{
  "name": "Canterbury Court Apts",
  "avg_rating": 3.2,
  "review_count": 6,
  "adjusted_review_count": 6,
  "adjusted_review_average": 3.2,
  "reviews": [
    {
      "author": "Chantilly H.",
      "rating": 1.0,
      "review": "Amenities are not available due to what ever excuse they come up with month to month. I lived there a year and only got to use the pool/hot tube twice. Your heat bill will be $200.00 in winter, and the windows will condensate and freeze over and then mold. You will sweat to death in summer because you can not use a window AC. Washer and dryer is mini so power bill will also be high all year, due to having to do multiple loads and the appliances are outdated. If you are a lower unit you will hear everything from your neighbors upstairs. I mean everything and it will startle you out of bed at night as if they will fall through the ceiling. You will hear the neighbors toilet flush every single time. My neighbor used the toilet a lot! They won't properly clean the apartment before you move in, if you have a cat or dog on the lease , they will keep your entire deposit claiming the entire carpet in the unit needed to be replaced due to urine ,only proof of their false claim is a black light they apparently use after you move out but not when you move in.... You will be refused a walkthrough on exit and the the carpet cleaners are also, the same person who replaces carpet.. even though they never cleaned carpets before you moved in and will not show proof when you ask. To top it off you will be forced to pay an added amount to cover all the cost of replacing carpet after they already kept 1500.00 or be reported to collections. The time and cost of fighting them in court is costly and time consuming.",
      "ownerResponse": []
    },
    {
      "author": "Dan M.",
      "rating": 5.0,
      "review": "I've lived here for about ten months now, and while I wouldn't recommend moving across two states in the middle of February, Emileigh was amazing in helping an out-of-towner figure out how to get situated.  Everything from the screening process to the move-in to the pet approval was handled quickly and easily, and the facilities are really nice.\n\nNow, this is 2020, and some of the onsite amenities are sadly unavailable, but they're doing the responsible thing which I can respect.",
      "ownerResponse": []
    },
    {
      "author": "Kathy M.",
      "rating": 1.0,
      "review": "I gave a great review last month, then I received a lengthy explanation for why they were keeping my $600 deposit and charging me an additional $339.31 for replacing carpet that was disgusting when I first moved in!  I have NEVER been treated like this and I am so disappointed.  They claim there were traces of urine through most of the living room and dining room. They provided where this supposedly was and all of the areas were covered by my furniture and my cat would NOT have had access to them.  My cat NEVER peed on the carpet. She is a house cat and they are very picky.  She always uses her litter box.  Wish I could post without any stars!",
      "ownerResponse": []
    },
    {
      "author": "Kayla B.",
      "rating": 5.0,
      "review": "Wonderful neighborhood, quiet and private, maintenance does their job quickly and effectively, and the property manager Emily is wonderfully helpful and educated. Highly recommend this company.",
      "ownerResponse": []
    },
    {
      "author": "Naomi R.",
      "rating": 5.0,
      "review": "I loved living here! Emily, the woman at the office, was always professional, respectful, and remembered everyone's names. I thought the apartment complex seemed small enough to seem personable. Very quiet apartment and neighbors were great. Highly recommend living here. Will miss the great, convenient location.",
      "ownerResponse": []
    },
    {
      "author": "Lee R.",
      "rating": 2.0,
      "review": "My wife and I have lived at Canterbury Court on and off since 2001.  Our last move out was on December 29, 2013 just over a month ago after living there for eight years.  We expected to pay a reasonable cleaning fee as we have paid before in our other two move outs.  Unfortunately this did not happen this time.  We were charged an excessive cleaning fee which was very disappointing but we paid it and wrote a letter explaining our disappoint but no one has responded to our letter to see how we could improve this issue.  I know there are new owners which then caused a change in management at Canterbury Court which probably explains the reduction in customer care.  Before these changes took place we have written positive reviews in the past of the customer care that we received from the former owners and managers.  Obviously from our long stay at this site it has been a place that we have enjoyed living.  With the new direction owner/management has taken Canterbury Court  is not the great experience that we came to expect.",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "3790 Canterbury Ln Bellingham, WA 98225"
}