{
  "name": "Roma Management",
  "address": "557 W Bakerview Rd Ste 108 Bellingham, WA 98226",
  "company_type": "Property management company",
  "review_count": 75,
  "avg_review": 3.5,
  "reviews": [
    {
      "author": "Greg Fortune",
      "rating": 5.0,
      "review": "Erin and the staff at Roma Management were more than helpful, they were absolutely amazing! ",
      "ownerResponse": [
        {
          "text": "We are so thrilled to hear that your mother is enjoying her new home. We truly try our best to find the best fit for our tenants and happy this worked out for her. Thank you for your feedback this is so helpful.\nErin"
        }
      ]
    },
    {
      "author": "S. Jackson",
      "rating": 4.0,
      "review": "Pros:\n- Office management is very caring and professional, always willing to help with anything you need ",
      "ownerResponse": [
        {
          "text": "Hi Sarah, We appreciate your residency for the past two year and welcome your feedback. Regrettably parking allocation is out of our control, we do inform all our prospective tenants prior to renting about the challenges. Our goal is to  More"
        }
      ]
    },
    {
      "author": "Katelyn",
      "rating": 5.0,
      "review": "Before Roma took over as my property management company it took weeks to have things fixed, if they ever even got fixed. Usually things were just ignored or brushed off and I ended up having to do a lot of repairing around my super old ",
      "ownerResponse": [
        {
          "text": "Thank you for sharing your experience! We're delighted to hear tht you apprecaite our efforts to provide exceptional support. Your feedback movtivates us to continue delievering the best service to our residents."
        }
      ]
    },
    {
      "author": "Malynne Castro",
      "rating": 5.0,
      "review": "Very pleased with our application and move in process through Roma! A simple, easy, and fast process where we felt valued and supported. The ladies in the office that helped us; (Erin, Becki, and Emma) were so incredibly kind and efficient. ",
      "ownerResponse": [
        {
          "text": "It has been a pleasure working with you and we greatly appreciate your feedback."
        }
      ]
    },
    {
      "author": "melissa zuk",
      "rating": 5.0,
      "review": "We moved into a property managed by Roma about 2 weeks ago and our experience has been exceptional! The team worked hard to get our place ready so we could move in before the available date and welcomed us warmly upon arrival from ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words about your experience with us. We try our very best to make your experience with us enjoyable. "
        }
      ]
    },
    {
      "author": "Roberto Chavarria",
      "rating": 5.0,
      "review": "Best experience ever! With the housing market the way it is right now not everybody cares about the renters so much, well this is not the case of Roma Management, they were all very supportive and listening specially Erin, we moved from a ",
      "ownerResponse": [
        {
          "text": "Thank you for sharing your experience with us and seeing the value in the service we provide, we(I) do care and it's so nice to see that it is apprecaited. It was a pleasure to work with you and your family. If you ever need another rental in the future we would love to work with you again."
        }
      ]
    },
    {
      "author": "Gabriel Casasanta",
      "rating": 5.0,
      "review": "Roma management has been amazing to me! I was working with Erin one on one and she has been reliable, understanding and flexible about my situation. She always picked up the phone when I answered and was so prompt! She and the owner helped ",
      "ownerResponse": [
        {
          "text": "It was pleasure working with you and we appreciate you sharing your experience with us. We try to provide the customer service that everyone desires and happy saw it first hand.\n"
        }
      ]
    },
    {
      "author": "Candace",
      "rating": 4.0,
      "review": "Erin in the office was amazing. Minor fixes tend to get left behind, large things are fixed very very quickly. Overall, a very good experience, especially considering the property management experience in Whatcom County as a whole. *Insect maintenance on the property could be improved as spiders are not my favorite.",
      "ownerResponse": [
        {
          "text": "It was pleasure working with you these past FIVE years. I hope your move went well! Thank you for your tenacy! I hope all went well with you move and settling in, we would love to work with you again."
        }
      ]
    },
    {
      "author": "Journey Howden",
      "rating": 5.0,
      "review": "Erin helped my boyfriend and I get set up with our first home! She was so much help and made the process incredibly smooth.",
      "ownerResponse": [
        {
          "text": "It has been a pleasure to assist you during this process and I look forward to working with you. Thank you for your kind review."
        }
      ]
    },
    {
      "author": "Kayleigh Banks",
      "rating": 5.0,
      "review": "We are so happy with Roma Management. I rented a gorgeous apartment in Ferndale from them for a few years and then when my relationship changed they helped me coordinate a transfer to a different apartment and really made a very difficult ",
      "ownerResponse": [
        {
          "text": "Thank you for your very kind feedback, we truly appreciate that you took the time to share your experience. Thrilled to hear you have enjoyed your time with us thus far and look forward to working with you in the future.. "
        }
      ]
    },
    {
      "author": "sabine KEMPfe",
      "rating": 5.0,
      "review": "Erin is a god send. She was super friendly, attentive and informative. She worked with me for our special move in circumstance, and considered both my needs and the needs of the owner until we came up with a solution, which shows she is ",
      "ownerResponse": [
        {
          "text": "Hi Sabine, thank you for your kind feedback! We truly appreciate that you recognize our efforts, and look forward to working with you."
        }
      ]
    },
    {
      "author": "Joely Fisher",
      "rating": 5.0,
      "review": "Erin has been the most communicative property manager Ive ever had. She made me feel secure about my move out process even when trouble shooting the little things. Thank you Erin you rock!",
      "ownerResponse": [
        {
          "text": "It was a pleasure working with you and I appreciate your kind words. It was my pleassure to assist you. All the best with your move. "
        }
      ]
    },
    {
      "author": "Colleen Johnson",
      "rating": 5.0,
      "review": "So far from my moving in 3 years ago to now they have been great. Erin always answers my calls and is very helpful. They are great. The owner has some things they should maintain better but the property managers can't make them do it but I ",
      "ownerResponse": [
        {
          "text": "Hi Colleen, Thank you so much for your wonderful feedback, it has been a pleasure to work with you these past few years. "
        }
      ]
    },
    {
      "author": "Jessica Warrick",
      "rating": 5.0,
      "review": "Erin from Roma made our renting experience wonderful. Her attentiveness and dedication to making every interaction human instead of a cold corporate response was refreshing, to say the least. She truly went above and beyond, setting a new ",
      "ownerResponse": [
        {
          "text": "Hi Jessica,  Thank you for your very kind feedback! It is so rewarding when you see that someone like you appreciate all that we do. We truly love helping people. All the best to you moving forward."
        }
      ]
    },
    {
      "author": "Chris Throop",
      "rating": 5.0,
      "review": "I first applied to the apartment without even looking at it, knowing that it was a solid place and very good location. My first visit to the apartment complex  was comfortable, the setup of the building feels new and modern. Everything ",
      "ownerResponse": []
    },
    {
      "author": "Victoria Alvarez",
      "rating": 5.0,
      "review": "Erin is one of the most attentive Property Managers I have worked with.  I have tried to apply to a couple of different properties in Bellingham and had to always chase them down to get a reply.  I spoke with Erin after the office was ",
      "ownerResponse": [
        {
          "text": "Thank you so much for your kind words and you amazing review, Victoria. We really appreciate you taking the time to share your experience with us and the community. It is so nice to hear that our efforts are making a difference. We look forward to working with you."
        }
      ]
    },
    {
      "author": "Julie Jakobitz",
      "rating": 5.0,
      "review": "Erin does an amazing job!  I worked closely with her for several weeks getting someone placed at one of the properties.  This case ended up having a ton more paperwork than usual.  Erin was dedicated to working with me and getting this ",
      "ownerResponse": [
        {
          "text": "Julie it was a pleasure to work with you as well. It was wonderful to work as a team to place your client. You make a difference."
        }
      ]
    },
    {
      "author": "Elijah Owen (Eli)",
      "rating": 1.0,
      "review": "I put in eight maintenance requests and only one was taken care of because it was a leak in the sink and it would damage their property. 2 years I was being strung along with a simple door fix. ",
      "ownerResponse": [
        {
          "text": "Please do not base your judgement/opinion about Roma Management by this review, there is so much more to this situation than the person is willing to share, lease violations etc. "
        }
      ]
    },
    {
      "author": "Ilya Shportko",
      "rating": 5.0,
      "review": "Really awesome service. I enjoyed my stay there. Everything went well. Erin did a really great job helping my wife and I get in the unit and out. We were able to successfully receive our security deposit as well. I would recommend them any day.",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words, we enjoyed working with you as well. All the best to you both moving forward."
        }
      ]
    },
    {
      "author": "Irena Kolbert",
      "rating": 4.0,
      "review": "Nice and fancy units I have to say! There is always parking in the Ferndale Willy Flats, and it was overall a great experience. I didn't like that they kept my $1250 deposit when I moved out early though. There were no damages at all in my ",
      "ownerResponse": [
        {
          "text": "Thank you for your comments - Regrettably the security deposit is forfeited if you break your lease agreement with us, this is our policy and also listed in the lease agreement signed by all residents. Not all management companies manage to  More"
        }
      ]
    },
    {
      "author": "Steven Boring",
      "rating": 5.0,
      "review": "Erin is very easy to work with and does her Job well. If you need something and she doesn't have the answer she will go out of her way to try and find it. I've dealt with 3 other property management companies and this one has been by far the best. Thanks Erin!",
      "ownerResponse": [
        {
          "text": "Hi Steven it has been a pleasure to work with you. Thank you for your kind words."
        }
      ]
    },
    {
      "author": "Justine Griffith",
      "rating": 5.0,
      "review": "I have been with Roma Management for almost a year now. Whenever I have a problem, they are quick to respond and show they truly do care for your best interest. I've spoken with all of the staff and each one has been nothing but kind and ",
      "ownerResponse": [
        {
          "text": "Justine - we appreciate you and your patience with this unique situation."
        }
      ]
    },
    {
      "author": "Andrea Velasco",
      "rating": 5.0,
      "review": "Erin is the best!! She always try to helps and make things easy. I had a great experience renting with Roma Management.",
      "ownerResponse": [
        {
          "text": "It was a pleasure working with you as well. Thank you for sharing your experience with us. All the best with your move."
        }
      ]
    },
    {
      "author": "Jin Soo Hong",
      "rating": 5.0,
      "review": "We feel blessed in getting to work with Erin of finding our new apartment in Bellingham, WA. She is very kind will find you the perfect home / apartment that meets your need. If google had 10 stars rating, she deserves full 10 stars.",
      "ownerResponse": []
    },
    {
      "author": "Sarah Finkbonner",
      "rating": 5.0,
      "review": "Romas' management team is assume! They respond promptly, an are a group of fantastic ladies who go above and beyond!",
      "ownerResponse": [
        {
          "text": "Thank you Sarah for your kind feedback! We enjoy working with you as well, you are an ideal tenant. "
        }
      ]
    },
    {
      "author": "Lynn G",
      "rating": 5.0,
      "review": "Erin Galbraith is amazing! She worked her hardest to help my family get into a place and has been a sweetheart the whole time. Thank you so much!",
      "ownerResponse": [
        {
          "text": "It was a pleasure working with you and your family. Thank you!"
        }
      ]
    },
    {
      "author": "Liana Harvey",
      "rating": 5.0,
      "review": "Had a pretty great experience with Roma. Erin was very nice and helpful with the moving in and out process and was always pleasant to talk to. Great location of units and will definitely keep in mind for any future moves.",
      "ownerResponse": [
        {
          "text": "It was a pleasure working with you. Thank you so much for your sharing your experience with other."
        }
      ]
    },
    {
      "author": "Tanya Chase",
      "rating": 5.0,
      "review": "I moved into the Ferndale location about two and a half years ago. Since then I have had to call Roma a handful of times for everything ranging from noise complaints to trash to questions about decorating my door they have always been quick ",
      "ownerResponse": []
    },
    {
      "author": "Jacob Olsen",
      "rating": 5.0,
      "review": "We came from another complex (VABC) where management was sub-par. Our experience has been awesome with Roma. We had a delay with our complex opening and they worked with us and even offered to help us out with storing our stuff. Erin is a ",
      "ownerResponse": [
        {
          "text": "Thank you so much Jacob for your kind words! We are so pleased to have you as a resident!"
        }
      ]
    },
    {
      "author": "Lio C",
      "rating": 1.0,
      "review": "Erin was extremely rude to my partner on the phone. Hung up on him when he asked about getting the lease contract in writing. The rude behavior only started after we had turned in our applications-- which is when they would have learned ",
      "ownerResponse": [
        {
          "text": "This information is disappointing to hear. I always go out of my way to assist someone and feel there is more to this then the person is wanting to share and why they did not reveal their real name."
        }
      ]
    },
    {
      "author": "jmajor29",
      "rating": 5.0,
      "review": "I rented from Roma for 3 years and never had a problem with them. The customer service in the office was Outstanding! The apartments are beautiful. The appliances worked perfect! I Never had a problem with mold or bug's in the apartment. ",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to give us your thoughts - We will miss you! All the best!"
        }
      ]
    },
    {
      "author": "Dima Karashchuk",
      "rating": 5.0,
      "review": "Had a great experience staying at Willy Flats. Roma Management  helped us out all of the two years that we stayed there. Great team, great communication skills.",
      "ownerResponse": [
        {
          "text": "Hi Dima, thank you for your positive review, we appreciate your feedback. We enjoyed working with you these past two years. All the best.\nErin - Roma Management"
        }
      ]
    },
    {
      "author": "Marva Biggar",
      "rating": 1.0,
      "review": "This place is an absolute scam. I asked what I needed to do to break my lease early and was advised I would need to forfeit my deposit and provide an intent to vacate. I sent them my intent to vacate, 5/30 and was completely out of the unit ",
      "ownerResponse": [
        {
          "text": "Hi Marva Biggar, thanks for sharing your feedback. We are sorry to hear you didn't have a great experience. We take your feedback seriously and hope you'll give us another chance."
        }
      ]
    },
    {
      "author": "Skye Saxon",
      "rating": 5.0,
      "review": "I lived at a Roma property with roommates while I was going to school in Bellingham, it took MONTHS to find a place and none of the several places I looked at compared to this apartment. Our unit was spacious and modern and close to I-5 and ",
      "ownerResponse": [
        {
          "text": "Thank you for your review. We are glad that you had a good experience with Roma Management."
        }
      ]
    },
    {
      "author": "Jeff Singsaas",
      "rating": 5.0,
      "review": "In the complete free for all of finding a place to rent in Bellingham prior to the school year, I FINALLY spoke to a real person and, fortunately it was Erin at Roma Management.  She was friendly (rare), helpful, knowledgable, and helped ",
      "ownerResponse": [
        {
          "text": "We appreciate you taking the time to leave this review!"
        }
      ]
    },
    {
      "author": "Amber Abapo",
      "rating": 1.0,
      "review": "Haven't gotten to our maintenance request for 3 months now. Almost 4. Accusing us of not nofiying them of our pet rabbit. Bills us a $200 \"late\" bunny fee. Tells us they gave us a PAPER notification about the rabbit hutch outside when we ",
      "ownerResponse": [
        {
          "text": "Thank you for your impute.  We are disappointed to hear that you have been so displeased. We again apologize for the rushed process you experienced at move-in. This dissatisfaction is precisely why we no longer bend on our move-in dates for  More"
        }
      ]
    },
    {
      "author": "kyle shadowchain",
      "rating": 3.0,
      "review": "I have not actually dealt with the owners or any staff...but I have been waiting a good almost 10 minutes for someone to come by the office in romark flats to apply for their 2 bed 1 bath apartment. The office is not supposed to close till ",
      "ownerResponse": [
        {
          "text": "Hi Kyle! We apologize for not being in the office when you came by. We do have limited staff this week as some called out. With it being the summer months it is an extremely busy season and we are out showing units and preforming move-ins  More"
        }
      ]
    },
    {
      "author": "Duncan (hikesafely)",
      "rating": 3.0,
      "review": "My Deposit was a struggle to get back.\n\nI spent a year in the apartments on W Bakerview. (I left June 2019) During my ",
      "ownerResponse": [
        {
          "text": "Duncan as I had stated that I will refund you the hauling fee that was charged to you.  You should be receiving a check in the mail by the end of the week. Sincerely-Roma Management"
        }
      ]
    },
    {
      "author": "Daniel Karpov",
      "rating": 1.0,
      "review": "I've been a first time tenant with this property management since July 2018. I had emailed them numerous times about overflowing dumpsters/recycling bins, unauthorized vehicles parking, and maintenance issues and not once have received a ",
      "ownerResponse": [
        {
          "text": "We appreciate your input and would like to work with you about these issues.We have been working hard to resolve these issues however it is a tedious task and we will continue to work on this."
        }
      ]
    },
    {
      "author": "Erica Gonzalez",
      "rating": 1.0,
      "review": "They left during the pandemic and let all the weeds overtake the apartments. When they came back and without warning they sprayed herbicide during the middle of the weekday at like 4pm. When I brought this to the owners attention he said ",
      "ownerResponse": [
        {
          "text": "The move-out paperwork was sent out on September 17th which is well within the 21 day time frame that is required by law. Per the tenants request the Move-out paperwork was sent to their employers address. Our office was just notified  More"
        }
      ]
    },
    {
      "author": "Anjoli Garrison",
      "rating": 5.0,
      "review": "very helpful & kind management, really helped me get into a place in about a weeks time!",
      "ownerResponse": [
        {
          "text": "Thank you for your feedback, we are more than happy to assist and look forward to working with again."
        }
      ]
    },
    {
      "author": "Abrielle Tolle",
      "rating": 5.0,
      "review": "Erin has gone out of her way to make sure my renting experience was as painless and transparent as possible. I've greatly appreciated the time she's taken to help me out.",
      "ownerResponse": [
        {
          "text": "It's been a pleasure to work with you as well. Thank you for renting with Roma Management."
        }
      ]
    },
    {
      "author": "Emily Rossing",
      "rating": 5.0,
      "review": "We just got an apartment through Roma and so far it's been a breeze! Amanda and Erin have been so great with the application process and have answered every question for us! We look forward to renting from them.",
      "ownerResponse": [
        {
          "text": "Thanks so much! We can't wait to serve you again soon."
        }
      ]
    },
    {
      "author": "Austins Challenges",
      "rating": 1.0,
      "review": "Warning for everyone applying here. The 100$ fee does not do anything. After placing the holding fee and turning in our applications we find out they rented our place out to someone else while we had the hold on the place and they hadn't ",
      "ownerResponse": [
        {
          "text": "While we always strive for satisfaction with prospective tenants, unfortunately, things do not always work out. Specifically, in your case, you should have never been allowed to place the holding fee down on the unit until your application  More"
        }
      ]
    },
    {
      "author": "Jessica Coogan",
      "rating": 5.0,
      "review": "Erin is so helpful and a great person to work with. They provide excellent customer service and provide as much leniency as they can given lease restrictions.",
      "ownerResponse": [
        {
          "text": "It is a pleasure to work with you. Thank you for your tenancy with us."
        }
      ]
    },
    {
      "author": "MarLa Williams",
      "rating": 5.0,
      "review": "Erin is fantastic and professional. She was amazing with the move in and outstanding with helping with the move out. Great management by Erin.",
      "ownerResponse": [
        {
          "text": "Marla, it was a pleasure to work with you as well. Happy to help resolve your move-out from the previous management."
        }
      ]
    },
    {
      "author": "Inna Gamdysey",
      "rating": 5.0,
      "review": "Very helpful management. Pleasant to work with. Caring.",
      "ownerResponse": [
        {
          "text": "Inna, thank you so much for review, we truly apprecaite you and your feedback and look forward to working with you in the future."
        }
      ]
    },
    {
      "author": "Veronica Marie Perez",
      "rating": 5.0,
      "review": "Management has been communicative, helpful, and welcoming. The move-in process was easy, complaints are heard and responded to, and most of the residents Ive met are extremely friendly. Great place to call home!",
      "ownerResponse": [
        {
          "text": "Thank you Veronica, It's been a pleasure to work with you as well."
        }
      ]
    },
    {
      "author": "Jacob D",
      "rating": 1.0,
      "review": "Withholding deposits whimsically, or because they know its on the former tenants time and resources to get it back, is just outrageous. This is a poorly managed establishment. Dont expect to get good response time to your most basic of needs or wants.",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Savvy Shopper",
      "rating": 1.0,
      "review": "Regularly overinflates the values of the homes they list for rent on Zillow.  The last one I checked was overinflated by more than $100,000 over its actual value.  Pity the people dumb enough to rent that.  When you come across a listing by ",
      "ownerResponse": []
    },
    {
      "author": "Emmanuelle Maher",
      "rating": 1.0,
      "review": "these folks will NOT give you your deposit back. theyll dodge your calls. not only are they stealing hard-earned wages, but peace of mind, too.",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Leticia Velasco",
      "rating": 5.0,
      "review": "Amazing costumer service! They're always  there for all our needs! we been with them 2 years and we have no complaints ! thank goodness we found a amazing landlord!!! soooooo happy!!!!!",
      "ownerResponse": []
    },
    {
      "author": "Jacob Blankenship",
      "rating": 5.0,
      "review": "Been living in their units for about 3 years now, the unit I have is well built and they respond quickly to my issues that arise.",
      "ownerResponse": [
        {
          "text": "Thank you Jacob! We strive to give the best service possible. We appreciate you as a resident of Roma Management."
        }
      ]
    },
    {
      "author": "Nathan Jaimez",
      "rating": 1.0,
      "review": "Very poor management when it comes to customer service. Not to mention they withhold your deposit. Look elsewhere to avoid this problem. Highly recommend you dont support this establishment. Complete waste of time and money.",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Lisl Ost",
      "rating": 1.0,
      "review": "they should really rename the deposit bc YOU DON'T GET IT BACK and that's not a deposit. they've apparently always done this read the other bad reviews",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "MegaJabboy",
      "rating": 1.0,
      "review": "Non-communicative and highly unprofessional, these people are currently holding my friend's deposit illegally without any reasoning! No walk out sheet or anything! Really disgusting and illegal, avoid this place!",
      "ownerResponse": [
        {
          "text": "This tenant was given their disposition letter according to the law and send to the tenant's specifications."
        }
      ]
    },
    {
      "author": "steven trujillo",
      "rating": 1.0,
      "review": "I applied for a unit with this company, I was the first to submit all required documentation and they rented the unit out from under me.",
      "ownerResponse": [
        {
          "text": "Steven, we are very sorry that this did not work out.  Unfortunately there was another application that had been submitted when your application came in.  They did get their final documentation in prior to your last document arriving.  We  More"
        }
      ]
    },
    {
      "author": "Remi Vitales",
      "rating": 1.0,
      "review": "Impossible to get deposit back. BE AWARE! They will keep your deposit no matter what.",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Makayla Montoya Frazier",
      "rating": 1.0,
      "review": "Dont rent here if you plan on getting a deposit back! Unprofessional and lackluster. They are also LIARS, see below ",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Victoria Brown",
      "rating": 1.0,
      "review": "If there was a zero star rating they would get it. Terrible! Just dont use them!",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management. I find it strange you have the rating since we have never worked with you."
        }
      ]
    },
    {
      "author": "Sarah M",
      "rating": 1.0,
      "review": "SCAMMERS!!!!!! They will keep your deposit and ignore your calls!!!!!!!!!!!! If I could give them negative stars I would!!!!!!",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Eliot Tole",
      "rating": 1.0,
      "review": "Worst ever. Dont even bother renting from them.",
      "ownerResponse": []
    },
    {
      "author": "Zach Appelbaum",
      "rating": 1.0,
      "review": "Horrible service. Dont mess with these guys.",
      "ownerResponse": [
        {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      ]
    },
    {
      "author": "Ryan",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Bruin 34",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Bryli Elsner Blankenship",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Bryli - we were so happy to help with your situation!"
        }
      ]
    },
    {
      "author": "mahinahiapo",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "James Hong",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Michelle B.",
      "rating": 5.0,
      "review": "I lived in the Willy Flats apartments managed by Roma. When I had an issue and reached out to Erin I got very timely responses and they dealt with whatever the issue was promptly. I ended up getting a job out of state and had to break my lease. I contacted Erin and was informed that my deposit would be forfeit (fair, I signed a contract after all) , but that she would try to rent my unit so I would not be responsible for rent for the remaining 2 months. I moved out mid-month, so she told me to pay the full month's rent and that should cover cleaning costs, carpet (I have animals and there is a fee listed for this in the lease), and any damage. That seemed fair to me, so I did that, not expecting to get any money back. Not only did she rent my unit, saving me a lot of money, but I was just notified that I'm getting a lot of the rent overpayment back. I did return the apartment clean and without damage, but like I said, I didn't anticipate getting any money back. I'm shocked. Roma is the first property management company that I've had where I've walked away feeling like I was treated fairly, they are so lucky to have Erin. And that's saying something, because I did break my lease and normally that would make for a bad end. I would definitely recommend renting from them if you're in Whatcom County!",
      "ownerResponse": []
    },
    {
      "author": "Jaz G.",
      "rating": 1.0,
      "review": "Extremely Unprofessional staff. Withhold deposits over a month, against state law. Very small parking lot, no guest parking at all. Do not live here if you want your loved ones to comfortably visit you.",
      "ownerResponse": []
    },
    {
      "author": "Erica G.",
      "rating": 1.0,
      "review": "They left during the pandemic and let all the weeds overtake the apartments. When they came back and without warning they sprayed herbicide during the middle of the day like a weekday at 4pm. I had a reaction to it as did another neighbor of mine. They have gaslighted me and they will pretend they haven't gotten your call or letters. I like trusting my landlord.",
      "ownerResponse": []
    },
    {
      "author": "Amanda A.",
      "rating": 2.0,
      "review": "Positives: the office gals were always friendly to us and did their best to assist and for the space, they were a good price compared to the surrounding area - $1150 for a 2 bed/1 bath. We also loved how wide they made the staircases as this was helpful when moving in. The layout overall was also nice! It felt secluded with the surrounding nature which was part of what drew us there. \n\nNegatives: pieces of Willy Flats and the owner. The owner is not a \"people person\" at all and has no manners that we - or the neighbors we would often chat with - ever saw. He literally yelled at my partner (while he was letting our dog pee in a grassy area) telling him he isn't allowed to pee on the concrete (what dog chooses to pee on concrete?!) or on site - which the lease didn't state anywhere and there's no designated pet area on site and the apartments have nothing near by. He didn't even introduce himself or apologize after my partner corrected what the owner thought he was doing. \n\nSo, on to the apartments...they look nice overall but you can tell that they bought whatever materials could be found because few of the apartments even actually match and even within the apartment there are three different \"wood\" colors ranging from blonde to red tones - so random. The walls between people's living rooms and the next tenants bedroom are quite thin. You can hear whole conversations type thin...the floor is so cheap that dropping and ICE PACK dented it. Literally dented it. There were dents in the floor before we even moved in and we were the first ones to ever live there. There is no guest parking on site, and the apartments are in a random area with no alternate parking options available - not even a shoulder on the main road. People were CONSTANTLY making a huge mess of the trash/recycle area. They really just need to put money into cameras so they know who is abusing the rules, but it seems the owner was too cheap? So instead, every month that people made a mess of the area they would charge extra to ALL tenants. \n\nAll in all, not a great experience. Seems more of a money focus as a whole. If it weren't for the kind office staff, it'd be a 1 star.",
      "ownerResponse": []
    },
    {
      "author": "David G.",
      "rating": 1.0,
      "review": "Absolutely ridiculous phone etiquette. Customer service was so unexpectedly terrible. Treating us as a nuisance for wanting to see a unit. If my first and only conversation with them reflects their management style I would never bother making your first call.",
      "ownerResponse": []
    },
    {
      "author": "Sarah O.",
      "rating": 1.0,
      "review": "This company will not only use up all of your security deposit, but they will also charge you EXTRA for bogus reasons. They have failed to do any maintenance requests when you request them, they will set up all these random fees and won't answer any calls or emails when you try to reach them. Their listings are all over priced and the parking is a joke. Beware if you are a tenant or a potential tenant. Oh, and not to mention how unprofessional they are. They have their business hours set up so that no tenant can reach them in normal business hours. I hope they never screw anyone over like they did with the people I know who lived at one of their managed properties. No other management company is as terrible as these people are.",
      "ownerResponse": []
    },
    {
      "author": "Brian P.",
      "rating": 2.0,
      "review": "Amanda the \"senior property manager\", argued with my girlfriend about what room number we lived in for an extra key to borrow, my girlfriend was unsurprisingly right and Amanda offered no apology. The owner is the maintenance worker also and when our door lock broke and he replaced it the Management didn't have a copy of that new key after. We also didn't get a call from him when it became 3 hours past our appointment just because he was \"busy\" after we had to call him. And when we couldn't tell if our overhead fan in the kitchen was on because it's so weak he also could barely hear it and he left it like that and had the nerve to ask how much we cook, really?!! There are no security cameras even though it's next to a busy street where we have had to call the cops multiple times for suspicious activity, I got told by a neighbor we have had package thefts too. There's been a lot of cutting corners and poor owner effort for resolutions. Plus the complaints they send us for having a cat that likes to sit on the window ledge, surprise animals like sunshine and we're on the first floor so we aren't just going to have our windows open... And that's why we pay a pet deposit, right? No guest parking... That should say a lot on it's own. Poorly insulted windows and door jams for \"brand new\". They care about the employees first by a long shot, just look at the hours of operations... It's laughable. Amanda bring her kids to work often and it's obviously more disorganized when that happens. ...So I wouldn't recommend Roma unless you want disrespectful, cheap and selfish management. Erin is great on her own so we feel bad she has to work with the other two. Growing up in Bellingham I'm really disappointed in this property's leadership, it's just \"new money suckers\" here.",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 70,
  "adjusted_review_average": 3.4
}