{
  "name": "Dargone USA",
  "slug": "dargone-usa",
  "company_type": "property",
  "address": "2363 Main St Ste 102 Ferndale, WA 98248",
  "review_count": 3,
  "avg_rating": 1.3,
  "yelp_reviews": [
    {
      "author": "Liliana M.",
      "rating": 1,
      "review": "We were one of the first tenants in the building so we didn't realize how thin the walls were. Once the building filled up, I could hear my neighbor sneeze next door and use the bathroom. \n\nThey don't maintain the property. It's a mess. They don't even clear/de-ice the stairs in the winter. \n\nUpon move out, we CLEANED. It was absolutely spotless. We received $96.00 out of $1000.00 deposit. Apparently we left the apartment a mess. I would NEVER recommend living there.",
      "ownerResponse": null
    },
    {
      "author": "Christine R.",
      "rating": 1,
      "review": "These apartments suck!!  They are glittery on the outside but are carelessly built and very poorly run.  If you want to live in an expensive ghetto with riff raff for neighbors and an ignorant not present manager than this is the place for you.  Loud neighbors, with lots of rules but no one to enforce them.",
      "ownerResponse": null
    },
    {
      "author": "David M.",
      "rating": 2,
      "review": "The apartments were ok when they were brand new . Physically the apartments are cheap and have a \"mass produced\" feel. By that I mean the plumbing is finicky and there are funny design flaws all over (exposed pipes, malfitting cabinets). The building I was in had almost no insulation. I could literally hear one neighbor sneez, and I knew when video game time came around for my other neighbor (this is all while I was watching TV). However other buildings were reportedly better in that aspect. There is minimal storage. Since the new manager came around the quality of people has dropped dramatically. I love kids, however, the kids at these apartments are largely unsupervised and leave their toys all over. On more than one occasion I had to move bikes so I could leave the parking lot. Trash blows around alot until the landscaping guy brings his kids to pick it up once a week, a few months out of the year. When I moved out at the end of February 2012, there was still three Christmas trees from the previous Christmas and one from the year before. I can see this being a step up from some situations but not many. I rated the apartments two stars because it was bearable for the first two years of the three I lived there.",
      "ownerResponse": null
    }
  ]
}