{
  "name": "Regency Park Apartments",
  "slug": "regency-park-apartments",
  "company_type": "property",
  "address": "2050 Fraser St Bellingham, WA 98229",
  "review_count": 3,
  "avg_rating": 5.0,
  "yelp_reviews": [
    {
      "author": "Milagros B.",
      "rating": 5,
      "review": "Diane is my favorite office lady. She is always sweet and helpful. She left her desk to help us when we had an issue in our apartment and we needed her come see for herself.",
      "ownerResponse": {
        "text": "Hi Milagros,\nThank you for your review. We appreciate residents like you! We will pass along this comment to the On-Site Team.\nRegards,\nRegency Park Management"
      }
    },
    {
      "author": "Oleg S.",
      "rating": 5,
      "review": "I have lived here for almost three years now with my wife and kids. We have been blessed with living at regency park since day one. The staff in the front office is wonderful, the maintenance team is by far I've ever seen in any residence. You can tell they truly care about each family that lives here. They go above and beyond and try extremely hard. Thank you to every single person that works here to make it so wonderful. Bless you all!",
      "ownerResponse": {
        "text": "Hi Oleg, Thank you for your kind review; we are happy to pass along your comments to the team here at Regency Park Apartments! - HNN Communities Customer Service"
      }
    },
    {
      "author": "Anna S.",
      "rating": 5,
      "review": "Regency Park Apt truly deserves a 5 Star rating from me and my family members. We all agree that this place is amazing. Let me start by saying that ALL the people who work at Regency really make this place great. They are always so polite and professional. Absolutely ALL the people that work here deserve a medal. This place is constantly being built; like a new smoking area and a brand new children's play area outside. They also have a theater room, gym area, and a computer area. Also I notice how hard the workers are at their job; they care about this place, they constantly remodel, they constantly manage the areas that need tending, they are on time and work until the job is complete. My husband and I always see workers outside the complex fixing and building and always managing the trash. The office ladies are wonderful too! Any issues we had were taken care of right away. Plus our neighbors are great too; everyone here seems to mind their own business and it feels like a safe community. This place is huge so we have no problems with parking either. We are very happy living here. Thank you for all your hard work, our family surely appreciates it.",
      "ownerResponse": null
    }
  ]
}