{
  "name": "360 Property Management",
  "address": "471 SE Pioneer Way, Oak Harbor, WA 98277",
  "company_type": "company",
  "review_count": 78,
  "reviews": [
    {
      "author": "Jasmine Martin",
      "rating": 2.0,
      "review": "2 stars because we had no big issues with them during renting.\nBut we had the same issue as everyone else. We used a cleaning company off the list they recommended. This cleaning company spent half a day cleaning ",
      "ownerResponse": []
    },
    {
      "author": "CindyB",
      "rating": 1.0,
      "review": "Strongly recommend avoiding this company.\nI didn't choose to rent through 360. I leased through another company and \"inherited\" 360 when that management company was bought by 360. ",
      "ownerResponse": []
    },
    {
      "author": "O Navarro",
      "rating": 3.0,
      "review": "Rented a home with them for 2 years. Overall good response with maintenance requests, sometimes a bit slow due to needed approval from home owners, and some issues with third party technicians. Make sure to take pictures and document ",
      "ownerResponse": []
    },
    {
      "author": "Krista Enneberg",
      "rating": 5.0,
      "review": "I loved renting through 360 Property Management and never had issues. I felt like they actually cared. Renting can be stressful and worrisome in these times, having a good property management is so important. A company that sees us as ",
      "ownerResponse": []
    },
    {
      "author": "Jamie",
      "rating": 1.0,
      "review": "Got told there was a property available, contacted the agent went and looked at it just to be told it's not available when I get there wasted time wasted money horrible internal communication",
      "ownerResponse": []
    },
    {
      "author": "Laura Aguilar",
      "rating": 1.0,
      "review": "DO NOT RECOMMEND! LOOK FOR OTHER OFFICE AND OPTIONS TO RENT A PLACE.\nThey charge a ridiculous amount of money for \"cleaning\" a move out will cost you a LOT of money. ",
      "ownerResponse": []
    },
    {
      "author": "Kyle Marshall",
      "rating": 5.0,
      "review": "I live at Harbor Heights in Oak Harbor, & my experience with 360 has been nothing but positive. Any repair requests that I put in are promptly responded to & taken care of. They do a great job communicating/ working with residents.",
      "ownerResponse": []
    },
    {
      "author": "Bingalah Travels Jack Fruit and Apple Pie",
      "rating": 1.0,
      "review": "After five years, I regret having ever rented through this company.\nRules, if any regarding noise, are not enforced. They will hear your complaint,  contact the other tenant, then do nothing more about it.\nIf you want peace of mind I would suggest looking elsewhere.",
      "ownerResponse": []
    },
    {
      "author": "gage sorensen",
      "rating": 1.0,
      "review": "I know it's hard getting a place, but if you can try and avoid them. If you cant make sure to document everything when you move in with pictures and recordings especially when you move out. They will do everything to keep your deposit. They ",
      "ownerResponse": []
    },
    {
      "author": "Brittni Clark-Perez",
      "rating": 5.0,
      "review": "All the staff that Ive come in contact with were friendly and helpful. Id like to give Bronwyn a special shout out. Her customer service was impeccable and a breath of fresh air. She is a big reason why we wanted to rent from this company. I wish there were more Bronwyns at every business on this island.",
      "ownerResponse": []
    },
    {
      "author": "Kayla Hasse",
      "rating": 1.0,
      "review": "Do NOT allow them to inspect the home after move-out. The COVID prevents us from inspecting with you home is bogus. They had 2 walk throughs while we were home bringing in potential renters before we even moved out. Apparently not an ",
      "ownerResponse": []
    },
    {
      "author": "David Fox",
      "rating": 1.0,
      "review": "HIGHLY DO NOT RECOMMEND!!!! This place seemed nice at first okay rent and a decent space but they had a lot of bogus charges for cleaning and repairs when me and my wife cleaned that place top to bottom and only replaced things we had ",
      "ownerResponse": []
    },
    {
      "author": "Samantha Elise",
      "rating": 1.0,
      "review": "Rented here because I just needed a place while in transition. The apartment was absolutely awful. Fixtures were falling apart, repairs needed to be made, carpet was old, mold painted over in the bedroom ceiling blinds were yellow and ",
      "ownerResponse": []
    },
    {
      "author": "Kayla",
      "rating": 1.0,
      "review": "I'm not convinced any property they rent is worth what they charge. Our apartment is tiny and cramped, there are holes in the walls and the closet doors, most of the outlets don't work properly, the carpet is filthy and coming up in places, ",
      "ownerResponse": []
    },
    {
      "author": "Elisha Volanos",
      "rating": 1.0,
      "review": "I spoke with the leasing agent who over promised and then underserved my family. They said they would ; remove trash on my property and have not, clean out a shed,  accomplish repairs to the house well over due...etc, etc. They want their ",
      "ownerResponse": []
    },
    {
      "author": "Justin Bradley",
      "rating": 1.0,
      "review": "Horrible. If you are military please stay away from this greedy company. The apartment me, my wife and kids stayed in wasnt even worth the $1050 we paid a month. On top of that we constantly dealt with mold and mildew, that you can tell ",
      "ownerResponse": []
    },
    {
      "author": "Jon Did It",
      "rating": 1.0,
      "review": "Koetje in three words, is completely criminal. In this time of global pandemic, you would expect a local company to try to help people out. Instead we were accused of false claims and stolen from. As I helped my mom and my family move, we ",
      "ownerResponse": []
    },
    {
      "author": "Caleb Stewart",
      "rating": 1.0,
      "review": "They rented a place to me, and my young children and didn't tell me the neighabor was a problem. They knew the neighbor problem and so did the rest on the people in the area. The police even knew his name when i gave the address when I ",
      "ownerResponse": []
    },
    {
      "author": "Daniel Weeks",
      "rating": 4.0,
      "review": "Koetje is a fine property manager.  When we moved out, we discussed our move out with Liz. We were told not to be nervous because it wouldnt be a white glove inspection and that they expect their tenants to be able to live in the ",
      "ownerResponse": []
    },
    {
      "author": "Samantha Wanek",
      "rating": 1.0,
      "review": "Please do not rent an apartment or property managed by Koetje unless you like a slew of problems and headaches that arent taken care of effectively or in a timely fashion. Weve been renting an apartment managed by Koetje for 5 months and ",
      "ownerResponse": []
    },
    {
      "author": "Daniel Snow",
      "rating": 1.0,
      "review": "Ive only lived in my outdated apartment for 2 months and they already scheduled a walk through. Unbelievable. And they sure love to rent run down apartments to match BAH exactly because they know service members have nowhere else to go ",
      "ownerResponse": []
    },
    {
      "author": "Strategistmaster",
      "rating": 1.0,
      "review": "Don't rent from these people, they have incredibly unprofessional conduct and repeatedly attempt to coerce you into staying quiet about maintenance necessities through threats of violence and harassment of you and your place of employment. ",
      "ownerResponse": []
    },
    {
      "author": "Flint Nienhuis",
      "rating": 1.0,
      "review": "Scam artists, rented me a dirty room. Light fixture collasped on its own and they charged me 150 dollars, When I moved out the charged me 500 dollars for the room being dirty even though it was as clean as when I got there. Now you probaly ",
      "ownerResponse": []
    },
    {
      "author": "Dena Trinh",
      "rating": 1.0,
      "review": "I only give 1 star. They are not professional. Staff not helpful. I felt like they think all tenants are bad..when we moved in, we found something was broken, we put in move-in inspection and was told to submit the maintenance request. We ",
      "ownerResponse": []
    },
    {
      "author": "Rhonda Rainwan",
      "rating": 5.0,
      "review": "I really enjoyed renting through 360 while I was stationed in Whidbey! I had a few apartments through them, and they always took care of me if I needed something. The app makes paying rent very convenient.",
      "ownerResponse": []
    },
    {
      "author": "Kimmiko",
      "rating": 4.0,
      "review": "The staff here are always busy but for good reason.  They manage a lot of properties, but whenever you have an issue they actually try to advocate to get these items taken cared of and repaired quickly. ",
      "ownerResponse": []
    },
    {
      "author": "jeffrey giroir",
      "rating": 1.0,
      "review": "They would not remove from my lease FOR A YEAR after have moving out because they said they had been waiting on paperwork from an old room mate.  When they finally did take me off they had the paper work they needed for months.  They are terrible and will make up things to get more money out of you.",
      "ownerResponse": []
    },
    {
      "author": "J Me",
      "rating": 5.0,
      "review": "These folks are the way to go!! They have been so helpful to my kids and I, helping to keep us from being homeless!!!! That was the kindest most admirable thing anyone could do for us!!! I recommend 360 properties with 100 % assurance, you'll be happy too  ",
      "ownerResponse": []
    },
    {
      "author": "Anthony Drews",
      "rating": 5.0,
      "review": "Admittedly, I had some previous concerns however the management team at KPM stepped in and assisted me to great lengths. I'd like to take a moment to thank Camden and Jerry for their customer service and dedication. They showed me KPM ",
      "ownerResponse": []
    },
    {
      "author": "Patricia Graef",
      "rating": 5.0,
      "review": "Very polite, am looking fir a one bedroom apt. In Oak Harbor or Anacortes area.",
      "ownerResponse": []
    },
    {
      "author": "Josiah Grigaliunas",
      "rating": 1.0,
      "review": "Most unprofessional office I have ever stepped foot in. The owner had the audacity to mock me while in his office making a payment. Also super neglectful the stove they had caught on fire and that wasn't the only fire on his property that month.",
      "ownerResponse": []
    },
    {
      "author": "Nathan Kelly",
      "rating": 5.0,
      "review": "I've had the privilege of working with 360 Property Management on a few projects and am impressed by how responsive they are and how committed they are to fixing things the right way. They care about their properties and it shows!",
      "ownerResponse": []
    },
    {
      "author": "Beau Bianchi",
      "rating": 5.0,
      "review": "We have worked with Dave and Lovie. They are fantastic human beings. Very caring and responsive. These folks are highly trustworthy!!!",
      "ownerResponse": []
    },
    {
      "author": "Colony Campbell",
      "rating": 5.0,
      "review": "These people are amazing they help me get an apartment always have been very very good to me and my family if something needs fixed they are on it!! I'm so happy to be a part of the Koetje family.",
      "ownerResponse": []
    },
    {
      "author": "James Richards",
      "rating": 5.0,
      "review": "As a tenant, the folks at 360 have been professional, polite, and awesome for the whole move in process!",
      "ownerResponse": []
    },
    {
      "author": "Sydney Jesson",
      "rating": 1.0,
      "review": "Reported to BBB. See review.",
      "ownerResponse": []
    },
    {
      "author": "James Romero",
      "rating": 3.0,
      "review": "Koetje could be better. Some places they have are not living standard and should not be on listing. Besides the few they do have great listings and good staff. Great if first time renter.",
      "ownerResponse": []
    },
    {
      "author": "Teresa Gaskill",
      "rating": 4.0,
      "review": "I've worked with 360 Property Management for a few years. Very friendly, professional staff. Customer service and maintenance go above and beyond when you need help with something at a rental property.",
      "ownerResponse": []
    },
    {
      "author": "S Osburn",
      "rating": 5.0,
      "review": "Renter for 3 years with this company and they were great to work with.",
      "ownerResponse": []
    },
    {
      "author": "Rebecca Craig",
      "rating": 1.0,
      "review": "They made it seem our application was sure to go through but then they denied us over something long since taken care of",
      "ownerResponse": []
    },
    {
      "author": "Tim Goette",
      "rating": 5.0,
      "review": "I am a vendor hired to do repair to properties they manage and I know this team they work very hard for owners and tenants.",
      "ownerResponse": []
    },
    {
      "author": "Chey Richardson",
      "rating": 5.0,
      "review": "The people who work here, are friendly & helpful when looking at their properties to rent.",
      "ownerResponse": []
    },
    {
      "author": "Cindy Cluff",
      "rating": 5.0,
      "review": "They have been great.  Totally love them.",
      "ownerResponse": []
    },
    {
      "author": "NEIL FORSTER",
      "rating": 3.0,
      "review": "Helpful wish they were closer to long beach",
      "ownerResponse": []
    },
    {
      "author": "Beth Bear",
      "rating": 4.0,
      "review": "They seem like theyre improving with time",
      "ownerResponse": []
    },
    {
      "author": "Christa Ford",
      "rating": 5.0,
      "review": "Great management company for 2 years!",
      "ownerResponse": []
    },
    {
      "author": "Rick Schutte",
      "rating": 5.0,
      "review": "Great customer service. Thank you",
      "ownerResponse": []
    },
    {
      "author": "Nick Sanabria",
      "rating": 1.0,
      "review": "Do not rent from these people.",
      "ownerResponse": []
    },
    {
      "author": "Capt. Cannabis",
      "rating": 1.0,
      "review": "Watch your back these are shady people..",
      "ownerResponse": []
    },
    {
      "author": "Matthew Hammar",
      "rating": 1.0,
      "review": "DO NOT TRUST THEM!!!!",
      "ownerResponse": []
    },
    {
      "author": "Alma Clark",
      "rating": 1.0,
      "review": "They made us homeless.",
      "ownerResponse": []
    },
    {
      "author": "AMY HUNT",
      "rating": 1.0,
      "review": "Rude and nasty to people disabilities.",
      "ownerResponse": []
    },
    {
      "author": "A J",
      "rating": 5.0,
      "review": "Great Rental company!",
      "ownerResponse": []
    },
    {
      "author": "Amanda Dearing",
      "rating": 3.0,
      "review": "Some people love them",
      "ownerResponse": []
    },
    {
      "author": "Stan Blake",
      "rating": 4.0,
      "review": "Very nice and helpful.",
      "ownerResponse": []
    },
    {
      "author": "M B",
      "rating": 4.0,
      "review": "Friendly, helpful",
      "ownerResponse": []
    },
    {
      "author": "Emma DuPont",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "John Brooks",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Elizabeth Kay",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Carson Paws",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Aaren Lindsey",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Sebastian Serrano-Ayala",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Pioneer Office",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Randall Johnston",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Kiana Monay",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Crystal Gorham",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Mike",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "George Houchin",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Nontobeko Mkhize",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Art of perfection",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Eric King",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Cynthia Smith",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jason Blackwell",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Eric",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Nina Sweet",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Ian G",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Patricia Flanagan",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "ziggy weidenhamer",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Baillie Kitchell",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jessica Hollett",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Debra Voogd",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Patricia Snow",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "janine",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "J Witness",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 56,
  "avg_rating": 3.0,
  "adjusted_avg_rating": 2.8
}