{
  "name": "Adams Property Management",
  "address": "1344 King St Ste 201 Bellingham, WA 98229",
  "company_type": "company",
  "review_count": 10,
  "reviews": [
    {
      "author": "Ethan Kendall",
      "rating": 1.0,
      "review": "Pipes froze went without running water for 10 days no restitution for equipment I bought to unthaw pipes slow to respond. Owners selling property gave me till end of lease to figure out new place to live found place a month early moving out ",
      "ownerResponse": []
    },
    {
      "author": "Graham Armstrong",
      "rating": 5.0,
      "review": "We rented from Howard and Caroline for 5 years, and while their management style might not work for everyone, it was perfect for us. We were comfortable handling the majority of maintenance and repairs on our own,  and they were comfortable ",
      "ownerResponse": []
    },
    {
      "author": "Nick Hatch",
      "rating": 4.0,
      "review": "I've been a tenant with Adams for over three years, and have been pleased with the no-nonsense approach they take with property management. Problems generally get fixed quickly, and they'll be a respectful and attentive landlord as long as ",
      "ownerResponse": []
    },
    {
      "author": "Sarah Ross-Morgan",
      "rating": 1.0,
      "review": "I've lived in Whatcom county most of my life and I've rented from many property management groups, most are pretty fair. Truthfully Adams is the second worst (Lakeway wins first by a landslide- oi vey). This guy...I've never been so abused ",
      "ownerResponse": []
    },
    {
      "author": "Steven Shimko",
      "rating": 5.0,
      "review": "Awesome landlords, always punctual when there are issues",
      "ownerResponse": []
    },
    {
      "author": "Nick Farrell",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Graham A.",
      "rating": 5.0,
      "review": "We rented from Howard and Caroline for 5 years, and while their management style might not work for everyone, it was perfect for us. We were comfortable handling the majority of maintenance and repairs on our own,  and they were comfortable being \"hands-off\" landlords. We paid a very reasonable price the entire time that we rented from them.\n\nThey are also good people. I will miss having small chats with Caroline once a month while turning in rent.",
      "ownerResponse": []
    },
    {
      "author": "Pamela C.",
      "rating": 5.0,
      "review": "Howard and Caroline are great! They have been taking care of our properties for about 5 years and we can count on them for everything.  Honesty, and integrity.  He screens our tenant's well and we have never had any problems because of their thoroughness.  \nHoward and Caroline are wonderful communicators and they follow through with all request.  \nWe are so glad to have found them!",
      "ownerResponse": []
    },
    {
      "author": "Monica J.",
      "rating": 1.0,
      "review": "Renting with Adam's for six years was one of the worst decisions of my life. The homes are not clean -- we moved into a house filled with garbage, food that was YEARS old, and damage -- and ended up having to pay for the previous tenants damage. Howard and the other woman in charge do not have any idea of how to run a business. They are aggressive, disorganized, unprofessional and downright ridiculous. Howard will come to your house unannounced and be rude. Yes, he will just walk in. I wish I was kidding. Don't expect to ever get a call back unless  they didn't get their money. Howard is incredibly aggressive towards women and will cuss at you over the phone or in person. The office is dirty and covered with papers. I have no idea how they get anything done because when they arent being incredibly rude they are so out of it it's comical. Without a doubt the worst experience i've ever had.",
      "ownerResponse": []
    },
    {
      "author": "Nick F.",
      "rating": 1.0,
      "review": "Absolutely disgusting and disgraceful excuse for a Property Management company.\n\nMy roommates and I were in love with our duplex we were renting from Adams, until we noticed a few of the appliances (along with the already-damaged carpets and floors that needed maintenance in terms of cleaning) needed attention. Since Adams is... SHOCKER... supposed to facilitate maintenance on up-keeping the house, we have made arrangements for some of these things to be fixed on numerous occasions (and arrangements were NOT made easily by any measure - we always had to be the ones calling the repair people [which i'm pretty sure is not standard procedure]). Finally, one day when my roommate decided to take the rent check in, she inquired about the possibility of having the carpets taken care of, since we had been ignore several times on this request. Without hesitation, the owner (Howard) flipped out on my roommate and spewed the most distasteful sexist garbage onto her, claiming she was a \"bitch\" and threatened eviction on us for no good reason whatsoever, other than the fact that we were \"annoying\" and he \"hated our unit\". (All VERBATIM from what was said) Long story short, APM will not be going down without a fight. Absolutely the worst rental company experience ever.",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 9,
  "avg_rating": 3.3,
  "adjusted_avg_rating": 3.1
}