{
  "name": "MJB Real Estate Group",
  "address": "",
  "company_type": "company",
  "review_count": 23,
  "reviews": [
    {
      "author": "Gabe Wynn",
      "rating": 5.0,
      "review": "Jeff was amazing, he assisted my partner and I with finding and purchasing the perfect home. We are first time home buyers so we were really nervous and Jeff truly treated us like family. He was honest and extremely knowledgeable about ",
      "ownerResponse": []
    },
    {
      "author": "Nancy Landau",
      "rating": 5.0,
      "review": "My husband and I worked with Jeff Engen on our move from Berkeley, CA to Bellingham, WA.  He is a fabulous real estate agent!  Jeff really walked us through the whole process, talked us down when we were anxious, explained the steps and the ",
      "ownerResponse": []
    },
    {
      "author": "Lauren",
      "rating": 5.0,
      "review": "I can't thank Mike enough for his hard work and timely attention to closing a deal on my first home. He really knows his stuff, from the local area to working with the right lenders for the best rate. He also has a great intuition for ",
      "ownerResponse": []
    },
    {
      "author": "Kasey Peach",
      "rating": 5.0,
      "review": "We found Mike by doing some research here online as the reader is probably doing now. One of our favorite parts of working with Mike is that he gets to the point and quickly pin points what it is that you are interested in and then uses ",
      "ownerResponse": []
    },
    {
      "author": "Jennifer Lally",
      "rating": 5.0,
      "review": "I worked with Mike Belisle to purchase my condo in Bellingham in the fall of 2018 and to sell it in February/March 2021, and I would HIGHLY recommend Mike to anyone looking to buy or sell. ",
      "ownerResponse": []
    },
    {
      "author": "Linda Walker",
      "rating": 5.0,
      "review": "Mike Belisle did a great job marketing and selling our small acreage Bellingham home in the country this past fall. Priced right, pointers on staging, great communication and follow-up. After we moved out and the deal was done, a truly ",
      "ownerResponse": []
    },
    {
      "author": "Maureen Van Deuren",
      "rating": 5.0,
      "review": "If you want to get the job done Mike Belisle and his TEAM should be your first call!\nThe excellence is apparent the minute you talk with Mike. He listens, asks ",
      "ownerResponse": []
    },
    {
      "author": "Jane Wareing",
      "rating": 5.0,
      "review": "Experience with Michael Belisle of the MJB Real Estate Group\n\nEarlier this spring, we were getting ready to sell our home so we could move ",
      "ownerResponse": []
    },
    {
      "author": "bFishLike bFischLike",
      "rating": 5.0,
      "review": "My professional relationship with Mike Belisle stretches back to 2015 when he made my transition from San Diego to Bellingham an absolute walk in the park. He guided me in the purchase of a new home and was there to assist me every step of ",
      "ownerResponse": []
    },
    {
      "author": "Jenni Cox",
      "rating": 5.0,
      "review": "I found a dream house when I least expected it and called Michael to talk through the numbers of placing and offer and eventually selling my existing home.  I thought it was going to be a longshot but he went right into action and worked on ",
      "ownerResponse": [
        {
          "text": "Hi Jenni, thank you for the great review. We really enjoyed working with you as well. We wish you all the best in your new home and can't wait to hang out soon."
        }
      ]
    },
    {
      "author": "Micah Bartlett",
      "rating": 5.0,
      "review": "I've had Mike's help buying 2 places now. While a little rough around the edges, Mike has good knowledge and insight into homes/ property and is a great guy to have in your corner. He will ask the tough questions, keep the process moving, and bargain for your best interests.",
      "ownerResponse": []
    },
    {
      "author": "Kelsey Chance",
      "rating": 5.0,
      "review": "Thank you Mike!!  As first time home buyers, we felt confident all the way with you as our agent.  From trudging through the rain and mud with me to look at the property lines, all the way to getting our winning offer in within 2 hours of viewing the house - you were hands on and a real advocate for us.  We love our new home!!",
      "ownerResponse": [
        {
          "text": "Thank you Kelsey. It was an honor working with you and Spencer. I wish you both the best and hope to see the personal touches you do."
        }
      ]
    },
    {
      "author": "Kelly Earl",
      "rating": 5.0,
      "review": "My husband and I moved to Bellingham in July 2021 and always dreamed of being home owners. After passing on a home we were positive we wanted, we settled on a gorgeous new construction in Everson. Jeff Engen worked around the clock ",
      "ownerResponse": []
    },
    {
      "author": "Millard Shires",
      "rating": 5.0,
      "review": "I hope this isn't too long...  Some agents are wonderful at hand holding and explaining.  Some agents are wonderful at getting the job done -- you just tell them what you want/need and let them go to work.  Sort of like surgeons...some have ",
      "ownerResponse": [
        {
          "text": "Mill, you and Carol are so great. Thank you for your kind words. Its a pleasure to know you and thanks again for the advice on my trees.  Everyone needs to know a Master Gardener. : )"
        }
      ]
    },
    {
      "author": "George Walker",
      "rating": 5.0,
      "review": "Mike did a fine job of marketing our house and satisfying both the sellers (us) and the buyers.  The deal went smoother than expected -  probably due to Mike's flexibility during negotiations.",
      "ownerResponse": []
    },
    {
      "author": "Scott Stone",
      "rating": 5.0,
      "review": "We had Mike sell our home and were very impressed with his professionalism and knowledge of the market. He exceeded our expectations. If you are looking to buy or sell a house, Mike will not disappoint.",
      "ownerResponse": []
    },
    {
      "author": "J Venus",
      "rating": 5.0,
      "review": "Mike Belisle is the most knowledgeable real estate agent in Whatcom County.  He has a vast background that includes land development, home remodels, investment properties, and mortgage management, just to name a few.  As a fellow real ",
      "ownerResponse": []
    },
    {
      "author": "Ben King",
      "rating": 5.0,
      "review": "What would we have done without Jess?! My wife and  I just concluded a lengthy search for a new home, and Jess Davis was there for us every step of the way. We looked at house after house for months and she never balked at our specificities ",
      "ownerResponse": []
    },
    {
      "author": "Makayla M",
      "rating": 5.0,
      "review": "I stumbled on MJB real estate through Instagram and reached out to find a realtor. I spoke with Jordyn and she put me in touch with Jessica. The team at MJB is super helpful and knowledgeable about buying a home! I would highly recommend!",
      "ownerResponse": []
    },
    {
      "author": "Funny Moms I Like To Follow",
      "rating": 5.0,
      "review": "Mike was a GREAT teammate through the buying process! He pushes past limits most will not and cheers you on during the entire buying process. 1,000 times PICK HIM. Hes got your back.",
      "ownerResponse": []
    },
    {
      "author": "Steve Chance",
      "rating": 5.0,
      "review": "I have used Mike on several purchase and sales over the years and would use no one else.  He is experienced, highly professional, accessible, responsive, and consistently works beyond my expectations.",
      "ownerResponse": []
    },
    {
      "author": "Spencer Berger",
      "rating": 5.0,
      "review": "I cannot recommend Mike Belisle highly enough. He is extremely knowledgeable about all things real estate.",
      "ownerResponse": []
    },
    {
      "author": "Sarah Peach",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 22,
  "avg_rating": 5.0,
  "adjusted_avg_rating": 5.0
}