{
  "name": "Oak Harbor Real Estate & Property Management",
  "address": "890 SE Pioneer Way STE 101, Oak Harbor, WA 98277",
  "company_type": "Real estate agency",
  "review_count": 20,
  "reviews": [
    {
      "author": "Carl Newman",
      "rating": 5.0,
      "review": "We've used Brian and Donna to purchase a house and they manage our rental property.  We wouldn't consider using anyone else for our future needs.  They showed us many homes before we finally bought and they didn't try to over-sell any of ",
      "ownerResponse": []
    },
    {
      "author": "Chris Pressentin",
      "rating": 1.0,
      "review": "ATTENTION MILITARY FAMILIES!  Avoid these people.  They are crooks.  They took over for the old rental company my family rented from, otherwise I wouldn't have even dealt with them.  My family and I lived at a property for over 2 years and ",
      "ownerResponse": []
    },
    {
      "author": "Rochell Brown",
      "rating": 5.0,
      "review": "Thank you to Brian and the maintenance staff for saving Thanksgiving.  Our oven went out and he made sure to connect my family in a timely manner and delivered a loaner till the new one arrives.  We very much appreciate you.",
      "ownerResponse": []
    },
    {
      "author": "Melissa Champion",
      "rating": 1.0,
      "review": "Avoid, dishonest and false advertising! Rented online and the pictures were not new pictures. The owner/manager is argumentative and lies to your face. He will try to nickel and dime you, save your money and time and find another local ",
      "ownerResponse": []
    },
    {
      "author": "Siani Tempson",
      "rating": 5.0,
      "review": "They are very accommodating. House was clean and process was fast. Thank you Oak Harbor Property Management Team!",
      "ownerResponse": []
    },
    {
      "author": "Jordan VIGE'",
      "rating": 1.0,
      "review": "Military beware,  they extort military and treat you like it inconvenient that you have to live in the property while you pay rent.  They will try and charge you for maintenance you filled out needed to be done when you leave, in 3 years ",
      "ownerResponse": []
    },
    {
      "author": "Hope Wirth",
      "rating": 5.0,
      "review": "Donna and Brian have been wonderful in helping us buy our dream home and list our current home. They showed us a lot of houses before we found the current one. They were wonderfully patient and listened to our needs and desires. When it ",
      "ownerResponse": []
    },
    {
      "author": "Island 12",
      "rating": 5.0,
      "review": "Donna went out of her way to help us get into a home. We had to sell ours first and we went with another local realtor who treated us like we were there for her. I'm not going to slander anyone by giving a name but let me just say this, ",
      "ownerResponse": []
    },
    {
      "author": "Molly Bryant",
      "rating": 1.0,
      "review": "We signed a lease on a trailer for rent through this company and got railroaded from the get. The roof was leaking in multiple spots and coming into the light fixture. There were outlets that did not work due to water damage the home was ",
      "ownerResponse": []
    },
    {
      "author": "Tawnee Hillmer",
      "rating": 1.0,
      "review": "Very disappointed with this property management all around.\nWhen I went to view an apartment, Donna told me that there was no pending applications. I put in my application right away, my boyfriend put his in that night. ",
      "ownerResponse": []
    },
    {
      "author": "Domestic Error",
      "rating": 5.0,
      "review": "We had the pleasure of renting through Brian for three years. During that time, we were treated extremely well and I cant come up with a single complaint. Initially, my rental started as a super-last minute / mid-deployment ",
      "ownerResponse": []
    },
    {
      "author": "Mallory Palatucci",
      "rating": 1.0,
      "review": "If I could give them no stars I would. Anna was right on the mark saying the owner, Brian was terrible at communication, that is unless you needed something then he got right back to you. ",
      "ownerResponse": []
    },
    {
      "author": "Jeremy B",
      "rating": 1.0,
      "review": "If youre in the military or part of a military family avoid this place at all cost. He will screw u out of money any way he can. Pay special attention to his leases, he doesnt follow them himself but will make sure u do. Again AVOID AT ALL COST.",
      "ownerResponse": []
    },
    {
      "author": "Normand Richard",
      "rating": 1.0,
      "review": "I left the place clean with little more to do - single person living - tubs never use nor was oven/kitchen or the 3rd bedroom, yet he charged me 420$ for cleaning with no detailed invoice and 150$ (2 paint scratches that I fixed), normal ",
      "ownerResponse": []
    },
    {
      "author": "Ben Nichols",
      "rating": 1.0,
      "review": "This is the worst landlord you could possibly have. When you submit a maintenance request you don't get a professional to come fix the problem. When you go to move out he charges you for problems in the house that were previously there ",
      "ownerResponse": []
    },
    {
      "author": "Candie Mendez",
      "rating": 1.0,
      "review": "Property manager never got back to me. I had to text her and call several times and she never communicated the decision of the owner. I had to go into the website to realize the house we wanted to rent was off market.",
      "ownerResponse": []
    },
    {
      "author": "Seth Champion",
      "rating": 1.0,
      "review": "Avoid this property management and save your money. False advertising and the manager/owner is shady!!!",
      "ownerResponse": []
    },
    {
      "author": "Rita Bartell Drum",
      "rating": 5.0,
      "review": "The team at Oak Harbor Property Management are professional and responsive toward landlord and tenant needs, they are a joy to work with!\nWe highly recommend them,\nDr. Edward Drum and Rita Bartell Drum",
      "ownerResponse": []
    },
    {
      "author": "Anna colkin",
      "rating": 1.0,
      "review": "terrible communication. only get back to you when they need something, but if they have a problem or it benefits them they can answer right away. Issues with my rental that were not fixed in a timely manner, random \"liability\" charges added to rent, and honestly rude service.",
      "ownerResponse": []
    },
    {
      "author": "Corey Mcfarren",
      "rating": 5.0,
      "review": "Very professional and prompt. Move in process was great.",
      "ownerResponse": []
    },
    {
      "author": "Michael Gartner",
      "rating": 5.0,
      "review": "So far very good.",
      "ownerResponse": []
    },
    {
      "author": "Kyle Merriman",
      "rating": 5.0,
      "review": "My wife and I have used OHRE for buying, selling, and renting homes for 7 years and have always been happy with the service.",
      "ownerResponse": []
    },
    {
      "author": "Garrett Kolmer",
      "rating": 5.0,
      "review": "Great folks to work with!",
      "ownerResponse": []
    },
    {
      "author": "C Ross",
      "rating": 1.0,
      "review": "Horrible service and non-responsive. Avoid!",
      "ownerResponse": []
    },
    {
      "author": "willie sprague",
      "rating": 5.0,
      "review": "Great communication and pays on time every time.",
      "ownerResponse": []
    },
    {
      "author": "Todd Talley",
      "rating": 5.0,
      "review": "Great",
      "ownerResponse": []
    },
    {
      "author": "Barbara Hawkins",
      "rating": 5.0,
      "review": "So helpful & friendly",
      "ownerResponse": []
    },
    {
      "author": "Jennifer Velez",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Pamela Burley",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Cara Holmes",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 27,
  "avg_rating": 3.0,
  "adjusted_avg_rating": 3.1
}