{
  "name": "Property Management PNW",
  "address": "16404 Smokey Point Blvd Ste 203, Arlington, WA 98223",
  "company_type": "company",
  "review_count": 15,
  "reviews": [
    {
      "author": "Sarah Gesick",
      "rating": 5.0,
      "review": "Property Management PNW has great communication. Their customer cooperation is excellent and professional, They have respond promptly to any questions, concerns, and difficulties I have encountered. They are highly efficient and organized. ",
      "ownerResponse": [
        {
          "text": "Sarah thank you so much for the great review!"
        }
      ]
    },
    {
      "author": "Scott Henry",
      "rating": 1.0,
      "review": "I was under false pretense that this company is a great company to rent the house with but after few months, I had several house issues where PNW refused to get them taken care of. I wanted to get a different house but they refused to work ",
      "ownerResponse": [
        {
          "text": "Scott thank you for your feed back per your rental agreement and maintenance addendum. All maintenance requests are required to be submitted online to our maintenance department and they are processed within 48 Business hours, All of your  More"
        }
      ]
    },
    {
      "author": "CIDSolutions",
      "rating": 5.0,
      "review": "Melanie is so knowledgeable and helpful.  She goes the extra mile with her service and care!  I really appreciate what Melanie brings to the table for all she does.",
      "ownerResponse": []
    },
    {
      "author": "Lori K",
      "rating": 5.0,
      "review": "I met Melanie in the Spring of 2018 when I was considering renting my home.  She was highly experienced and helped me with all the aspects of getting my home ready to rent including advice on how to make a home attractive to quality renters ",
      "ownerResponse": [
        {
          "text": "Thank You Lori It was a pleasure working with you!"
        }
      ]
    },
    {
      "author": "Brandon Moore",
      "rating": 5.0,
      "review": "I highly recommend Melanie Maddy for your property management and real estate needs. Melanie is professional and is available to answer my many questions at all hours of the day. She has been simply amazing. Thank you!!",
      "ownerResponse": [
        {
          "text": "Brandon Thank you so much its always a pleasure to add new investors and I hope you enjoy your new home just in time for the holidays! "
        }
      ]
    },
    {
      "author": "Raja Venugopal",
      "rating": 5.0,
      "review": "I've known Melanie Maddy of Pacific NW Reality and Property Management Services for more than a year now. They manage multiple of my properties. Melanie's knowledge and experience in real estate and property management is extensive and ",
      "ownerResponse": [
        {
          "text": "Thank you"
        }
      ]
    },
    {
      "author": "Nathalie Deng",
      "rating": 5.0,
      "review": "Melanie is very helpful and she is very generous to give me a lot of advice and suggestions. she do things very efficently and she usually respond email very quickly. I really appreiated that she trying to help me to rent my property to the higher price in the market. I strongly recommond her as property manager. she is flexible too.",
      "ownerResponse": [
        {
          "text": "Thank You Nathalie We appreciate your business!"
        }
      ]
    },
    {
      "author": "Jennifer Daris",
      "rating": 5.0,
      "review": "While renting a previous home, the owners switched realtors in the middle of our time to Pacific NW Property Management.  My husband and I respected their professionalism, helpfulness, communication, and overall business practices, and would go to them again if renting in the Snohomish, Washington, area.",
      "ownerResponse": [
        {
          "text": "Thank you so much it was our pleasure!"
        }
      ]
    },
    {
      "author": "Bryant Everett",
      "rating": 5.0,
      "review": "Property is well taken care of and the move in process is very simple. They are very understanding of people just starting out or don't have a line of credit.",
      "ownerResponse": [
        {
          "text": "Thank You Bryant we appreciate your review, Welcome to your new place!"
        }
      ]
    },
    {
      "author": "kristina geyer",
      "rating": 5.0,
      "review": "I give this company and Melanie 5 stars! Give her a call!",
      "ownerResponse": [
        {
          "text": "Kristina Thank you for your review we look forward to working with you!"
        }
      ]
    },
    {
      "author": "Naomi Rodgers",
      "rating": 5.0,
      "review": "My property manager Melanie has been great!",
      "ownerResponse": [
        {
          "text": "Naomi Thank you for taking care of the property like its your own!"
        }
      ]
    },
    {
      "author": "gary blendheim",
      "rating": 5.0,
      "review": "Great property management services in Snohomish County, Melanies attention to detail and work ethic are stellar!",
      "ownerResponse": [
        {
          "text": "Thank You Gary we love managing your property!"
        }
      ]
    },
    {
      "author": "jEANNIE COLBERT",
      "rating": 5.0,
      "review": "great!",
      "ownerResponse": [
        {
          "text": "Thank You and Welcome Home!!"
        }
      ]
    },
    {
      "author": "Rey Belmonte",
      "rating": 5.0,
      "review": "Good",
      "ownerResponse": [
        {
          "text": "Thank you Rey!"
        }
      ]
    },
    {
      "author": "Fidel Alvarez Campa",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you !"
        }
      ]
    },
    {
      "author": "Jessica Reyes",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you !"
        }
      ]
    },
    {
      "author": "Michelle Clark",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank You Michelle I look forward to working with you!"
        }
      ]
    },
    {
      "author": "Kelly McMahon",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Kelly look forward to working with you!"
        }
      ]
    },
    {
      "author": "Ruth Galvan",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Douglas Bellew",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Douglas we were able to get your home rented quickly we appreciate the business!"
        }
      ]
    },
    {
      "author": "Kelly Timney",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Kelly!"
        }
      ]
    }
  ],
  "adjusted_review_count": 14,
  "avg_rating": 5.0,
  "adjusted_avg_rating": 4.7
}