{
  "name": "Whidbey Residential Rentals",
  "avg_rating": 5.0,
  "review_count": 2,
  "adjusted_review_count": 2,
  "reviews": [
    {
      "author": "Lucylyn G.",
      "rating": 5.0,
      "review": "When we first moved here we tried a two other Property Management places first. They were the bigger names around town. The first place it seemed like the owner was the only person working for the company, including doing any and all handyman/repair work. The second place was much different and we thought we liked them a lot. Turns out we didn't, but that's a whole other review. \n\nOur experience with this office was quick, efficient and very relieving. My husband called up after looking at a couple of listings he was interested in, spoke with Theresa and told her what we were looking for, and she also offered up a few things we passed over. We're really happy she did, because we are now in a town home that has everything we needed and wanted at a very affordable rate. We initially wanted a single family home, because we really wanted a garage, and she encouraged us to look anyways. SFH were more expensive with less room inside and no neighbors with connecting walls. She understood our needs and found us a town home that had a garage and was at the end of the building, so we only have one neighbor with connecting walls. The neighbor is just one guy, who is almost never home and when he is is super quiet. We've met him a few times in the less than a month that we've been here. He's also really nice. I know you can't always pick your neighbors, but Theresa really understood that we are a quiet couple who like our home to be equally as quite, jets excluded, and said she knew this would be a good fit because we match very well with the neighbors.\n\nIt means a lot that she would look out more for us and our wants and needs that she did her bottom line. The tenants who stayed here before us kind of messed up the place, and she did an amazing job making sure everything was in clean and working order. Noticing the repair and work orders needed to get this place back in good condition, I know that the cost was just over what she actually made from renting to the young couple over the 6 month lease, but as a responsible property manager she did what she had to do. \n\nI can respect that completely. My husband and I are planning to buy a house by the end of our lease, and in the event that we have to move, we have already decided that she is going to be the property manager if we decide to rent versus selling.",
      "ownerResponse": []
    },
    {
      "author": "Debi S.",
      "rating": 5.0,
      "review": "This rental management company is the best. Wonderful staff, caring individuals who take care of their owners and clients. Always helpful, reasonably priced rentals. I would highly recommend these folks for either rental management or rental property.",
      "ownerResponse": []
    }
  ],
  "company_type": "company",
  "address": "285 NE Midway Blvd Ste 2 Oak Harbor, WA 98277",
  "adjusted_avg_rating": 5.0
}