{
  "name": "Monterra Apartments",
  "avg_rating": 2.0,
  "review_count": 19,
  "adjusted_review_count": 14,
  "reviews": [
    {
      "author": "Chloe E.",
      "rating": 1.0,
      "review": "This is NOT a safe place to live. If you're considering renting here, don't.  The residents include several criminals at this time. I've seen threats left on apartment doors and cars. I'd love to break my lease because I feel unsafe, but aparently I cannot. Cars get keyed all the time. We aren't allowed to recycle. There isn't enough parking for the residents. By the time I had lived here 3 months, we had gone through 3 different property managers, and none of them seemed to have a clue what they were doing. I cannot stress enough how terrible living here is. I have had 0 positive experiences with property managers or other tenants.",
      "ownerResponse": [
        {
          "text": "Hi Chloe, We're troubled to read your review of Monterra, and we're eager to do all we can to help improve your time here. When you get a moment, could you please come to see us in the office or give us a call at (360) 306-8756? We look forward to hearing from you soon. Thanks."
        }
      ]
    },
    {
      "author": "Aidannnjames",
      "rating": 1.0,
      "review": "Signed lease renewal, now they're trying to force us into a new more expensive lease. Office essentially called me a liar when I tried to explain that all parties attempted to sign. Theres also rats living everywhere on the property.",
      "ownerResponse": [
        {
          "text": "We apologize for any confusion during the renewal process. All parties on the lease need to complete the lease signing by the renewal deadline in order to receive that renewal offer pricing. Additionally, we are continuing strict pest  More"
        }
      ]
    },
    {
      "author": "Tori Lehman",
      "rating": 1.0,
      "review": "It took them months to fix a door that was broken when I moved in, and they continued contacting me for weeks after it was replaced to ask if I still needed it fixed. There are cracks in the ceiling and dents in the walls that were not ",
      "ownerResponse": [
        {
          "text": "Thank you for sharing your experience at Monterra. We are sorry to hear that you have encountered issues with maintenance and the appliances. We strive to provide prompt and efficient service, and we apologize for any inconvenience caused.  More"
        }
      ]
    },
    {
      "author": "Veronica Cruz Smith",
      "rating": 1.0,
      "review": "DONT MOVE HERE. Rats everywhere. Whole property smells like rat poop. Management neglects the property and is rarely present or reachable. Your rent will go up every year while living conditions go down the hole. Any tenant is accepted, so expect fights, parties, aggressive dogs off leash, and every weekend no parking.",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to share your experience at Monterra. We appreciate you having contacted us directly. We are actively working to address your concerns. We thank you for having brought them to our attention. "
        }
      ]
    },
    {
      "author": "Alex Ruderman",
      "rating": 1.0,
      "review": "This place is horrible. Its cheap for a reason. Apt #357 has had cracks in the ceiling for MONTHS and Before even attempting to fix. There have been multiple instances of sewage water coming up into the bathroom and into the yard. PTLA / APEX management is horrible. Avoid at all cost.",
      "ownerResponse": [
        {
          "text": "Hey Alex. We apologize for the maintenance issues in your previous unit and thank you for your continued patience as we navigate through repairs. Please feel free to contact us directly at your earliest convenience if you have any further questions or concerns!"
        }
      ]
    },
    {
      "author": "Wava Vautour",
      "rating": 5.0,
      "review": "When Monterra took over they definitely could tell Cambridge Square needed a lot of tlc. While some have complained about the construction, it all needed to be done in order to fix and update the units and get rid of all the mold. It is ",
      "ownerResponse": [
        {
          "text": "Hello Wava, Thank you for providing this feedback. It's good to know that our residents are happy and excited about our community improvements. We also appreciate your kind words about Andrew, he is a valued team member. As always, let us know if we can be of assistance!"
        }
      ]
    },
    {
      "author": "Colton Strong",
      "rating": 1.0,
      "review": "This has been by far the worst property management company I have ever dealt with. They absolutely do not care about thier current tennants and only about bringing new unknowing clientele. I have lived here peacefully for nearly 2 years and ",
      "ownerResponse": [
        {
          "text": "Dear Colton, Thank you for the review and feedback about our management at Monterra Apartments.  We are truly sorry that you are displeased with the processes so far at the community and encourage you to stop by the leasing office to  More"
        }
      ]
    },
    {
      "author": "Bry Yates",
      "rating": 1.0,
      "review": "The absolute worst management Ive dealt with living in Bellingham. I thought the shaddiness and scheming landmark was bad, this is the worst experience Ive had. I am getting woke up before 9 AM because of a jack hammer and because of a ",
      "ownerResponse": [
        {
          "text": "Bree, we're so sorry for any inconvenience that you've experienced because of our property maintenance and construction. Unfortunately, these are operations that are necessary to maintain and improve our community. We recognize, however,  More"
        }
      ]
    },
    {
      "author": "Space Gnome",
      "rating": 1.0,
      "review": "Welcome to Monterra Apartments. Monterra has plummeted downhill over the past few years especially now since Andrew, the only redeeming factor of this place has left and I don't blame him. I would recommend moving here in a few years time ",
      "ownerResponse": [
        {
          "text": "We truly value your feedback, and we apologize for the disruptions caused by construction at the property. We do our best to be considerate of residents by containing construction to the hours of 8:00am-6:00pm, but we know that doesnt work  More"
        }
      ]
    },
    {
      "author": "Mom Tom",
      "rating": 1.0,
      "review": "Ptla management completely ruined this place. They have upcharged us on just about anything they could possibly think of and made every maintenance request feel like it was below them to fix. Don't expect your deposit back and take as many pictures as you can if you ever want to rent from them.",
      "ownerResponse": [
        {
          "text": "We're sorry that you're not enjoying your living experience at Monterra. We strive to make our residents happy and want our community to be a place that everyone loves to call home. Please be assured that your concerns matter to us. Kindly reach out to us at your convenience to discuss what we can do to improve your time here."
        }
      ]
    },
    {
      "author": "m p",
      "rating": 1.0,
      "review": "THIS IS A DANGEROUS PLACE TO LIVE. Was a decent place while Landmark still owned it, and I never imagined Id have a good thing to say about those clowns. Theres a woman living in the complex who, I can say without exaggeration, terrorizes ",
      "ownerResponse": [
        {
          "text": "Thank you for reaching out to us as our residents concerns are very important to us.  We are committed to giving our residents a wonderful living experience at Monterra Apartments and take situations like this very seriously.  As you  More"
        }
      ]
    },
    {
      "author": "Tyler Steinberg",
      "rating": 1.0,
      "review": "We had a seeing scheduled and no one was there or bothered to tell us when theyd be back",
      "ownerResponse": [
        {
          "text": "Hey Tyler, we are sorry to see you are dissatisfied with our community! Please reach out to our main office so we can gain some insight into how to better serve you."
        }
      ]
    },
    {
      "author": "Zachary Toombs",
      "rating": 4.0,
      "review": "Nice, just could use a little TLC on the outside...",
      "ownerResponse": []
    },
    {
      "author": "Charlie Young",
      "rating": 1.0,
      "review": "Shoddy workmanship on the buildings and difficult to park.",
      "ownerResponse": []
    },
    {
      "author": "Jayden Houchin",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your five-star rating of Monterra! We appreciate your residency, Jayden!"
        }
      ]
    },
    {
      "author": "Cetching",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Lee Norton",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Were sorry to see this low rating, Lee. We hope youll contact us directly to allow us an opportunity to address any concerns you may have. Thank you."
        }
      ]
    },
    {
      "author": "The GOAT",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jake Sutton",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "company_type": "property",
  "address": "487 31st St Bellingham, WA 98225",
  "adjusted_avg_rating": 1.5,
  "summary": "# A Balanced Review of Monterra Apartments\n\nBased on various user reviews, this article aims to provide a comprehensive outlook on the experiences of tenants at Monterra Apartments. Remember, this article's intent is not to promote nor disparage Monterra Apartments but to assist in forming an unbiased opinion of their property management capabilities. All information within the user reviews alludes to specific sentiments and incidents which are paraphrased and anonymized for privacy. \n\n## Good\nDespite the mixed feedback, Monterra Apartments has exhibited moments of positive performance. A particular tenant expressed satisfaction with the recent changes after Monterra took control, highlighting the essential renovations and the mitigation of issues like mold. The construction, though inconvenient for some, is recognized as necessary to the property's refurbishment.\n\nThe responses from the property management to user reviews show a willingness to engage and resolve issues. They have invited tenants to discuss concerns personally and assured continued efforts to address maintenance and construction inconveniences. Their responses, while formulaic, indicate a readiness to assist and improve the living conditions of their tenants.\n\n## Great\nIncluding in the good, occasional stellar remarks come from residents who see potential in the Monterra Apartments under the new management. An example cited in user reviews is the diligence shown in purging long-standing mold issues. A resident appreciated the hard work and even singled out a team member for their valuable contribution.\n\nThe initiative to communicate with the residents, even in the face of criticism, sets a proactive tone for the management. They have acknowledged feedback and expressed a commitment to creating a positive and enjoyable living experience for all residents in the Monterra Apartments, which is commendable given the difficult circumstances.\n\n## Bad\nUnfortunately, not all remarks are favorable. Residents have reported significant safety concerns, citing multiple instances of criminal activity within the apartment community. These allegations, grave in nature, represent a major red flag about the living conditions at Monterra Apartments.\n\nIn the realm of logistical headaches, tenants have encountered problems with lease agreements and renewal processes. Accusations of management pushing for more expensive leases or disregarding previously agreed upon terms have surfaced, painting a picture of potential mismanagement and causing frustration among the inhabitants.\n\n## Ugly\nThe ugly truths about Monterra Apartments appear to stem notably from chronic neglect and a perceived indifference towards tenant welfare. Reports from the residents detail a consistent problem with pests, especially rats, and a belated or nonchalant response to maintenance requests, such as unaddressed structural cracks and prolonged dysfunctional fixtures.\n\nMoreover, residents have a shared experience of a difficult communication stream with Monterra's property managers, who are described as rarely present and unapproachable. There are accounts of amenities like recycling not being offered and insufficient parking available for tenants. These themes run like red threads through the user reviews and pose serious questions about the efficiency and tenant management practices currently in place.\n\nPlease consider this article as a tool to inform your decisions regarding property management companies or rental properties. The user reviews summarized in this article are generated by ChatGPT and aim to convey the experiences shared by actual tenants without bias."
}