{
  "name": "Sunset Pond Apts",
  "avg_rating": 2.9,
  "review_count": 7,
  "adjusted_review_count": 7,
  "reviews": [
    {
      "author": "Marissa C.",
      "rating": 1.0,
      "review": "Not a safe place to live. Outside: trash everywhere, homeless people, car windows bashed in, property stolen off porch. Inside: overflowing toilets, standing water inside that management not only won't care about but would then probably charge you for water damage upon move out. \n\nI was forced to pay other peoples bills when I lived here or threatened with eviction. I was never compensated for their mistake, just treated with hostility. \nI was also forced to pay for the carpets to be replaced when I moved out based on how the carpets looked on the bottom once ripped out, not the top that you can see. They did not let me see the state the bottom of the carpet upon move in yet that's what they judged it off of upon move out... they really just make their own rules here and will continue to take advantage of people\n\nDon't risk it! Live anywhere else.",
      "ownerResponse": []
    },
    {
      "author": "Taylor C.",
      "rating": 5.0,
      "review": "We had a 2nd floor apartment with a stunning view of the pond. Our apartment came with a discount and even though we had our rent raise it was still a very good price compared to those in town. The front office people were always kind to us, the maintenance here are hard workers and treat you with kindness. Overall we enjoyed our experience here.",
      "ownerResponse": []
    },
    {
      "author": "Jessica P.",
      "rating": 1.0,
      "review": "Avoid this place at all costs especially if you are a single woman! \nWe had issues on several occasions with the cleaner harassing and peering in windows, taking pictures, when many other units were far worse than my daughter's . Piles of trash all over balconies, throwing trash over the edge, screaming and yelling from other units. People park huge vehicles in compact spaces and others have to crawl in and out of cars. The office is always closed and the staff mean and rude.\n\nMy daughter was also harassed by homeless people and we called the police on several occasions. The police said the landlords were responsible to keep homeless people off of peoples patios and that motion lights/cameras should be installed. When I contacted the management they said it wasn't their problem.\n\nMy daughter has been targeted by rude bitter people who excuse the behavior of some and harass others.",
      "ownerResponse": []
    },
    {
      "author": "Farnoosh R.",
      "rating": 3.0,
      "review": "My wife lived there for a year (2017-2018), and I visited regularly. \n\nPros: \n-The area is clean and well taken care. \n-Contrary to the past the neighborhood is pretty safe. \n- In unit laundry \n-It's a walking distance to several shopping places in Sunset square \n- Adequate quest parking space \n- Most tenants were decent and respectful \n\nCons: \n- Parking is pretty tight especially if you have a mid to large size car. \n- Office staff, especially the old lady that works there was remarkably rude and condescending on many occasions when I visited the office\n- Our upper floor was unusually squeaky anytime someone walked up there to the point that it wakes you up if you're sleeping \n- It would take maintenance staff several days to come over and fix something simple",
      "ownerResponse": []
    },
    {
      "author": "Ben B.",
      "rating": 4.0,
      "review": "Overall this place is very livable.  The area has been quiet, clean and I have appreciated the friendly neighbors.  The club is great!  A place to get away after a long day and get a quick workout in or soak in the hot tub.  The main complaint is the tight parking spaces and a lack of them for guests.",
      "ownerResponse": []
    },
    {
      "author": "Brianna M.",
      "rating": 2.0,
      "review": "Apartment has great view of the pond- Third floor, great window and balcony. We moved into the maintenance manager's old place so everything was in working order, cheap carpeting and plastic shower inserts, but very livable. We cleaned when me moved in. Parking spaces are very small and cars will be dinged by doors. I did also hear of a few neighbors cars being stollen.\n \nBeware of move out fees! We moved out and cleaned, but it was an off time when we were leaving so the apartment manager did not check us out. They charged us 5 hours of cleaning to a total of $159.87. Fine, whatever, I have always walked through before and if anything was not up to par, I would re-clean, but it was cleaner than when we moved in. We had steam cleaned the carpet, oven was clean, bathrooms spotless, balcony wiped down (moss & mold-less). We paid the bill, check cleared, no problem. Then a month later, we have collections trying to recollect this. \n\nThe office simply does not have their stuff together. Incorrectly sending a paid bill to collections should have some reprocussions, but it simply doesn't. \n\nRead more: http://www.apartmentratings.com/WA/Bellingham/Sunset-Pond-Apartments_360734772298226/review-111205729#ixzz2jh5WuC2P",
      "ownerResponse": []
    },
    {
      "author": "Heather E.",
      "rating": 4.0,
      "review": "This was my second time living in these apartments while in my hometown and I have nothing but love for the managers and staff at this complex. Karl and Jeeter always are prompt, efficient and friendly. They helped me out more times than I can count. They kept the apartments, community rooms and parking lots looking clean and presentable. \n\nThe only reasons why the apartments themselves do not rate 5 stars in my book was the noise from the neighbors beside me penetrated through my walls, and the townhouse parking, although covered, was further away from my unit, so my children and i often got wet before getting to our car. That's Bellingham for ya, not that we mind to much.\n\nI highly recommend this complex and if my husband and I don't end up purchasing a house, we'll more than likely reside there again.",
      "ownerResponse": []
    }
  ],
  "company_type": "property",
  "address": "1205 Woodstock Way Bellingham, WA 98226",
  "adjusted_avg_rating": 2.9,
  "summary": "# Sunset Pond Apts: An Honest Look at Tenant Experiences\n\n_Due to the myriad personal stories and experiences with Sunset Pond Apts, this article is created to provide potential renters with a broad overview of resident sentiments. Written by ChatGPT, this article aims to be a helpful tool in your search for a property management company or rental property._\n\n## Good\n\nSunset Pond Apts has received acclaim for the beauty of its location and the amenities it offers to its residents. Some residents express appreciation for the stunning view of the pond they enjoy from their apartments, mentioning the serenity it brings to their living experience. Pleasant interactions with front office personnel have also been emphasized, with some tenants commending the kindness and the effort that the staff and the maintenance teams put into their work. Furthermore, the provision of in-unit laundry facilities and the bonus of a clubhouse add convenience and luxury to everyday life at the complex.\n\nCommunity aspects such as friendly neighbors and adequate guest parking spaces have been positively noted as well, enhancing the atmosphere of the place. Some reviews recount the complex as being \"livable,\" with quiet surroundings conducive to relaxation. People specifically appreciated the chance to interact positively with not just the staff, but also with one another, fostering a sense of community. These incidents show that, for some, Sunset Pond Apts not only meets but also exceeds expectations when it comes to certain aspects of apartment living.\n\n## Great\n\nThe complex is reported to be in a clean and maintained condition, with some residents confirming a safe and respectful neighborhood. One reviewer, in particular, celebrated the convenience of walking to several shopping centers nearby, highlighting the blend of nature's tranquility with urban accessibility. Such positive feedback suggests that the property management is successful in creating a livable and attractive environment for its residents, ensuring that exterior appearances are kept up to a standard.\n\nMoreover, the extra perks such as the discount on rent for some residents and the recreational facilities available like the hot tub have been factors that significantly enhanced their living experience. The effort by the management to make the apartments more affordable, plus the leisure facilities, portrays Sunset Pond Apts as a place striving to provide added value. The dedication of the on-site teams, including both managers and maintenance staff, has been commended, indicating a level of care and service that residents find noteworthy.\n\n## Bad\n\nWhile there are positive notes, some residents have faced challenges with parking. Multiple reviews cite the cramped nature of parking spaces and the difficulties larger vehicles encounter, causing inconvenience and sometimes minor car damage. Additionally, noise has been a general concern, with complaints of squeaky upper floors interrupting the peace of tenants below.\n\nInteractions with office staff were not uniformly pleasant across all reviews. A reviewer pointed out instances of rudeness and condescension, tarnishing the otherwise agreeable experiences with property management. The delay in maintenance responses has further sowed seeds of dissatisfaction among some residents, highlighting a potential area for improvement in the responsiveness and customer service of the complex's support staff.\n\n## Ugly\n\nThe most serious grievances from user reviews stem from safety issues, with reports of theft, trash littering the premises, and harassment by individuals both inside and outside the complex. Unfortunately, these issues have created a sense of insecurity, with one resident feeling unsafe and troubled by the presence of homeless individuals around the living spaces. Another renter recounted being unfairly charged for previous tenants' bills and faced hostility when disputing the charges.\n\nMove-out experiences have also tainted the reputation of Sunset Pond Apts, with multiple tenants feeling unjustly burdened by hefty cleaning fees and charges upon departure. One resident detailed how despite leaving the apartment in a clean state, they were charged excessively, and later, the matter was erroneously escalated to collections. This type of mismanagement and poor communication severely impacts the trust residents have in the property management company, suggesting a need for systemic improvements.\n\nAs this article illustrates, the broad spectrum of resident reviews for Sunset Pond Apts indicates a dichotomy in the satisfaction levels of its tenants. Both outstanding and concerning attributes have been mentioned, which should aid prospective renters in making an informed decision.\n\nRemember, the above reflections are generated by ChatGPT and serve to present a condensed version of user-provided experiences, helping you navigate the multifaceted world of property rentals and management."
}