{
  "name": "Coldwell Banker Bain of Bellingham",
  "address": "",
  "company_type": "Real estate agent",
  "review_count": 19,
  "reviews": [
    {
      "author": "Pete Gegenhuber",
      "rating": 5.0,
      "review": "Our realtor went way, way above and beyond his responsibilities to provide us with excellent first class service! He took care of all our needs and made it a real pleasure, even when things went sideways, and we were worried about the sale. ",
      "ownerResponse": []
    },
    {
      "author": "corey smith",
      "rating": 2.0,
      "review": "We worked with Ann Cantrell and Derek Buse to sell our home in Bellingham.  While they are both kind and friendly people, we were very disappointed with the sale overall.  In the initial listing, they made some errors, including the amount ",
      "ownerResponse": [
        {
          "text": "Hello Corey,\nIt sounds like you had an unfortunate experience; however, your experience wasnt with any of our agents and specifically not with Ann and Derek. We believe you  More"
        }
      ]
    },
    {
      "author": "Pamela Banin",
      "rating": 5.0,
      "review": "Bryan Smith is the best possible real estate agent ever!! I would never have a home in Bellingham without Bryan's expertise and endless patience,during a confusing and challenging sequence of events.We still keep in touch if a question ",
      "ownerResponse": []
    },
    {
      "author": "Tim B.",
      "rating": 5.0,
      "review": "I can't imagine a better realtor than Coldwell Banker's Jeff Braimes. He has that great combination of professionalism and sincere friendliness. His ethics through a myriad of selling and buying situations were impeccable. He dealt ",
      "ownerResponse": []
    },
    {
      "author": "Eric McRory",
      "rating": 5.0,
      "review": "Charly Meyers did a fantastic job handling a real estate transaction between me and a personal friend.  My primary concern was that my personal relationship with the seller would be preserved and the utmost of respect would be provided for ",
      "ownerResponse": []
    },
    {
      "author": "Herman Hamm",
      "rating": 5.0,
      "review": "My agent, Ms. Stephanie McSorley, is the best advocate I have ever had as my representative,  She has found property for me more than once, and - for a friend of mine- at least twice.  I have owned 12 parcels of land over the years, and I ",
      "ownerResponse": []
    },
    {
      "author": "Steve Balas",
      "rating": 5.0,
      "review": "With all due respect to Coldwell Banker Bain, it is the agent that makes the difference. Large real estate companies have many, many agents and not all of them will be good. But with respect to Krista Kenner, she is one of the reasons that ",
      "ownerResponse": []
    },
    {
      "author": "Mark Lawrence Dobbie",
      "rating": 5.0,
      "review": "It was an education and a joy to learn about the process of selling a house and to be helped through it. I can't imagine a happier experience (and the circumstances were by no means easy). Mr. Hanley's readiness to help and, at the same time, his discretion, were exemplary. Nothing can beat the human touch we experienced. Thank you.",
      "ownerResponse": []
    },
    {
      "author": "Denis McGuire",
      "rating": 5.0,
      "review": "Carrie Vike Hilleary's professionalism, care and attention, when we recently purchased a home in Bellingham, was outstanding. My family and I would certainly recommend Carrie to anyone looking for an agent to sell or purchase property.\nThank you Carrie\nDenis McGuire",
      "ownerResponse": []
    },
    {
      "author": "Eighteen Echo",
      "rating": 5.0,
      "review": "Have worked with Ed Hanley of and on for the last 15 years. Mr. Hanley is a very competent, friendly, and hard working realtor. So when we decide to downsize our home in retirement we will definitely hire him again.",
      "ownerResponse": []
    },
    {
      "author": "Sebrina Holmstrom",
      "rating": 5.0,
      "review": "Ken Harrison is the Best!He is considerate, kind ,Funny and would be my first choice!\nIn January my Sister lost her husband to heart disease. Two years prior she was ",
      "ownerResponse": []
    },
    {
      "author": "Allan Chaloupka",
      "rating": 5.0,
      "review": "We liked that Ken Harrison kept with us for nearly four years until we found the house that was right for us. No matter how many times he took us to see properties, he was cheerful and always trying to help us find \"the one.\"",
      "ownerResponse": []
    },
    {
      "author": "Rick Wilson",
      "rating": 5.0,
      "review": "Greg Grant is a no-nonsense, get things done guy. His honesty and integrity are beyond reproach. I have had the opportunity to participate in several real estate transactions with him. I marvel at his expertise.",
      "ownerResponse": []
    },
    {
      "author": "Kayla Dalle",
      "rating": 5.0,
      "review": "Trish at CBB is amazing! In a crazy market like this you need an agent like Trish to get your dream house! We will always work with her in the future.",
      "ownerResponse": []
    },
    {
      "author": "Peter Venable",
      "rating": 5.0,
      "review": "Lori Jo Smith is such a great person to work with and she gets things done quickly when it matters.",
      "ownerResponse": []
    },
    {
      "author": "Linda Leum",
      "rating": 5.0,
      "review": "ken harrison was excellent in every way!",
      "ownerResponse": []
    },
    {
      "author": "Kenny Bahar",
      "rating": 5.0,
      "review": "Best brokerage in town!!!",
      "ownerResponse": []
    },
    {
      "author": "Julie Morris",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Margaret McMinn",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 17,
  "avg_rating": 4.8,
  "adjusted_avg_rating": 4.8
}