{
  "name": "Julian & Company, Real Estate Team with the Muljat Group",
  "address": "",
  "company_type": "Real estate agent",
  "review_count": 107,
  "reviews": [
    {
      "author": "Mercedes Converse",
      "rating": 5.0,
      "review": "Julian was very helpful throughout the entire process. It was an emotional time selling and preparing my fathers house after he passed and he helped with every part of the process to get the house ready to sell. He was even able to be ",
      "ownerResponse": [
        {
          "text": "It was such a honor to assist you and your siblings with the sale of your fathers beautiful South Hill home. Having lost my father as well this year, it made this transaction extra special and heartfelt. Thank you for trusting in my advice  More"
        }
      ]
    },
    {
      "author": "Dave Donohoe",
      "rating": 5.0,
      "review": "We highly recommend Julian and his team based on our experience with Julian selling our property in Bellingham. We live outside of Bellingham and as such it was very important for us to have a realtor that we could trust. Julian knows the ",
      "ownerResponse": [
        {
          "text": "Dave,\n\nThank you so much for the glowing review! I deeply appreciate your trust in  More"
        }
      ]
    },
    {
      "author": "Mark Wade",
      "rating": 5.0,
      "review": "Julian is an exceptional real estate agent who helped us find a great home in a neighborhood we thought might be out of our reach. He made the entire process of buying a home run smoothly. We were impressed with his professionalism and his ",
      "ownerResponse": [
        {
          "text": "Mark,\n\nI had the best time working with you and Jody to find the perfect South Hill  More"
        }
      ]
    },
    {
      "author": "Ross Olason",
      "rating": 5.0,
      "review": "We had a great experience buying our home with Julian! He was very knowledgeable about the entire Bellingham area and its neighborhoods. He took all of our wish list into account and found us the perfect home in a neighborhood we hadnt ",
      "ownerResponse": [
        {
          "text": "Thanks for selecting me as your agent and helping you and your beautiful family land in Bellingham. Im sure that your children will thank you when theyre older for making this major move!  "
        }
      ]
    },
    {
      "author": "Heesun Park",
      "rating": 5.0,
      "review": "We moved from Atlanta looking for a change of environment in the  Bellingham area. As any out of state move would entail, we had a good share of anxiety whether we would be able find a home that we would enjoy in a completely new ",
      "ownerResponse": [
        {
          "text": "Heesun!\n\nIt was a great honor getting to support you two in finding the perfect place!  More"
        }
      ]
    },
    {
      "author": "Scott Bigler",
      "rating": 5.0,
      "review": "Julian Friedman has been an absolutely outstanding agent to work with for finding a home; as well as being a welcoming presence to the Bellingham area. ",
      "ownerResponse": [
        {
          "text": "Scott, \n\nThe only downside to finding and closing in the perfect home so quickly was that  More"
        }
      ]
    },
    {
      "author": "Dakota C",
      "rating": 5.0,
      "review": "Julian and his team were a pleasure to have sell our home. Julian is hands on and goes above and beyond to ensure the his clients needs are met. They will make you feel as if you are the only home on the market and top priority. I would ",
      "ownerResponse": [
        {
          "text": "What a great experience! You and Nate were a dream to work with in every regard. Your responsiveness and level of commitment to ensuring that the home was brought to market in the best way possible is so appreciated!! Watching your family  More"
        }
      ]
    },
    {
      "author": "Jewel Nelson",
      "rating": 5.0,
      "review": "Before deciding on an agent, I interviewed between 20-30 candidates . After thorough consideration, I chose to list with Julian and his team. In my opinion, Julian is one of the top agents in Bellingham and beyond! I cant recommend Julian Friedman and his team at Julian and Company enough! ",
      "ownerResponse": [
        {
          "text": "Joy,\n\nThanks for trusting in me to help with the sale of your home! You put so much  More"
        }
      ]
    },
    {
      "author": "David E",
      "rating": 5.0,
      "review": "Julian Friedman is a go-getter, just the kind of agent we needed in Bellinghams tight market with a limited inventory of mid-priced condos. Because we had a limited time-frame, we wanted an agent who could aggressively help us with our ",
      "ownerResponse": [
        {
          "text": "David, \n\nGetting to meet you two and identify an off market opportunity that worked  More"
        }
      ]
    },
    {
      "author": "Leslie Spurr",
      "rating": 5.0,
      "review": "Working with Julian was easy and fun. We met with him in October just to become familiar with the different Bellingham neighborhoods. Julian drove us all around and was able to understand our tastes and could steer us in the right direction ",
      "ownerResponse": [
        {
          "text": "Leslie,\n\nWorking with you two was pure joy! I really enjoyed the time that we spent  More"
        }
      ]
    },
    {
      "author": "Cyrus Haselman",
      "rating": 5.0,
      "review": "Julian and his team were in our corner for over a year and advocated for us in so many ways, connected us with people we needed in the community and walked us through the home buying process in a really clear, logical and reasonable way. ",
      "ownerResponse": [
        {
          "text": "You two were so much fun! The only bummer about finding you the right house, is that I dont get to see you as often. Thanks for having me as your agent and Im excited to maintain the friendship that we built in the process. So much love to you both!!!"
        }
      ]
    },
    {
      "author": "tcmauer",
      "rating": 5.0,
      "review": "Jerry helped me close on a home in less than two months, which is remarkable in the Bellingham housing market.  He was quick to respond to all my messages and requests to tour homes, worked around my schedule so viewings could be done ",
      "ownerResponse": [
        {
          "text": "Thanks for the kind words Tom! But truly the credit must go to you. You stayed positive during the struggles of losing bidding wars and kept true to your good nature and patience. I'm a firm believe that attitude dictates success in many  More"
        }
      ]
    },
    {
      "author": "Joe Micech",
      "rating": 5.0,
      "review": "Julian & Company were awesome and very  professional. Julian went to the property and did a video visit walk through for us because we could not be there. Above and beyond made the process of buying property easy and pain free. We are so ",
      "ownerResponse": [
        {
          "text": "Joe,\nServing you and Danna was so much fun! The stars aligned! Searching for the right property and closing on it within 3 weeks of our first conversation! I am always here for you and look forward to celebrating on your big win soon!\n"
        }
      ]
    },
    {
      "author": "Leif Jones",
      "rating": 5.0,
      "review": "Julian worked diligently to ensure the smoothest real estate transactions as a buyer and seller on 2 single family homes and 1 commercial property, I would highly recommend his services. I've interfaced with countless agents and he is by far the best real estate agent in bellingham!",
      "ownerResponse": [
        {
          "text": "Leif,\n\nIt's been a pleasure helping you over the years! Fining your first investment  More"
        }
      ]
    },
    {
      "author": "Josh Geller",
      "rating": 5.0,
      "review": "Just bought our first home with Julian's help!\n\nJulian displayed genuine empathy and understanding from the start. He actively ",
      "ownerResponse": [
        {
          "text": "Thanks Josh! It was so much fun helping your whole company find homes in the area! Even better, I got some awesome new friends! I'm excited to share some great memories with you all this summer!"
        }
      ]
    },
    {
      "author": "rice ontheroad",
      "rating": 5.0,
      "review": "Julian was great at listening to what we were looking for, excellent market knowledge, fantastic responsiveness, great strategy advice, and amazing support through our entire home purchase. We would definitely recommend Julian to anyone looking for a home in the amazing Bellingham area.",
      "ownerResponse": [
        {
          "text": "Every step of the way you two were an absolute pleasure to work with! It was a true team effort! Thanks for taking my advice and working so diligently to get the job done! Im beyond grateful  Looking forward to celebrating with you at your new home! "
        }
      ]
    },
    {
      "author": "Brent Erickson",
      "rating": 5.0,
      "review": "Julian was a great partner in helping us purchase our property. We approached him with a property in mind and he helped us seal the deal. He was very responsive throughout the entire buying process and provided valuable insights on both the ",
      "ownerResponse": [
        {
          "text": "Brent, \nIt was such a great experience working with you and Elizabeth! I really appreciate your thoughtfulness and calm resolve throughout the entire process. Thanks  More"
        }
      ]
    },
    {
      "author": "Katie Armbruster",
      "rating": 5.0,
      "review": "My husband and I were first time home buyers in the Bellingham area.  We were lucky enough to connect with Julian and his team through Zillow.  Julian was very prompt in identifying the properties that we were/might be interested in and ",
      "ownerResponse": [
        {
          "text": "KatieThanks for for such a thoughtful review and detailed description of your experience working with us! It was a real pleasure serving you two and helping you land in your first home!!I look forward to staying in touch and hope to see you at some of our parties and events!"
        }
      ]
    },
    {
      "author": "Libera Geller",
      "rating": 5.0,
      "review": "Julian and his team went above and beyond for my husband and I as first-time home buyers. He was patient and understanding as we searched for the perfect home for over five years! Julian was incredibly knowledgeable about the local ",
      "ownerResponse": [
        {
          "text": "Libera,\n\nI had a blast taking you three around and getting to know you. I'm eager to  More"
        }
      ]
    },
    {
      "author": "Danna Zelenka",
      "rating": 5.0,
      "review": "Julian assisted us every step of the way! He was very professional, cordial and kind. Hes knowledgeable, and was able to give us clear options, as we moved through the process of purchasing our home. He responded right away to our texts ",
      "ownerResponse": [
        {
          "text": "Danna, this was truly a fairytale transaction. Im still buzzing from all the good energy and excitement that was sustained through the entire process. You were the right couple for this house and it is obvious! When the seller accepted  More"
        }
      ]
    },
    {
      "author": "Amber Wagner",
      "rating": 5.0,
      "review": "Julian was extremely patient and helpful in finding our new dream home. His response time was exceptional and I was always able to reach him. When we were looking at homes, Julian was clear and direct on his assessment of each house. This helped my husband and I feel like the choice we made was sound.",
      "ownerResponse": [
        {
          "text": "Amber, it was a blast supporting you and your family with this important move! Its always a nice surprise finding the perfect home on the first day of searching. Since we didnt get to spend much time looking at houses together, I hope you can come to our events and hang!! All the best! -Julian"
        }
      ]
    },
    {
      "author": "Jillian Hendershot",
      "rating": 5.0,
      "review": "Julian was our realtor before we were even serious about buying a new home. Even when we were just looking casually he made himself available to show us homes on our schedule. He grew up in the Bellingham area so his knowledge of this area ",
      "ownerResponse": [
        {
          "text": "Jill,\n\nI am so grateful to have had the pleasure of working with you and your beautiful  More"
        }
      ]
    },
    {
      "author": "Heidi Giles",
      "rating": 5.0,
      "review": "Julian & Company were amazing to work with. We didn't necessarily represent an \"easy case.\" We lived across the country (Washington, DC), knew that we wanted to move to Washington State (in the North Sound area....we thought), and were ",
      "ownerResponse": [
        {
          "text": "It was an honor to represent you and build such a strong connection with you and your lovely family! It brings me great joy to be a part of such a big moment Im your life! I know moving across the country was a huge decision. Every moment  More"
        }
      ]
    },
    {
      "author": "Lacey Postlewait",
      "rating": 5.0,
      "review": "Julian helped my husband and I purchase our first home. We found our dream home before it was on the market and within 48 hours of our initial conversation with Julian, we were able to see the home and get under contract. He was extremely ",
      "ownerResponse": [
        {
          "text": "Lacey, it was an absolute pleasure to represent you and your growing family on this major purchase! The fact that you work for one of the most incredible lenders in our area and decided to choose me to be your agent, means the world to me! I wish you all the world and will always be there for you!"
        }
      ]
    },
    {
      "author": "Ken Johnsen",
      "rating": 5.0,
      "review": "We were totally happy with Julian and his firm, we moved from selling decision to closing in a month.  His communication and follow through were fantastic throughout the process, we highly recommend him!",
      "ownerResponse": [
        {
          "text": "Thanks for trusting in me to deliver the best possible results for you two! $225k over asking price with no contingencies was exactly what I had hoped for. It was an honor to work for you and I am so pleased that I had your support to get  More"
        }
      ]
    },
    {
      "author": "Matt Geller",
      "rating": 5.0,
      "review": "Julian and his team were excellent real estate agents for my wife and I as first-time home buyers. They were patient, knowledgeable and always responsive to our questions and concerns. They exceeded our expectations and helped us find our ",
      "ownerResponse": [
        {
          "text": "Matt,\n\nWhat a fun and rewarding experience it was to work with you and your lovely  More"
        }
      ]
    },
    {
      "author": "Gary Peak",
      "rating": 5.0,
      "review": "Julian helped my wife and me with both sides of successful sell/buy transactions.  We both appreciated Julians extremely fast response rate, his professionalism, thorough knowledge of arcane nuances of the numerous steps involved in ",
      "ownerResponse": [
        {
          "text": "Gary, helping on your contingent purchase and the sale of your home was quite the marathon! Both you and Deb were so incredibly helpful and an absolute pleasure to serve! I'm thrilled to have assisted with this transition. I will always be here for you! Enjoy your gorgeous new home!"
        }
      ]
    },
    {
      "author": "Tannia Hecht ComuniCabo Cleft Palate Speech Therapy",
      "rating": 5.0,
      "review": "We hired Julian Freedman to help us list a condo in Bellingham this past month. He is  charming, fun,  as well as very professional. ",
      "ownerResponse": [
        {
          "text": "Where do I start?\n\nRepresenting you and your family on this transaction meant the world to me. As  More"
        }
      ]
    },
    {
      "author": "Blake Hudson",
      "rating": 5.0,
      "review": "What an absolute pleasure to work with them on our high end sale in Edgemoore. It was a challenging endeavor that he completely took the stress out of, very thankful. Julian is the best real estate agent in a Bellingham! And every family member I have referred has had a great experience and glowing reviews!",
      "ownerResponse": [
        {
          "text": "Blake, \n\nit was an honor to help you and your lovely family sell and then buy! I'm glad  More"
        }
      ]
    },
    {
      "author": "Cassandra Bemish",
      "rating": 5.0,
      "review": "Julian was a huge help in buying our home. He gave my husband and I great pointers in what we should offer and helped us with our love letter. We also werent pre-approved for a loan before finding the house we wanted to buy, but Julian ",
      "ownerResponse": [
        {
          "text": "Cassandra, it was such a joy to work with you and your beautiful family!I am beyond pleased that we were able to get your first offer accepted on the first home that you fell in love with! We love being able to provide these types of  More"
        }
      ]
    },
    {
      "author": "Jordan Goff",
      "rating": 5.0,
      "review": "Julian's team was absolutely phenomenal to work with! Julian is such a wealth of knowledge, and coached us perfectly to lock down the first home we put an offer on. We also worked with Summer, who is an amazing individual and really took ",
      "ownerResponse": [
        {
          "text": "Im so pumped that we were able to assist you in finding the perfect place! I know the process can be stressful and am beyond pleased that we were able to help make it smooth and enjoyable. Wishing you the world!!  "
        }
      ]
    },
    {
      "author": "Teo Crider",
      "rating": 5.0,
      "review": "I grew up in the Pacific Northwest, and have lived in Washington State for over 30 years. I arrived in Bellingham in the summer of 2010, thinking that it would be a short stop along a series of travels and new destinations, as I was an ",
      "ownerResponse": [
        {
          "text": "Teo,\n\nIm blown away by this glowing review! Your creative efforts in Bellingham have  More"
        }
      ]
    },
    {
      "author": "john m marshall",
      "rating": 5.0,
      "review": "Julian's professionalism and knowledge of Real Estate has exceeded all my expectations.\nI reached out to Julian not about purchasing property but with a question about ",
      "ownerResponse": [
        {
          "text": "John, it was such a pleasure spending some time, sharing my experience with you. This industry is all about collaboration and I am happy to continue to be a resource for you as you get established."
        }
      ]
    },
    {
      "author": "Alex Crooks",
      "rating": 5.0,
      "review": "We are new to Bellingham and Julian helped us to find and negotiate the purchase of our new home. It is a hot market right now and therefore speed was paramount. Julians responses were always very fast, thorough and efficient. His ",
      "ownerResponse": [
        {
          "text": "Thank you Alexandria Crooks for allowing me to be a part of your home buying process. I wish you many years of happiness in your new home. Please don't ever hesitate to reach out if you have questions about your home or the community, need  More"
        }
      ]
    },
    {
      "author": "Amie Wise",
      "rating": 5.0,
      "review": "Julian and his team were AMAZING!!!  When I got to Seattle to start the process of dealing with my Grandfathers house it was a Saturday afternoon and I had not even spoken to a real estate agent.  My fianc made some phone calls and Julian ",
      "ownerResponse": [
        {
          "text": "Amie, it was such a privilege to represent you in selling your grandfathers home. I know that being out of state made things a bit more complicated and am so thrilled that I could be of value throughout the process. Wishing you good health and happiness in the years to come!"
        }
      ]
    },
    {
      "author": "Matt Goodwin",
      "rating": 5.0,
      "review": "Julian is exactly who you need in a crazy market like this one. He put together a competitive offer while taking into account what we were comfortable moving forward with. He walked us through each step, and stayed in constant contact every ",
      "ownerResponse": [
        {
          "text": "Matt! We did it! First try nonetheless!! Your both were such a blessing to work with and Im so excited that you have escaped Seattle and found your dream county property! Come by the office for a beer something soon!"
        }
      ]
    },
    {
      "author": "Joy Makdisi",
      "rating": 5.0,
      "review": "Working with Julian was a great experience--I cannot recommend him highly enough. He is personable, knowledgeable, and as native of Bellingham he is a fountain of knowledge about different neighborhoods, parks, local businesses, and ",
      "ownerResponse": [
        {
          "text": "Joy, it was such a great experience working with you two! I am trilled to be able to help land you one of the most competitive multiple offer situations ever! Thanks for your positive attitude and efforts as we went through the process of identifying the perfect home. I'm looking forward to visiting once you get settled!"
        }
      ]
    },
    {
      "author": "doug hooks",
      "rating": 5.0,
      "review": "Julian was referred to me through a good friend and he did not disappoint.  I had mixed feelings about selling my home and Julian and his team made the process so much simpler than I could have imagined.  The entire process, from 1st ",
      "ownerResponse": [
        {
          "text": "Doug, what an honor it was to assist in listing your home! You were amazing to work for and I am so pleased that we were able to sell your home for 25% above list price! Wishing you good health and happiness in the years to come and looking forward to staying in touch!"
        }
      ]
    },
    {
      "author": "Luke Lenentine",
      "rating": 5.0,
      "review": "Julian wants me to be happy with finding my true dream home. He spends the time it takes to help me understand permitting and zoning restrictions and he asks all the right questions for stuff I should be thinking about that hadn't even ",
      "ownerResponse": [
        {
          "text": "Luke, I love chatting with you and helping navigate your rather unique and challenging questions. Thanks for working with me and please send my love to your lovely wife:)"
        }
      ]
    },
    {
      "author": "J Hansen",
      "rating": 5.0,
      "review": "We had a great experience with Julian as our realtor.  We were looking for a retirement/vacation home and spouses were on 2 different pages about what we wanted.  Julian was patient, helpful and knowledgeable in showing us a variety of ",
      "ownerResponse": [
        {
          "text": "Jan, working with you and your husband was an honor! I had such a blast and really enjoyed your homemade cookies :). Thanks again for giving me the privilege of being your Realtor! Enjoy your new home on Lake Whatcom! -Julian"
        }
      ]
    },
    {
      "author": "Jess Hartzog",
      "rating": 5.0,
      "review": "Best home-buying experience EVER! Jerry checks all the obvious boxes, of course: super friendly, responsive, and knowledgeable. The real treat here is how Jerry was able to help us problem-solve on the fly - he consistently went above and ",
      "ownerResponse": [
        {
          "text": "Hi Jess! What an amazing experience. From day one we knew we'd get along with our backgrounds and technical understanding of processes. It was a pleasure working with you and Josh through this whole process. It was long and we got tested a  More"
        }
      ]
    },
    {
      "author": "Hannah Shell",
      "rating": 5.0,
      "review": "Julian & Kailee went above and beyond with the sale of our property. Immediate & necessary care for an ailing family member meant this process was weighing heavily on my family, and the stress of this sale was entirely mitigated by the ",
      "ownerResponse": [
        {
          "text": "The pleasure was all mine! I'm so glad that we could get such a great price on your home, especially considering all of the challenges that came up. Thanks for all of your efforts and trust in me to bring you the best deal possible. We did it!! "
        }
      ]
    },
    {
      "author": "Chris Horne",
      "rating": 5.0,
      "review": "We found Jerry on a whim after doing some\nGoogle searches for the best realtors in the Bellingham area. Our experience with Jerry was nothing short of fantastic, right from the get go he was ",
      "ownerResponse": [
        {
          "text": "Chris it was my pleasure to work with you and your partner to find the family a place to call home up here in the PNW. Us both being from Texas gave us some common ground to start on and really helped us understand one another from the  More"
        }
      ]
    },
    {
      "author": "Ashley Meadows",
      "rating": 5.0,
      "review": "Julian made a seemingly impossible process absolutely possible. When faced with 2-3 months to find a new home after a rental contract ended, I knew we needed someone we could trust with our future and such a monumental decision. Julian was ",
      "ownerResponse": [
        {
          "text": "Ashley,  Thank you for your kind words and strong vote of confidence. It was a fun whirlwind to navigate together and I am so glad we got to your end goal. I look forward to connecting again and hearing how things are going. Please reach out any time, and thank you for trusting me with your home buying process."
        }
      ]
    },
    {
      "author": "Carl Weiseth",
      "rating": 5.0,
      "review": "Julian made finding and purchasing a home in the Bellingham-area an been an absolute pleasure! ",
      "ownerResponse": [
        {
          "text": "Carl Weiseth, I am so glad you had a great experience and hope you are settling into your new neighborhood. It was an absolute pleasure working with you and thank you for your glowing recommendation. Please don't ever hesitate to reach out  More"
        }
      ]
    },
    {
      "author": "Katie Beden",
      "rating": 5.0,
      "review": "Julians attention to detail and daily drive were invaluable assets to my first home buying experience. Within 10 days of deciding to buy after 16 years of renting, he showed me the full range of my options and after seeing many homes that ",
      "ownerResponse": [
        {
          "text": "Katie, the entire process with you was incredible! The grace and resolve you showed when loosing on your first offer was inspiring! And guess what, you got a lake house instead! They say good things come to those that wait. It was definitely worth the wait!  "
        }
      ]
    },
    {
      "author": "Andy Meadows",
      "rating": 5.0,
      "review": "This was our first home buying experience and we couldn't have done it without Julian.\nWe found out less than three months ago that we would have to move with no plans ",
      "ownerResponse": [
        {
          "text": "Andy,  I am so glad I was able to help you navigate the home buying process. It can be crazy without the right support, so I am glad I was there to take some of that off your plate. Thank you for your kind words and support. It means a lot  More"
        }
      ]
    },
    {
      "author": "Katrina Hilpert",
      "rating": 5.0,
      "review": "We decided to move more seriously into homebuying last year and started to look for a realtor. We wanted a realtor who brought a team to the table, so we looked at realtors that advertised as one. Our thought was that it takes a village to ",
      "ownerResponse": [
        {
          "text": "Katrina, I knew from our first meeting that you and AJ would be a pleasure to work with! It is always such an honor when a client finds us organically, while searching for the best real estate agent to fit their needs. Thanks for your trust  More"
        }
      ]
    },
    {
      "author": "Emily Hazlip",
      "rating": 5.0,
      "review": "We truly could not be any happier with everything Peyton did for us. She went above and beyond to make sure we were getting exactly what we wanted. Being new to this area, she and Julian took the time to help us get acquainted with each ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words. We are so honored you chose us to help you find your perfect place in Bellingham. Please know that we are always here to help with finding connections for contractors, restaurants, outdoor fun, and more. We  More"
        }
      ]
    },
    {
      "author": "Paul T",
      "rating": 5.0,
      "review": "I have had the pleasure of getting to know Julian over the last year. He immediately impressed me with his ultra quick responsiveness and sincere desire to help. Julian always goes the extra mile to ensure he is providing elite-level of ",
      "ownerResponse": [
        {
          "text": "Paul, serving your family has been an honor! I can't thank you enough for your trust as we find you your dream property!"
        }
      ]
    },
    {
      "author": "Becca Seim",
      "rating": 5.0,
      "review": "Julian walked us through the entire process of selling our home. Selling can be stressful in itself, but selling when you aren't 100% prepared for it due to life changes just adds to that. Julian helped us prioritize what was most important ",
      "ownerResponse": [
        {
          "text": "Becca, working with you and Toby was incredible! I am grateful for your trust through this transaction and Im so pleased that we were able to get a record breaking price on the sale of your lovely home!"
        }
      ]
    },
    {
      "author": "Steven Davis",
      "rating": 5.0,
      "review": "We moved to the Bellingham area in September. I had spoken with Julian throughout the summer while our home was on the market. Julian sent us information so that we could familiarize ourselves with the area. When we received an offer on our ",
      "ownerResponse": [
        {
          "text": "Steven, I couldn't have dreamed up better clients than you and Nancy! It was an honor to help with finding you the perfect place and helping in your transition to Whatcom County. I am always available and look forward to celebrating with you soon!"
        }
      ]
    },
    {
      "author": "Iris Fu",
      "rating": 5.0,
      "review": "Julian is the first agent we contacted when looking for a home in Bellingham and we purchased the first home he showed us (he listened to our needs) in less than two weeks. It was purchased under the listing price. He's busy but very ",
      "ownerResponse": [
        {
          "text": "Iris, you and Aaron are such a warm and amazing couple. Im trilled to help welcome you to Bellingham! Im so pleased that we were able to find you the perfect home on the first day of searching! The first house we looked at, nonetheless. Im always here for you as your agent and friend! -Julian"
        }
      ]
    },
    {
      "author": "Dr. Marci Hardy, PhD",
      "rating": 5.0,
      "review": "Julian has a drive and dedication to his clients that is unparalleled. We appreciated all his support and energy as we worked together to sell our home. He got the job done and offered so much energy and support along the way to make it ",
      "ownerResponse": [
        {
          "text": "Marci, I am so glad we were able to get your home sold and find a great property for you to buy as well. I appreciate you trusting me with both sides of your transaction and I have enjoyed getting to know your whole crew. I wish you all the  More"
        }
      ]
    },
    {
      "author": "Anthony Ponce De Leon",
      "rating": 5.0,
      "review": "I cant stress enough how important it is to work with an agent that comes with a true insiders perspective on the city. I have worked with agents in the past, but Julian has been the best real estate agent I could imagine. Talking to ",
      "ownerResponse": [
        {
          "text": "Anthony, I love helping artists like you reach their real estate goals! Its been such a pleasure getting to know you and I cant say enough about how incredible your work is! Wishing you good health and happiness in the years to come!"
        }
      ]
    },
    {
      "author": "Dylan Walsh",
      "rating": 5.0,
      "review": "Julian and his team are amazing!! They were so helpful through the whole process of selling my property. Really easy team to work with; knowledgeable and quick to respond to any questions. Great experience!",
      "ownerResponse": [
        {
          "text": "Dylan, the pleasure was all mine! I'm thrilled that we were able to get such a great price on your property and wish you and yours good health and happiness in the years to come!\n-Julian"
        }
      ]
    },
    {
      "author": "Lauren Saunders-Klapp",
      "rating": 5.0,
      "review": "Julian is a realtor that does it all. Not only was he there every step of the way, answer every single question for us, but he went to bat for us and got us well over asking. He advised us on where to spend our money in updates and it ",
      "ownerResponse": [
        {
          "text": "I am so thankful Lauren Saunders-Klapp for your entrusting me with the sale of your home. I am glad you felt supported along the way, as going above and beyond is a goal I have for with every transaction. Please reach out if you ever need  More"
        }
      ]
    },
    {
      "author": "Ryan Davis",
      "rating": 5.0,
      "review": "Julian was excellent start to finish.  He was dedicated to finding my wife and I a property that would suite both our needs.  On top of that he was extremely communicative, positive, and helpful during the entire process. In the end we found a fantastic house that was perfect for the whole family.  Thanks Julian!",
      "ownerResponse": [
        {
          "text": "Im so pleased that I was able to line you up with this incredible home! This was such a fantastic experience in so many ways! Im grateful to call you my friend and cant thank you enough for trusting in me to be your Realtor!!"
        }
      ]
    },
    {
      "author": "Jabez Richard",
      "rating": 5.0,
      "review": "We were in a terrible situation with an uncooperative mortgage company, when Julian and his team patiently helped us navigate these difficult waters and brought us out on the other side with a sold house and enough money to make a nice down ",
      "ownerResponse": [
        {
          "text": "Jabez, its been a great honor to help you and your family through this challenging time. Thanks for giving me the opportunity to serve!"
        }
      ]
    },
    {
      "author": "Katy Moran",
      "rating": 5.0,
      "review": "Love the passionate team over at Julian and Co! This group is made up of individuals who have your best interest in mind and will work hard to provide you with the best experience and result possible. I feel Im in capable and trustworthy hands. Highly recommend!",
      "ownerResponse": [
        {
          "text": "Thanks Katy! We absolutely love your photography and really appreciate the work you have done in our community! Wishing you all the best!"
        }
      ]
    },
    {
      "author": "Royce Cardwell",
      "rating": 5.0,
      "review": "Julian was a huge help in both buying my home and selling my old one. He knows what it takes to get you in your dream home. He is an aggressive advocate for what his clients want and worked his butt off to make sales happen. He even staged ",
      "ownerResponse": [
        {
          "text": "Royce, Im so pumped that we were able to make all of this happen so quickly! You guys were amazing to work with and Im looking forward to coming by with dinner and meeting the baby soon!  Thanks again for working with us! -Julian"
        }
      ]
    },
    {
      "author": "Jeff Kelley",
      "rating": 5.0,
      "review": "Julian was the best to work with. Even with all the COVID restrictions we had to go through during the early days of this Pandemic he was a brilliant light on the shore guiding us through the rigors of searching for and finally purchasing a ",
      "ownerResponse": [
        {
          "text": "I'm blushing! You both were such a pleasure to serve and I'm thrilled that we were able to land you the first home you put an offer on. Wishing you and La Donna good health and happiness!!!"
        }
      ]
    },
    {
      "author": "Eric Phaneuf",
      "rating": 5.0,
      "review": "I can't say enough good things about Julian and Peyton. Peyton is an awesome buyers agent, and really knows the market in Bellingham and what it takes to actually land the house you want. Both were super supportive throughout the entire ",
      "ownerResponse": [
        {
          "text": "Eric & Kelly-Jo, thank you so much for the kind words and for being such a breeze to work with. It was such an honor to represent you two on your purchase, Bellingham is lucky to have you two added to our community! Wishing you and your loved ones health and happiness - Peyton"
        }
      ]
    },
    {
      "author": "Ryan Porterhawk",
      "rating": 5.0,
      "review": "We worked with Peyton, with a couple conversations with Julian himself as well. Peyton listened to our wants and needs for our family, tried to understand our priorities, and was knowledgeable every step of the way. Any time she didn't have ",
      "ownerResponse": [
        {
          "text": "It's so much fun helping a close friend with the sale of their home and the purchase of their new home! It's such a joy to be a part of you and Tina's life and to have been a part of such a monumental moment in it. Thank you for your kind words and support over the years!"
        }
      ]
    },
    {
      "author": "Nikki Anderson",
      "rating": 5.0,
      "review": "This market is outrageous and daunting for first-time homebuyers.  Summer & Julian are the kind of people you want in markets like this:  local, knowledgeable, professional, honest & up-front, super responsive to last-minute requests, and ",
      "ownerResponse": [
        {
          "text": "Thank you Nikki for trusting me with helping you find your dream home! It was fun for me too to get to see you and your partner refine your search as we went through the process, and I am so happy about the home you got. Such a gorgeous  More"
        }
      ]
    },
    {
      "author": "Michael Warren",
      "rating": 5.0,
      "review": "Jerry was very supportive during extended negotiations for our property.  He also followed up when the seller was slow to complete promised work.  In addition, Jerry is a very positive guy, and a pleasure to work with.",
      "ownerResponse": [
        {
          "text": "Thank you for the kind words Michael! It was such a pleasire getting to know you and your wife. I absolutely loved our adventures around Skagit and I am so grateful I got to to have y'all as clients and now call you friends. Thank you for being wonderful humans! \n- Jerry "
        }
      ]
    },
    {
      "author": "Mark Christophersen",
      "rating": 5.0,
      "review": "Peyton is an incredible realtor; enthusiastic, friendly, and positive. We worked with Peyton for over eight months in a competitive market and she always went above and beyond helping us. She was flexible and available with scheduling tours ",
      "ownerResponse": [
        {
          "text": "What an honor it was working with you and Christine on the purchase of your first home! And the home you had your first child in!! Thank you so much for the kind words and your trust in me throughout the process. Wishing you and your family good health and happiness"
        }
      ]
    },
    {
      "author": "Jenny Schiffner",
      "rating": 5.0,
      "review": "Jerry got me exactly what I wanted in this super-competitive market!  He was quickly available to show me the many houses that I wanted to see and  took time to help me decide if I wanted to make an offer. ",
      "ownerResponse": [
        {
          "text": "Thanks Jenny! We might have toured 1/2 of Whatcom county but every tour brought us closer to the perfect home for you and your family. Also your easy-going personality and willingness to flex and adjust our strategy was what allowed us to  More"
        }
      ]
    },
    {
      "author": "Gowalk2865",
      "rating": 5.0,
      "review": "Julian and his team are incredibly professional and knowledgeable. Julian is well prepared and capable to help from beginning to end. He has a true understanding of the complex issues that can present during a purchase to help navigate the process. You will be in great hands!",
      "ownerResponse": [
        {
          "text": "Thanks for your kind words! please reach out if you ever need ANYTHING!!! I am here to serve."
        }
      ]
    },
    {
      "author": "Luke Holland",
      "rating": 5.0,
      "review": "Julian is a fantastic realtor. As a home inspector I have worked with him on a handful of inspections and I am always impressed by his professionalism and level of care for his clients. Hes never afraid of information I give because he is ",
      "ownerResponse": [
        {
          "text": "Luke, it has always been a breeze working with you! My clients have always been pleased with your service and friendly attitude!"
        }
      ]
    },
    {
      "author": "Michael Croxton",
      "rating": 5.0,
      "review": "Every now and then, someone steps into our lives without warning and enables great change!  Summer Huntington has proven to be that most recent person for my wife and me.  She came to us by referral, as we were initially trying to find a ",
      "ownerResponse": [
        {
          "text": "Thank you for sharing your story, and I am over the moon about how well it worked out for you and your wife. Wow, your house literally had so many of your boxes checked and is such a beautiful home! I feel grateful to have gotten to know  More"
        }
      ]
    },
    {
      "author": "Lee Huffman",
      "rating": 5.0,
      "review": "Julian was aware of my impending move from what was my current primary residence into a new property I had recently purchased. He reached out with clients that were potentially interested on a Monday morning. We exchanged notes & numbers, a ",
      "ownerResponse": [
        {
          "text": "You were incredible to work with and I really appreciate all of your efforts in this transaction! I'm looking forward to working with you again in the future."
        }
      ]
    },
    {
      "author": "Rebecca Li",
      "rating": 5.0,
      "review": "We're so grateful to Peyton and all the folks at Julian & Company for helping us find our home here in Bellingham! The group went above and beyond for us - talking us through the wild market and all the options we might explore. ",
      "ownerResponse": [
        {
          "text": "Rebecca! I'm so happy for you and Tyler on landing your beautiful home in Bellingham! You two were such a joy to work with, so grateful to have met you both. Cheers to your first year in your home!"
        }
      ]
    },
    {
      "author": "Kristin Henderson",
      "rating": 5.0,
      "review": "Im so thankful we lucked out with Julian as our realtor. If you are looking in Bellingham this is your guy! Not only did he get our offer accepted over other offers by working his realtor magic, he gave us a truly amazing home buying ",
      "ownerResponse": [
        {
          "text": "Kristin Henderson, it was a true pleasure to connect with you and assist you with your home buying journey. I am always happy to answer any questions you have about the community and offer up my favorite trails to explore and places to grab  More"
        }
      ]
    },
    {
      "author": "Amanda Kerzman",
      "rating": 5.0,
      "review": "My husband and I worked with Peyton to buy our first house, and had a wonderful experience. First, Peyton is kind, upbeat, and enjoyable to be around! She is extremely knowledgeable about real estate and the market, which we found so ",
      "ownerResponse": [
        {
          "text": "Thanks so much for the kind words! You two go getters were awesome to work with and a pleasure to represent! It brings me so mych joy to watch you two settle into your beautiful home. Thank you for your trust, referrals and time! Cheers to you and Tom."
        }
      ]
    },
    {
      "author": "Nathan B",
      "rating": 5.0,
      "review": "To start things off this was my very first home buying experience.\n\nTo start things off from the very first conversation (which was a chance ",
      "ownerResponse": [
        {
          "text": "Nathan, working with you was an absolute pleasure! The journey of a first time home buyer can be challenging and stressful. Your excitement and steadiness through the entire process was amazing! I'm thrilled that we were able to identify,  More"
        }
      ]
    },
    {
      "author": "Marianne Casasanta",
      "rating": 5.0,
      "review": "Jerry is an awesome person to work with.  He is one of those rare, down to earth people, that make it easy to connect to, yet professional, knowledgeable, and a great sense of humor to boot!!   My mom came out to visit me and fell in love ",
      "ownerResponse": [
        {
          "text": "Hey Marianne & Mom! What a fun experience to share with you two! From touring homes with driveways as steep as mountains to homes with yards WAY too big to take care of we really saw it all. Thank you for trusting me and having such a great attitude during the whole process! I appreciate you both so much."
        }
      ]
    },
    {
      "author": "David Goodman",
      "rating": 5.0,
      "review": "Summer and her team will make your real estate dreams come true! Buying our first home was a lengthy and somewhat emotional process, and she was there every step of the way to coach us through it. She was incredibly responsive and available ",
      "ownerResponse": [
        {
          "text": "Thank you so much for trusting our team with your dream home! It was an absolute pleasure working with you and getting to know your beautiful family in the process. Enjoy those waterfront sunsets!"
        }
      ]
    },
    {
      "author": "James Demarest",
      "rating": 5.0,
      "review": "Julian feels like part of my family already. He calls just to chat and to check in on us and never turns it into a sales call. Ive been communicating with him for over a year and he knows Im still not ready to buy yet still, he is there ",
      "ownerResponse": [
        {
          "text": "Thank you James Demarest. I am always here and happy to connect and be a resource for each of my clients. I appreciate your kind words and please reach out anytime. Wishing you well and looking forward to connecting again soon."
        }
      ]
    },
    {
      "author": "Kelli Burhans, LMT",
      "rating": 5.0,
      "review": "We worked with Peyton Voelker, and she is a fantastic agent.  She was genuinely supportive of our goals and decisions while at the same time telling us what we needed to hear, not just what we wanted to hear.  She is smart, knowledgeable ",
      "ownerResponse": [
        {
          "text": "Thank you for working with us on this move! We will always be here for you and are incredibly grateful for you!"
        }
      ]
    },
    {
      "author": "Kyle Sanderson",
      "rating": 5.0,
      "review": "Julian has always been a great connector. Makes sense he would create a team of excellent people! With his intimate knowledge of Bellingham and surrounding areas I endorse and highly recommend them for any of your real estate needs!",
      "ownerResponse": [
        {
          "text": "Thanks for the kind words! Working with you has always been a pleasure!"
        }
      ]
    },
    {
      "author": "Nancy Brown",
      "rating": 5.0,
      "review": "When we first starting looking for a home in Washington we came across a nice young lady Named Peyton Voelker. We could not believe how much she bended over backwards to help us find the right home. well after a couple of months of looking ",
      "ownerResponse": [
        {
          "text": "Nancy, I am so thrilled to have met you and Harry and to have been a part of such a monumental moment in your lives! I am so excited to have you both move up to bellingham next year. Wishing you and Harry health and happiness. I'll see you soon!"
        }
      ]
    },
    {
      "author": "Jane Hyatt",
      "rating": 5.0,
      "review": "We had the best experience buying our home with Jerry at the helm. He was fun, pleasant and helpful, and since we were buying from out of state, he often helped us by stopping by the home and doing a video walk thru.  Thanks so much Jerry!",
      "ownerResponse": [
        {
          "text": "Hey Jane! It was an adventure indeed! Thanks for always trusting me and allowing me to do the best I could for you and your husband! We went through the gauntlet and bested the process despite our needs and high expectations. We did it! Happy to help such cool people."
        }
      ]
    },
    {
      "author": "Jonny Kingman",
      "rating": 5.0,
      "review": "Julians extensive knowledge of the area, coupled with being very well-versed in the real estate and lending industry, made for a tremendously enriching experience. I look to Julian for guidance, insight and perspective on all things involving real estate and finance - highly recommend!",
      "ownerResponse": [
        {
          "text": "Jonny, as a fellow professional, it gives me great joy knowing that someone of your caliber is confident in referring and utilizing our services. I am always available and happy to help in any way :)"
        }
      ]
    },
    {
      "author": "Erin Olmstead",
      "rating": 5.0,
      "review": "Jerry Spragins was our realtor! He is great to work with and very personable. He was available to answer our questions anytime along the way and was always positive! It was nice working with such an approachable realtor.",
      "ownerResponse": [
        {
          "text": "Hey Erin, thanks for the kind words! First time home purchases can be daunting and frankly scary for new buyers...But you guys made it look easy! I was so happy we were able to find the perfect property even though it was quite a long  More"
        }
      ]
    },
    {
      "author": "Jon Heaton",
      "rating": 5.0,
      "review": "After over a year of looking, and getting outbid a few times, we finally the home for us.  We used Summer Huntington from the Julian Group and have nothing but nice things to say about her. Very patient and understanding. Thanks!",
      "ownerResponse": [
        {
          "text": "Thank you so much Jon, it was an absolute pleasure working with your family to find a home. Welcome officially to Bellingham!"
        }
      ]
    },
    {
      "author": "Valerie Davies",
      "rating": 5.0,
      "review": "Jerry was a pleasure to work with.  He understood exactly what features I was looking for in a local condo and found me the perfect property for my downsizing move.  Also he was very patient with my lack of tech skills!",
      "ownerResponse": [
        {
          "text": "Thank you Val!\n\nFinding the perfect condo was a challenge but we ended up finding you a  More"
        }
      ]
    },
    {
      "author": "Connor low",
      "rating": 5.0,
      "review": "Great experience with Julian, very prompt and professional throughout the whole experience!  We were selling a home living on the other side of the country and Julian made it very smooth!  Would definitely recommend to anyone!!",
      "ownerResponse": [
        {
          "text": "You both were dream clients! It was such a joy to help in listing your property. The communication and trust that we have is truly appreciated. Im always available and hope to see you when you make it back to the area!"
        }
      ]
    },
    {
      "author": "Orion Lekos",
      "rating": 5.0,
      "review": "Julian and his team were great to work with every step of the way.  He helped me negotiate a deal that I didnt think was possible.",
      "ownerResponse": [
        {
          "text": "Thanks for working with us! In this changing market, it's a pleasure to work out creative solutions to help make dreams come true! Thank you so much for choosing to work with us on your purchase. \n-Julian"
        }
      ]
    },
    {
      "author": "Julian Walls",
      "rating": 5.0,
      "review": "A very knowledgeable team that knows the whatcom area and the surrounding areas. If you need a agent to help you find a house to buy or sell. This is the team to choose all the agents are very nice and helpful in all areas. Their executive assistant is very cheerful and makes really good coffee when stopping by the office!",
      "ownerResponse": [
        {
          "text": "Thanks for the kind words! It has been a pleasure getting to know you and am incredibly grateful for your support!"
        }
      ]
    },
    {
      "author": "Asher Friedman",
      "rating": 5.0,
      "review": "Julian Friedman (my brother) is a natural born super communicator and community organizer which makes him a terrific choice for anyone looking for representation in selling property, investing in their dream home, building wealth through ",
      "ownerResponse": [
        {
          "text": "I love you brother! Thanks for your kind words. You are an incredible person and I love watching you grow!"
        }
      ]
    },
    {
      "author": "Andrew Howard",
      "rating": 5.0,
      "review": "What a great inspiration! In a time when it is difficult to find a home, Jerry Spraggins pulled through. I was at first hesitant about trying to find a place of my own. Jerry helped me through every step, especially when it came to ",
      "ownerResponse": [
        {
          "text": "As my first transaction for a close personal friend this was such a rewarding experience. We toured so many homes and I even talked you out of a few that I didn't think would work for you long term. However, you trusted me that I would find  More"
        }
      ]
    },
    {
      "author": "Jeff Roper",
      "rating": 5.0,
      "review": "Man, can't say enough good things about this guy. Helped to guide me through the entire process of BOTH buying and selling a house, both of which went off flawlessly, even in this crazy market. He was professional and personal and was a joy ",
      "ownerResponse": [
        {
          "text": "Jeff, you were such a pleasure to serve!! Purchasing a home in this environment can be challenging. I am so pleased that we were able to get your offer accepted on one of the most competitive listings to date! 22 offers and they chose  More"
        }
      ]
    },
    {
      "author": "jhschmitty",
      "rating": 5.0,
      "review": "Julian has always been on my side like a brother showing my potential properties. He has always been very patient and knowledgeable about the local and national market and goes above and beyond his call of duty.",
      "ownerResponse": [
        {
          "text": "You are such an incredible guy and have always been someone that I deeply respect. Thank you for trusting in me to be your Realtor!"
        }
      ]
    },
    {
      "author": "ian charboneau",
      "rating": 5.0,
      "review": "I was looking for the perfect house in Bellingham this spring and Julian was a tremendous help throughout the process. His level of courtesy and  attention to detail made the entire process much simpler and worry free.",
      "ownerResponse": [
        {
          "text": "Thanks for sharing your experience!! Im honored to have been a part of your journey and will always be there as your friend and agent!"
        }
      ]
    },
    {
      "author": "Megan Williams",
      "rating": 5.0,
      "review": "Julian was so efficient and gave us prompt service and negotiated our perfect house for under our budget! We couldnt have been more happy with our experience and home purchase!",
      "ownerResponse": [
        {
          "text": "Meg, you and Brian and such incredible people. It was an honor to represent you and your family for such an important move! Should you ever need anything, please reach out. I look forward to being an advisor for all of you real estate related questions or needs. Enjoy your new home!"
        }
      ]
    },
    {
      "author": "Gabriela Daniels",
      "rating": 5.0,
      "review": "The absolute best people to work with. Lots of place of places to choose from in Bellingham. I recommend working with anyone on their team. Also Kailee, their executive assistant, is an absolute sweetheart!",
      "ownerResponse": [
        {
          "text": "Thank you so much for everything! We will always be here for you and are so grateful to be part of your journey! All the best!"
        }
      ]
    },
    {
      "author": "Elliot Dix",
      "rating": 5.0,
      "review": "Ive had the pleasure of knowing Jerry for a long time. Hes friendly, professional, and a diligent worker. And he loves to go the extra mile to please his clients. You wont regret working with him!",
      "ownerResponse": [
        {
          "text": "Elliot right back at you! Every project weve ever done Ive been equally impressed by your work ethic and bold ideas. Thanks!"
        }
      ]
    },
    {
      "author": "Samantha Parks",
      "rating": 5.0,
      "review": "Julian is a friend and professional colleague. He has been a pleasure to work with and its clear from my interactions with him and his clients that he goes above and beyond to get the job done!",
      "ownerResponse": [
        {
          "text": "Sam, you have done wonders for my clients and I am always thrilled to refer my homeowners to your cleaning business!"
        }
      ]
    },
    {
      "author": "Brayden Hubbard",
      "rating": 5.0,
      "review": "Julian was very professional and handled himself very well when he was selling my home and he sold my house for more than I anticipated so that was a plus as well.",
      "ownerResponse": [
        {
          "text": "I had such a great time listing your home and wish you all the success in the world with your big move! It was really great getting to know you and hopefully you make it back to Whatcom County someday!"
        }
      ]
    },
    {
      "author": "eashie angelstorm",
      "rating": 5.0,
      "review": "Jerry was amazing  and helpful, helping us find a place here, while we were in Colorado.   It all went very smoothly with no surprises.  Thank you again for an easy transition.",
      "ownerResponse": [
        {
          "text": "It was such a fun experience searching for the purrfect condo that allowed your animals to join you. We had a few hurdles to overcome but we stayed the course and we made it happen! Thanks for making it a great experience."
        }
      ]
    },
    {
      "author": "Campbell Bryson",
      "rating": 5.0,
      "review": "Friendly, knowledgeable, professional. Julian and Peyton were a treat to work with. Highly recommend them to anyone!",
      "ownerResponse": [
        {
          "text": "Thanks for trusting us to be your Realtors! We have really enjoyed our time together and look forward to seeing you next month at our quarterly party!"
        }
      ]
    },
    {
      "author": "Travis Unema",
      "rating": 5.0,
      "review": "Personable, easy to communicate with, knowledgeable with local contacts for lenders and managers. Quick responses to questions, emails texts and calls. Great service and honest!",
      "ownerResponse": [
        {
          "text": "Thanks for choosing us to help you with this purchase! Looking forward to seeing you at our next client event!"
        }
      ]
    },
    {
      "author": "Steph D",
      "rating": 5.0,
      "review": "Jerry is great! Very professional, positive, and responsive. Would recommend him to anyone looking in the Bellingham area!!",
      "ownerResponse": [
        {
          "text": "Thanks Steph! I appreciate the recommendation! Thanks for talking the time to share your feedback!"
        }
      ]
    },
    {
      "author": "Mattie Stewart",
      "rating": 5.0,
      "review": "The communication with the entire team was efficient, professional, and friendly. Jerry Spraggins is an amazing g human!",
      "ownerResponse": [
        {
          "text": "Mattie! Meeting your entire family was the best part of our getting to know one another. You have an AMAZING family and everyone is so unique in their own ways. I had such a blast with you and we saw A TON of cool properties, secret rooms,  More"
        }
      ]
    },
    {
      "author": "Taj Jackson",
      "rating": 5.0,
      "review": "Get the most money for your home! You will want to work with them again",
      "ownerResponse": [
        {
          "text": "Thank you for the kind words!"
        }
      ]
    },
    {
      "author": "Robert Knode",
      "rating": 5.0,
      "review": "Great team to help you sell or buy!",
      "ownerResponse": [
        {
          "text": "Thanks Rob!!"
        }
      ]
    }
  ],
  "adjusted_review_count": 107,
  "avg_rating": 5.0,
  "adjusted_avg_rating": 5.0
}