{
  "name": "Local Property Management",
  "address": "1310 9th St Ste 814 Bellingham, WA 98228",
  "company_type": "Property management company",
  "review_count": 15,
  "reviews": [
    {
      "author": "Susan Zanol",
      "rating": 5.0,
      "review": "Superb! I have rented from Local Property Management for 4 1/2 years. Staff is highly competent and totally tenant centered without being the least bit intrusive. Rent is reasonable and so are increases. In fact, this year there was no ",
      "ownerResponse": []
    },
    {
      "author": "Rhonda Steel",
      "rating": 5.0,
      "review": "This property management is phenomenal and responsive. The management office is easily accessible on site in the Fairhaven location, w/ protected parking and protected mail. The apartments are good quality comparatively.",
      "ownerResponse": []
    },
    {
      "author": "Meghan Lopez",
      "rating": 5.0,
      "review": "Local Property takes care of its tenants!! Every request for maintenance was responded to within days, and the manager Dawnah is easy to reach and communicate with; she will always respond to your emails within a day. Our experience renting from Local Property was smooth and everything else we could have hoped for.",
      "ownerResponse": []
    },
    {
      "author": "Jessica Danielle",
      "rating": 5.0,
      "review": "Dawnah and James are a joy to work with, very responsive, kind and understanding! Probably the best rental company Ive ever worked with in Bellingham (out of a lot), definitely would love to continue renting from them in the future",
      "ownerResponse": []
    },
    {
      "author": "Sandra Lewis",
      "rating": 5.0,
      "review": "Good experience.  My son rented for two years.  They try their best to be good managers!  Manager gets busy at times, but always got back with us...but not many issues.  Would recommend!",
      "ownerResponse": []
    },
    {
      "author": "Silas Uhder",
      "rating": 5.0,
      "review": "Hands down the best property management company in Bellingham. They are responsive, professional and won't rip you off like some of the other companies in Bellingham.",
      "ownerResponse": []
    },
    {
      "author": "Sandor Voros",
      "rating": 5.0,
      "review": "A great place to rent from! They respond quickly to emails and maintenance requests and do not try to shell money out of you.",
      "ownerResponse": []
    },
    {
      "author": "John Corbin",
      "rating": 5.0,
      "review": "From beginning to end, there has been great communication and the unit we rented was very nice and high quality! Would recommend!",
      "ownerResponse": []
    },
    {
      "author": "Ashley V",
      "rating": 5.0,
      "review": "My favorite place to rent from so far! Very clean, nice and responsive management too!",
      "ownerResponse": [
        {
          "text": "Aw, thanks Ashley! We are sad to see you go, and we wish you all the best.\n\n-James & Dawnah"
        }
      ]
    },
    {
      "author": "Brian Gass",
      "rating": 5.0,
      "review": "Great company. They are responsive to issues and address them promptly.  Always professional when interacting with them.",
      "ownerResponse": []
    },
    {
      "author": "Eli J",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Merve Candemir",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Renee D.",
      "rating": 5.0,
      "review": "Local Property management offers a professional rental experience and is prompt, friendly, and efficient throughout the entire process.",
      "ownerResponse": []
    },
    {
      "author": "Kiana O.",
      "rating": 1.0,
      "review": "If you like being scammed rent from Local\nProperty! I lived there for several months and experienced several in inconveniences and terrible customer service.",
      "ownerResponse": [
        {
          "text": "Hi Kiana,\n\nUnfortunately, your description does not at all line up with the facts of your tenancy with us. You repeatedly violated the lease agreement, left your apartment a complete mess and then tried to use photos from someone else's listing to deceive us (something you admitted to doing in your subsequent communication with us). I am happy to provide those records if you now don't recall doing so.\n\nI am sorry that you were clearly unhappy living with us - that is not what we want at all, and we work very hard on resident satisfaction. Our Google reviews, which are much more popular than yelp, show that we have one of the highest ratings in all of Bellingham. But still, that is no excuse to continue to lie and smear our name.\n\nI hope you'll find it in you to update or delete your review in accordance with honesty and integrity.\n\nWe wish you all the best.\n\n-James"
        }
      ]
    },
    {
      "author": "Billie R.",
      "rating": 1.0,
      "review": "Completely dis-organized and could care less about potential customers time.  Called on a property, Tonya said they wouldn't be showing it for a week and a half, gave me a day and time.  Tonya ended up calling me back that evening to advise she gave me the wrong day.\n\nShowed up to the property, with 3 other people and waited 15 minutes.  Finally called to find out it had been rented.\n\nNot only did she/they not call us back to give us the courtesy of not wasting our time, no apologies were made.  She obviously had my name and number.\n\nI will not do business with a company that has such a disregard for people and their time.  I find this rude.  \nA call could have been made at any time that the house had been rented. Mind you, it is still listed on their website.  \n\nFar to many property management companies in this town.  \n\n1 star because they do not offer NEGATIVE STARS option.",
      "ownerResponse": [
        {
          "text": "Hi Billie,\n\nThere is no excuse for what happened when you interacted with our business, and I'm sorry this review didn't get a response sooner. We are much more active on Google reviews, so these few Yelp ones tend to slip through the cracks.\n\nAlso, with this review being so old, I can assure you that management has changed up significantly. I am James, the new manager. Been working here for two years now and have a strong emphasis on resident satisfaction - the aforementioned Google reviews will show that effort to be successful.\n\nWhile I know there's nothing we can do to undo what happened when we were under less effective management, I hope you'll keep a look out for any of our listings again if you should need housing. I promise you won't be disappointed!\n\nHave a wonderful day.\n\n-James"
        }
      ]
    }
  ],
  "adjusted_review_count": 13,
  "avg_rating": 4.3,
  "adjusted_avg_rating": 4.4
}