{
  "name": "Northwest Property Collective LLC",
  "address": null,
  "company_type": "Short term apartment rental agency",
  "review_count": 7,
  "reviews": [
    {
      "author": "Elizabeth Cox",
      "rating": 5.0,
      "review": "I would highly recommend Jessica for any of your rental needs. She is quick to respond, very professional and very realistic when it comes to income and expenses. I was interested in turning my home into an AirBnB and she came out promptly ",
      "ownerResponse": [
        {
          "text": "Thank you very much! Grateful for you :)"
        }
      ]
    },
    {
      "author": "Emelie Goodman",
      "rating": 5.0,
      "review": "Very impressed with Jessica at NW Property Collective response time and management skills. Im a local realtor and Jessica continues to serve my clients stage, design and rent out their homes short term netting them the highest dollar ",
      "ownerResponse": [
        {
          "text": "As a small business, we really appreciate that you took the time to leave us a positive review. We look forward to working together again soon! "
        }
      ]
    },
    {
      "author": "Jenn Fluke",
      "rating": 5.0,
      "review": "The home is very comfortable. Checking in was easy and the property management team was fast to help with anything.",
      "ownerResponse": [
        {
          "text": "Thank you so much for trusting our expertise, Jenn! It was a delight to meet you."
        }
      ]
    },
    {
      "author": "Erin Luna",
      "rating": 5.0,
      "review": "With Northwest Property Collective, I received prompt and professional communication regarding my inquiry. Jessica is extremely knowledgeable, very approachable, and pays thoughtful attention to every detail. I am confident Northwest Property Collective truly has the clients best interests in mind when managing a property.",
      "ownerResponse": [
        {
          "text": "Thank you very much Erin! I appreciate you :)"
        }
      ]
    },
    {
      "author": "Jeffrey Brooks",
      "rating": 5.0,
      "review": "The place was beautiful and Jessica was fabulous - so great we rented again for next year.",
      "ownerResponse": [
        {
          "text": "Thanks Jeff, you are an ideal guest! Looking forward to next year already :)"
        }
      ]
    },
    {
      "author": "Phil Zeutenhorst",
      "rating": 5.0,
      "review": "Jessica was great. House had everything for a wonderful stay. location was great too.",
      "ownerResponse": [
        {
          "text": "Thanks Phil! You were a great guest, come stay again!"
        }
      ]
    },
    {
      "author": "Mary hmb1968 B",
      "rating": 5.0,
      "review": "Jessica is professional, prompt and responsive. Always willing to help and goes the extra mile!",
      "ownerResponse": [
        {
          "text": "Thank you for being such a valued client, I adore you and your home!"
        }
      ]
    }
  ],
  "adjusted_review_count": 7,
  "avg_rating": 5.0,
  "adjusted_avg_rating": 5.0
}