{
  "name": "Padden Creek Apartments",
  "avg_rating": 3.0,
  "review_count": 7,
  "adjusted_review_count": 7,
  "reviews": [
    {
      "author": "bruce f.",
      "rating": 5.0,
      "review": "We lived at Padden Creek for seven months while waiting for a condo we purchased. This place is absolutely wonderful. Quiet, beautiful, just steps from some of the best trails and just a short walk to downtown Fairhaven. The management team led by Meghan is wonderful to work with and the maintenance staff is fast and efficient. I simply can't say enough good things about this apartment community.",
      "ownerResponse": []
    },
    {
      "author": "Eric E.",
      "rating": 2.0,
      "review": "Despite paying my rent promptly on the first of the month for over 6 months they thought it would be fine to put a notice on my car saying they would tow it in 48 hours because my tags expired. My new ones were lost in the mail and it's a pandemic. They have my email and phone number but they couldn't be bothered to contact me. If I did not see the notice my car would have been towed. This is how they treat a paying tenant who never companied about anything.",
      "ownerResponse": [
        {
          "text": "Dear Eric, we understand it is frustrating to receive a towing notice. Several other residents received the same notices, so it wasn't a personal situation. We have emailed all residents several times in the last 6 months to remind them to update their vehicle info and to be sure they are following the parking policies in the lease they have signed and agreed to. For future reference, if there is a delay in your renewal you can let us know and we'll make a note in your file. There are several businesses in the Bellingham area you can walk in to renew your tabs, or of course you can go online to renew at dol.wa.gov and show us the receipt while you wait for them to come in the mail."
        }
      ]
    },
    {
      "author": "Morgan B.",
      "rating": 5.0,
      "review": "We moved here after selling our house. It has been great not having to worry about doing the lawn and maintenance. Maintenance guys come to fix things right away when you call for a work order. The apartment is a little dated but it's like 30 years old. Everything is clean and functional and the location can't be beat! Right on the Interurban Trail and Fairhaven Park. The other tenants are mostly quiet older folks or working professionals so quiet for the most part. They are super pet friendly! We have 2 dogs, one is an ESA and a cat and all 3 are allowed. The office is always helpful and friendly. We got a free carpet cleaning when we renewed our lease. All in all a comfortable pet friendly place to live.",
      "ownerResponse": []
    },
    {
      "author": "Kate M.",
      "rating": 2.0,
      "review": "Update to my earlier review: I was able to get a full refund of my deposit by contacting the entire executive team of the corporate office. While I'm happy to have a positive outcome, it shouldn't have been this complicated or taken extra steps.",
      "ownerResponse": []
    },
    {
      "author": "Emma C.",
      "rating": 4.0,
      "review": "Easy communication with the staff, the maintenance men are great, and of course, the location is fabulous. The apartments themselves are clean and functional, the only thing that keeps me from giving them a full 5 stars is I wish the cabinets and counter tops in my apartment were new -- It'd really make the whole place feel 100x nicer!",
      "ownerResponse": []
    },
    {
      "author": "Kelsey M.",
      "rating": 1.0,
      "review": "This is by far the WORST place my husband and I have ever lived. What's more is my husband was a property manager previously and knows Washington state tenants rights and fair housing laws like the back of his hand. \n\nMeghan is incredibly unprofessional and unintelligent in regards to her job and tenant rights. She was extremely unhelpful and has poor customer service skills.\n\nIf you choose to live here, get EVERYTHING in writing. Do not consider in-person/ over the phone communicate sufficient. \n\nMy husband is extremely careful when handling business without written communication and continually struggled with Meghan and her \"interpretation\" of the lease and mail sent to us. Their answers to our questions often ended up being guesses, in which they never made right with us. \n\nThe check-in and check-out was sketchy at best. They ended up charging us for items listed as \"required\" or \"maintenance\" on the lease and were described as not being tenant responsibility. Meghan \"interpreted\" this to mean it what not our responsibility to paint ourselves, but we should have to pay for it... WHAAAAT?!?! That is not how the originally \"interpretation\" was explained to us when signing the lease.\n\nI could go on with story after story of unprofessional and sketchy behavior from Meghan and the office staff (I think the other lady name is Erin?) that we and numerous neighbors have experienced, but I feel like you get the point.\n\nOverall, I would NEVER recommend Padden Creek Apartments or Fairhaven Creek Apartments to my worst enemy.",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "1900 18th St Bellingham, WA 98225",
  "adjusted_avg_rating": 3.0
}