{
  "name": "Piazza Realty Property Management Inc",
  "address": "120 E George Hopper Rd, Burlington, WA 98233",
  "company_type": "Property management company",
  "review_count": 51,
  "reviews": [
    {
      "author": "Nicole LaCresha",
      "rating": 5.0,
      "review": "Theres a lot of negative comments about piazza. My totally experience has been a blessing, last minute showing for me, communication is on point! They are doing everything in their power to get me into a place. Breanna has been so helpful ",
      "ownerResponse": [
        {
          "text": "Gosh!!! Thank you Nicole, it is our pleasure to help and to work with you on your rental. The review is a huge  bonus, cant wait to share with the staff. "
        }
      ]
    },
    {
      "author": "Leslie Martinez",
      "rating": 1.0,
      "review": "By far the worst company to try and rent from. They take their sweet time processing everything. Everytime you try calling to speak to the management person or whatever they are  busy or dont answer the phone. After they finally  ",
      "ownerResponse": []
    },
    {
      "author": "Danial Osburn",
      "rating": 1.0,
      "review": "Okay so Im amongst friends talking about our experiences with piazza reality. Which triggered me to remember I never got to give my review. I lived at\n13075 Avon Allen rd ",
      "ownerResponse": []
    },
    {
      "author": "Vicky Benson",
      "rating": 5.0,
      "review": "We Are Very Pleased With Piazza Property Management July would be 9 Years Renting From Them Staff Is Wonderful To Maintenance is Prompt as well.....",
      "ownerResponse": [
        {
          "text": "Vicky.  We appreciate you. Thank you for posting this. "
        }
      ]
    },
    {
      "author": "Michelle Kerr",
      "rating": 5.0,
      "review": "I love the owner and all of the employees. I felt more like a friend than rather than just a  tenant! Much love ",
      "ownerResponse": [
        {
          "text": "Thank you Michelle.  We feel that way too.  We appreciate you sharing that with us and others. "
        }
      ]
    },
    {
      "author": "Cassandra Rauch",
      "rating": 5.0,
      "review": "I've been renting my home through this company for over three years now, and I feel like I've had a rather great experience. They have been responsive when I've needed assistance or information, and they have always been really pleasant to ",
      "ownerResponse": [
        {
          "text": "Thank you so much Cassandra! We appreciate you so much!"
        }
      ]
    },
    {
      "author": "Mike Lowrey",
      "rating": 5.0,
      "review": "I didnt have the best credit history. The staff and Manager were super willing and enthusiast about helping me. They made me feel comfortable and not like less than a person. They gave me the opportunity to have something better newer and ",
      "ownerResponse": [
        {
          "text": "Thank you so much Mike. We really appreciate you taking the time for this detailed review it means so much to our staff."
        }
      ]
    },
    {
      "author": "SwC R",
      "rating": 1.0,
      "review": "This place is awful to deal with if you are renting from them. I know numerous ppl that have been screwed by this company. They are a dishonest company. Rented me a home with non stop problems. Sinks not working, rat problems, heating ",
      "ownerResponse": [
        {
          "text": "Dear SwC r\nWe do not recognize our name as ever having rented from us.  If you have concerns with Move-out charges, we certainly want you to talk with us and provide us  More"
        }
      ]
    },
    {
      "author": "Debbie Joswick",
      "rating": 5.0,
      "review": "I've been renting from Piazza Realty for over 5-years now and they have been an excellent company to work with. Quick to address any issues we may have and in a timely fashion. Kathy is wonderful, as is her staff! ",
      "ownerResponse": [
        {
          "text": "Thank you, Debbie.   We can't tell how much it means to us to get this kind of review from a long term renter.  We appreciate this very much, from the whole staff."
        }
      ]
    },
    {
      "author": "Zack K",
      "rating": 5.0,
      "review": "Kathy Piazza Property Management has been my property manager since 2009 when I had left due to military orders up to the sale of my home in December 2016.  I have not had a problem with them.  They are very professional in everything they ",
      "ownerResponse": [
        {
          "text": "Thank you Zack.  We appreciate your review and hope you are doing well. Thank you for your service."
        }
      ]
    },
    {
      "author": "Sushi Juice",
      "rating": 1.0,
      "review": "Maria, the front office lady who takes phone calls and attempts to help people, is rude and obnoxious - and always seems to be covering for her boss. Kathy, the \"Manager,\" is always so busy yet she leaves early and is routinely unavailable. ",
      "ownerResponse": []
    },
    {
      "author": "Vincent Sherman",
      "rating": 5.0,
      "review": "Piazza Realty Property management was recommended to me to.manage my rental house in Mount Vernon by a local floor service company. It was one of the best recommendations i have ever recieved. ",
      "ownerResponse": [
        {
          "text": "Thank you Vincent. It is our pleasure to serve your.  We appreciate you taking the time to share your experience.  It means a lot of us as a small business."
        }
      ]
    },
    {
      "author": "Angela Prevette",
      "rating": 5.0,
      "review": "I am a long term renter with Piazza.  Kathy-Jo has gone above and beyond helping my family and I during trying times while renting through Piazza.  I would recommend renting through them today!",
      "ownerResponse": [
        {
          "text": "Thanks Angela, I appreciate your review and 5-stars!!  Thanks for being a great tenant!!"
        }
      ]
    },
    {
      "author": "Tamie Jensen",
      "rating": 2.0,
      "review": "I contacted them to ask about an apartment listed for rent. A 1 bed/ bath. It's a duplex with laundry in garage. No yard. Front door to building is missing. The outside is covered in moss. It's in a rather shady area of Stanwood. Surrounded ",
      "ownerResponse": [
        {
          "text": "Greetings Tami. I know its difficult to find affordable housing right now. The rate is actually what it is for that area. We do not set the rental prices that is set by the owners. Mount Vernon is less expensive than Stanwood or Arlington."
        }
      ]
    },
    {
      "author": "patti basart",
      "rating": 5.0,
      "review": "I want to thank Piazza Property Management for my wonderful experience in finding a delightful place to live, with their help.  They have been professional, helpful, kind and courteous from my application process to moving in and so ",
      "ownerResponse": [
        {
          "text": "Thank you Patti, We appreciate this review!"
        }
      ]
    },
    {
      "author": "Whitney Warsaw",
      "rating": 1.0,
      "review": "Would give them zero if I could. Attitude right when they answer the phone. And apparently the main person u need to talk to.. takes her break 15 min after they open. I called 3 different times and she was 'on break' ...unprofessional...the ",
      "ownerResponse": [
        {
          "text": "So sorry Whitney, these processes are sometimes very dissapointing for potential renters for many reasons.  We are a property managers and can only manage for owners based on their specifications and standing rental rules.  We wish you the best of luck with your search and for you and your family."
        }
      ]
    },
    {
      "author": "Sean Brenton",
      "rating": 2.0,
      "review": "The web site is never up to date. And sometimes doesn't even work at all. If a property has a pending application ahead of yours we should be able to be told a time frame. There is no reason every County a universal application. And data ",
      "ownerResponse": [
        {
          "text": "Thank you Sean for the feedback.  We are constantly updating our technology and website.   Let us know if you have anymore trouble with the site."
        }
      ]
    },
    {
      "author": "Madisen Cork",
      "rating": 4.0,
      "review": "Only reason it is 4 stars instead of 5 is because it can be really hard to communicate with them. They work with you with just about anything thankfully, but it can be really hard to get a call back because they always seem to be so busy! ",
      "ownerResponse": [
        {
          "text": "Thank you Madisen.  We do appreciate you."
        }
      ]
    },
    {
      "author": "Juan Jose",
      "rating": 5.0,
      "review": "Great company to work with! I first started as a tenant with them and had great service, then I purchased my first rental property and put it under their management and they have done an exceptional job!  I would highly recommend this company to anyone looking to rent or to have their property managed!",
      "ownerResponse": [
        {
          "text": "Thank you Juan.  We appreciate your business and your review."
        }
      ]
    },
    {
      "author": "Joe",
      "rating": 1.0,
      "review": "Dishonest in the way they do business and known as slum landlords in Skagit. Id stay away and look elsewhere! Not worth it",
      "ownerResponse": []
    },
    {
      "author": "Cindy De Leon",
      "rating": 5.0,
      "review": "Just started renting under Piazza Realty Property Management Inc in October and so far everything that we've taken to them has been corrected/replaced in a quick manner, with no complaints/arguments.  Very nice staff to work with.",
      "ownerResponse": [
        {
          "text": "Thank you so much Cindy! We appreicate you."
        }
      ]
    },
    {
      "author": "Ezra Epstein",
      "rating": 5.0,
      "review": "They're a great property management team.",
      "ownerResponse": [
        {
          "text": "Thank you so much Ezra!!! This means a ton to all of us. "
        }
      ]
    },
    {
      "author": "Danny Dean",
      "rating": 5.0,
      "review": "Been with them for over a year now, we recently had a big windstorm that caused a tree to fall into our powerlines pse rold us we had to have an electrician come out and repair stuff. Called Piazza at 8am and spoke to them about it and Maria had someone out here within a couple hours to take care of it!!! Thanks for your help!!!!!!",
      "ownerResponse": [
        {
          "text": "Thank you Danny, We appreciate you taking the time leave this great review. It means so much to our staff."
        }
      ]
    },
    {
      "author": "Noirceuil LeSombre",
      "rating": 4.0,
      "review": "Great staff. Very open and efficient. Friendly and helpful. Viewing and application process smooth.",
      "ownerResponse": [
        {
          "text": "Thank you so much we appreciate your feedback."
        }
      ]
    },
    {
      "author": "Dylan Husby",
      "rating": 1.0,
      "review": "Everyone I ever know thats rented from here has absolutely hated it. Very rude, condescending staff, will fine you for complaints even if not valid. Multiple friends and family have given me this information. Do not rent from them :)",
      "ownerResponse": [
        {
          "text": "Hi Dylan, I am sorry to hear of your experience with our company.  I have looked for you in our system and do not find you as a current or previous tenant.  I would love to discuss this further with you if you could reach out to me via email at kathy@piazzapropmgt.com or by phone at 360-424-7368.  Thank you."
        }
      ]
    },
    {
      "author": "Larry Hilliard",
      "rating": 5.0,
      "review": "I really like working with these people - Biri, Veronica, Kathy and the others working behind the scenes.  They are my \"go to\" team for finding tenants and executing leases. Thanks!  Larry H.",
      "ownerResponse": [
        {
          "text": "Thank you Larry,  We like working with you too.  This review means a lot to all of us."
        }
      ]
    },
    {
      "author": "David Torres",
      "rating": 4.0,
      "review": "We have rented for 7+ years with Piazza. Local Family and business, they are good to work with and have done good by us over the years. I would recommend.",
      "ownerResponse": [
        {
          "text": "Thank you David.  We so appreciate our review."
        }
      ]
    },
    {
      "author": "David Torretta",
      "rating": 5.0,
      "review": "This agencyIs absolutely awesomeIs absolutely awesome.I have five properties with themAnd they have totally been on top of things.",
      "ownerResponse": [
        {
          "text": "Thank you David, your confidence is much appreciate by the whole staff."
        }
      ]
    },
    {
      "author": "Kjersti Mutchler",
      "rating": 1.0,
      "review": "This is the worst management company Ive ever rented from. Expect inspections beyond legal requirements, poor communication with very rude staff and management, unprofessional behavior, rent increases when reporting a problem with the ",
      "ownerResponse": [
        {
          "text": "Hi Kjersti, I have looked through our records and do not see you as a current or previous tenant.  If you have things that you would like to discuss I am more than happy to meet with you."
        }
      ]
    },
    {
      "author": "Brenda Porter",
      "rating": 1.0,
      "review": "Worst place I have ever rented from. They were never true to their word. Most dysfunctional employees. All were useless my entire time living in my rental. Never again will I rent from them.",
      "ownerResponse": [
        {
          "text": "We are so sorry that you felt that way. Being in the middle between owners and renters is not an easy place but we do the VERY best we can for both. Sometimes there are irreconcilable differences in the relationships between owner and  More"
        }
      ]
    },
    {
      "author": "AMA LUV",
      "rating": 5.0,
      "review": "I have rented from Kathy for 5 years and I would like to say that she is honest, respectful and truly cares about you!",
      "ownerResponse": [
        {
          "text": "We appreciate your review so much. We do try hard to care for everyone.  We appreciate you!"
        }
      ]
    },
    {
      "author": "Jason BENSON",
      "rating": 5.0,
      "review": "We have been renting our town house thru piazza for close to three years now.  Any unexpected issues have always been resolved quickly and to our satisfaction.",
      "ownerResponse": [
        {
          "text": "Thanks Jason, it's  been our pleasure working with you!!!"
        }
      ]
    },
    {
      "author": "Johnna Rodriguez",
      "rating": 1.0,
      "review": "Horrible! The owner Paul is more respectful and really cares! Not like the manager Kathy! And all her office worker! They have bad customer service!",
      "ownerResponse": [
        {
          "text": "We are so sorry that you felt that way. Being in the middle between owners and renters is not an easy place but we do the VERY best we can for both. Sometimes there are irreconcilable differences in the relationships between owner and  More"
        }
      ]
    },
    {
      "author": "Loretta Cantu",
      "rating": 5.0,
      "review": "I have enjoyed renting from them. They are friendly and when I need something fixed they get it done.",
      "ownerResponse": [
        {
          "text": "Thank you Loretta.  We really appreciate you."
        }
      ]
    },
    {
      "author": "Holly Woodhams",
      "rating": 4.0,
      "review": "I would give them five stars if they had more properties available.  Especially outside of Mount Vernon.",
      "ownerResponse": [
        {
          "text": "Thank you Holly, we appreciate your feedback, keep checking with us as we do get new properties in quite often."
        }
      ]
    },
    {
      "author": "Jay Bulworth",
      "rating": 1.0,
      "review": "She was rude. Very unpleasant to deal with over all and we chose to not even peruse business with them because of it.",
      "ownerResponse": []
    },
    {
      "author": "Doug Johnson",
      "rating": 2.0,
      "review": "In agreement with the other reviewer, I would have an attorney review any contract with this company before agreeing to lease one of their properties.",
      "ownerResponse": [
        {
          "text": "Contracts should always be reviewed carefully and make sure that you know what you are signing.  We unfortunately are managers and not owners so it is the nature of our business to have to please our owners. We strive to help everyone but are not able to that."
        }
      ]
    },
    {
      "author": "Autumn Cameron",
      "rating": 5.0,
      "review": "Professional and friendly staff, will recommend to anyone I know looking for a clean and well managed property",
      "ownerResponse": [
        {
          "text": "Thank you Autumn. We really appreciate you."
        }
      ]
    },
    {
      "author": "Aaronations Animations and Art",
      "rating": 1.0,
      "review": "Left mold in the house and spat in our faces 0/10 awful",
      "ownerResponse": [
        {
          "text": "Hi Aaron, I've tried to find you in our system to review your account and was unable to locate your file. We have very few staff that interacts directly with our clients.  None of us would have spat on anyone.  This is a very untrue and  More"
        }
      ]
    },
    {
      "author": "Adam Griffin",
      "rating": 5.0,
      "review": "Great to do business with. Very friendly and honest.",
      "ownerResponse": [
        {
          "text": "Thank you Adam,\nWe appreciate this review very much."
        }
      ]
    },
    {
      "author": "Barbara Riley",
      "rating": 3.0,
      "review": "They are very friendly and helpful as can be!",
      "ownerResponse": [
        {
          "text": "Thank you Barbara!"
        }
      ]
    },
    {
      "author": "Kevin Tinoco-Chavez",
      "rating": 5.0,
      "review": "Really nice and clean good assistants",
      "ownerResponse": [
        {
          "text": "Thank you Kevin. Accrue really appreciate you taking the time for the review. That means a lot to us."
        }
      ]
    },
    {
      "author": "Renee Bradwell",
      "rating": 1.0,
      "review": "Not great property management.",
      "ownerResponse": [
        {
          "text": "We are so sorry Renee.  We are a property managers and not owners.  We can only be an ambassador for the property owners.  We want to help everyone but unfortunatley we can't always do that.  Best of luck to you and your family."
        }
      ]
    },
    {
      "author": "Aj Howard",
      "rating": 3.0,
      "review": "Good place to rent from",
      "ownerResponse": [
        {
          "text": "Thank you AJ,  If you need anything let us know."
        }
      ]
    },
    {
      "author": "Dianna Blankenship",
      "rating": 5.0,
      "review": "Great staff.",
      "ownerResponse": [
        {
          "text": "Thank you so much Diana. We really apprecaite you taking the time to share this great review."
        }
      ]
    },
    {
      "author": "Stephen Murphy",
      "rating": 5.0,
      "review": "Good place to rent from",
      "ownerResponse": [
        {
          "text": "Thank you Stephen, We very much appreciate the review."
        }
      ]
    },
    {
      "author": "Kenny Jans",
      "rating": 5.0,
      "review": "Outstanding service from top to bottom.  Staff is knowledgeable, friendly, and very responsive.  10/10 strongly recommend!",
      "ownerResponse": [
        {
          "text": "Thank you Kenny!! We appreciate you and this great review!!!"
        }
      ]
    },
    {
      "author": "Nathyeli Santiago",
      "rating": 5.0,
      "review": "The attention in the office is very pleasant",
      "ownerResponse": [
        {
          "text": "Thanks for your review. We appreciate it very much!"
        }
      ]
    },
    {
      "author": "sonny lopez",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "The Original Twelve",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Sorry for your experience.  Please contact our office and let us know how we could have done better."
        }
      ]
    },
    {
      "author": "Loni Osborne",
      "rating": 2.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hi Loni, Thank you for your feedback.  It is clear you were disapointed but we don't know the reason. Please reach out to us for feedback.  As property managers , we are not owners and do our best to please both tenants and owners.  Best of luck to you."
        }
      ]
    },
    {
      "author": "angel west",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you  "
        }
      ]
    },
    {
      "author": "Danger Pez",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you."
        }
      ]
    },
    {
      "author": "Sonia Scott",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Michelle Perkins",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Becky Goodrich",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Our family has been in the property management business all my life.  We are always disappointed when owners and tenants clash over repairs, rules, property upkeep, community areas, owner responsibilities, or tenant accountability during  More"
        }
      ]
    },
    {
      "author": "Tony Stokes",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Tony,  our whole staff appreciates your review.  You made our day."
        }
      ]
    },
    {
      "author": "Kimberlymarie Wilson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Kim, it has been our pleasure working with you for the last 15 years!"
        }
      ]
    }
  ],
  "adjusted_review_count": 48,
  "avg_rating": 3.4,
  "adjusted_avg_rating": 3.6
}