{
  "name": "Delta Property Management",
  "address": "4229 76th St NE, Marysville, WA 98270",
  "company_type": "company",
  "review_count": 55,
  "reviews": [
    {
      "author": "Jestine Wilson",
      "rating": 5.0,
      "review": "Very friendly and efficient to work with. We've rented thru them for several years and have had nothing but excellent customer service. We highly recommend Delta Property Management!",
      "ownerResponse": []
    },
    {
      "author": "Megan Holmes",
      "rating": 4.0,
      "review": "Ive been renting through Delta for almost three years, and the majority of my dealings with them have been A+. There have been a few instances where things didnt get resolved in a super timely manner, or the landlord hasnt been willing ",
      "ownerResponse": [
        {
          "text": "Thank you Megan! We appreciate your kind words!"
        }
      ]
    },
    {
      "author": "Romney Howells",
      "rating": 5.0,
      "review": "I made a glaring error and missed two places I would have loved.  Delta always accommodated my busy schedule.  The real kicker is that most outfits just take your application fee and it is end of story.  Delta, as I was unable to get my ",
      "ownerResponse": []
    },
    {
      "author": "5Talents Capital LLC",
      "rating": 5.0,
      "review": "Delta Property Management has managed our small portfolio of duplex properties for ~18yrs.  We have found Delta to be small enough to have a relationship with the family of team members, yet of sufficient size and scale to provide high ",
      "ownerResponse": []
    },
    {
      "author": "Kristen Marie",
      "rating": 5.0,
      "review": "They are legitimately the best rental company I've ever dealt with. Anytime I have had a maintenance request, it was always handled in a timely matter. The receptionists are all immensely kind, understanding, and overall a pleasure to speak ",
      "ownerResponse": []
    },
    {
      "author": "Randy Leadbetter",
      "rating": 5.0,
      "review": "I've been working with Delta originally with a single family rental and an 8 unit apartment building. I've always been impressed by them. Always going above and beyond. ",
      "ownerResponse": []
    },
    {
      "author": "Kary Beckner",
      "rating": 5.0,
      "review": "Delta has managed our condo property for several years - always professional and handled maintenance issues in a timely manner. Delta also was our real estate broker when we decided to sell and we are very happy with the outcome and sale. Highly recommend!",
      "ownerResponse": []
    },
    {
      "author": "S M",
      "rating": 5.0,
      "review": "I started renting from Delta in January and have had no issues.  I turned in my move in inspection (which they allow you to do on your own and take it back to the office within a few days of move in)  and they addressed the maintenance ",
      "ownerResponse": []
    },
    {
      "author": "Mary Cameron Perillo",
      "rating": 1.0,
      "review": "Wish I could leave zero stars. This place is AWFUL. We voluntarily ended our lease early at the request of the homeowner, incurring great charges to us. Now they're attempting to bill us $1265 in landscaping fees after move-out, when we ",
      "ownerResponse": []
    },
    {
      "author": "Ruthie Abbott",
      "rating": 5.0,
      "review": "I have never had an easier rental company to deal with. Throughout our entire tenancy they have been patient, kind, communicative, and understanding. When the pandemic hit they were extremely helpful and understanding when our payments fell ",
      "ownerResponse": []
    },
    {
      "author": "Nathaniel Larson",
      "rating": 5.0,
      "review": "Great people with lovely attitudes who are always willing to meet me halfway and help out in whatever way they can. In my 8 or so months renting from Delta there has been nothing to complain about or any reason to be dissatisfied with the service provided by the employees and by my landlord.",
      "ownerResponse": []
    },
    {
      "author": "Erica Berentsen",
      "rating": 1.0,
      "review": "Do not go here if you have a service animal. They let owners discriminate against ESA animals and will deny you, but give a poor excuse as to why to avoid getting in trouble. I have asked to speak with a manager and no one calls back. I am ",
      "ownerResponse": []
    },
    {
      "author": "Robert Duby",
      "rating": 5.0,
      "review": "We hired Delta Property Management two years ago because we were not happy with our last management company.  Jami and her staff have been very professional and do what they say they will do. they are fair to the tenants, as well as protect ",
      "ownerResponse": []
    },
    {
      "author": "Dean Flaming",
      "rating": 5.0,
      "review": "My wife and I hired Delta Property Management to help manage our rental house.  Jami and her team are responsive and professional.  Delta Property Management has managed our home for 4 years with 2 different tenants.  They hold tenants ",
      "ownerResponse": []
    },
    {
      "author": "Suzanne Balde",
      "rating": 5.0,
      "review": "We rented from DPM in 2012 for a couple years. Reasonable rent. Timely response. Great experience. Highly recommended. In 2020, when it was time to transition from our permeant home, we wanted to have a property management company represent ",
      "ownerResponse": []
    },
    {
      "author": "juli Comfort",
      "rating": 1.0,
      "review": "Very unhappy with the customer service. I took off early from work in downtown Seattle (mind you Im losing money at this point) and use public transit due to parking as do ALL my coworkers and called to say I wasnt going to make it ",
      "ownerResponse": []
    },
    {
      "author": "Mikel Carr (Reckless Thor)",
      "rating": 1.0,
      "review": "Wish I could give 0 stars. Awful people to deal with. Give almost no notice before inspections, charge all tenants if one messes up. Charges exorbitant hidden fees. Tried to fight us when we have a Emotional Support animal due to my PTSD. I ",
      "ownerResponse": []
    },
    {
      "author": "Jamie Barksdale",
      "rating": 5.0,
      "review": "Delta Property Management has been nothing but nice and understanding. We had some misunderstandings but everything we have had an issue with has been taken care of. They have gone above and beyond their responsibility to fix what needed to ",
      "ownerResponse": []
    },
    {
      "author": "Lion NotSheep",
      "rating": 1.0,
      "review": "This company is terrible when it comes to moving out of one of their properties. They take all the deposit and then want more because they charge ridiculous amounts for nothing. A dump run for a few pounds of trash cost $150? No. No it ",
      "ownerResponse": []
    },
    {
      "author": "robot me gaming hi",
      "rating": 1.0,
      "review": "Me and my husband stay at delta property for more than 3 years.   When we move out wild berries until the deck, after we clean the back we found out a lots of tires underneath the deck, by the bushes we found acquarium. . It's totally mess ",
      "ownerResponse": []
    },
    {
      "author": "Merri C",
      "rating": 1.0,
      "review": "Also had issues with the deposit. We had an emergency and could not leave the house how we would have liked. Expected to not get most of our deposit back. Ended up owning them almost 1,000. Absolutely ridiculous. I asked for an itemized ",
      "ownerResponse": []
    },
    {
      "author": "Lewis Ray Potts",
      "rating": 5.0,
      "review": "I could give a bad review about my experience, but then Id be lieing out of my thumbs, (because Im texting it)!!! Amanda was awesome at helping get the  problem solved at our residence!!! Thanks Yo!!!",
      "ownerResponse": []
    },
    {
      "author": "Sandy Dallman",
      "rating": 5.0,
      "review": "We are renting our third house through Delta and have been more then happy with them.  They have always taken care of any repairs in a timely manner. We would highly recomend  Delta property.",
      "ownerResponse": []
    },
    {
      "author": "wes chadwick",
      "rating": 1.0,
      "review": "These are the worst people to deal with I feel sorry for anyone who rents through them",
      "ownerResponse": []
    },
    {
      "author": "Mary J Mama",
      "rating": 5.0,
      "review": "My family and I always had a great experience speaking with them on the phone. They were always solving any problems that came up as soon as possible. I would definitely recommend them to any renter. If we weren't moving to a different state, we would have stayed with them!",
      "ownerResponse": []
    },
    {
      "author": "Shawna Mabery",
      "rating": 5.0,
      "review": "They took care of my rental unit years ago .\nWorth the monthly fee to deal with tenants.\nThey collect your deposit and rent ,late fees ect..",
      "ownerResponse": []
    },
    {
      "author": "Art West",
      "rating": 5.0,
      "review": "Awesome friendly and professional staff...everyone is helpful and smiling",
      "ownerResponse": []
    },
    {
      "author": "Sara King",
      "rating": 1.0,
      "review": "DO NOT RENT FROM THEM! They are horrible. Completely unprofessional, thieving, slumlords! I was yelled at for no reason. They tried to charge me ridiculous things that were wrong with the property long before I got there out of my deposit. They don't fix things in a timely fashion if at all. Stay away!",
      "ownerResponse": []
    },
    {
      "author": "Seaside LEM",
      "rating": 5.0,
      "review": "Very impressed with the level of customer service provided by Shay and the team.  They are prompt at getting back to us when we need assistance or have questions.  Highly recommend! 10/10",
      "ownerResponse": []
    },
    {
      "author": "Shalaidah Velain",
      "rating": 5.0,
      "review": "Very nice people Julie was great. Even though we didn't end up renting from them they were very helpful.",
      "ownerResponse": []
    },
    {
      "author": "Emeterio Cervantes",
      "rating": 5.0,
      "review": "6 year tenant. Good property management team, courteous, fair, maintenance is quick and professional. I would recommend Delta to any friend or family.",
      "ownerResponse": []
    },
    {
      "author": "adalberto juarez",
      "rating": 5.0,
      "review": "This company  might be good to property  owners  but not to tenants  they are terrible. Manager is so rude to tenants  she shouldn't  be working there. She doesn't  handle tenants  complaint properly.  She should  be fired!",
      "ownerResponse": []
    },
    {
      "author": "JaNa Smith",
      "rating": 4.0,
      "review": "Overall I have had a very positive experience and received my entire deposit back.\nI would recommend Delta to other renters.",
      "ownerResponse": []
    },
    {
      "author": "Natalee neligan",
      "rating": 1.0,
      "review": "Very unprofessional, very rude . a lady has a better than  attitude and just overall not a good ran business. Run the other way if youre trying to rent through them",
      "ownerResponse": []
    },
    {
      "author": "Gana Shagdar",
      "rating": 5.0,
      "review": "Loved their staff, had no problems with them.When we got stationed in Washington we found a really cute town house through Delta property Management. I still miss it",
      "ownerResponse": []
    },
    {
      "author": "Cale Neubauer",
      "rating": 1.0,
      "review": "Worst rental agency I have ever delt with. Ran by a bunch of half wits and they will lie and steal your whole depoist. STAY AWAY FROM THESE PEOPLE! !",
      "ownerResponse": []
    },
    {
      "author": "sneet",
      "rating": 1.0,
      "review": "Take forever to respond, if at all. Will only do showings of properties 9-5 monday-friday. Good luck finding housing through them.",
      "ownerResponse": []
    },
    {
      "author": "Sascha G.",
      "rating": 1.0,
      "review": "Horrible experience with this company!! The owner, Dev, is rude and they will do anything to not give you your deposit back.",
      "ownerResponse": []
    },
    {
      "author": "Carmen Rivera",
      "rating": 1.0,
      "review": "I have a brother who lives in one of their apartments and Stacy is VERY rude and VERY unprofessional I can't believe she's in this type of business...",
      "ownerResponse": []
    },
    {
      "author": "Jennifer Gobel",
      "rating": 1.0,
      "review": "Plain and simple.. stay away from this business.",
      "ownerResponse": []
    },
    {
      "author": "Britney Dickens",
      "rating": 1.0,
      "review": "Avoid at all costs.",
      "ownerResponse": []
    },
    {
      "author": "Chris Towner",
      "rating": 5.0,
      "review": "Very good service.",
      "ownerResponse": []
    },
    {
      "author": "Currin Ross",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Vennesa Cane",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "A T",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "orion rondina",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Vanessa Kimberly",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Brooke Smith",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "FRIEDA DILLON",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Leah K",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Sandra Cabadas",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Kylie Moyer",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "joey jackson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Y Kos",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Christian Williams",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Lexus P",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Lucas Charron",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Viengkham Kittisack",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the 5 Star Review! It was a pleasure working with you!"
        }
      ]
    },
    {
      "author": "mama of_3",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 42,
  "avg_rating": 3.4,
  "adjusted_avg_rating": 3.4,
  "summary": "# Delta Property Management: A Balanced Review\n\nDelta Property Management has established itself as a notable name in property management, boasting a mixed bag of reviews that illuminate both its strengths and opportunities for improvement. Below, we analyze the good, the great, the bad, and the ugly, as reflected in user reviews, to provide a well-rounded perspective. Please note that the information in this article is generated by ChatGPT and is intended to be a tool to help find a property management company or rental property.\n\n## The Good\n\nDelta Property Management's dedication to friendly customer service shines through in numerous user reviews. Tenants often speak highly of the company's responsiveness, embracing the small team's ability to foster relationships. With recurring comments highlighting efficient work and attentive staff, it's evident Delta values customer interaction. This positive sentiment is bolstered by tenants who appreciate Delta's understanding and cooperative nature, especially during challenging times like the pandemic.\n\nBeyond customer service, Delta earns praise for its professionalism and the manner in which it handles maintenance issues. Swift action on repair requests signifies a commitment to tenant welfare. The approach towards property management, particularly with a family feel to the staff interactions, has also been appreciated. These positive experiences seem woven into the fabric of Delta's operations, contributing to their 3.4-star rating.\n\n## The Great\n\nWhen Delta Property Management excels, it does so to a notable degree as some tenants rate their experience unequivocally high. There are reports of Delta not just meeting, but exceeding expectations by going \"above and beyond\" for their clients. Exceptional experiences related to property management skills, like effective tenant placement and real estate sales, demonstrate Delta's capability and ambition to deliver comprehensive services. Additionally, the promptness in addressing tenancy matters and the gracious handling of emergency situations cement the impression of a deeply committed company.\n\nTestimonials from long-term partners speak volumes; some relationships span nearly two decades, reflecting an enduring trust and satisfaction. Clients recommend Delta Property Management heartily, underpinned by consistent professionalism and successful outcomes, such as satisfactory sales and tenant dealings. This high level of satisfaction is echoed by tenants and property owners alike, who enjoy the company's fair and hands-on approach.\n\n## The Bad\n\nOn the flip side, Delta Property Management's image is somewhat tarnished by reports of occasional lapses in communication and timely resolution. Some tenants express frustration over delays, with a few instances of unresolved issues. Property inspections, an essential element of property management, are reportedly being conducted with minimal notice, causing inconvenience to some tenants. The lack of punctuality or perceived neglect could reflect organizational challenges or resource constraints.\n\nMoreover, there are mixed feelings about Delta's staff interactions; while some find them professional, a few describe encounters as unfriendly. Customer service, a backbone of any service-driven business, is occasionally critiqued for not meeting the standards expected by some renters, potentially impacting the overall impression and reputation of the company.\n\n## The Ugly\n\nHowever, Delta Property Management faces its sternest criticism surrounding financial disputes, specifically regarding security deposits. Numerous user reviews lament unclear charges, steep fees for maintenance, and what some tenants perceive as unjustified withholdings post-lease. Such incidents have led to a sense of mistrust among a fraction of Delta's clientele. Troubling reports of troubles with service animals and accusations of unprofessional conduct mar the company's standing further.\n\nDiscontent peaks with allegations of unresponsiveness and rudeness, which, if not addressed, could significantly harm Delta's client relationships and business success. Accounting for the gravity of these concerns is vital; it serves as a crucial reminder that a property management company must constantly strive to maintain fairness, transparency, and respect in all its dealings.\n\nThis article's intent is to offer a comprehensive and impartial perspective based on user reviews, without pinpointing specific individual cases. It is evident that while Delta Property Management has areas of strength, particularly in customer service and maintenance responsiveness, it also faces critical feedback that should serve as a catalyst for improvement and growth."
}