{
  "name": "Integra Condominium Association Management",
  "avg_rating": 1.4,
  "review_count": 10,
  "adjusted_review_count": 10,
  "reviews": [
    {
      "author": "Condo O.",
      "rating": 1.0,
      "review": "Integra has been managing our condo association for about 3 years.  I am disappointed at their idea of increasing the sales appeal of our units by hiding the costs to new buyers who want to live here.  They are aware that high HOA fees are a deterrence to buyers so they suggest to the board lower HOA fees paired with regular annual assessments to fill the reserve funding.  This seems like bait and switch to me, but our board doesn't see this as an act of deception. \n\nIf you are buying a condo make sure you ask if there have been any recent assessments in addition to the HOA fees which are usually published so you understand the actual cost of living in the unit you are considering.",
      "ownerResponse": []
    },
    {
      "author": "Michael P.",
      "rating": 1.0,
      "review": "Where do I start?\nMy Wife and I purchased a Townhouse at Bay Rim Condo's on Birch Bay almost 4 years ago and we thought we'd be there through our retirement but....\nIntegra ruined a good thing!!!\nWorst Property Management Company EVER!!!!\nAnd that's being nice!\nCindy Rae acts like she owns the Property and uses the the HOA Board to start trouble.\nShe is a very Unlikeable person who has a SERIOUS attitude!!\nShe forgets that she works for the people at Bay Rim and I had a few words with her and we decided we were going to move... which we did!\nWorst experience of our lives!!!!\nIf you need a company to manage your Property...find someone else!!!\nThey charge you for EVERYTHING!!\nMove In fees...Move Out fees....total BS if you ask me!\nI've worked in Property Management and this is NOT how you handle a Portfolio!!!\nDo yourselves a favor and stay clear on Integra!!!!!!\nIf I could give NO Stars I would",
      "ownerResponse": []
    },
    {
      "author": "Nicholas E.",
      "rating": 1.0,
      "review": "Not sure how Jenn X. could rate this company five stars? Maybe she is a friend of the company or didn't have many real encounters with them. I wouldn't even give the 1 star if I could. I echo the sentiments exactly of all the other 1 star reviews. I wanna thank these people for leaving these reviews because this company is downright unethical. Terrible service, rude, they will lie and make up stories and do just about anything to get out of taking care of the things they are supposed to take care of. Definitely my worst experience ever with a property management company. You know when so many reviews in a row are one star and all say the same thing you should steer clear. Stay away. Also look at the Google reviews online, same horror stories. I could tell my whole story but just look at all the 1 star reviews before me and you will know my story, exactly the same as what they say. Very dishonest unethical company.",
      "ownerResponse": []
    },
    {
      "author": "Linda D.",
      "rating": 1.0,
      "review": "(If I could give no stars I would.)\n\nDo yourself a favor and run a very long way away from this company. Their rudeness is only exceeded by their questionable ethics. \n\nYou will find better rental and property management companies in the area. These people are the absolute worst.",
      "ownerResponse": []
    },
    {
      "author": "Bob D.",
      "rating": 1.0,
      "review": "This is the worst rental management company I have ever had to deal with.  \n\nThey will steal your application fee. They take application fees to apartments they know they will not be renting to you, and refuse to refund you your money.\n\nTheir customer service is terrible. They will not let you know important information. They will not contact you when there is information you should know about your lease. They charge you for every little thing they can, don't give any of your security deposit back, and charge you fines until you have paid an extra $200/month in fees. \n\nThere was no reason for them to treat me this way. I consistently turned in my rent on time, paid all of my bills and was a quiet and respectful tenant. \n\nI can only hope this stops people from using them as a property management company or from renting from them. It is not worth it.",
      "ownerResponse": []
    },
    {
      "author": "C H.",
      "rating": 1.0,
      "review": "I hope this prevents another person from applying for a rental from Integra.  They are the worst landlord company in Bellingham.  They will take your application fee knowing a listing has already been promised to a different tenant.  It's really akin to theft.  They are rude and unresponsive.  Yuck!  Stay away from this landlord!!!  If I could have given them 0 stars, I would have.",
      "ownerResponse": []
    },
    {
      "author": "Nanette J.",
      "rating": 1.0,
      "review": "I spoke with a woman today named Peggy. She was probably the rudest person I have had to encounter in a long time. I regret that I may have to talk to her again in the future but I can tell you that I will refuse to talk to her. She is definitely a very unhappy person and in the wrong line of work. She tried to belittle me over the phone and that is just not going to happen again. I feel sorry for this company that has this person as their first point of contact.",
      "ownerResponse": []
    },
    {
      "author": "R F.",
      "rating": 1.0,
      "review": "Haven't even bought the condo under their management yet and I already don't like them. I called to ask questions and Tess could not have been less helpful. She just kept saying \"did you read the certificate?\" Yes. I did. It is a legal doc and I just wanted quick clarification because, Hey, Tess, this is your area of expertise, not mine! I think you could do with a course in customer service skills because that is my area and you would be fired! I am buying a condo and can't wait to recommend that Integra be replaced!",
      "ownerResponse": []
    },
    {
      "author": "Jenn X.",
      "rating": 5.0,
      "review": "We have had nothing but amazing service from Integra during our 6 years with them! I wish they could take over the rest of our condo association!!!\nMy admiration of them went up even more recently when they took over and handeled everything for us when our tenants abandoned the unit. They're AMAZING!!!!!!!",
      "ownerResponse": []
    }
  ],
  "company_type": "company",
  "address": "2183 Alpine Way Bellingham, WA 98226",
  "adjusted_avg_rating": 1.4,
  "summary": "# Integra Condominium Association Management: A Mixed Experience\n\n## Good\n\nWhen it comes to property management, every story has two sides. In the case of Integra Condominium Association Management, there is a shimmer of positivity provided by a sole user review. This lone beacon in a sea of discontent speaks of exceptional service received over an impressive span of six years. The reviewer's satisfaction is emphatically highlighted by their desire to see Integra expand its management coverage within their condominium association, signaling a level of trust and administrative competence.\n\nTaking a step further, the same reviewer recounts an instance wherein the company demonstrated significant responsiveness and professionalism: Integra commendably handled a situation involving tenants who abandoned their unit. This act of quick and effective management showcases the company's capacity to resolve crises and ensure the smooth operation of their managed properties. Such experiences, albeit rare in the gathered user reviews, suggest that the company does possess the capability to perform well when they do get it right.\n\n## Great\n\nContinuing with the positive aspects noted in the user reviews, the above-mentioned reviewer’s satisfaction with Integra’s performance is worth merit. An enduring professional relationship of six years is not trivial, and indeed points toward a consistent delivery of service that meets the expectations of at least some clients. The actions taken by the company in the face of tenant abandonment are portrayed as proactive and thorough, alleviating concerns for the property owner involved.\n\nIt's also worth noting that good property management can often go unnoticed, as tenants and property owners may take seamless operations as a given. In this instance, the positive feedback, though singular, emphasizes important qualities one might seek in a property management firm: longevity, reliability, and capability in crisis resolution. Such traits, when demonstrated, are the pillars upon which successful property management firms are built.\n\n## Bad\n\nUnfortunately, the bad seems to outweigh the good significantly. Multiple user reviews express a sense of disappointment and frustration with Integra’s management strategies. Customers speak of a non-transparent financial approach, which involves recommending low HOA fees coupled with frequent assessments. This is perceived by at least one condo owner as a bait-and-switch tactic, potentially misleading new buyers about the actual costs associated with their properties.\n\nPoor customer service is another recurrent theme in the user reviews. The accounts speak volumes of communications mishandled and essential information withheld. There are accusations of unprofessional behavior and inconsiderate treatment towards clients, painting a troubling picture. The company's approach to management, as described by these users, falls considerably short of expected standards, contributing to an overall negative impression.\n\n## Ugly\n\nDigging into the deeper issues, several user reviews outline experiences that border on the egregious. There are strong allegations of unethical behavior, including taking application fees under false pretenses and a general lack of responsiveness. One reviewer went as far as to describe their interaction with the company as the \"worst experience\" of their lives, making a point to caution potential clients against engaging with Integra for property management services. \n\nThen there’s the matter of customer respect and ethical conduct, which other reviews suggest is sorely lacking. Descriptions of rudeness, deception, and a blatant disregard for customer satisfaction recur throughout the user complaints. With such serious and consistent issues raised, it paints a regrettable portrait of a company potentially shirking its responsibilities, betraying trust, and failing to fulfill the primary directive of a property management company, namely to alleviate the stresses of property management for owners and tenants alike.\n\n---\n\nIn this article, we have presented a balanced overview based on user reviews of Integra Condominium Association Management, while ensuring that specific personal information was kept confidential. This article's intent is to serve as a guide for individuals looking for insights into the company's operations and track record. These reviews are generated with the help of ChatGPT and should be utilized as a foundational tool to inform those in search of a reliable property management firm."
}