{
  "name": "Tullwood Apartments",
  "address": "4370 / 4380 Tull Rd, Bellingham, WA 98226",
  "company_type": "Apartment complex",
  "review_count": 66,
  "reviews": [
    {
      "author": "Kyleigh K",
      "rating": 5.0,
      "review": "Due to some very unfortunate circumstances I had to move out of my old place with little to no notice. When we saw a place available with Tullwood Apartments, my roommate and I jumped at the opportunity. On a Friday afternoon, we drove to ",
      "ownerResponse": []
    },
    {
      "author": "Renelle Leinbach",
      "rating": 4.0,
      "review": "Dan is amazing!  My daughter recently moved there and I'm in another state.  He has been so helpful. (carrying up large packages,  watching out for my daughter, answering my questions quickly and helping us resolve leasing and key issues ",
      "ownerResponse": []
    },
    {
      "author": "Eric Mike Sloan",
      "rating": 5.0,
      "review": "The newest property manager, Dan Wilson, is getting stuff. We've asked for basic improvements for a few years now. Dan has been knocking them out of the park since he started here a few months back. We finally got carport lights replaced, ",
      "ownerResponse": []
    },
    {
      "author": "Matt F",
      "rating": 5.0,
      "review": "The apartments are spacious clean and modeled very nice. I love the fact that it's a secure building with an amazing manager, Amy. Amy who goes beyond her daily duties to make sure the tenants are well taken care of and safe. She's very ",
      "ownerResponse": []
    },
    {
      "author": "Crystal Rogers",
      "rating": 5.0,
      "review": "The apartments are well maintained. The property manager Dan was also very helpful when I was having car issues and helped me get a jump on my battery.",
      "ownerResponse": []
    },
    {
      "author": "Samantha Mantey",
      "rating": 5.0,
      "review": "Love living here. Amy is the sweetest most awesome building manager ever. They are incredibly nice and work with you about pets. The buildings are armed so you have to buzz in. The walls are super thick so you almost never hear your side ",
      "ownerResponse": [
        {
          "text": "Thank you for the review! We love having you here in our lovely community!"
        }
      ]
    },
    {
      "author": "Donna Berger",
      "rating": 3.0,
      "review": "The gated community is nice. The manager is very helpful. But the apartment complex is surrounded by woods that are full of homeless people and is dangerous at times to take your trash out even there is an 6 foot fence with security wire around it.",
      "ownerResponse": []
    },
    {
      "author": "Aura Leigh",
      "rating": 5.0,
      "review": "Amy the property manager is really nice and seems to genuinely care about the wellbeing of her tenants. I feel safe here which is really important to me. I have plenty of space in my unit; a washer and dryer in an actual laundry room, a ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind review! I am happy to hear you are enjoying your apartment, and you feel safe here. We are working hard to tackle any and all safety concerns, and it is good to know our efforts are helping tenants feel safe in their homes. Thank you!"
        }
      ]
    },
    {
      "author": "Tara Mallon",
      "rating": 5.0,
      "review": "We are truly blessed to of found Amy and Tullwood Apts. We lost everything in the floods that hit Sumas in Nov 2021 and I wasnt sure if I would even find a place for my family on such short notice. Thankfully a friend of mine told me about ",
      "ownerResponse": []
    },
    {
      "author": "Kyria Taylor",
      "rating": 5.0,
      "review": "Such an amazing cozy place to live. Neighbors are all friendly and keep to themselves! I never hear anything above or to the sides of me  Amy the PM is such a sweet heart and has been helpful to my boyfriend and I since day ONE! She just helped us access rental assistance and lifted MONTHS of weight off of our shoulders! ",
      "ownerResponse": []
    },
    {
      "author": "Tris88",
      "rating": 5.0,
      "review": "We had been displaced due to the flood we got Approved to move in here and then just a week later had severe family problems and couldn't move in. Then a month later we were in desperate need again and I texted Amy. She had saved all my ",
      "ownerResponse": [
        {
          "text": "It is my pleasure to help! That is the best part of my job. Thank you for being pro-active and trusting me to help you get over the bumpy road on on your way to better days!"
        }
      ]
    },
    {
      "author": "Dominic Reyes",
      "rating": 5.0,
      "review": "Im one of the business partners and have been working with this property and Amy the manager for almost 5 years, she has been a huge asset to my performance. She is always willing to spend time on how we can align our goals to help each ",
      "ownerResponse": []
    },
    {
      "author": "Juan Rodriguez",
      "rating": 5.0,
      "review": "I have lived at these apartments for about a year and I have no complaints. The manager (Amy) has always listened to our requests and has gotten our maintenance requests done at a convenient time. She takes care of this place like it is her ",
      "ownerResponse": [
        {
          "text": "Thank you for your 5 star review! We are happy to have you here at Tullwood!"
        }
      ]
    },
    {
      "author": "Kelly Todd",
      "rating": 5.0,
      "review": "My husband and I love living here! Amy the on-site manager is very professional and respectful, shes always willing to help, she definitely goes the extra mile, weve been here 13 years and dont plan on going anywhere.",
      "ownerResponse": []
    },
    {
      "author": "Anthony",
      "rating": 5.0,
      "review": "Been living here for over 1 year.. parking is great, the property manager is attentive and consistently goes above and beyond what is expected.  The rent is starting to climb closer to my own personal ceiling, but look forward to staying ",
      "ownerResponse": [
        {
          "text": "Thank you for the updated review! So glad you are still here and happy!"
        }
      ]
    },
    {
      "author": "Isabel Rodriguez",
      "rating": 5.0,
      "review": "I have thoroughly enjoyed and appreciated my time here at the Tullwood apartments. Amy, the manager, is great at communicating with the tenants on expectations for the building and gives ample notice before entering tenants apartments (and ",
      "ownerResponse": [
        {
          "text": "We appreciate you taking the time to leave such a nice review! Happy to have you here at Tullwood with us, Isabel!!"
        }
      ]
    },
    {
      "author": "Pat Ryan",
      "rating": 4.0,
      "review": "I enjoy my unit, it's a good size, recently updated, price is fair, and it's pet friendly. Amy is a great property manager who seems to genuinely care about the tenants here. Any complaints I have are of no fault of the management.",
      "ownerResponse": [
        {
          "text": "Thank you for the nice review! Please feel free to contact me if there is anything I can do to improve your time here at Tullwood."
        }
      ]
    },
    {
      "author": "Nathan Bradley",
      "rating": 1.0,
      "review": "Tons of homeless and druggies in and out,  gated community is hardly ever really gated as the main entrance is always stuck open.  Parking is a nightmare.  Spaces are so tight and many residents take up 2 spots. Playground is soo old and ",
      "ownerResponse": [
        {
          "text": "I'm sorry to hear about her bad experience here at Tullwood.  Over the last 5 months a lot has changed.  The gates have been working perfectly and the the homeless from the nearby encampment have been staying out.  A new playground has been  More"
        }
      ]
    },
    {
      "author": "Devin Hart",
      "rating": 5.0,
      "review": "My boyfriend and I have been living here for just over 6 months, our first apartment ever, and we love it here! Amy is super awesome and on top of things. She takes the security of the place very seriously which is awesome. Tullwood apartments are awesome highly recommend this place!!",
      "ownerResponse": [
        {
          "text": "Thank you for the review! I am so glad your first apartment experience has been a positive one!"
        }
      ]
    },
    {
      "author": "Eric",
      "rating": 3.0,
      "review": "update: things seem to have gotten a bit better again. good on the property manager for doing what they can so I added a star. ",
      "ownerResponse": [
        {
          "text": "Eric - Thank you for your review. I understand your frustration with the rules not being followed. Unfortunately my hands have been tied the last year to enforce them, but I am now able to do more to make sure the tenants respect eachother  More"
        }
      ]
    },
    {
      "author": "Jamie Lorden",
      "rating": 5.0,
      "review": "My daughter rents at Tullwood Apts and I have never been happier with a property manager that's on site. Amy has been the most amazing, understanding and kind property manager. She has gone above and beyond for my daughter and grandson from day one! So nice that there are people who care. Thank you Amy!!",
      "ownerResponse": [
        {
          "text": "Thank you for your kind review. Your daughter is a lovely part of our community and I enjoy having her here!"
        }
      ]
    },
    {
      "author": "Ashley McCarty",
      "rating": 5.0,
      "review": "Loved the apartment that I lived in! Loved the location of the complex. Loved that I had a washer and dryer in my apartment.  Now the manager on the other hand was super nice until she decided to fine me for everything she could possibly ",
      "ownerResponse": [
        {
          "text": "unfortunately, there were several lease violations that affected the community and the cost to make repairs to the unit from tenant-caused damages were extensive."
        }
      ]
    },
    {
      "author": "Cole Miller",
      "rating": 5.0,
      "review": "Amy, the on site manager is, in my opinion a very nice and caring person. Not only does Amy take her job as serious as a surgeon, but she is constantly fighting for the safety and well beings of her tenants. I consider myself very lucky to have found this place.",
      "ownerResponse": [
        {
          "text": "Thank you for the review! We are so glad you are happy at Tullwood."
        }
      ]
    },
    {
      "author": "kayla coppock",
      "rating": 5.0,
      "review": "Nice apartments. Neighbors are pretty nice. Very clean property. The manager Amy is great! Met all my needs and overall great attitude throughout the whole process. Shes pretty quick to respond if theres an issue. Best property I've rented ",
      "ownerResponse": []
    },
    {
      "author": "Ning Ma",
      "rating": 5.0,
      "review": "My husband and I were looking for a temporary lease before our move to Canada and Tullwood Apartments were one of the few places that did month to month leasing so we signed with Amy. Honestly, I never thought I would have such an amazing ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind review. It was a pleasure having you here, I am so glad I was able to create a good experience for you!"
        }
      ]
    },
    {
      "author": "Derek Boyle",
      "rating": 5.0,
      "review": "Lived there for 2 years and no complaints. Any issues we had, our property manager Amy took care of it diligently and quickly! Move in and move out was easy with no stress. Great location and fair on rent.",
      "ownerResponse": [
        {
          "text": "Thank you for your review! I am glad you had a good experience here at Tullwood."
        }
      ]
    },
    {
      "author": "Jamie Lea",
      "rating": 1.0,
      "review": "Disgusting, filthy hallways. Needs painted. Paint is peeling everywhere. No work is done on these apartments to keep them looking decent. Pee stains on carpets in the hallways. Shredded carpet.",
      "ownerResponse": [
        {
          "text": "Thank you for your honest review, and I'm sure everyone else would agree about the carpet smell.  However, since taking over as manager not long after you posted this review, I have had all the carpets removed and replaced with vinyl plank  More"
        }
      ]
    },
    {
      "author": "Natasha Aven",
      "rating": 5.0,
      "review": "I love these apartments. I love that they are fully secured it makes me feel very safe with 2 kids running around. Amy the property manager of fantastic everytime I need something fixed it is done within 48 hours and if I  have a question or concern she is always there to answer it for me weather over email or on person!!",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words Natasha! Safety is my top priority at Tullwood, and I am glad you feel comfortable as a part of our community."
        }
      ]
    },
    {
      "author": "Dawn Gutierrez",
      "rating": 1.0,
      "review": "These four & five star reviews are because the Property Manager Amy handed out gift cards to Starbucks if they would write a good review!  Not unbelievable if she still works there.....the WORST property manager I've ever encountered AND the common areas are disgustingly filthy!  DO NOT MOVE IN UNLESS YOU'RE DESPERATE",
      "ownerResponse": [
        {
          "text": "Thank you for your review Dawn. In the interest of full disclosure, I give out Woods coffee cards to tenants when they are spotted doing a good deed, like helping a neighbor or going out of their way to keep the community safe. I also have  More"
        }
      ]
    },
    {
      "author": "Barbara Bonstein",
      "rating": 3.0,
      "review": "A few things make this a lower end property, unfinished edges, dips in the creaky floor, dog smell and misfitted toilet seats are a few. Being gated is great but not when the property isn't really worth it.",
      "ownerResponse": []
    },
    {
      "author": "Maegan D",
      "rating": 5.0,
      "review": "Amy is the best landlord Ive ever had she truly cares about her tenants and does whatever she can to help them with almost anything.",
      "ownerResponse": []
    },
    {
      "author": "Kimberly Slover",
      "rating": 4.0,
      "review": "My family and I have lived here for almost a year now under the new management of Landmark. We moved here from Kennewick, Wa. Since our moving in they have replaced all carpets in the hallway, and rec room and also fresh paint making it ",
      "ownerResponse": [
        {
          "text": "Thank you Kimberly for your kind and honest review. The Landmark Team stands behind you and all our residents in making sure your living experience is one of the best."
        }
      ]
    },
    {
      "author": "Melanie Osborn",
      "rating": 4.0,
      "review": "I enjoy it.  There are obviously more fancy apartments to be had, however, this place is affordable and secure.  Management is responsive and kind.   Great location.  I feel at home at Tullwood and really that's all that matters.",
      "ownerResponse": [
        {
          "text": "Thank you for the review! We are so happy you have decided to make Tullwood your home and you feel safe and you feel safe and secure here."
        }
      ]
    },
    {
      "author": "Chelsee Autry",
      "rating": 5.0,
      "review": "Amy is an amazing property manager, compassionate and understanding, kind, and helpful. So hard to find a nice place to live these days, Im glad we did!",
      "ownerResponse": [
        {
          "text": "So glad you call Tullwood home! Long term tenants like you make this place a great community! Thank You!"
        }
      ]
    },
    {
      "author": "Christina Rodgers",
      "rating": 1.0,
      "review": "This place is really dirty and in poor condition and the owner is really rude. She once stayed at a hotel I worked at and her room was really dirty there was food and garbage everywhere so I guess it doesn't surprise me at all. There's ",
      "ownerResponse": [
        {
          "text": "Hello Christina. I was hoping to reach you in order to address the issues in your review, but unfortunately I cannot find any contact information as you are not a current or past tenant. If you are sure you are speaking of the correct  More"
        }
      ]
    },
    {
      "author": "Rose Mundt",
      "rating": 5.0,
      "review": "well insulated apartments and no noise audible from neighboring apts. Quiet complex. Surrounding trees give a country feel despite being a block + from Walmart  (not visible from apts.) Friendly neighbors and great manager!",
      "ownerResponse": []
    },
    {
      "author": "Elisiah Campbell",
      "rating": 1.0,
      "review": "Surrounded by violent homeless drug addicts. The city doesn't do anything.",
      "ownerResponse": [
        {
          "text": "Thank you for your review, however, the issues outside of the Tullwood Apartments are beyond our control.  The people living in the encampment stay outside of our gates and do not enter our community.  We have not had a single incident  More"
        }
      ]
    },
    {
      "author": "Miss VaSge",
      "rating": 4.0,
      "review": "Great place to live, sense of community and great onsite property manager. Always feel safe here. Pleased to call it home.",
      "ownerResponse": [
        {
          "text": "Thank you for the nice words! We are happy to have you as part of our little community!"
        }
      ]
    },
    {
      "author": "J",
      "rating": 5.0,
      "review": "Enjoyed our time at the complex. Good management that works with you and responds to calls or text messages. Highly recommend this complex to anyone looking in the Bellingham area.",
      "ownerResponse": [
        {
          "text": "Thank you for the nice review! We enjoyed having you here!"
        }
      ]
    },
    {
      "author": "Jenna Kennedy",
      "rating": 2.0,
      "review": "Not as nice as I expected. The hallways and elevators are dim, musty, and in need of updating. Probably not worth the arm & leg being charged for rent.",
      "ownerResponse": [
        {
          "text": "Thank you for your review! Updating the hallways with fresh paint, carpet, and automatic air fresheners are actually on our list of \"winter projects\", so I appreciate you reiterating the need for this. We expect to have  all of them fresh,  More"
        }
      ]
    },
    {
      "author": "Michael S",
      "rating": 5.0,
      "review": "Great place to live, safe and secure with great on site management.",
      "ownerResponse": [
        {
          "text": "Thank you for the review! I am glad you are happy at Tullwood and have chosen it to be your home."
        }
      ]
    },
    {
      "author": "Kris W",
      "rating": 2.0,
      "review": "Worst apartment complex and property management company known to man.. If you have half a mind, you won't think about living here.",
      "ownerResponse": [
        {
          "text": "Tullwood Apartment Homes is under new ownership and management effective January 2013. Professionally managed by Landmark Real Estate. We welcome your comments, suggestions and ask that you visit our community and experience the positive change that has taken place since the transition."
        }
      ]
    },
    {
      "author": "Timmers Russell",
      "rating": 5.0,
      "review": "Nice apartments and going to be soon a gated community!",
      "ownerResponse": [
        {
          "text": "We are gated! Yay!"
        }
      ]
    },
    {
      "author": "Bshk Bob",
      "rating": 4.0,
      "review": "These are apartments that I've been to not bad I guess",
      "ownerResponse": []
    },
    {
      "author": "Adriana Sabalza",
      "rating": 1.0,
      "review": "Horrible  management and lots of cockroaches",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to write a review.  I'm happy to say that I have taken over as manager since you left this review and in the last 5 months I've made a lot of improvements to the property.  I have never had a report about  More"
        }
      ]
    },
    {
      "author": "usethissoftware",
      "rating": 4.0,
      "review": "The management is friendly and cooperative. Just really expensive.",
      "ownerResponse": []
    },
    {
      "author": "Donna Rambis",
      "rating": 5.0,
      "review": "Love it",
      "ownerResponse": [
        {
          "text": "Thank you for your 5 star review of your property!"
        }
      ]
    },
    {
      "author": "monique Taylor",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your review!"
        }
      ]
    },
    {
      "author": "Brianna McCourt",
      "rating": 3.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to post a review of our property!"
        }
      ]
    },
    {
      "author": "Jacqueline Hamilton",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your 5 star review of Tullwood Apartments!"
        }
      ]
    },
    {
      "author": "Jeffrey Benz",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hello Jeffrey - I do not see that you are a current or past tenant of Tullwood Apartments. Is there something I can help you with? I am happy to address any issues you may have with the property to create a better experience. Please feel free to contact me at tullwoodapts@visitlandmark.com. - Thank you - Amy, Property Manager."
        }
      ]
    },
    {
      "author": "Jacob Dille (Jake)",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "c",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Mary DePoppe",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your review!"
        }
      ]
    },
    {
      "author": "Melisa Downing",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the great review! We are happy to have you back at Tullwood!"
        }
      ]
    },
    {
      "author": "kelly daniels",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Brenda Martinez",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hello Brenda! Thank you for taking the time to submit a review. I strive to make Tullwood a pleasant place, even for guests. Please feel free to contact me if there is something I can help you with. tollwoodapts@visitlandmark.com"
        }
      ]
    },
    {
      "author": "Jamie Franklin",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to leave a review!"
        }
      ]
    },
    {
      "author": "Raymond Martinez",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "rosemerrie mundt",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Johnnie Sparks",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "jorge garfias",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "r whitehead",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Daniel Chavitage",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Michael Vargas",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Regeinia Suit",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 47,
  "avg_rating": 4.0,
  "adjusted_avg_rating": 4.1
}