{
  "name": "Evergreen Ridge Apartments",
  "avg_rating": 1.0,
  "review_count": 42,
  "adjusted_review_count": 30,
  "adjusted_review_average": 3.1,
  "reviews": [
    {
      "author": "Michelle G.",
      "rating": 1.0,
      "review": "I rented here for six years , the worst place ever ! Don't let the new paint they put on the outside and new windows and cheap blinds make you think they are nice . This new management is the worst. My unit flooded due to an explosion's of the expansion tank. They have 3 days to fix it . By law they have to offer you either another unit or a hotel. They said it would take one week to repair . When I asked the manager what they were doing to fix it they said oh dry the carpets out and your good to go. This happened on the 4th of November 2023. It was still not repaired when I moved out. I gave my notice as I asked them to replace the very old already stretcher out carpet and they had just sent on the 28th of November someone to asses the drywall damage as it had over two inches of water through the entire apartment, it was all declaired damaged so still no repairs. The water was left off and they put up no safety warnings for the water in the unit to stay out or anything. they didn't ask if i had a place to go or if i needed a place they never followed up to let me know what was going on with the unit but had me pay rent for the entire month . I was in it for 4 days . they had heaters running and fans for 24/7 days a week. My power bill never past 100 a month was over 200.00 and they also sent me a notice to inform me my rent was short and that they had added late fees for a unit i couldn't even stay in. i found out from several other tenants that they expansion tanks had also flooded their unit which meant they had never serviced them or done any checks on any of the hot water heaters following several floods continued to let them happen instead of replacing the 1995 expansion tank they had in the units. these by law are to be inspected once a yr. This place is awful the manager wouldn't answer our calls she was screening them. if any others want to come forward about there unit flooding at evergreen ridge i am taking them to small claims court in the process of filing now and have a good strong case for rent deposit as we cleaned without water. also for the cost of the 1000 deposit on new unit and extra expenses for the month i coach surfed. my things were al in my unit ruined and i expect payment for this . I have been stressed out and treated terrible by the management. No notices given when many people entered my apartment and a 48 hour notice must be issued leaving my things exposed and vulnerable to anyone who walked in my unit. Find another place do not move here they are money hungry unkind and  cheap.",
      "ownerResponse": []
    },
    {
      "author": "johnathan Hawkins (Guy)",
      "rating": 1.0,
      "review": "As of right now They like to tow cars and they have no signs up on who tows the car. After there remodel they have no signs up. So just call the cops to find out where your car goes.",
      "ownerResponse": []
    },
    {
      "author": "Andres Moreno",
      "rating": 5.0,
      "review": "The place is excellent, very clean and organized, the attention is ideal, they are very considerate.\nThe manager John is very attentive he cares about making you feel welcome and solving any concerns that arise.",
      "ownerResponse": [
        {
          "text": "Thank you Andres, we're very happy to have you here!"
        }
      ]
    },
    {
      "author": "Autumn Archuletta",
      "rating": 1.0,
      "review": "If I could give a 0 I would. The new owners are supposedly a non profit and these are income restricted. So why, in a single increase, was my rent raised by $890!? There is mold everywhere from previous water damage that I wasnt told ",
      "ownerResponse": []
    },
    {
      "author": "Karaoke Kitten",
      "rating": 5.0,
      "review": "I have lived at Evergreen Ridge apartment for 5+ years and my experience here has been exceptionally pleasant! The management and maintenance are very accommodating and friendly. The apartments are well cared for, clean and inviting. Pet ",
      "ownerResponse": []
    },
    {
      "author": "Pretty Betty",
      "rating": 5.0,
      "review": "I have lived here 5 plus years. The apartments are nice. It's clean and quiet. Our management/maintenance team are the best!! They are very helpful and always fix things right away. Both are very personable and kind.",
      "ownerResponse": [
        {
          "text": "Thank you for the kind words, we're happy to have you here!"
        }
      ]
    },
    {
      "author": "Helen Steele",
      "rating": 5.0,
      "review": "Great staff and a great location and within walking distance from two shopping centers, post office, restaurants and movie theatres.  The place has been relatively quiet, safe with a good sense of community. At this complex  a tenant may ",
      "ownerResponse": [
        {
          "text": "Thank you Helen, we appreciate you!"
        }
      ]
    },
    {
      "author": "Debbie Perez",
      "rating": 5.0,
      "review": "I have lived here for 2 years, going on 3. I am happy with my apartment. Management is kind and friendly. Maintenance is taken care of in a timely manner. Grounds are kept up nicely. Any concerns are always dealt with. I would recommend Evergreen Ridge Apts..",
      "ownerResponse": [
        {
          "text": "Thank you Debbie! We appreciate you and hope to have you as a tenant for many more years!"
        }
      ]
    },
    {
      "author": "B",
      "rating": 5.0,
      "review": "Evergreen Ridge apartments is a wonderfully maintained property with a very professional and caring manager. The maintenance manager is available 24 hours a day and does great work in a timely manner. Location is perfect near Barkley and a few minutes to the freeway.",
      "ownerResponse": [
        {
          "text": "Thank you for your review!"
        }
      ]
    },
    {
      "author": "Rose Flush Lawrence",
      "rating": 1.0,
      "review": "The managers at these apts. are very rude and was in a very bad mood when i inquired about them the lady and the gentleman think they have so much control with peoples lives I witnessed this one day when the manager was going to kick out a ",
      "ownerResponse": []
    },
    {
      "author": "Damascus Ventica",
      "rating": 1.0,
      "review": "LIES!\nJust so everyone knows, if you're looking for an honest genuine review, \"Google\" is not the place for that (nor is anywhere else on the internet). ",
      "ownerResponse": []
    },
    {
      "author": "Gabby Jacobsen",
      "rating": 1.0,
      "review": "Awful management! I signed a lease to live  here with a roommate I found on Craigslist. Within a month I was being physically  threatened  and it wasn't a safe environment  for me or my puppy. The management knew the situation, but still ",
      "ownerResponse": []
    },
    {
      "author": "anne rupe",
      "rating": 5.0,
      "review": "I moved into evergreen ridge appartments mar 2020. you will find lots to do .There is a gym and sauna up at the main office also a television room, vending machines and washer and dryers for the confinience of the residents,and an outdoor ",
      "ownerResponse": [
        {
          "text": "Thank you Anne, we love having you here!"
        }
      ]
    },
    {
      "author": "L D",
      "rating": 5.0,
      "review": "I've lived here for 15 years, and seen many landlords, and have hardly had trouble with any of them. If you mind your own business, take care of your space, and are respectful, you won't have problems. I don't know what  people are whining ",
      "ownerResponse": [
        {
          "text": "We appreciate your tenancy and hope to have you here for another 15 years!"
        }
      ]
    },
    {
      "author": "purplejabc",
      "rating": 1.0,
      "review": "The so called manager doesnt deserve even one star. She is a bully and doesnt care about her tenants. I could tell a story about the flood in my apartment caused by the maintenance man at the time. The so called manager treated me like it was my fault that the pressure tank exploded.",
      "ownerResponse": []
    },
    {
      "author": "Maksym Lord_Ehrgeiz Sinov",
      "rating": 5.0,
      "review": "I lived here for two years and I had some issues with neigbors being a mix of a methhead and a druncard, but that has nothing to do with a place, so I'm going to rate it with 5. I like management, every issue I had  with either an aplience ",
      "ownerResponse": []
    },
    {
      "author": "Sherrie Wright",
      "rating": 4.0,
      "review": "We've been happy here. Management is responsive and friendly. Close to Barkley Village, steps to the bus stop. Downtown or the mall are both about a 10 minute drive.",
      "ownerResponse": [
        {
          "text": "Thanks Sherrie! We're happy to have you here!"
        }
      ]
    },
    {
      "author": "Macy Nuber",
      "rating": 5.0,
      "review": "Management is very friendly and helpful! Apartments are well maintained and the maintenance guy is extremely nice. This is a wonderful place to live!",
      "ownerResponse": [
        {
          "text": "Thanks Macy, we appreciate you!"
        }
      ]
    },
    {
      "author": "Audrey Schuman",
      "rating": 5.0,
      "review": "Love the apartments! Very quiet for being at a crossing of two bigger streets. Timely response with maintenance and management with responsible response to the current COVID guidelines.",
      "ownerResponse": []
    },
    {
      "author": "Helen Steele",
      "rating": 5.0,
      "review": "Great location.  Good and clean clubhouse, gym and laundromat.  The new manager is worth a 5.  Two bus stops right at the premises.",
      "ownerResponse": [
        {
          "text": "Thank you Helen! We appreciate you very much!"
        }
      ]
    },
    {
      "author": "Prince Rabang",
      "rating": 1.0,
      "review": "This place would be wonderful if they didn't have the management there now very awful people and they are not worth getting rated one star it is for sure a minus star please people find other apartments to rent!!!!",
      "ownerResponse": []
    },
    {
      "author": "D A",
      "rating": 1.0,
      "review": "They took my application fee and didn't even bother to call and let me know I didn't qualify based on their unreasonable requirements.",
      "ownerResponse": []
    },
    {
      "author": "kingskrown420",
      "rating": 5.0,
      "review": "Wonderful staff. Well kept. Living there felt safe relaxing and reliable.",
      "ownerResponse": []
    },
    {
      "author": "Jesse Bowen",
      "rating": 1.0,
      "review": "Not sure they have any idea what they're doing, renter beware.",
      "ownerResponse": []
    },
    {
      "author": "david cummins",
      "rating": 1.0,
      "review": "very bad manegement",
      "ownerResponse": []
    },
    {
      "author": "BooN DocK",
      "rating": 1.0,
      "review": "Worst management ever",
      "ownerResponse": []
    },
    {
      "author": "Sao Scar",
      "rating": 1.0,
      "review": "Bad management",
      "ownerResponse": []
    },
    {
      "author": "mike hurst",
      "rating": 2.0,
      "review": "Terible management",
      "ownerResponse": []
    },
    {
      "author": "Andrea Starbird",
      "rating": 4.0,
      "review": "Nice place.",
      "ownerResponse": []
    },
    {
      "author": "Laury Estrada",
      "rating": 5.0,
      "review": "I love the location of the place, it is a very quiet place with good neighbors, we have lived here for 2 years and I think we would not change it for a while",
      "ownerResponse": [
        {
          "text": "Thank you Laury, happy to have you here!"
        }
      ]
    },
    {
      "author": "Grant Boyer",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "AALIYAH HAGEN",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Edy Mendoza",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thanks Edy!"
        }
      ]
    },
    {
      "author": " ",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Katie Boutwell",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Maxwell Grigsby",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Randy Robinson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Adrian Butler",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jennie Dennis",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thanks Jennie, happy to have you here!"
        }
      ]
    },
    {
      "author": "Story Bookweather",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Serge Ageyev",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "3451 Woburn St Bellingham, WA 98226",
  "avg_review": 3.0
}