{
  "name": "Village At Baker Creek",
  "avg_rating": 2.1,
  "review_count": 44,
  "adjusted_review_count": 38,
  "adjusted_review_average": 2.3,
  "reviews": [
    {
      "author": "Mike A.",
      "rating": 1.0,
      "review": "I'd give zero if I could. The mgmt staff here is very unprofessional and do things that should get them fired, from screaming at tenants to keeping the fitness room closed while health department isn't requiring it. They selectively enforce rules ( I see dogs off leash all the time, I went out after waking up to let my dog go to the bathroom for 3 minutes, not a walk, and the old lady screamed at me from across the street, then sent a notice to comply or vacate threat which is supposed to come after 3 warnings). I hate moving but may consider leaving after the 1st year just because of the office staff. Maintenance is nice and on their tasks, A+ for them. Parking is a nightmare. The units to the right of the complex (which I reside in) are old and not well kept, but come with a higher price (although lower than new construction). The unit was dirty when I moved in and had to deep clean it myself, even though they will charge me a cleaning fee when I move and not clean the apt again. Pretty slummy actions on just the mgmt staffs end Location is great, could be a nice complex with competent mgmt.",
      "ownerResponse": []
    },
    {
      "author": "Raphael G.",
      "rating": 5.0,
      "review": "Great location in town near all the shops clean and well maintained ample parking.",
      "ownerResponse": []
    },
    {
      "author": "Lisa W.",
      "rating": 1.0,
      "review": "Lived here 5 years, always paid the rent and bills on time,  never asked the management for anything except once to repair the broken washing machine...the washer - dryer unit finally got replaced with an older one after more than a month with no washer-dryer.. Didn't complain and just used it when I finally got it. I have been a homeowner and a landlord myself ... I cleaned the place conscientiously and thoroughly when I moved out, did not damage anything, including the walls, but still got charged a $125 cleaning and painting fee. (in addition to the deep carpet cleaning fee which was an expected cost).  When asked to explain the cleaning fee, the current manager was rude, disrespectful and nitpicking. In retrospect I should not have even bothered to take such time and care cleaning the unit before I left, since there was no appreciation expressed and they only look for ways to keep your money however they can. Not impressed. Bad management and interpersonal skills. My car was broken into, parked in front of my unit, and things were stolen... after reporting it to the management, they agreed to notify the other tenants, but they did nothing. \nDon't expect to get back your security deposit and don't expect to be treated in a courteous or professional manner if you ever have to ask the management about anything at this complex. So glad to have moved out and bought my own place now. I hope the manager learns some management skills and how to be courteous with people. And lesson learned: don't bother cleaning the unit when you move out because you won't get your rightful security deposit back, anyway.",
      "ownerResponse": []
    },
    {
      "author": "Paige N.",
      "rating": 5.0,
      "review": "Not sure what all the bad reviews are about. I've lived here for just about 9 months so I haven't gone through a lease renewal but so far this place has been awesome. Management has been great and super friendly and helped out with any issues or questions I've had in a timely manner. Maintenance requests have always been taken care of either same day or the next day as long as it's not on a weekend (I imagine they would tend to urgent issues on the weekend too). The maintenance guy is super friendly and always cracking jokes and says hello anytime you pass him by.\nI really love the apartment because there's hardly any freeway noise, the unit and deck are both very spacious, the place has a nice view, it's a very central location to Bellingham, parking has never been an issue and its affordable for Bellingham prices. Of course issues can arise when either ending a lease or renewing so I'll update if that's the case but I really don't imagine having any issues considering how great it's been so far.",
      "ownerResponse": []
    },
    {
      "author": "Patience M.",
      "rating": 1.0,
      "review": "Management is the worst here that I have ever seen. They do not care about anybody except themselves, they close down the office whenever without telling anybody, they send back your packages without warning you, and they do not care for your safety or wellbeing. During my time living at Village, they tried to increase my rent mid-lease and when I asked them about it they refused to fix the lease, reduce my rent, told me I was wrong and that if I don't pay it that I'll be late on rent and will have to pay added fees. Told management I knew my legal rights and they better fix this, so they agreed to look into it and get back to me. They never got back to me and forced me to hunt them down, again, and when I finally got ahold of somebody they told me they were wrong and it was illegal for them to try to do that. They also took over 2 weeks to fix my washing machine, same deal with my dryer when it broke, they try to charge you for others not following the rules, but when you go to report issues (such as being harassed by neighbors because they're drunk and disorderly) management refuses to do anything about it. This management is the sleaziest, sketchiest, careless bunch of people I have ever met. Rent at your own risk, do not recommend it here.",
      "ownerResponse": []
    },
    {
      "author": "David H.",
      "rating": 1.0,
      "review": "POOR MANAGEMENT!  RIP OFF ARTISTS!!!  The management was unresponsive to multiple maintenance problems.  The management office was totally disorganized and their staff was always changing.  The staff never was able to give you a straight answer on anything.  When I finally moved out, they never sent me my deposit even though they sent mE a letter indicating that they would.  They refused to talk with me after telling me the check totaling hundreds of dollars was sent, but NEVER ARRIVED!!!!  DON'T BE FOOLED!!!",
      "ownerResponse": []
    },
    {
      "author": "Drift C.",
      "rating": 1.0,
      "review": "The worst experience ever! During a lease take over the management leaves the negotiation up to the tenants. This caused some problems because no help was received during the whole process. When I went to to the office to sign for the lease the manager YELLED at me and the current tenant \"You have been a waste of my time\"... Now that I am the tenant nothing but horrible manners and service from the manager.\n\nThe apartments are new and nice but the management is so bad I recommend others to reconsider and look for other places because they can ruin your experience living there.",
      "ownerResponse": []
    },
    {
      "author": "Marie Clarice Blair",
      "rating": 1.0,
      "review": "The management staff here is very unprofessional. The front desk person is wonderful. The other two ladies are the worst people to deal with. They selectively enforce rules, they make you feel like you are the problem. They don't want ",
      "ownerResponse": []
    },
    {
      "author": "rimple kaur",
      "rating": 1.0,
      "review": "I dont live here. I have family that live here and we had some questions about some transactions going through automatically from their online portal my family uses to pay their rent. we didnt go in accusing anyone. We just wanted a ",
      "ownerResponse": []
    },
    {
      "author": "DS",
      "rating": 1.0,
      "review": "Horrible management! Stay away... They are a small socialist society that are forever invading your rights. They step all over you and your rights. If you want to just live and let live then stay way from here. You have absolutely no rights ",
      "ownerResponse": []
    },
    {
      "author": "Jill Robey",
      "rating": 5.0,
      "review": "Management and staff are wonderful! Maintenance requests are done in a timely manner. I would highly recommend living here.",
      "ownerResponse": []
    },
    {
      "author": "Casey Hokanson",
      "rating": 4.0,
      "review": "We moved in here shortly after moving back from Yakima. We knew that it was going to be a short stay. The management was very helpful with getting our lease takeover done. The location is nice and our newer apartment building was nice and ",
      "ownerResponse": []
    },
    {
      "author": "Nick Rose",
      "rating": 5.0,
      "review": "Im shocked by the things some people have experienced here. My girlfriend and I have lived here for a year and a half now. We moved in by taking over a lease. While the office did seem a bit disorganized during the lease takeover process, ",
      "ownerResponse": []
    },
    {
      "author": "Shan Main",
      "rating": 2.0,
      "review": "Great place to live. Apartment was nice and had no issues with the office staff. Maintenance was prompt. My only problem was they only gave us $35 of our deposit back. My roommate and I cleaned that place from top to bottom. It was ",
      "ownerResponse": []
    },
    {
      "author": "Mike Agnini",
      "rating": 1.0,
      "review": "Id give zero if I could. The mgmt staff here is very unprofessional and do things that should get them fired, from screaming at tenants to keeping the fitness room closed while health department isnt requiring it. They selectively enforce ",
      "ownerResponse": []
    },
    {
      "author": "Emmett Whitehall",
      "rating": 1.0,
      "review": "DO NOT RENT FROM HERE!\n\nIf I could give this place a zero I would. Neighbors were great and so was the ",
      "ownerResponse": []
    },
    {
      "author": "Izabela Ramos",
      "rating": 5.0,
      "review": "I have nothing but good things to say about VABC! They have made the crazy process of finding an apartment so much easier for my partner and I! Out of all the places we considered no place was as kind or helpful as VABC! Both Brandee and ",
      "ownerResponse": []
    },
    {
      "author": "Carter Thomas",
      "rating": 1.0,
      "review": "Great location near Bellis Fair mall.  The complex is beautifully maintained by hard working staff.  The parking is plenty decent for such a big complex.  It would probably be close to ideal if you could only remove and replace whoever it ",
      "ownerResponse": []
    },
    {
      "author": "Bella mango",
      "rating": 1.0,
      "review": "Theyve cost me now $600 in parking tickets on their private property because i have nowhere to park. If you work nights dont move here.\nEdit: Just found mold around a window. On not even three year old apartments. ",
      "ownerResponse": []
    },
    {
      "author": "Jos",
      "rating": 1.0,
      "review": "We have been long time renters and this place has drastically gone down hill since the day we moved in. Ever since we moved in years ago we've been waiting on an ordered item to come in so that they could fix an item in our apartment. Years ",
      "ownerResponse": []
    },
    {
      "author": "gurbinder garcha",
      "rating": 1.0,
      "review": "My friends live in these apartments they are the worst apartments to live in the whole entire what come county not only they have mold growing everywhere from windows to  underneath the sinks they are the worst management ever to manage a ",
      "ownerResponse": []
    },
    {
      "author": "Strateleven",
      "rating": 1.0,
      "review": "Management is the worst here that I have ever seen. They do not care about anybody except themselves, they close down the office whenever without telling anybody, they send back your packages without warning you, and they do not care for ",
      "ownerResponse": []
    },
    {
      "author": "brian DeFries",
      "rating": 1.0,
      "review": "Im giving 1 star, but that is still to good of a rating for this mgmt service. Very pleased when starting process to move in. Once that was complete the respect and professionalism was nonexistent. When asked questions about issues with the ",
      "ownerResponse": []
    },
    {
      "author": "Yawen GAO",
      "rating": 1.0,
      "review": "I took a day off to drive to Bellingham for apartment viewing. They forgot about my appointment which I made three days ago, and told me I can't view the unit because they needed 24-hour notice to the current resident. The manager sat at ",
      "ownerResponse": []
    },
    {
      "author": "Ahren Rhoden",
      "rating": 1.0,
      "review": "Wildly unprofessional and rude staff, inconsistent application of their rules, frequent passive agressive door mailers, emails, and texts. Grounds are poorly maintained with several major safety hazards. I don't think in my multiple years living here I've met a single neighbor who likes living here",
      "ownerResponse": []
    },
    {
      "author": "Tiarrah Banks",
      "rating": 1.0,
      "review": "Front Desk Receptionist Alena is very unprofessional. This office does not give good customer service, especially for someone who never is late on rent or other utilities.",
      "ownerResponse": []
    },
    {
      "author": "Raphael Grover",
      "rating": 5.0,
      "review": "Great location near Bellis Fair mall.  The complex is beautifully maintained by hard working staff.  The parking is plenty decent for such a big complex.",
      "ownerResponse": []
    },
    {
      "author": "Scott McKeever",
      "rating": 1.0,
      "review": "Poor management.  They don't even regulate their own rules or do anything about them.  The whole place should be shut down.  Or bought by a respectable, responsible, local owner.",
      "ownerResponse": []
    },
    {
      "author": "Jeffery Schwarz",
      "rating": 1.0,
      "review": "They were the worst landlords I have ever had. It seemed to me like they made every attempt to cheat me and squeeze extra money out of me.",
      "ownerResponse": []
    },
    {
      "author": "Jeremy Walker",
      "rating": 5.0,
      "review": "Really nice place to live!",
      "ownerResponse": []
    },
    {
      "author": "Howard Valentine",
      "rating": 5.0,
      "review": "Great meal of Black Cod, scallops, asparagus, corn on the cob, sweet potato and tomatoes",
      "ownerResponse": []
    },
    {
      "author": "Ryan Nelson",
      "rating": 5.0,
      "review": "Very nice neighborhood and the site is well maintained.",
      "ownerResponse": []
    },
    {
      "author": "Jessica Thomas",
      "rating": 1.0,
      "review": "Awful service, office never keeps your paperwork filed properly and when you have copies they argue.",
      "ownerResponse": []
    },
    {
      "author": "Joe Skar",
      "rating": 1.0,
      "review": "I wouldn't wish these apartments on my worst enemy.",
      "ownerResponse": []
    },
    {
      "author": "Tristen rector",
      "rating": 4.0,
      "review": "A little to expensive for my family and I but we called it home.",
      "ownerResponse": []
    },
    {
      "author": "Ali Kurtz",
      "rating": 5.0,
      "review": "Very beautiful apts...",
      "ownerResponse": []
    },
    {
      "author": "Melissa Maxwell",
      "rating": 1.0,
      "review": "Very unprofessional staff for management.",
      "ownerResponse": []
    },
    {
      "author": "Clinton Jameson",
      "rating": 2.0,
      "review": "Units are way to small.",
      "ownerResponse": []
    },
    {
      "author": "loveleen virk",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "N H",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Milangela Diaz",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Denise Prowell",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Natalie Olsen",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Joshua Crabtree",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "3963 Primrose Ln Bellingham, WA 98226",
  "avg_review": 2.2
}