{
  "name": "Access Real Estate Services LLC",
  "slug": "access-real-estate-services-llc",
  "company_type": "company",
  "address": "809 W Orchard Dr #8, Bellingham, WA 98225",
  "review_count": 116,
  "avg_rating": 3.3,
  "reviews": {
    "google_reviews": [
      {
        "author": "G.k. Pearson",
        "rating": 5.0,
        "review": "I've been renting from Access for several months.  They were upfront,  transparent about the application and move in process. I've had one repair request that was taken care of immediately. All of my inquires, concerns etc have been responded to very promptly. Emails answered within the hour, or less.  The manager,  Bryan is courteous,  professional,  and most importantly i think,  understanding of concerns. They are by far the best management company I've ever rented from.",
        "ownerResponse": {
          "text": "G.K.  Thank you for taking the time to write your nice review.  I will let Bryan know about your kind words.  Regards,\nDavid."
        }
      },
      {
        "author": "Tanya Lopez",
        "rating": 1.0,
        "review": "Not trying to hurt feelings, but I would like to express my concern, definitely poor management, trying to communicate to solve a smoked issue and other problem in my apartment, been living here 6 months and since move in the concern of the smell of smoked in the apartment, never goes away, been emailing management and now they dont respond to any email,  with this super cold weather I have to open my door so the smoked smells goes away, my electricity bill is getting too high do to this problem, Bryan complex manager, havent had a solution for this, the contract said is a smoked free community but absolutely the opposite.\n\nCan some one please contact me for this long matter,",
        "ownerResponse": {
          "text": "Tanya, this issue has been given more than adequate attention.  The property manager has visited your unit and the unit that you claim has been smoking.  It did appear that a tenant was smoking in one of the units and they were issued a warning.  A follow up inspection was done both by the property manager and the complex owner and there was no evidence of continued smoking.  Your unit was also reinspected and no noticeable smell of smoke was detected.  I'm sorry that I missed your initial response, but when I investigated this item, it is apparent that the issue was dealt with properly and your claims of our failures are inaccurate.  Regards, David"
        }
      },
      {
        "author": "JeshUa Morgan",
        "rating": 1.0,
        "review": "Company is very shady. We will be filing a small claims case against them. I have pictures and videos of how I left my apartment on move out and when I got the invoice for my deposit I got back 168.00 out of 1100. Said they had extra cleaning fees because it was left dirty. Extra Carpet cleaning fees when the carpets were brand new as I have rugs covering the entire place and was only there a year. Also the property I was in used the owner of the property for maintenance so the owner was in and around the property all time checking in on people. But they dont tell you that who it is. Office manage Brian is not helpful in anyway and the team he runs is lacking knowledge on how to do their job. On move out I was giving no paper work for updated address and when I called to ask where and when I would be receiving my deposit and invoice they said they sent it to the last know address, that was where I just moved from. So they sent it to the place they knew I would no longer be and failed to reach out. I would highly recommend another company as they are awful at doing their job.",
        "ownerResponse": null
      },
      {
        "author": "Hanna Adams",
        "rating": 1.0,
        "review": "I was completely SCAMMED by this company!\nDo not give them your money.\n\nI spoke on the phone with an employee who told me we could apply for a listing without seeing it in person first- we live 3 hours away so coordinating this is difficult.\n\nI was also assured that my credit wouldnt be an issue during the application process- I am a stay at home mom of a baby with no income, and was applying with 2 other adults with VERY good income and credit (tens of thousands monthly)\n\nAfter paying this company $150 for an application,  and calling to confirm we were first in line for the rental-\nI was sent a few scant emails saying we cant apply without viewing, my credit disqualified us and that they wouldnt allow us to rent-\nThey refused to return my calls.\n\nContradictory to everything I had been told BEFORE I forked over $150 bucks.\nSmells like a scam to me!",
        "ownerResponse": {
          "text": "Hanna, we certainly are not running any kind of scam.  We have to pay to have your credit and criminal background check performed.  We also have to pay employees to evaluate your credit score and background check.  Those items are not free. After obtaining information on all of the applicants, it was determined that you did not meet the minimum requirements for renting that particulare unit.  The same requirements are applied to all tenants and we rent on a first come first served basis to qualified applicants.  \nDavid M Long Jr MBA, CPA\nCFO/Owner Access Real Estate Services"
        }
      },
      {
        "author": "Andrea Paszkowski",
        "rating": 5.0,
        "review": "They are wonderful. So easy to work with and they get back to you quickly if anything is needed (maintenance, etc). Best property management company experience I've ever had.\n\nUpdate-But just wanted to add to my original review what a pleasure it was to work with everyone at Access Real Estate. My lease is ending as of tomorrow due to moving out of state. We rented with them for 2 years & are truly sorrow we couldn't continue with them.   We truly had the best experience with Access Real Estate. They were communicative, professional, understanding, and prompt. They are the ones to check out first when looking for a rental!",
        "ownerResponse": null
      },
      {
        "author": "Eileen Turk",
        "rating": 5.0,
        "review": "We have had Assess Real Estate Services manage our rental property for over six years now.  Access has been great at contacting us whenever a service issue has come up and   coordinating repairs with the service providers and our tenant. Bryan is easy to work with and has taken the work out of being a rental property owner. Their paperwork is always timely and complete and their management fee is very reasonable.",
        "ownerResponse": {
          "text": "Thanks so much for your kind words. It's a pleasure to be of service for you!"
        }
      },
      {
        "author": "Laura Briscoe",
        "rating": 5.0,
        "review": "Over the years, weve worked with a handful of property management companies.  Only been with Access for a year now, but we are impressed and here to stay.  Bryan is so easy to work with.  The communication with us is excellent, and I can only imagine he provides the same level of service for our tenants.  We never have to wonder whats happening at our properties and always feel like a valued client (even though we dont own multi-unit complexes.)",
        "ownerResponse": {
          "text": "Hi Laura, thank you so much for your kind words.  We really appreciate you taking the time to leave us a review.  Best Regards,\nDavid"
        }
      },
      {
        "author": "Emma Rogers",
        "rating": 5.0,
        "review": "Access is by far the best property management company I've had in Bellingham. Their rentals are reasonably priced, well maintained, and Bryan is quick to respond to questions/maintenance requests. Everyone I've delt with is friendly and accommodating. I would gladly recommend Access to anyone searching for a rental!",
        "ownerResponse": null
      },
      {
        "author": "Tara Almond",
        "rating": 5.0,
        "review": "I've worked with Access Real Estate Services both as a tenant first and then as a property owner. Having been a renter for most of my life it was important to me to find a property management company that would not only treat my tenants fairly and with respect but be able to respond to issues quickly and efficiently. Since hiring them last year, they've done the job with no problem to my knowledge and have always been friendly and accountable when I had questions. I also appreciate how they accommodate our family's preferences for how certain situations were handled. I understand they are also a small company and I like that their operation is small enough to give personalized attention to our individual units and tenants.",
        "ownerResponse": null
      },
      {
        "author": "Joel Harmon",
        "rating": 5.0,
        "review": "So far I have had an amazing experience with this team. Both Rachel and Janine have had outstanding customer service. I felt welcome right away. I have been a renter for the last two decades and have had my fair share of \"slumlords.\" I wanted to make sure that this time as a first time home owner, that my tenants would have a first class experience.\nRachel and I hit it off right away over the phone and her friendliness came  across well. I had checked in with a few other local companies and are still waiting for calls back from some of them. Access responded to my request right away and made sure to make sure that my needs were taken care of. After describing my requirements for the future tenants, she walked me through the process and made sure all my questions were answered.\nFor her and Janine, customer service is most important. Not just to me the owner, but a genuine respect for the tenants. I signed the contract a day ago and they already have several interested parties ready to view my home. All my worries and concerns have been thoroughly answered and put to rest. This team makes it easy for owners to feel secure with their investment.",
        "ownerResponse": {
          "text": "Joel, thank you so much for taking the time to express your thoughts.  It's our pleasure to be of great service to you!"
        }
      },
      {
        "author": "Eileen Lanthier",
        "rating": 5.0,
        "review": "Bryan at Access has been so amazing and helpful throughout the two years Ive been renting from them. My roommates and I have just signed onto our third year and we hope to continue using Access for all our rental needs in the future!",
        "ownerResponse": {
          "text": "Eileen, thank for taking the time to provide this nice review.  We're glad your so happy with our services.  David"
        }
      },
      {
        "author": "pau Borden",
        "rating": 5.0,
        "review": "I believe Access PM is fabulous.  Their monthly statements are easy to understand and very clear.  I love working with Bryan Long.  He is very responsive to all my concerns as a property owner.",
        "ownerResponse": null
      },
      {
        "author": "Chris Moye",
        "rating": 5.0,
        "review": "I have a unique perspective in regards to the quality of Access Real Estate as I am both a tenant in one of the properties they manage as well as an employee of a service company that assists with some their maintenance needs.  I have had nothing but positive interactions with the Access team on both sides of the coin.  They are quick to respond to maintenance requests and my tenant needs. They are fastidious in ensuring their properties are safe and well maintained and have a keen eye on balancing the tenant /ownership relationships so that all parties \"win\".  As a management company the Access team has been a pleasure to rent from and work with.  I would start and end with Access when looking for a professional, caring, relationship driven management company.",
        "ownerResponse": null
      },
      {
        "author": "Mary Gibb",
        "rating": 5.0,
        "review": "Long Time Business Partner -  We've been a service provider for Access Real Estate for many years. They are top notch leasing company. They really take care to maintain the properties in a professional manner.  If I were choosing a company to care for my property, I would definitely consider Access and so should you!",
        "ownerResponse": null
      },
      {
        "author": "Hugh Newmark",
        "rating": 1.0,
        "review": "I cannot emphasize what an abhorrent experience I had with Access.\n\nMy landlord switched from Hammer to Access and it was terrible. Our washer broke, and the installer out the new one in incorrectly and flooded the house.\n\nThe owner of the company, Rachel, was disgusting to deal with. She was rude, standoffish, condescending, and truly horrible to work with.\n\nI'm a business owner, I understand how vendors and schedules work, there was no reason for her to lie to me the way her and her staff did over and over again about returning our apartment to a liveable condition in a timely manner.\n\nThey also lied to us about our lease renewal. They told us they were renewing our lease, and that it was in the mail. Weeks went by, so I called and checked up, I was reassured it was in the mail. Shortly before the lease was up, they told us last minute that they weren't.\n\nI know renting in Bellingham is hard, but Rachel and Access are parasites and should be avoided at all costs.",
        "ownerResponse": null
      },
      {
        "author": "marcia hoelzen",
        "rating": 5.0,
        "review": "We own only one single family property right now but Access has managed various properties for us over the years.  Our experience has been quite good.  They have been responsive to us and to our tenants, resulting in long term rentals for us and well maintained properties.",
        "ownerResponse": {
          "text": "Hi Marcia, thank you so much for your kind words.  It is a pleasure providing great services for you!"
        }
      },
      {
        "author": "Chris Klar",
        "rating": 5.0,
        "review": "We own several rental properties in Bellingham and Access Real Estate has handled our property management needs since 2011. We're happy with the service that Rachel and her team provide and find that they are responsive to our concerns and needs. Dave provides excellent monthly financial reports. Peace of mind with Access.",
        "ownerResponse": {
          "text": "Thanks Chris, we really enjoy working with you.  Access Real Estate Services"
        }
      },
      {
        "author": "RJ Halloran",
        "rating": 4.0,
        "review": "So far, our experience with Access has been amazing! Bryan Long has done a great job responding to questions about our lease and general situation, which is a little atypical. Looking forward to renewing our lease and being with Access for years to come!",
        "ownerResponse": null
      },
      {
        "author": "A Ben",
        "rating": 5.0,
        "review": "I have been a tenant for almost 3 years now, and Access has been (by far) the best property management company I've ever rented from. They respond to my maintenance requests immediately (same day!) and have always had great communication with me. Consistent, professional, top notch service!",
        "ownerResponse": null
      },
      {
        "author": "Nicole P",
        "rating": 5.0,
        "review": "We are tenants of a rental home, family of four. We have been homeowners for 15 years, and were concerned about becoming tenants after our home sold, but we have been treated well and have a lovely home. The home was clean and in good repair when we moved in. We had an issue with the dishwasher and the dishwasher was replaced in a little over a week. A good portion of Bellingham housing is run by huge property management companies who can set any rents and any rules they wish because of the high demand for housing,. Access, being a bit smaller company than most, seems to be quite fair in their dealings and easier to work with than most companies.",
        "ownerResponse": null
      },
      {
        "author": "Peter Commons",
        "rating": 5.0,
        "review": "Access has been managing our property for years. They are reliable, trustworthy, and quick to respond  which is super important to us as we don't live anywhere nearby.",
        "ownerResponse": null
      },
      {
        "author": "Jon Goldberg",
        "rating": 5.0,
        "review": "As a former employee of this company, you may understandably think my perspective to be biased. However, in my honest experience as a tenant at 2-3 other local companies here in Bellingham, I have come to realize that Access is absolutely the preferred property manager in town. There is a level of competency and attentiveness that you will only find at a smaller company such as this. Additionally, these qualities are matched only by their willingness to be fair (within the dictates of landlord-tenant law). Simply put, there IS a reason why Access has the highest google rating in town. Any unhappy tenants that say otherwise simply do not understand how legally binding contracts operate, or how one upholds their end of a lease agreement.",
        "ownerResponse": null
      },
      {
        "author": "Journey Oxford",
        "rating": 5.0,
        "review": "I currently reside in a rental home that is managed by Access Real Estate Services LLC.  Shortly after I moved in. I noticed that the home was in desperate NEED of a new over the range microwave. The interior paint in the existing one was badly peeling. Which is a health hazard. I contacted Bryan Long at Access and he had a very nice new microwave installed in less than one week. Bryan was very helpful, courteous, friendly and communicative during this process. Not to mention the promptness in which he handled this matter. A shout out to Bryan and Access Real Estate Services LLC. Thanks!",
        "ownerResponse": {
          "text": "Hi Journey, thank you so much for taking the time to write a positive review.  We really appreciate that and we are happy to be of service!"
        }
      },
      {
        "author": "Samantha Hoffman (Sam)",
        "rating": 1.0,
        "review": "Me and my roommates found a property they had posted and applied immediately because we have been struggling to find a place for while now.\nI called to ask some questions the next day when they were open and I was met with rudeness and attitude. The woman I was talking to was in the middle of a meeting and told me to just email my questions. I dont like to do this because then it takes significantly longer to get answers, but I did.\nI filled out an application with a Cosigner because most places require a Cosigner with full time students (Which is dumb because we have jobs and pay our bills on our own). I was then informed that the property was not accepting co-signers because it was not a college property. It is frustrating that we cant apply because we are students and we pay our own bills and such, so why does it matter?\nPlus with all the questions I asked in the email, none of them were really answered in the response.\nIf youre not going to allow co-signers/full-time students on a property you should really put that somewhere on the listing.\nThis was me and my friends one and only experience with Access and we will never look into another property there again. They are rude and feels to me they look down on students.",
        "ownerResponse": {
          "text": "Hi Samantha, this is David I am one of the owners of Access.  I'm sorry your attempt to work with us was so frustrating.  If you and your roommates meet our income qualifications, you wouldn't need a cosigner.  I don't know if that is the case or not.  We certainly don't look down on students. We work with students all the time.  If you'd like to have a chat, I'd be happy to set up a time with you.  Just let me know."
        }
      },
      {
        "author": "Brian Hoelzen",
        "rating": 5.0,
        "review": "We have had three different properties that Access managed for us.  They have done a great job for us and I believe for our tenants as well.  One property has had the same tenant for nearly 4 years.  I have to give Access credit for making that happen!",
        "ownerResponse": null
      },
      {
        "author": "amanda apitz",
        "rating": 1.0,
        "review": "The staff is incredibly rude. They also over charge for slum accommodations.  They have zero compassion and terrible customer service.\n\nThumbs down. Im surprised they havent been sued for incompetence yet.\n\nThey left a female tenant locked out of her apartment, after dark without her seizure medicine. They refused to help her in with the spare key they had. That put the tenant in danger. This type of management is beyond unprofessional. Even worse, when the tenant called, they were incredibly rude to her.\n\nFurthermore, the rental had many repairs ignored\n\nThey should be shut down.",
        "ownerResponse": {
          "text": "Amanda, we do not provide after-hours lockout service.  Tenants are responsible for maintaining possession of keys to units at all times.  If an after-hours lockout occurs, a locksmith must be called and all charges are the tenant's responsibility.  This policy is clearly stated in the lease your daughter signed.  If there is maintenance that needs attending to, please tell your daughter to contact our office and we'll get things taken care of, if needed."
        }
      },
      {
        "author": "Anne Kucera",
        "rating": 5.0,
        "review": "Our condo association has worked with Access for 4.5 years.  As a Board member, I especially appreciate the high level of service we received during a complete rehabilitation project that involved a special assessment.  Rachel, David, and all of the Access associates provide us with exceptional service that assists us with the management of the property.",
        "ownerResponse": null
      },
      {
        "author": "Ben (Ben)",
        "rating": 3.0,
        "review": "I've been with out the ability to use the kitchen sink for several weeks.  I've called and politely requested updates on repair timelines and scope of work on weekly basis without a call back.\n\nEdit - resolved with several days of my initial review, many contributing factors, limited contractor, literal massive regional flooding increasing plumber demand, and etc.  Clearer communication would still have been appreciated.",
        "ownerResponse": {
          "text": "Ben, I've talked to staff regarding this matter and we've been doing everything we can to remedy the issue.  Best Rooter & Blythe plumbing have been to your unit already and it has been determined that the damage is well beneath the surface.  An excavator has been engaged to dig up the plumbing line so it can be repaired.  However, recent weather conditions (heavy rains) haven't allowed this to happen yet.  I'll also add that your point of contact is either the property owner or the management company that is managing the unit.  We manage the association, but do not manage any rental units at this association.  We've been communicating frequently with the owner of the unit and if you are not being kept in the loop, you should be contacting her or the rental management company, not Access Real Estate Services."
        }
      },
      {
        "author": "Alissa Reynolds",
        "rating": 2.0,
        "review": "My room mates and I attempted to schedule a viewing of an apartment. When we did so, we were told that we didn't meet the minimum requirements, when no minimum requirements were listed for the property. I called Access, and was then informed that there is a minimum income requirement. Not a big deal, my room mates and I all have cosigners. I was then told that cosigners were only allowed for applicants who are full-time students, therefore we were simply not allowed to apply for this property.\n\nThe woman who informed me of all of this was very polite, however, I am upset that information about a minimum income requirement was not contained in the listing and that there are no cosigner restrictions mentioned anywhere on the Access Real Estate Services website that I could find. In fact, the information I found on cosigners said that they are needed by \"Anyone without income equal to at least 3 times the monthly rent,\" with no mention of needing to be a full time student.\n\nMy room mates and I are employed and fully capable of paying rent. We all have cosigners available in order to meet the requirements for the listing, as specified on the website. The fact that we are not allowed to utilize them is frankly baffling to me. In addition, I should not have had to call the company in order to find this information.",
        "ownerResponse": {
          "text": "Hi Alissa, I appreciate your feedback.  I'll check on the listings to see if all of the pertinent information is available.  We do typically mention the income requirements and note when co-signers are not allowed, but we may have reposted an old ad without all the data."
        }
      },
      {
        "author": "Kasey Cleek",
        "rating": 2.0,
        "review": "I found the process of getting a rental with access real estate difficult and nerve-racking. Access appeared to have little knowledge of the property they were renting, for example, we were sent to set up utility services with city hall only to be told by city hall that the units in the area were billed together and we couldn't set up individual service. We were also told to get our own garbage cans but there were dumpsters there. It took awhile to figure out what our utility charges/situation would be. The move in conditions listed were contrary to what we saw, there was no idea about parking, ect. Now that were in, things are good and I really like the apartment, but I feel access could have been much more knowledgeable about the property they were renting.",
        "ownerResponse": {
          "text": "Hi Kasey, I'm sorry your initial experience with Access wasn't great.  If you'd like to discuss the issue further, pleas give me a ring at our office 360-685-0123.  I'd be happy to talk to you.  Regards, David"
        }
      },
      {
        "author": "Red Maple",
        "rating": 5.0,
        "review": "I found Access Real Estate Services LLC to be professional and easy to work with. Everything  is clear, simple, and straightforward. I'm happy to have this company to manage my rental property. I would highly recommend it!",
        "ownerResponse": {
          "text": "Thank you so much for your kind words."
        }
      },
      {
        "author": "treehouse98221",
        "rating": 4.0,
        "review": "As past treasurer of a medium-sized condominium association, I worked closely with Access Reality and with David Long in particular. David handled our financials effectively, responsibly, and accurately. He provided monthly 20+ page reports that were extensive and comprehensive...which greatly helped me communicate to the board up-to-date financial information. He met with the full board annually to help prepare our proposed budget for the upcoming year. Additionally, he was always available for any questions I might have. David was - and is - a very helpful and welcome resource to our HOA.",
        "ownerResponse": {
          "text": "Thank you for your kind words, much appreciated!"
        }
      },
      {
        "author": "1One Love",
        "rating": 1.0,
        "review": "Before paying the application fees I wanted to make sure I wouldn't get denied, yet I was. Wasted time, money. They seem to know nothing about their rentals. Very rude, misleading information, these people are power hungry and discriminate against the disabled and low income families. Unwillingly to help if in a rut, they don't care.",
        "ownerResponse": null
      },
      {
        "author": "Rye Bow",
        "rating": 1.0,
        "review": "Access Management was late paying for our bills and incurred a late fee which was unaddressed to this point. They have played the owners against each other in order to save face. It is very sad to see such manipulation from a hired agent. It is extremely alarming to see such horrible service standards from all the management companies in Bellingham. I would never advise using them.",
        "ownerResponse": null
      },
      {
        "author": "Melanie Kiss",
        "rating": 1.0,
        "review": "Access Real Estate is very unprofessional and takes advantage of poor, unsuspecting college students. They rented out a flea-infested, moldy, decrepit home to my kids, which they couldn't tour in person and therefore had no idea what they were getting into. After the kids moved out because the conditions were unlivable, Access refused to let the kids out of their lease. The house should be bulldozed and Access should be out of business and sued for improper business practices. They are very non responsive and are happy to collect rent from kids who are not even living there.",
        "ownerResponse": {
          "text": "The flea issue was an unfortunate thing related to prior tenants.  We addressed that issue promptly and at that point the unit was livable.  Like all rentals in Bellingham proper, this unit is subject to inspection by the city.  This unit meets the city's standard for rental to the public.  Leases are legal contracts and tenants cannot be let out of leases just because they want out.  That would be a disservice to the property owners we represent.  Our company has done nothing improper at all.  We followed the law by responding to all issues that were reported without exception.  Since the unit has been turned over to us, we have been actively advertising the unit in hopes of finding new tenants.  Again, our company is doing exactly what it is supposed to do."
        }
      },
      {
        "author": "Cameron Brewer",
        "rating": 1.0,
        "review": "Access Real Estate Services is garbage. My wife and I had just moved up here and were looking for an apartment to rent. Before paying the application fees we wanted to make sure we wouldn't get denied. They were very eager to answer our phone calls at first, but as soon as they had our money it was nearly impossible to get ahold of anyone besides the front desk. I wouldn't recommend this business to anyone. BEWARE.",
        "ownerResponse": null
      },
      {
        "author": "Toribio Morales",
        "rating": 5.0,
        "review": "The folks at access work very hard to ensure a clean and safe living area for their tenants. They are fair and are often available to help. If you do what you're supposed to do as a tenant they take good care of you. I highly recommend them and would rent from them again.",
        "ownerResponse": {
          "text": "Thank you Toribio, it's a pleasure to be of service to you!"
        }
      },
      {
        "author": "Neil McCrea",
        "rating": 5.0,
        "review": "When we hired Access Real Estate services to represent our Condo Association, the board was a shambles of petty, vindictive infighting.  Access handled often painful clash of personalities and wills with consummate professionalism and a great deal of patience.  I feel that I owe them all a beer and/or a box of chocolates at the very least.",
        "ownerResponse": null
      },
      {
        "author": "Holly Harkener",
        "rating": 1.0,
        "review": "My condo building's HOA uses this company, and it is a nightmare. The responsiveness and care is almost non-existent. Only one person has ever been able to answer a question of mine, and he's one of the owners. The folks who answer the phones have never ever been able to answer a question or provide help in any way. If it were up to me, we would not be using Access Real Estate.",
        "ownerResponse": null
      },
      {
        "author": "lothar Titel",
        "rating": 5.0,
        "review": "I have  several  properties with Acces, the have managed them for me\nfor several years.\nI am very happy with the job the are doing. .Dave and Rachel have a good\nTeam, I have not heard a bad word from any of the tenants !\nGood Job, Thank you",
        "ownerResponse": {
          "text": "Thanks Lothar!  You're always a pleasure to work for!"
        }
      },
      {
        "author": "Casey Norman",
        "rating": 5.0,
        "review": "Access RES is handling a rental property for us.  They have done a great job managing the property and updating us with any issues or concerns.  Renewing the tenant lease was a breeze.  Since we are living out of state it gives me peace of mind that I don't need to worry.  Thank You!!",
        "ownerResponse": {
          "text": "Thanks Casey!"
        }
      },
      {
        "author": "Steven Kelly",
        "rating": 1.0,
        "review": "I was on the Board of a condominium association for several years that used Access as the Association Managers.  During my tenure I found that Access consistently failed to follow through on their commitments, failed to adhere to a key requirement of the Governing documents, failed to adhere to important terms of the management agreement and were rude to Board members.",
        "ownerResponse": {
          "text": "Steve, I will just mention this -- you came in to our office and proceeded to use profanity.  I informed you in no uncertain terms that your behavior was unacceptable.  I think most folks can figure things out from here. I have no idea why you feel inclined to make derogatory and false comments a year after the fact."
        }
      },
      {
        "author": "Cheryll Greenwood Kinsley",
        "rating": 5.0,
        "review": "Access Real Estate has given us exemplary service for almost five years. They are responsive, courteous, and always on top of whatever needs to be done. We recommend them highly.",
        "ownerResponse": {
          "text": "Thank you Cheryll.  Your wonderful to work for!!"
        }
      },
      {
        "author": "Tyler Lewis",
        "rating": 2.0,
        "review": "Our HOA Board hired Access to be our Proprty Management Company and it turned out to be the biggest mistake they have ever made.  The husband and wife owenrship team are completely arrogant and unwilling to work with our members to resolve a situation.  They do not provide any of the services they advertise.  Instead they seek the approval of an attorney for anything they are challeninged with and bill the cost to the HOA.  Do not hire this company for Porperty Management.  They are rude, arrogant, and power hungry.",
        "ownerResponse": {
          "text": "Tyler,\n\nThe association's attorney was hired to complete the drafting of the new rules & regulations and to ensure that the adoption of the rules and regulations was done in accordance with your founding documents and the HOA Act.  The board and management took due care during this process.    When you make challenges to the HOA board's authority to enact those same rules it is not only appropriate but also necessary to consult the attorney once again.  It was clear you were not accepting my feedback that the board was within its rights to enact rules & regulations.  We, as the management company, do not want to engage in missteps that put the board or the community in a bad situation.  So, we forwarded your request and complaints to the attorney for review and feedback.  The attorney's feedback was that the board was within its right to enact and enforce the rules you are complaining about.  The correspondence with the attorney has also been shared with you.\n\nHopefully, at some point you'll come to understand that enforcing rules & regulations at the board's direction is part of what property managers are paid to do, even when those rules & regulations are not liked by everyone.\n\nRegards,\nDavid M Long Jr., MBA, CPA, CMCA\nOwner Access Real Estate Services"
        }
      },
      {
        "author": "Andrew Fowler",
        "rating": 1.0,
        "review": "I wish I could give this company a zero star. The customer service is awful. They do such a poor job at maintaining their property.\nWe pay $300 a month for our HOA fee, who knows what that money goes for. We don't have a pool or any amenities.\nIf you are thinking about using this company, RUN AWAY FAST.",
        "ownerResponse": {
          "text": "Andrew, I've check our system and talked to every staff member.  You are not a association owner, tenant, or rental owner in our system.  I simply do not know who you are.  If you contact our office and let us where you are located, we'd be happy to help."
        }
      },
      {
        "author": "Do D",
        "rating": 5.0,
        "review": "The best experience I've had as a renter is with Access and I've dealt with many PM companies over the years.  They seem to be doing everything they can to keep our place well maintained and are always very responsive.",
        "ownerResponse": {
          "text": "Thank you D!"
        }
      },
      {
        "author": "dan L",
        "rating": 5.0,
        "review": "As a service provider, I have been doing business with Access for a few years now. They have always been professional, courteous, and understanding of the work that we provide. It is always a pleasure working with this company.",
        "ownerResponse": null
      },
      {
        "author": "mike van Dyke",
        "rating": 5.0,
        "review": "They have been managing properties for the family for some time now. They do residential, multifamily and commercial for us. I highly recommend them as they are extremely responsive to tenant and owner needs. Great firm, good to work with.",
        "ownerResponse": {
          "text": "Thanks for your kind words Mike.  We love doing business with you!"
        }
      },
      {
        "author": "brad reed",
        "rating": 5.0,
        "review": "I made 1 phone call, the owner came out, assessed the situation took pictures ect. Within a week a guy showed up fixed it correctly ( I know it was done right, they called Hytech) very easy to deal with Acess,  Dave and everyone there has been great to deal with timely and responsive thanks for taking care of the situation",
        "ownerResponse": null
      },
      {
        "author": "K. Sla",
        "rating": 2.0,
        "review": "Obviously, this company writes its own reviews!  I  used this company and I can tell you - I'd never do business with them again.  NEVER.  When a maintenance issue came up - they were told to give me a quote - that I'd like the \"worst case senario\" cost wise.  When I got the bill (no communication at all to indicate I could expect to be hosed), it was for three times the \"high side\" quote - and additionally, the person they contracted with did not do the work he had indicated he would - only part of the work.  If you want to get screwed over and have them expect you to thank them for it - go ahead and hire them.  I found them to be unprofessional and extremely arrogant.",
        "ownerResponse": null
      },
      {
        "author": "Kelli Quiroga",
        "rating": 5.0,
        "review": "Kelly in reception is awesome!!! The whole process of getting a rental was super simple. I have a good feeling my tenancy will be an easy time too. Thanks Access :)",
        "ownerResponse": {
          "text": "Wow, thank you so much for taking the time to speak well of us.  I'll be sure to mention your kind words to Kelly as well."
        }
      },
      {
        "author": "Scott M",
        "rating": 5.0,
        "review": "Access has been excellent from day one!  Have worked with several local Property Management firms over the last 8+ years, and they're the best around.  Highly Recommend!!",
        "ownerResponse": null
      },
      {
        "author": "Jacob Hiebert",
        "rating": 2.0,
        "review": "Access realty is a business that you should avoid. Although, they found us a great property for a good price, they were very unprofessional and rude. Could not ask the boss a question without them throwing out rude accusations.",
        "ownerResponse": {
          "text": "Jacob, I'm not sure what you are talking about specifically.  Would you be so kind as to let me know what your questions was that didn't get answered.  Regards, David"
        }
      },
      {
        "author": "Sam Roth",
        "rating": 5.0,
        "review": "We work directly with Access Real Estate on a regular basis.  We are proud of this partnership and would not hesitate to recommend them to any one!",
        "ownerResponse": null
      },
      {
        "author": "Brenna Grace",
        "rating": 5.0,
        "review": "We just started renting from them, and they made the whole process incredibly easy and smooth to get the apartment, unlike so many other rental management companies in the area.",
        "ownerResponse": {
          "text": "Thank you for the kind words Brenna.  Much appreciated!  Access Real Estate Services"
        }
      },
      {
        "author": "Craig Gunst",
        "rating": 5.0,
        "review": "I provide electrical service work for Access.  They always have knowledge of the property I am going to and everyone in the office are very professional and helpful with any questions that I may have.  Very great company to do work for.",
        "ownerResponse": null
      },
      {
        "author": "Doug Taube",
        "rating": 1.0,
        "review": "I hve never been treated as rude,unethical by a buisness include owners wife.i hve been n bham 28yrs.hve worked,owned small buisness.and #1is treat others as u would want b treated.i hope this comp.will b liable for writting a lease for a tentant.who has been live 9yrs at present apt.after they sign lease access sent letter stated they cant renew or honor this contract.there is a pattern of discrimination.with disabled indivisuals.i ask others take few minutes to express their opinons.with experiences dealing with access prop.mgt.they presently hve 9 rentals in one complex.they raised rents from average200_300$...in 1month notice.is the reason tenants are leaveing.there are several tenants been here 2-9years. 3_4 hve been over 6yrs.are upset landlords are able to not b accountable for their actions.please take the time to read peoples opinons.to b able form your own.i do wish good health happiness+prosperity to all mankind.......David i appriciate your response.i understand reason for rent increase.taxes renovations agee rent was lower then should be.im talking regard another tenant been here 9 yrs.your comp.sign renew lease also sec.8 then he rec.a letter state access will not honor lease sign by all parties concern.if a tenant breaks a lease they are responible for balance.why would this not same to access mistakes? I am waiting for results.hopefull he obtains legal council.he has severe disabilities.for myself given 30days after reside 3yrs.paid n full n time.unfortuately if given 60-90days notice.that would allow to find 1bdm under 800$.and sec 8.....when there is 1% in bellingham fit critera.then hve 4others sign new lease past 45days.they all didnt rec the currant prices..1bdm 912$ include w\\s...2bdm 1050$ studio 765$.....we hve pattern of indifferences i would enjoy to meet snd talk for few moments.i believe the changes were the owner and yourself.the incident with your wife was disapointing.she is a professional know s better how treat a tenant.i hve always been polite.brought n fowers for the staff.im sure owner of property will hear about currant situation.with thr lease sign sealed +delievered.tenant who has mental disabilities reside 9yrs.any court would award damages for the mistskes access has made.you hve my phone #.god bless u and your family.",
        "ownerResponse": {
          "text": "Doug, I'm sorry you feel the way you do.  What you don't realize here is that we, as property managers, do not get to make all of the decisions.  The owners of complexes often insist on rent increases after they have made investments in the property, which is the case with your particular apartment complex.  Honestly, the rents were too low at this complex compared to others nearby.  It's also important to realize that owners of complexes can legally deny certain categories of individuals tenancy, which was done in your case.  I also add that neither you nor anyone else has been denied tenancy because you are disabled.\n\nI am 100% certain there was no executed lease document between our company and you.  You were offered tenancy and then we realized you fell into a category the owner of the complex no longer wished to rent to.  We verified with the proper authority that denying tenancy in this manner was indeed legal.  I made that phone call myself.  So, the offer of continued tenancy was withdrawn as soon as we realized what had happened.  You were given more notice than your existing lease requires that we would not be renewing your lease.  There is nothing illegal or nefarious here.\nI wish you the best in your search for your new home.  David M Long Jr"
        }
      },
      {
        "author": "Yvonne Carson",
        "rating": 5.0,
        "review": "Access Real Estate Services is the management company for our Homeowner Association. I have found them easy to work with and quick to respond to questions.",
        "ownerResponse": {
          "text": "Thanks Yvonne, I was glad to see you joined the board!"
        }
      },
      {
        "author": "Dan Altman",
        "rating": 5.0,
        "review": "Access has rented and  taken care of my renal houses for many years . They have been easy and great to work with .",
        "ownerResponse": null
      },
      {
        "author": "tom cruzana",
        "rating": 5.0,
        "review": "Access is awesome! I've been a tenant for over 4 years and they have continuously provided excellent customer service.",
        "ownerResponse": null
      },
      {
        "author": "Kim Dokken",
        "rating": 5.0,
        "review": "Access Real Estate is wonderful. They are always attentive to all our needs. The staff is professional and personal.",
        "ownerResponse": null
      },
      {
        "author": "Software Patriot",
        "rating": 1.0,
        "review": "Constant hurdles with them to get anything fixed.  Expect at least 2 weeks to get anything done with them.  Refused to do have anyone present for the final walk through.  Shady...",
        "ownerResponse": null
      },
      {
        "author": "Alexander Bullock",
        "rating": 1.0,
        "review": "Rude! Absolutely rude never ever look into these guys. Asked them nice questions about cost, viewings and application payment, 9/10 the lady would be rude or hang up and not call back.",
        "ownerResponse": null
      },
      {
        "author": "Kristen Ryan",
        "rating": 1.0,
        "review": "This company is disgraceful. The trick and deceive students into signing unnecessary forms. STUDENTS BEWARE!!! READ everything before you sign.\nDISHONEST. DECEITFUL.DECEPTIVE. That sums it up.",
        "ownerResponse": null
      },
      {
        "author": "Grant DeRemer",
        "rating": 5.0,
        "review": "I have worked with the staff at Access for many years and have always found them very professional and easy to work with. I recommend this company.",
        "ownerResponse": null
      },
      {
        "author": "Dependable Cleaning",
        "rating": 5.0,
        "review": "We have worked with Access for many years they are great to work with. Very responsive and professional.",
        "ownerResponse": null
      },
      {
        "author": "Laura Bethany",
        "rating": 1.0,
        "review": "My mother tried to apply for a rental through this company, and she was treated horribly.",
        "ownerResponse": null
      },
      {
        "author": "Marko Polo 0069",
        "rating": 5.0,
        "review": "I've worked with these people for years and they always seem to do their best to satisfy their tenants.",
        "ownerResponse": null
      },
      {
        "author": "Kimberly Madsen (Sunfireray)",
        "rating": 5.0,
        "review": "This is a company that takes what they do seriously.  Working there I found it easy to get the information I need in order to do my job.",
        "ownerResponse": {
          "text": "Thank you Kimberly!"
        }
      },
      {
        "author": "Gerry Maxfield",
        "rating": 1.0,
        "review": "All my friends only have negative things to say about this business. Horrible customer service and predatory lease agreements. Avoid renting from them!!!",
        "ownerResponse": null
      },
      {
        "author": "Heather Kelsey",
        "rating": 1.0,
        "review": "Both the receptionist and Rachel did not offer help when I seeked documents. They also did not provide such documents.",
        "ownerResponse": {
          "text": "Hi Heather, what documents were you looking for?  If it is something we are permitted to release to you, I can see that you get copies.  Please let me know.  David"
        }
      },
      {
        "author": "Corvett Higdon",
        "rating": 4.0,
        "review": "Wish there was more 3bedrooms but the site is easy to use",
        "ownerResponse": null
      },
      {
        "author": "Sara Tilley",
        "rating": 4.0,
        "review": "VERY PLEASED WITH ACCESS REAL ESTATE SERVICES.  THEY HAVE GOTTEN WAY HIGHER RENTS THAN WE HAD BY RENTING IT OUR SELVES",
        "ownerResponse": null
      },
      {
        "author": "Rosa Marie",
        "rating": 1.0,
        "review": "Just asked to see if a unit was available. Girl was extremely rude.",
        "ownerResponse": null
      },
      {
        "author": "Robert Oswald",
        "rating": 5.0,
        "review": "Have been wonderful",
        "ownerResponse": {
          "text": "Thank you for taking the time to give us a review.  We always appreciate that!"
        }
      },
      {
        "author": "Dana Burnidge",
        "rating": 5.0,
        "review": "Friendly staff, great to rent with.",
        "ownerResponse": null
      },
      {
        "author": "Ann Lavigne",
        "rating": 1.0,
        "review": "They are very unproffessional and rude",
        "ownerResponse": {
          "text": "Hi Ann, I don't see your name in our system any where.  Would you mind elaborating on your comment so I can see if there is something I can help you with.\n\nDavid Long"
        }
      },
      {
        "author": "G. Elaine Nash",
        "rating": 1.0,
        "review": "Would be nice to do a minus review\nTotally rude",
        "ownerResponse": {
          "text": "If you are going to post a negative review, it would be nice to know what the problem was.  Just complaining doesn't tell me, the owner, or anyone reading your review anything other than you are unhappy."
        }
      },
      {
        "author": "matthew chapanar",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kevin Esser",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shannon Stocker",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Champion Gibson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shayla Saenz",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Samanda Dillard",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Trish",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Bo Watkins",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sarah Slayton",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tiffany Denniston",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "John Gunderson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi John, thank you for taking the time to give a 5 star, much appreciated.  It's a pleasure working with you!"
        }
      },
      {
        "author": "Haven Skye",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "MrThorbis",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the review!"
        }
      },
      {
        "author": "Taylor Ladson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brenda Anderson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Brenda, I actually asked for your rating to be removed because there is no evidence that you were either a tenant or a client of ours.  If you worked with us with a different last name, please let me know.  I like to investigate things anytime we get negative feedback.  It gives us an opportunity to identify any areas where we do have shortcomings or explain a little better to you why things happened the way they did.  Please give our office a call if you have an item you'd like to discuss."
        }
      },
      {
        "author": "Jessi M",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joelee",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Anna McBrady",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Anna, I believe you called our office earlier today and asked whether you could pay your rent late.  You were informed there would be late rent fees if rent was not paid on time.  This policy is spelled out explicitly in your lease.  While not always a popular policy, we do strictly enforce rent due dates for all of our properties.\n\nIf you are upset about something different, please let me know and I'll respond.\n\nDavid"
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Margaret E.",
        "rating": 1,
        "review": "Wish I could give zero stars. Never had an issue with a property management company before this one (call me lucky I suppose). However, this company finds sneaky ways to charge you fees (not small ones), and their customer service team will deflect and ignore any concerns you have regarding the clarity or legitimacy of said fees. Reaching out to the owner, Rachel, was also not helpful as she never answered any emails and the rest of her team would not ever put me in touch with her. Above all, Access's customer service was the worst I've ever dealt with. Customer service is hard work but they were consistently beyond rude any time we called, acting like it was a massive inconvenience to deal with anything.",
        "ownerResponse": null
      },
      {
        "author": "Jaspreet T.",
        "rating": 1,
        "review": "Access has good people that seem to mean well but some are incompetent at their job. If you decide to move forward with them, expect poor service on weekends, independently check on your property after the tenant moves out, and most importantly, check their math! \n\nDuring my experience, I had rude customer service when I called on a Saturday, my property smelled of wet dog after the tenant moved out, and I was overcharged on multiple occasions. Access was quick to correct their accounting mistakes when I pointed them out so I would highly encourage anyone who uses their services to double check their invoices and challenge them as necessary - I was overcharged multiple times during my ~6 months with access.\n\nThe aforementioned inconveniences make the overall experience unpleasant. To the access team, I recommend double checking invoices before sending them out and maintaining an open line of communication with owners.",
        "ownerResponse": null
      },
      {
        "author": "Rusty S.",
        "rating": 1,
        "review": "ATTENTION BELLINGHAM STUDENTS,\nACCESS IS ESSENTIALLY THE COMCAST OF RENTAL AGENCIES\n\nThis is the first business that has ever been so thoroughly unethical, that I felt compelled to warn the public about them.\n\nThese people are scam artists through and through; preying on the young and financially challenged. Their business seems to generate a significant portion of its income from fines, fees and extravagant move out charges. \n\nThey are very good at making it abundantly clear that their only goal is to generate profit and any expense. \n\nAdditionally, it seems that their business is very disorganized. They can not seem to keep track of any maintenance requests or documentation. After several written requests for repairs to features that were damaged upon move-in, we eventually gave up and just accepted that we were going to have to live with the pre-existing damage. Little did we know they would attempt to hold us financially responsible for said damage upon move-out.  \n\nThese people are not to be trusted and will take any action necessary to exert their power over the young and under privileged. If you attempt to dispute any of their actions or charges they will NOT hesitate to block youfrom contacting them, or even go as far as to take preemptive legal action against you.\n\n\nYou have been warned.",
        "ownerResponse": null
      },
      {
        "author": "LaVerne S.",
        "rating": 5,
        "review": "We're new to Washington and found Access to be very helpful in finding a new home in the Bellingham area.  The staff was welcoming and helpful - every detail, both small and large, was anticipated and well managed.  Thanks for making such a great first impression for our new home town.",
        "ownerResponse": null
      },
      {
        "author": "Donna W.",
        "rating": 2,
        "review": "Rudest owner around in property management,...  AND SHE WAS WORKING FOR ME!  ...   Procrastinates everything by saying she is working on it.  Closed minded, unwilling to consider any suggestions. Forgets who she is working for.  She is going to do what benefits her and at her convienence only, and that is that!\n\nI gave this service 2 stars because she has some very nice, intelligent and personable employees.  Otherwise, she personally, gets zero stars from me.",
        "ownerResponse": null
      },
      {
        "author": "Ludi C.",
        "rating": 1,
        "review": "Access refused our request to do the inspection walk through for check-out. I had never come across a company so uncooperative. Then I found out why- they took almost $600 from out deposit ! I had NEVER experienced such a huge amount taken out. We cleaned! The checkout notes said we damaged things that were already damaged. The damages even showed in their rental advertisements. When confronted with the advertisement pictures showing the damages, Access then changed their story and said all $600 was for 10 hours of cleaning. They also charged us $60 for changing a battery in the smoke detector when we already changed it. They did not listen, just took our money like some god damn robber. This family owned business is a family of thieves who prey on especially young inexperienced rentors. I'm considering taking them to small claims court to get our money back!",
        "ownerResponse": null
      },
      {
        "author": "Donald B.",
        "rating": 1,
        "review": "My particular experience with this company was far from positive.  They cancelled a showing 30 minutes prior and then as a consolation said that I could show up at a group showing to get involved with a circus.  I am inclined to never do business with them.  I hate the fact that it is a landlords market where they can treat everyone like they are in the hunger games.",
        "ownerResponse": null
      },
      {
        "author": "Beth M.",
        "rating": 1,
        "review": "Drove over 6 hours only for one of our scheduled showings to have been forgotten about so we waited 20 minutes in a parking lot for nothing. Another house we looked at had rotting beams under the raised parking and overall disrepair and uncleanliness, exposed pipes, garbage under the home, etc. One prospective tenant described the beams as \"rickety\" and was immediately snapped at by an employee who insisted that the overhanging platform was a part of the road (it wasn't).",
        "ownerResponse": null
      },
      {
        "author": "Kyle A.",
        "rating": 5,
        "review": "The owners truly care about their customers and have very agreeable in assisting me as a renter.",
        "ownerResponse": null
      },
      {
        "author": "Dana B.",
        "rating": 5,
        "review": "Access is a great place to rent with! Their staff is courteous and professional, far beyon any other rental agency located in Bellingham. I recommend them to anyone looking for an excellent rental experience.",
        "ownerResponse": null
      },
      {
        "author": "Alicia P.",
        "rating": 1,
        "review": "If you enjoy renting from a company that actively steals from you, tries to upcharge without checking info, and doesn't care about their tenants than access is right for you! While renting from them for one year we experienced water coming up from the floor boards and were told this was a normal and ongoing issue and they would \"look into it\", they did not. We experienced plumbing issues, including waste leaking in from the upstairs unit, and Access was unhelpful and unconcerned. After an attempted break in we had to threaten them, as they kept hanging up, in order to have basic security measures enforced such as nailing the windows so no one could sneak in again. Additionally we were repeatedly \"charged\" for utilities and bills that were not in our name but in the last tenants information. This billing issue took over three months to fix and because of their speedy turnover in personnel we never talked to the same person twice. This company will take full advantage of anyone and especially college renters who may not be familiar with renters rights, an issue I now know by heart. I would give them negative stars if I could. Please avoid this godawful agency at all costs. I wish I had seen a review like this before I had signed a lease.",
        "ownerResponse": null
      },
      {
        "author": "Meghan M.",
        "rating": 1,
        "review": "I scheduled a showing that was confirmed by text multiple times. When I showed up for my scheduled showing, there were four others waiting as well. Nobody showed up. We later found out the house was already occupied. Very poorly managed.",
        "ownerResponse": null
      },
      {
        "author": "Alyssa T.",
        "rating": 1,
        "review": "STAY AWAY! Access just wants your money, is horrible at getting back to you about SERIOUS issues (until you threaten to sue them), and does not include everything they advertise! I will never rent through them again and I suggest everyone and anyone stay away if at all possible.",
        "ownerResponse": null
      },
      {
        "author": "Kristen R.",
        "rating": 1,
        "review": "COLLEGE STUDENTS BEWARE!!!!\nThis company uses deceptive and dishonest business practices. Please be sure and READ everything before you sign. This business is in the habit of taking advantage of college students who trust them. After working with Alex on a matter pertaining to my son's lease, I requested to speak with his supervisor. FIVE times. I was never given the information. I feel like the supervisor was aware of the situation and chose not to speak with me.\nDECEPTIVE. DISHONEST. SNEAKY.  SHAMEFUL.\nIf I could give less stars I would.",
        "ownerResponse": null
      },
      {
        "author": "Scott M.",
        "rating": 5,
        "review": "Access has been excellent from day one!  Have worked with several local Property Management firms over the last 8+ years, and they're the best around.  Highly Recommend!!",
        "ownerResponse": {
          "text": "Thanks Scott, It's great working with you too!"
        }
      },
      {
        "author": "Cheryll K.",
        "rating": 5,
        "review": "We have been very pleased with the services of Access Real Estate during the almost four years we've worked with them. We can't imagine a more responsive, courteous, and capable group of people.",
        "ownerResponse": null
      },
      {
        "author": "Dave M.",
        "rating": 1,
        "review": "Worst service I have received by a real estate company in Bellingham. This town is notorious for having its shady real estate services that exploits the students in the community. Access is a perfect example of this. Very unprofessional and rude",
        "ownerResponse": null
      },
      {
        "author": "Cheryll K.",
        "rating": 5,
        "review": "As 2017 draws to a close, we want to thank Access for another year free of rental-home worry! The Access team takes good care of us and our tenants. Prompt, courteous, absolutely dependable and completely professional, the folks at Access problem-solve 24/7 so we don't have to. Nothing ever falls through the cracks, and their reports and accounting are impeccably done. Thanks, Access! You're the best.",
        "ownerResponse": {
          "text": "Thank you Cheryll, You are an absolute pleasure to work for!"
        }
      },
      {
        "author": "Susanne S.",
        "rating": 4,
        "review": "Access manages our condominium complex extremely competently with only a few relatively minor glitches.  Phone calls are returned and emails responded to in a timely manner.  I can't imagine anyone better to work with than Access.  Personnel are cheerful and accommodating.",
        "ownerResponse": null
      },
      {
        "author": "Jaya V.",
        "rating": 4,
        "review": "We've been using Access for property management for a few years now and have been very pleased with them. They have notified us of any problems with our rental property and given us the choice of fixing it or having them hire someone to do it. They find new tenants, collect rents and pay us, all without a hitch. Personnel have changed over the time we've been usuing them, but we've always been treated politely.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 98,
  "adjusted_rating_average": 3.3
}