{
  "name": "Brampton Court Apts",
  "slug": "brampton-court-apts",
  "company_type": "property",
  "address": "1470 Birchwood Ave Bellingham, WA 98225",
  "review_count": 30,
  "average_rating": 2.33,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Colby W.",
        "rating": 4,
        "review": "All the negative reviews are from quite awhile ago. My wife and I moved in here in September of 2016 and have had quite a wonderful experience, in fact we just signed a new year lease! \n\nWhen we were looking for apartments, I was initially turned off because of all the yelp reviews, I decided to take a look at the place later on because finding housing is tough around here! \n\nThe rates were great on the site and they allowed pets, but we were looking at the old site. Apparently the old owners own www.bramptoncourt.com but the actual site is www.brampton-court.com \n\nParking can be quite difficult at times as parking permits aren't really enforced, but you can always find a spot (depending on how much you want to walk),some parking spaces can be extremely tight (I recommend going for the bigger ones)\n\nThe noise level is not that bad at all! It all depends on your neighbors, which is true with any complex you live in. \n\nMaintenence is always quick to solve our issues and despite there being no fencing or controlled access, it is a very safe place to live. \n\nSince living there, I've had no break ins or attempted break ins, no stolen packages, and no feeling of being creeped on (besides my inlaws showing up unannounced)\n\nAnyways...... Past reviews don't reflect how it is now :)",
        "ownerResponse": null
      },
      {
        "author": "Kalia S.",
        "rating": 1,
        "review": "This place is absolutely insane. The rent they ask for is ridiculous with the layout. So imagine you're wanting guests to come over for a dinner, or even game night. Let's pretend one of your guests wants to use the restroom, welll that's too bad! They'll have to walk through YOUR ROOM! I can't even open my fridge unless I close my dishwasher, and don't even get my started on the trim. My grandma could've done a better job building the place.",
        "ownerResponse": null
      },
      {
        "author": "Shelby A.",
        "rating": 1,
        "review": "The rental rates on the website are lower than what you end up seeing on the lease, ripoff alert.\n\nYour rent will go up quickly. And you can kiss your $500 deposit goodbye when moving out.\n\nThey will take advantage of college students and Coast Guard people due to the temporary housing needs. \n\nDishonest and bait and switch business. Avoid!",
        "ownerResponse": null
      },
      {
        "author": "Justin B.",
        "rating": 1,
        "review": "I wouldn't recommend living here. Management changes too frequently. The living room windows don't open and there's no AC so the apt get way too hot! It's miserable.  Driving my power bill up by trying to stay cool",
        "ownerResponse": null
      },
      {
        "author": "David F.",
        "rating": 1,
        "review": "Do Not Rent here. The service is Terrible. When signed our lease we were lied to about being able to sign over our lease to someone else if need be. The Property manager said it was completely okay to do and that it \"happens all the time cause this is a college town\". \n\nWell now that we are trying to sign it over, Jeannie from the Corporate Office, said that we are not allowed to do it. This is AFTER she was okay with it. Originally everything was okay because we had a State of Washington employee ready to take over our lease, then he backed out. Now we have some college kids from California who are ready to take over and now its a problem. Seems like discrimination to me. \n\nI'll never do business with Coast Management ever again.",
        "ownerResponse": null
      },
      {
        "author": "Alexander A.",
        "rating": 2,
        "review": "Way overpriced. There are 2 websites, bramptoncourts.com which is NOT current, and brampton-courts.com which has the current, much higher pricing. 1bed listed on old site is $785, $1025 on new site. These are in no way $1000 apartments. I first stopped by to look at a 1 bedroom and just laughed out loud. It was ok in regards to space and had decent natural light, but it REEKED of smoke even though this is supposed to be a no smoking complex. Also, several of the lights (which are those long industrial bulbs) were out or going out. This was supposed to be move-in ready! Just not at all a $1k apartment. I stopped by one more time to look at what she told me was a different unit. (She didn't realize it was the same one.) They had replaced the carpet and the smoke smell was gone, but it still just wasn't a $1k apartment. No way. I found one at The Edge which actually is one.",
        "ownerResponse": null
      },
      {
        "author": "Donna A.",
        "rating": 1,
        "review": "My daughter moved in here and has been lied to, bullied by management, and has not had a full night sleep since moving in. She discussed a 6 month lease and was presented with a full year when she went in to sign the paperwork. Since College had already started she signed without consulting anyone, not knowing that type of bait and switch is a huge red flag regarding future interactions.\nThe few times I have tried to visit and spend the night the neighbors are up all night and making a huge amount of noise, the downstairs neighbor is a drinker and smokes like a chimney, the smoke blows directly into my daughters apartment if she even opens her slider door one little crack. The manager Amanda, is the worst person I have ever had the misfortune to encounter, she is the one that lied about the lease and had my daughter sign something doubling the time. Please be warned, we learned the hard way and am now seeking a lawyer to fight this shady place. Look for somewhere nice, and please ask about management before you move in any where, that's where the problem lies here!!!\n\nUpdate: After dealing with ants, extremely noisy neighbors, numerous phone calls to the police, fights in the parking lot at 3am,  and the apartment managers doing nothing about it, we finally moved my daughter out. BEWARE!!! They are now saying they have purchased from the old owners and no deposits have been transferred over to them. They have $1,000 of our money unaccounted for and won't provide any information. We also were told to not clean the apartment too much as they were going to go in and gut it,  Then we were told they had to spend 2 hours cleaning the kitchen! I cleaned that myself, not my daughter and it was cleaner than when she moved in! Now they say they aren't giving our cleaning deposit back, so there is another $350!!!!! Anyway, telling us they don't have our deposit is illegal, we have spoken with an attorney \n and she told us this is totally illegal, and are looking to begin a class action lawsuit. We welcome anyone else having issues with this apartment complex to contact us. We will be posting on Facebook, Twitter plus handing out flyers and posting in the parking lot of the complex. Strength in numbers people, illegal and shady apartments cannot be allowed to continue behaving like this with no consequences.",
        "ownerResponse": null
      },
      {
        "author": "Tom L.",
        "rating": 1,
        "review": "After moving into Brampton court my apartment was invaded with ants. Talked to management about the problem and they gave me some ant bait boxes that did not work. I spoke to management a second time and they gave me more bait boxes and said there was nothing else they could do. The second round did not help either. I put up with the ant problem the entire 5 months I was at their location and they just had the oh well attitude and did nothing to remedy the situation. I had a cat and probably threw away about $30.00 worth of cat food due to the ants. I never was more glad to be out of a place. I also spent time cleaning and was charged for little things like dust on the side of a cabinet. I definitely would not recommend this apartment complex.",
        "ownerResponse": null
      },
      {
        "author": "Stef J.",
        "rating": 1,
        "review": "Tthese apartments are very noisy. Neighbors blast music late at night. Doors slamming. Noise in the parking lot at all hours.  Management unresponsive to complaints even though the police have been called. Parking is very difficult.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Kalia Fehlman",
        "rating": 1.0,
        "review": "I would LOVE to have a conversation with the people who built this place because, its done horribly. If you have a guest over and they need to use the restroom, well guess what they need to walk through the apartment into YOUR ROOM to get to a bathroom. Dont even get me started on the trim of this place, haha I can literally stick my whole finger in the trim. (Thats where the ants come into play) yes ANTS. The apartment complex does nothing about the infestation but gives you a spray can. Basically saying youll need to figure it out yourself. OH and to add if any of your lights go out YOU have to buy new ones, not the complex, and theyll even tell you it doesnt matter what the wattage is.",
        "ownerResponse": null
      },
      {
        "author": "Juliana Ruiz",
        "rating": 4.0,
        "review": "We lived at Brampton for 5 years before buying our house. It was affordable and a good place to call home. Even with the changes in management throughout the years, they always answered all of our concerns or questions straight away and acted on it if needed. The apartments are pretty old, but the maintenance workers are nice and good at fixing things. As far as loud annoying neighbors, you will find that in any apartment building; management was always quick to respond on any noise complaints wed put in. You will need a portable AC unit in the summer, we had one in the living room and one in the bedroom and it was more than enough to keep us cool through the warmer months. If you have a dog, the place is very pet friendly as long as you leash them and pick up after them. They were also very reasonable with what they charged us for move out fees after half a decade of wear and tear of the place. Overall Id definitely recommend!",
        "ownerResponse": null
      },
      {
        "author": "A",
        "rating": 2.0,
        "review": "Where to begin. There's a lot of open space in these units, you're able to pretty much lay out your living area however you want. Though, it is an odd design choice to have the bathroom only accessible through the bedroom. If you like mirrors amd gold trim you'll be in heaven, many of the walls have sliding mirror doors which open up to a surprising amount of space.\n\nRent seems fair enough, but I was only there for nine months so my rent never had a chance to raise.\n\nI can't recommend anyone live here unless you have too. I turned my heater off in the middle of winter... It was still insufferably warm due to some of the worse insulation I have ever experienced. With only one window that opened in the apartment, even with an AC unit and several fans, the apartment would get up to 85 degrees.  I had my AC running through September and October it got that hot.\n\nIt also took management upwards of two months to replace stairs that had rotten through and were unsafe.\n\nThere's a large transient community in the parking lot next door. No big deal normally, but I'd find piles of puke in the parking lot from time to time.\n\nOverall, good learning experience.",
        "ownerResponse": null
      },
      {
        "author": "Red Pumpkin",
        "rating": 1.0,
        "review": "I used to live here for a year and at first I thought it was a good apartment complex....for my first time living on my own....and wow was I wrong. During the winter, fall and spring the apartment was pretty comfortable overall with just two box fans, one oscillating fan and one exhaust fan. But as the summer came around, the fans didnt do anything to cool down the inside of the apartment, it was so bad that I had to leave my apartment for days and stay at Starbucks or the library to stay cool.\n\nThis is unacceptable with how horribly insulated the apartment is, I feel like I could have gotten heat stroke if I wasnt careful, things didnt start to fully cool off until 2 in the morning and then I was able to finally sleep comfortably. Whenever I had called for help on something that wasnt working, it took about two weeks until someone could finally come and fix, dish washer, dryer/washer, etc. Also certain dogs arent allowed here, puppies/Pitbulls/German Shepards/ Rottweilers and mixed breeds but I saw some of these breeds before, management here I thought was strict and on top of making sure everyone living here is accommodated, guess thats not true.",
        "ownerResponse": null
      },
      {
        "author": "Jillyn Dillon",
        "rating": 4.0,
        "review": "The application process is a bit antiquated and slow-moving.  However, the lease agreement is very fair, and the month-to-month arrangement is tough to beat.\nWe were in a 2BR 1BA top-floor unit and moved to a 2BR 2BA ground floor unit. Both units were nicely laid out. The flooring, appliances and counters are all base-level, but that's to be expected at this price point.  The complex is clean, and the landscaping is well kept. Residents receive parking passes. The parking is unassigned and can be somewhat tight. This is a dog-friendly complex, and that's apparent from the number of dogs being walked on the property at regular intervals. However, all of the dogs here seem well behaved and are relatively quiet.",
        "ownerResponse": null
      },
      {
        "author": "Sarah Supit",
        "rating": 2.0,
        "review": "With all the pros and cons, it is fair. Rent was raised a few hundred dollars by the time I left. I previously gave a 4 star rating because of being a dog owner in Bellingham (difficult to rent in town), month to month, and the resources all around you. The old owners were great and the new owners somehow lost a lot of records.\n\nI lowered it to 2 star because when moving out near the end of last year, I hired a cleaner and spent two days deep cleaning. I'm not a messy person, neither my roommates. We deep cleaned to make sure we got our deposit back. The office woman had mentioned how not to vacuum because they will vacuum anyways, and we wouldn't get charged for it. I knew I should have asked for it in writing, that was my mistake. I deep cleaned everything, every corner, washed the walls so I could get my deposit back. I lost my deposit of $700 and they charged us another $200+, I wasted my last days cleaning when they took my money anyways.\n\nPrevious post that was still my honest experience living their: They are pet friendly, my dogs love the walk I take them around here and it's close to Birchwood park. If my car broke down today I could walk to get my groceries, go see an optometrist, clean my car and get it repaired at the shop close by and eat at a restaurant within less than a 5 min walk. Or go shopping at the mall and walk back 20-30 min.  I also donate a lot of old belongings to the salvation army nearby and bike around the plaza parking lot. 7/11 is nearby for my 3 am snack and I really appreciate the little things, even the gas station SUPER close before I do my road trips.\n\nThe reason it's not a higher star is not much of a view, not the nicest neighborhood and occasional homeless persons every now and then. If I had children I wouldn't want them cursing the way they do around these side walks. New management is not bad I got a new toilet with a button woo hoo lol\n\nAdvice living here: Ask for anything they say in writing. Everything, to watch your own back. Also, keep a second record of everything. I was not a bad tenant, we were the tenants who shooed off a lot of the homeless people and called the cops when they would scream and chant at 2 am. That leads to my last advice, do not be afraid to call the cops if you see anything strange or pestering in the neighborhood. Because if you don't, these people will come back to bother you.",
        "ownerResponse": null
      },
      {
        "author": "Maddi",
        "rating": 1.0,
        "review": "Seriously.... the longer you stay here the worse it gets... We moved here into a two bed two bath with rent at $985 a month and we were going to lease again despite the neighbor issues because the property itself wasn't trashy, but they raised the rates to 1180$ a month!\n\nIt states in the lease that the property is /federal/. We have a bad streak of bad neighbors breaking rules. Families leaving piles of garbage in front of the doors and one neighbor blasting a bass subwoofer at all hours of the day and sneaking their dogs and psycho girlfriend in to live full time. These people got evicted, fortunately, but not the most recent downstairs neighbors: They smoked cigarettes and weed hourly and I overheard them throwing the beer cans into the little river in our backyard. I complained to the landlord but they couldn't control these college kids, apparently! My room always smelled like smoke if I kept my screen door open.... Which I did - especially in the summer - because it was the only \"window\" in the apartment. This lasted all year, man!\n\nI wanted to live here because it was strict, which is what I desired because I don't drink or smoke and I sleep early, and I felt like the owners would care to uphold these rules but NOPE.",
        "ownerResponse": null
      },
      {
        "author": "Serge Plex",
        "rating": 1.0,
        "review": "Constantly switching management, VERY poorly insulated apartments (you will be cooking during the summer from heat and/or humidity), rude and self-centered property owners that only care about your paycheck, and inconsiderate neighbors... Oh! And no puppies. I DO NOT recommend living here. You can do better.",
        "ownerResponse": null
      },
      {
        "author": "indya simpson",
        "rating": 5.0,
        "review": "We have been here 6 months. Everything has been easy for us here even at application process.  I love the location being close to Cornwall. We have a little one so going to the park is very simple. They are ok with making sure there is no cars park that dont belong. The staff is nice. Our nabors are nice.",
        "ownerResponse": null
      },
      {
        "author": "Heather Pulju",
        "rating": 5.0,
        "review": "Reasonable rent, close to shopping, friendly neighbors and staff. We've lived here 2 years now and still very much enjoy it  ",
        "ownerResponse": null
      },
      {
        "author": "Mike Linebrink",
        "rating": 3.0,
        "review": "Not too bad of a place. Free internet isn't the best but hey it's FREE! Decent pool and lots of kids.",
        "ownerResponse": null
      },
      {
        "author": "Luis",
        "rating": 1.0,
        "review": "slumlords",
        "ownerResponse": null
      },
      {
        "author": "Jeff Bingman",
        "rating": 1.0,
        "review": "The longer you stay here, the worse it gets....",
        "ownerResponse": null
      },
      {
        "author": "Jessica Ridge",
        "rating": 1.0,
        "review": "Be careful when you live here.",
        "ownerResponse": null
      },
      {
        "author": "Rafael Sanchez",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Dolola Ava",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "jorge miranda",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Maddie Marie Walker",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Confirmed Trash",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Enna Anderson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jasmine Fast",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 23,
  "adjusted_average_rating": 1.96
}