{
  "name": "Elevate Bellingham",
  "slug": "elevate-bellingham",
  "company_type": "property",
  "address": "900 N Forest St Bellingham, WA 98225",
  "review_count": 19,
  "avg_rating": 2.3,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Branden W.",
        "rating": 1,
        "review": "This place sucks every is broken and the never fix anything, our door lock has not work for almost a year and they were not able to fix it, all the exit signs are broken and there is hardly fire extinguishers, there are holes in the walls and the game room has been closed for like two years off and on, the rent is to high for the experience you get living here...",
        "ownerResponse": null
      },
      {
        "author": "Doug B.",
        "rating": 1,
        "review": "Please read the following post before renting an apartment at The Elevate.\n\nMy son has lived here for a couple of years now.  Recently, the batteries went dead on the electronic lock on his door so he was unable to lock his door.  He notified the management that he could not secure his apartment (studio) and that he was basically stuck at home there until maintenance could fix his door lock.\n\nThe management sent the maintenance guy down who told him that they could change the batteries out but didn't have the computer program to re-program the locks (computers with program on them stolen evidently) so his apartment would remain unlockable.  This was on a Thursday.  My son went back on Friday.  No resolution, no plan, no repair just lots of excuses to not repair door.  No urgency, no apparent desire to solve the problem before the weekend. Entire weekend then stuck in an unlockable apartment.  My son missed his weekend at work because he could not lock his door and leave and subsequently missed out on a couple hundred dollars of pay.\n\nMonday, same song and dance.  Run around from management.  Calls to regional manager who wouldn't answer phone and apparently would not authorize the placement of a simple mechanical lock on the door. \n\nOn Tuesday I got involved and called asking to talk to the manager.  She was pleasant but said her hands were tied.  I requested to talk to regional manager and got his number.  Based out of Arizona, he would not answer my calls or return my calls.  Several attempts but no contact and zero customer service.  I asked the building manager if they could at least put a standard mechanical lock on the door so he could lock his apartment and attend class. More run around, no resolution.\n\nFinally on Wednesday, we heard they were going to fix the lock sometime between 10am and 2pm.  My son went to class expecting the problem to be resolved.  Came back from class-door lock still broken.\n\nThursday, one week from door lock problem the maintenance guy came back out and put a mechanical door lock on his door which is what should have been done on day one. \n\nSo, what is your time worth?  What value do you put on expecting that your apartment is going to be lockable and secure?  What value do you put on your belongings?  Your computer and personal items?  What does it feel like to be sequestered in your room because the management would not authorize a door lock for your apartment? (a really simple and inexpensive fix)  What kind of obligation do you feel toward your employer and the job that you have?  What dollar value do you think this should impact rent?\n\nPlease remember that Elevate is a private for profit business that recognizes that students are transitory and likely will only live there for a year or two.\nTaking care of their residents does not appear to be a priority in any shape or form.  Please take this into consideration before renting an apartment here.\n\nDoug S",
        "ownerResponse": null
      },
      {
        "author": "Erika S.",
        "rating": 1,
        "review": "Guess what? People moved out in August 31st and didn't get their security deposit back. I guess I'll be filling a claim in court because they aren't even calling me back to give me a reason why it's taking so long.",
        "ownerResponse": null
      },
      {
        "author": "Kristine P.",
        "rating": 1,
        "review": "Our daughter moved out in August and has been trying to get her deposit back since then. Don't rent here!!  They don't respond when there's anything broken. They don't respond when you ask for your deposit. Just look at the responses on this page - they only respond to positive reviews. Very sad. I hope all renters get together and take them to court over deposit issues.",
        "ownerResponse": null
      },
      {
        "author": "Andrea W.",
        "rating": 2,
        "review": "For one bedroom in an apartment with 3 other roommates the cost is too high. Most amenities were not available while I lived here, there was no change to rent and the company withdrew their offer for reduced rent with proof of good grades. \nThe staff seems to do their best but were ill-equipped for the maintenance necessary for the building. The only elevator to the non-reserved parking garage is frequently in disrepair including on move-in day, forcing residents to walk up 3-7 flights of stairs to access their apartment (folks with ability impairments too!) \nNeighbors within the building are often inconsiderate in 3 ways: 1) noise penetrates the walls, floor and ceiling so there is potential disruption from any and all directions making studying from home a challenge. 2) messes in the trash room, hallway, parking garage and other common areas are constant. The 6th floor entrance is frequently soaked in dog urine. 3) many residents (and staff) don't follow COVID guidelines regarding large gatherings and wearing masks. \nYes this apartment has conveniences but there are also many drawbacks.",
        "ownerResponse": null
      },
      {
        "author": "Julia G.",
        "rating": 1,
        "review": "Too expensive, especially considering they never fix anything. There has been a door into the mail room that has been broken for six months and they just haven't bothered to fix it. There was an alarm that was going off for about a week in the basement that I honestly don't know what was for but it wasn't life threatening so idk why they never shut it off. They also stopped sending notifications for when you get packages (which btw is annoying that the hours to pick them up are really limited) at one point without telling anyone they would and my roommate needed her meds but had to go a few days without them since she didn't know they were here... the trash room is always a disaster, the dishwasher is unreliable, and the vibe is like a hotel dorm situation. That being said dorms are usually more maintained. To be fair everyone that worked in the office quit on the same day so I can see why for a while the maintenance was worse than normal but then you have to question why everyone quit. Also the certification for the elevator expired, and it was down for a hot minute so not good for accessibility reasons AT ALL. This complex is located on a street that a ton of party houses are on so I hope you like noise and fireworks at 2am. Also just cars are loud and frequent. The walls are super thin though so everything is loud. \nNow I know covid made things difficult and that's fair, but the amenities were down for the majority of the time and they never did anything to make up for it (such as a refund for amenity fees as an example) \nIf you're thinking about moving to bham, especially as a student, just get a house, it's roughly half the cost per month if you can get some good roommates (and it's easier to avoid them in a house if they are bad so...)\nIt seemed like a good decision when we signed the lease, but that wasn't the case.  Covid did screw some stuff up and it probably would have been better without it and they might have gotten a higher rating from me, but they handled it poorly, it's like they gave up on everything, and they it really hard to get of the lease so I know people that never set foot in here and still paid full price the whole time. \nTLDR; they need to Elevate their standards",
        "ownerResponse": null
      },
      {
        "author": "Gina A.",
        "rating": 1,
        "review": "My daughter moved out of Elevate August 2021. I co signed on her lease, and they asked for a 2,400 dollar deposit. She was going to move back to Oregon, and needed the deposit for another apt. They said it would get to her soon. We communicated with Veronica in the office weekly for awhile. She was always nice and answered our questions. The weeks turned into months, and still nothing. They would tell her to tell us it in was in the mail. The employees at Elevate were always nice and helpful, but management was not. We decided to take them to court at one year, and just served them papers. We were angry at how management brushed us off, and asked for what we thought was fair. It's the day before court day14 months later, and they agree today. Elevate was   not at fault in this matter and Veronica the office mgr. is a very nice person! It's just too bad we had to go that far just to get our money back.",
        "ownerResponse": null
      },
      {
        "author": "Lori G.",
        "rating": 1,
        "review": "TERRIBLE communication regarding anything.  My daughter moved out 8/31/2021 and we have yet to receive her security deposit.  We've reached out and they have nothing to say except it'll come eventually.  It's been over two months which is over the allowance by law.",
        "ownerResponse": null
      },
      {
        "author": "John S.",
        "rating": 1,
        "review": "BEWARE! This management company will take every penny they can get from you, no matter the circumstance.  Be very aware of what you are signing!\nOur friend's son had to leave school and his apartment to return to Seattle for treatment of cancer.  Our friends found a new renter to take over the lease but the management company refused and are holding our friends responsible for the remaining rent.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Trey",
        "rating": 2.0,
        "review": "I unfortunately lived here for 1 whole school year, and boy did I encounter a ton of interesting things.\n\nPros: Maintenance crew. These guys are the only thing keeping this place afloat, and they dont even have that large of a team, quick responses to tickets for apartment issues when I sent items in (bulbs out or closet off the tracks).\n\nCons: Lack of security, Managers, front hosts, price\n\nSecurity: Not only did I encounter a homeless man passed out in the stairwell when going in for a morning final, I had my car vandalized within the garage of this complex, as well as encountered a trespasser at 4am lurking around my floor looking for unlocked rooms. I too came across someones back car window smashed out and items stolen within (premium parking spot, 2nd floor garage).\n\nThe garage is a hotspot for sketchy things to happen, and this all stems from the company being too cheap to install a gate, the maintenance team recommended this a while back, but the company refused it due to the cost.\n\nManagers: I dont understand how these people still have jobs, they sit at their desk for 8 hours managing the front hosts, and dont do anything useful, theyre not lenient in re-scheduling room checks for people out of town for holidays, theyre not useful in managing noise complaints against other rooms, and from previous posts it also seems as if they cant even get security deposits back to people within a timely manner.\n\nFront hosts - I understand they are college students, so theres only so much they can do with their useless managers, so again not much complaints for them, rather how they are managed. They respond quick to noise complaint responses via text within working hours, but those complaints werent of any help as the I continued to send complaints over (manager not taking action). But apart from that, they are helpful over the phone with questions and helpful when filling out paperwork.\n\nPrice: The apartment price doesnt come with the cost of the monthly garage price; and for the cost of this place, it wasnt worth it. The room itself you pay for an internet router that is on the ceiling, a lack luster living room that is furnished, skimpy drawers for your room and a rock solid prison bed. Not to mention the jail like courtyard that no one ever used.\n\nAll in all, this place is at best a 2/5, for location to campus and the maintenance staff. I would stay away if you can, there are plenty of other better spots around (New England apartments for example). This company will soon go under, it seems like their owner is also running his other locations as poorly as this one in other states, which makes sense as to why the onsite managers are as useless as they are. Unfortunately the maintenance team isnt getting the resources they need in order to keep this place afloat. As for what we are paying, they should have plenty of funds to manage their costs and upkeep, but the owner is losing money, so hes cutting his spending unfortunately. Spend your money on a house or other well managed properties if you can, if this happens to be your last resort, just expect to encounter what Ive written out.",
        "ownerResponse": {
          "text": "Hello Trey!\n\nThank you for sharing your honest feedback with us! We apologize for the inconvenience you have experienced. We would love to hear more from you, regarding your experience here. Please give us a call during office hours and speak to one of our managers. Elevate Bellingham."
        }
      },
      {
        "author": "Scott Langston",
        "rating": 1.0,
        "review": "The things that the management do and don't do here is audacious.\nThings that they do: ask for rent early, walk into your apartment without notice while your girlfriend is changing, randomly shutoff the water, violate the lease agreement terms multiple times. Things that they don't do: fix the security cameras, fix broken locks, have functioning handicap accessibility buttons, clean up the broken glass from the several cars that have been broken into, clean up the puke that has been in the parking garage for over a month now, respect their tenants. Do not live here unless it is a LAST RESORT",
        "ownerResponse": {
          "text": "Hello Scott,\n\nWe're sorry to hear about your experience with Elevate Bellingham. We urge you to adress your concerns as a resident to our property manager. There may have been some miscommunications and oversight regarding notices for the following events listed. Please know that Elevate follows WA state RCW's when it comes to notice of entries, and providing notice when drastic measures occur.\n\nMany of your concerns regarding property related items, are in the hands of our corporate office, which we sympathize with the residents frustration. If you would like to address your concerns further please stop by the leasing office Monday -Friday between 10 am & 6pm, and speak to our property manager who is always willing to adress concerns. \n\nThank you!"
        }
      },
      {
        "author": "Josh Houlding",
        "rating": 4.0,
        "review": "Pros:\nPretty solid apartments. Pricey, but all the appliances are good quality and function well. Nice amenities, including an awesome top-floor deck overlooking downtown, full gym, and study lounge. Close proximity to both campus and downtown is a huge plus. Maintenance staff are fantastic and fixed every issue my roommates and I had within a few hours usually.\n\nCons:\nIn the 3 years I lived here, though, I found there to be an overabundance of irritating, immature people living here. If you live here, be prepared for a fair amount of noise and to be surrounded with people who don't care about others and vandalize exit signs, handrails, floor signs, and all manner of other things. This isn't necessarily the fault of the complex, but it's something to know if you decide to live here. They don't empty the trash room on the 3rd floor enough either, so it was disgusting and overflowing much of the time. Also, because it's on a major road to downtown in a college town, be prepared to hear a lot of loud cars, trucks and motorbikes with modified exhausts. Internet speeds are decent (25mbps down and up), but stability is questionable.\n\nOverall, I don't regret living here, and while I can't say how it compares to other apartments in Bellingham (I only lived in the dorms my first year and here my other 3), it's solid if you're willing to spend a lot. It seems like Elevate gets a lot of hate, and I don't think most of it is justified.",
        "ownerResponse": null
      },
      {
        "author": "Nick Houlding",
        "rating": 5.0,
        "review": "Maintenance service quickly restored power to dishwasher. Submitted request and had our dishwasher repaired the next day.",
        "ownerResponse": {
          "text": "Thank you, Nick, for your wonderful 5-Star review regarding our maintenance service. We are pleased to hear that your work order was addressed in a timely manner. Please continue to reach out to us, on how we can better serve our residents. Or any feedback you have regarding our maintenance. "
        }
      },
      {
        "author": "Colleen Mahan",
        "rating": 3.0,
        "review": "Loved the living experience. The room is great and I dont hear much from my fellow neighbors. My one critique is that they arent very clean regarding the fitness room and hallways. I wish they vacuumed and maintained the fitness equipment like their yoga balls, basic cleanliness, and replace broken equipment (like the punching bag). The staff is very friendly and have fun activities for their residents. Maintenance requests are dealt with in a timely manner. There are wifi/ internet problems here and there but overall not an issue day to day.",
        "ownerResponse": null
      },
      {
        "author": "Miranda",
        "rating": 1.0,
        "review": "would give 0 stars if I could moved out 3 years ago and still havent received deposit after legal action.. shady",
        "ownerResponse": {
          "text": "Hello Miranda! \n\n\nThank you for sharing your honest feedback with us! We apologize for the inconvenience you have experienced. We would love to hear more from you, regarding your experience here. Please give us a call during office hours and speak to one of our managers. Elevate Bellingham."
        }
      },
      {
        "author": "Robert Perry",
        "rating": 5.0,
        "review": "The only thing that would have made it better is if there had been a studio apartment to view.",
        "ownerResponse": {
          "text": "Hi Robert! Thank you so much for sharing your honest feedback with us - we greatly appreciate your 5 star review! Best, Elevate Bellingham"
        }
      },
      {
        "author": "Ariana Gant",
        "rating": 5.0,
        "review": "This is my second year living at Elevate and I've renewed my lease for next year. I love living here! When I first visited, Corbin gave me a great tour and from there the application process was easy and the employees were very helpful and kind. I feel safe living here as there is a key fob system so the keys can't be copied and there are locks on nearly every door in the whole building. The facility is always clean and the staff members who fill maintenance requests are always very friendly and helpful. The apartments are spacious and the windows are nice and large. Elevate is pet friendly too, so having a cat has been very easy. Elevate also does a lot of awesome events and giveaways and they offer free printing (you just have to bring paper). The apartment is the perfect distance from the WWU campus- it usually takes me about 5-10 minutes to walk to campus. Overall I would highly recommend Elevate!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Smiles Cas",
        "rating": 4.0,
        "review": "When we moved in, our garage disposal wasnt working well (which seems like something they should have fixed during inspection) but a few days after I put in the maintenance request, it was fixed and sounding and working like it should.",
        "ownerResponse": {
          "text": "Greetings Smilescas,\n\nThank you for your wonderful and honest 4- star review. We appreciate and value the feedback that our residents have to offer. We are glad that our maintenance team was able to fix the issues you had experienced with your disposal. We do apologize for the inconvenience, when you moved in. While we do work to resolve all maintenance issues during our turn inspection process, we realize that some items may have been missed. We will continue to improve on this and ensure that maintenance items are thoroughly completed before our residents move-in. \n\nIf you have or would like to provide any additional feedback, please don't hesitate to let us know!\n\nThank you,\n\nElevate Bellingham"
        }
      },
      {
        "author": "Ciera Abrams",
        "rating": 3.0,
        "review": "I moved out on August 31st of last year and did not receive my deposit back. There were promises being made that it would get back but no results. However, the Elevate Bellingham property management wasnt necessarily the bad guy in this case and were very communicative and were mostly just the middleman to get stuff done right.\nThe issue lies with the management company and their tardiness and lax behavior towards getting people the deposit they are owed. After a whole year of communication I can confirm that Veronica, the community manager, was nothing but kind and helpful and truly wanted to right the wrongs that management was doing. Im not saying what they did isnt bad, but from a property level Elevate did all they could to help.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 19,
  "adjusted_rating_average": 2.3
}