{
  "name": "Evergreen Properties NW",
  "slug": "evergreen-properties-nw",
  "company_type": "company",
  "address": "1211 Mill Ave #102, Bellingham, WA 98225",
  "review_count": 18,
  "avg_rating": 4.1,
  "reviews": {
    "google_reviews": [
      {
        "author": "Eryn Messer",
        "rating": 5.0,
        "review": "Evergreen Properties NW has been a DREAM to rent from and deal with as a tenant!  I had a bad taste in my mouth from other property management companies but Casey and his staff took that away from Day 1.  The very few times Ive needed maintenance, I never had to wait and it was taken care of asap.  Not only that, Casey & staff have gone above and beyond a few times when they didnt have to - ALWAYS with a smile, too. Evergreen Properties NW is a breath of fresh air when most companies these days have forgotten what good customer service is!  I will rent from them as long as I need to, for sure. I highly recommend them if youre looking to rent.",
        "ownerResponse": null
      },
      {
        "author": "Katlyn Cummings",
        "rating": 5.0,
        "review": "They have been a very communicative and professional group by owning up to some hiccups upon move-in, and taking responsibility by hiring landscapers to manage the grounds around the units. Definitely an ethical business to work with. Evergreen is an ever-growing property management business and excited to see its' continued success.",
        "ownerResponse": {
          "text": "Thank you, Katlyn!  "
        }
      },
      {
        "author": "Kayleigh Mattoon",
        "rating": 4.0,
        "review": "While working with Casey was enjoyable and he was attentive to our property needs, I cannot give 5 stars. Casey works hard, however, unfortunately, he has abysmal staff who do not communicate with the tenant or with Casey appropriately.\n\nBetween rude and unprofessional text messages received by me from his assistant to clear miscommunication between Casey and his assistant, staff alone lost Casey a top review. Id lower it further if Casey were not a joy to work with.\n\nCasey, you run a strong business. I wish you every success and I hope you can find staff that match your dedication, kindness, and responsibility.",
        "ownerResponse": null
      },
      {
        "author": "Paige Nausha",
        "rating": 5.0,
        "review": "We rented from Evergreen Properties NW for approximately 5 years. We were in the unit for 6 years, but it was managed by another company for the first year or so. We are VERY glad that Evergreen Properties NW took over because from then on, everything was much smoother and the staff was much nicer. I suggest calling the office with questions or concerns, as they are more likely to answer the phone or call back instead of email. Casey is very kind and reasonable to work with. He did a great job with maintenance, but there was sometimes a delay in response. We moved out of state, otherwise we likely would have stayed until we saved enough to purchase a home!",
        "ownerResponse": {
          "text": "Paige,\n\nThank you for the review!  It was wonderful having you both as tenants and would welcome you back anytime!"
        }
      },
      {
        "author": "RYAN HIMMEL",
        "rating": 5.0,
        "review": "Just took over a lease and the whole process was super easy. This is by far the most ethical property management company in the area. Casey specifically is very helpful and responds very quickly with any questions that you may have . Overall very happy with the moving in process.\n\n7/21/20 Almost two years later and this has been a fantastic management company to deal with. Our lease ends next month and we are moving into another place that is also managed by Evergreen. Lara has been beyond helpful as well as Casey. If you plan on renting in Bellingham, I would heavily consider using Evergreen. Nothing beats them!",
        "ownerResponse": {
          "text": "Hi, Ryan, Thank you for the kind review.  We are happy to have you as a tenant!"
        }
      },
      {
        "author": "Bryant Nichols",
        "rating": 1.0,
        "review": "This was my experience with Casey and the group which was awful to say the least.\n\n- Casey was over an hour and a half late to the initial meeting to view the house.\n-The lease he sent over was full of errors.\n-Upon showing up to move in, the house was not cleaned and had a hole in the drywall.  After 3 days, Casey brought in a cleaning crew.  The cleaning crew threw away everything in the refrigerator.  Casey laughed about the situation, saying I guess I should have walked through the house before you guys moved in.\n-The house needed numerous fixes, fireplace, sink leaking, and several other fixes.  For items, like the fireplace, he said he would call a local company to come fix it.  I called the local company to confirm Casey has called them, it did not.  It took 3 months to fix the initial items from move in.\n-The house I rented had a deck which I told Casey numerous time about.  Finally, one of the boards broke under me creating a huge safety hazard.  When I told Casey about this, he said he could not touch the house without the owners permission.  What is the point of managing a property if you can not maintain issues? Especially huge safety issues like a broken board on a 10 foot tall deck.  The issue was never fixed.\n-Lara and Casey always complain of being too busy.  Issues with the house took a long time to resolve.  When I moved out, I still had unresolved maintenance claims after 2 years.\n-This is a second job for Casey as he often bragged about doing construction with the owner.  Again, why he often forgets or issues take a long time to resolve.\n-I had to break my lease which I understand should have some fees associated with it.  They tried to charge me fees that were not in the lease.  It took weeks of arguing and requesting the clause in my lease before they finally did not charge me.\n-Would not allow a lease take over as it was not their policy anymore but could not provide written proof of this.  It is funny how a below review states someone just took over a lease.\n-Charged me for the month of rent for April for my lease break but was fired half way through April and did not refund the rent for the rest of the month.\n-Would not do a final walkthrough of the house upon move out.\n\nI could go on and on about how terrible of a company this is or how much Casey/ Lara does not care about their tenants.\n\nResponse: Ah, yes Casey.  Tenants that pay rent on time and leave the place better than they found it are clearly the ones to avoid.  I apologize for being difficult and making you fix things, like a property manager is supposed to do.  And no, you did not work hard, it took weeks to get a response from you.",
        "ownerResponse": {
          "text": "Oh, Bryant. This review does not surprise me.    Im sorry you feel this way. However, You and your perpetually bitter girlfriend were quite difficult most of time. (Tenants we strive to avoid if I had to be completely honest)  I personally worked with you on many occasions while you were in the process of searching for a home and put up with your dishonestly and excuses the entire time...Sadly, no matter how hard we tried, you werent pleased.  Fortunately for us, you guys moved on.  Please call the office and ask for Casey should you have additional concerns.  Id love to discuss this with you in person.\n\nBest of luck to you both!"
        }
      },
      {
        "author": "Zack Elan",
        "rating": 1.0,
        "review": "incompetent and inconsiderate - they will waste your time.\n\nI made an appointment to view one of their available rentals. told the guy I'd be driving from Seattle to Bellingham to see it. drove up the next day.\n\n...and was told when I got there they'd already rented it out the previous day. couldn't be bothered to call me and cancel and tell me not to make the unnecessary trip.\n\nand as I write this, the rental is *still* listed as available on their website.",
        "ownerResponse": {
          "text": "Zack,\n\nWe are sorry that this happened.  Our units are first come first serve and we accepted an application an hour before your viewing appointment.  Again, we are sorry about this."
        }
      },
      {
        "author": "CALEB LEE",
        "rating": 5.0,
        "review": "Most helpful rental agency in Bellingham. Being a college town, renting can be stressful here at times. Casey and Rebecca at evergreen have made our renting experience as easy as possible. The women in the office have always been helpful with communication and questions my wife and I have had. Casey is always prompt with repairs and making sure things are right. Big thanks to the team at Evergreen Properties NW!! Highly recommend renting with them!",
        "ownerResponse": null
      },
      {
        "author": "Savannah Hoffman",
        "rating": 5.0,
        "review": "Evergreen Properties has been nothing but helpful and kind towards me as a new tenant. They are incredibly easy to get ahold of and care greatly about any of the needs and concerns I have. They are the best property management group I have rented from in Bellingham!",
        "ownerResponse": null
      },
      {
        "author": "Cory Cavness",
        "rating": 5.0,
        "review": "After working with several mangment companies over the years, Evergreen Properties NW was wonderful to rent from.\nThey are easily available to get ahold of and fulfill maintenance requests very quickly.\nCasey helped us out tremendously with our Sub-lease and even found potential renters making it all the easier.\nThey have a nice online portal for paying rent and your utilties, it's a great convenience.\nOverall I am very satisfied with Evergreen Properties NW and would not hesitate to rent from them again.",
        "ownerResponse": null
      },
      {
        "author": "Emily Cain",
        "rating": 5.0,
        "review": "Evergreen Properties NW is an excellent property management group. They really care about the needs and concerns of their renters and are so quick to take care of problems that you are having. Within one day of putting in a maintenance request they were here fixing our shower, absolutely the best people to rent from.",
        "ownerResponse": null
      },
      {
        "author": "sl vs",
        "rating": 5.0,
        "review": "As far as property managers in Bellingham go, these folks are a giant leap ahead of the rest. As a newer company, sometimes they might get a little busy and overwhelmed, especially as they adjust to new growth, more tenants, and more locations, but otherwise they are absolutely doing their best to be responsible landlords and managers.",
        "ownerResponse": null
      },
      {
        "author": "Kayce Kutch",
        "rating": 5.0,
        "review": "I rented this space sight unseen when I moved to Bellingham from out of state. Ive lived here for almost 3 years and it has been absolutely wonderful. My lease is up at the end of the month and I would stay if I wasnt moving into a house! Thank you for an easy 3 years.",
        "ownerResponse": {
          "text": "Kayce,\n\nIt has been a pleasure having you as a tenant.  Thank you for the kind review!"
        }
      },
      {
        "author": "Kenny Roman",
        "rating": 5.0,
        "review": "Awesome managent company!\n\nBeen renting from these guys for about 9 months now and they have been on the ball with everything. Very prompt with service requests, they're always available whenever you need them and it makes the renters experience seamless and enjoyable. Will be staying with them for a while to come now, thank you for all your hard work!",
        "ownerResponse": null
      },
      {
        "author": "Andre Merritt",
        "rating": 5.0,
        "review": "Awesome place to live. The staff is very helpful and respond to all needs expediantly. Would definitely rent from their properties again!",
        "ownerResponse": {
          "text": "Thank you, Andre!  We are glad to hear you had a good experience with us.  Casey Trosin, Managing Broker"
        }
      },
      {
        "author": "Dan Heller",
        "rating": 1.0,
        "review": "Questionable marketing tactics",
        "ownerResponse": {
          "text": "Dan, I believe you have the wrong company.  Please call Casey if you have a concern with our marketing tactics.  We are a fair and transparent with all of our advertising."
        }
      },
      {
        "author": "Brenda Warren",
        "rating": 5.0,
        "review": "Very friendly",
        "ownerResponse": null
      },
      {
        "author": "Monica Contreras",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Monica,\nUnfortunately, when tenants leave their units in a less than desirable  condition, there are consequences.  We always try to be fair with everyone in regard to security deposits.  Please call Casey if you have additional concerns. 360-594-4229"
        }
      }
    ]
  },
  "adjusted_review_count": 17,
  "adjusted_rating_average": 4.2
}