{
  "name": "Julie Carpenter-Re/max Whatcom County",
  "slug": "julie-carpenterremax-whatcom-county",
  "company_type": "company",
  "address": "913 Lakeway Dr Bellingham, WA 98229",
  "review_count": 7,
  "avg_rating": 5.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Nicole J.",
        "rating": 5,
        "review": "I couldn't be happier with the \"above and beyond\" service Julie provided.  She walked us (first-time home buyers) through every step of the process with knowledge and patience.  She showed us many houses, listening to our needs and offering valuable insights.  When we finally found a home that was right for us, we were ready to jump.  Julie helped us write a competitive offer that was accepted -no small feat in this crazy market!\n\nJulie's help getting to closing was also essential.  She kept us on track with every step and was in constant reliable communication with the lender, the seller, the closing agent, and us.  When we ran into trouble with our national lender moving the process forward to close on time, Julie talked us through every option.  It all worked out perfectly, (we switched to WECU where we got great service and were even able to close a week early) but the process sure was stressful. I can't express how valuable Julie's presence and insights were during this time.\n\nJulie is organized, experienced, knowledgeable, available, and caring.  I recommend her without hesitation.",
        "ownerResponse": null
      },
      {
        "author": "Woody P.",
        "rating": 5,
        "review": "Julie knows the real estate business inside and out. They went above and beyond what any other real estate agent I have ever worked with has done. They found a listing that matched my requirements better than the one I originally asked them to negotiate for me. Then, they -negotiated a price significantly below what I was willing to offer.  They took care of and reminded me in a timely fashion regarding all necessary and optional paperwork that might be important for a smooth closing. No surprises and great follow up after completion.\nAn outstanding agent. I highly recommend!",
        "ownerResponse": null
      },
      {
        "author": "Brenda B.",
        "rating": 5,
        "review": "I have known Julie for over 20 years.  She has been such a valuable help to my clients who are either looing to sell their home or are looking to buy.  My husband and I have used Julie personally for our own real estate needs and know first hand how well she treats her clients.  Her knowledge of the local market is second to none.  I highly recommend her services both as a listing agent and as a selling agent.",
        "ownerResponse": null
      },
      {
        "author": "Cari S.",
        "rating": 5,
        "review": "Julie more than exceeded our expectations. She responded quickly to any phone call or text, was thorough, forthright, very knowledgeable, and experienced. We were looking for a single family resident from long distance. When new listings popped up, she went to the property for us, taking pics and FaceTiming me. She made valuable suggestions and had insight I didn't think of, like adding a wall and creating a mud room where one didn't exist. Her longtime residency, knowledge of the community and many years experience as a realtor were evident. At the time, the market was hot with multiple offers coming in. Her strategies helped us buy the property we dreamed of.  We truly appreciate her negotiating skills and assistance. Thank you, Julie!",
        "ownerResponse": null
      },
      {
        "author": "Theresa M.",
        "rating": 5,
        "review": "Words to describe Julie - professional, competent, knowledgeable, intelligent, pleasant.  I have known Julie for over 9 years, and she is a true professional, expert in her industry and makes the purchase/sale process smooth.  I have used other real estate agents in the past, but will only work with Julie from now on.",
        "ownerResponse": null
      },
      {
        "author": "Lori R.",
        "rating": 5,
        "review": "I have the pleasure of working with Julie, and I recommend her to anyone looking for a detail oriented top notch real estate broker.  Her years in the business and experience is a valuable asset to both buyers and sellers. If you're looking for a top notch broker with incredible negotiating skills, call Julie.",
        "ownerResponse": null
      },
      {
        "author": "Danielle R.",
        "rating": 5,
        "review": "I've worked with Julie on several deals, both my own and clients, and what sets her apart from the average realtor is her broad knowledge of the industry. Her longevity in the real estate industry as a full-time realtor means her knowledge and experience are expansive. While you are making an emotional decision (do I like the layout of the house?), Julie's hands are on walls looking for leaks, knocking on neighbors doors to see what their take on the house and neighborhood are, and all the little things that we, as home buyers, may not know to look for. She is easy to work with, quick to respond, and a resource QUEEN! She may not know the answer to your question, but she certainly knows who to direct you to in order to service your needs. I highly recommend Julie to be YOUR realtor.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 7,
  "adjusted_rating_average": 5.0
}