{
  "name": "Northbrook Place Apartments",
  "slug": "northbrook-place-apartments",
  "company_type": "property",
  "address": "3615 Bennett Dr, Bellingham, WA 98225",
  "review_count": 8,
  "avg_rating": 4.4,
  "reviews": {
    "google_reviews": [
      {
        "author": "Bonnie Garrison",
        "rating": 4.0,
        "review": "I wrote a review about three years ago. Everything in that review still stands.  At the time I didn't have any pets. I now have two cats  which I love very much. The pet policy here is very good. You can only have two, but who needs more in an apartment? If you're looking for a place to live and you have pets, kids, come here. (There may be weight/breed restrictions on certain dogs I'm not sure.)",
        "ownerResponse": null
      },
      {
        "author": "GregG.",
        "rating": 4.0,
        "review": "good neighbors friendly staff the only bad thing is first come first serve for parking. not enough spaces so ppl park anywhere they can.",
        "ownerResponse": null
      },
      {
        "author": "Bonnie Garrison",
        "rating": 4.0,
        "review": "I have lived at Northbrook for 25 years. It's not a bad place. Very quiet despite fact that Bennett Drive is  the road right in front. It's close to the airport but very little nose. The manager Joy is great. Friendly and upbeat. If you have the attitude that you want to work with her things will get done. Maint         guy is good and reliable. He gets repairs done quickly. (He even unclogs my bathroom sink. I have very long hair.) My neighbors are  nice and friendly.  Less than a mile from Fred Meyer and close to Bellis Fair and the freeway on ramp going both north and south.",
        "ownerResponse": null
      },
      {
        "author": "Phil I-P",
        "rating": 4.0,
        "review": "Anyone know how to get ahold of Doreen, the previous landlord, I know she works for the Cooperate now. I am needing to contact asap thank you it is important. I would forever  grateful and comment on here if you do know and I'll keep checking. Thanks again so much!",
        "ownerResponse": null
      },
      {
        "author": "ms grundy",
        "rating": 4.0,
        "review": "Great place but getting noisy.",
        "ownerResponse": null
      },
      {
        "author": "Joey Morrison",
        "rating": 5.0,
        "review": "I like living here",
        "ownerResponse": null
      },
      {
        "author": "Al Colon",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joseph Morrison",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 6,
  "adjusted_rating_average": 4.2
}