{
  "name": "RE/MAX Whatcom County",
  "slug": "remax-whatcom-county",
  "company_type": "company",
  "address": "913 Lakeway Dr, Bellingham, WA 98229",
  "review_count": 23,
  "avg_rating": 4.8,
  "reviews": {
    "google_reviews": [
      {
        "author": "P B 707",
        "rating": 5.0,
        "review": "JAY DHINDSA at RE/MAX Whatcom county did a fantastic job helping us find our first home in Blaine! We are very happy with the decision we made with Jays help. We chose Jay because he took the time to explain everything clearly, gave us honest opinions and he had years of experience.\nThank you again for making our dream a reality and we could not have done this without your help, I highly recommend him to everyone who is looking to buy a property.\nThanks again RE/MAX team.",
        "ownerResponse": null
      },
      {
        "author": "Briddick Webb",
        "rating": 5.0,
        "review": "Let me start by saying a tad biased. Ive been a real estate broker for 13 years (over 12 at REMAX) and I can honestly say these are the best group of professionals Ive ever encountered.\n\nAll of the agents are top notch, the training, marketing, and presence in the community is unparalleled.\n\nLori is a tremendous Designated Broker and I feel fortunate to get to hang my license here.\n\nIf youre considering hiring a real estate agent, look no further.\n\nTheres a reason people have trusted  RE/MAX for 50 years.",
        "ownerResponse": null
      },
      {
        "author": "Mark Klenk",
        "rating": 5.0,
        "review": "We worked with Josh and Kelli most recently at Re/Max in Bellingham, both on the buy and sell side.\nWe would definitely recommend them, especially for relocating. They did a great job listening, finding places that match what we were looking for, and being on top of things logistically and communication-wise.\nOur experiences were with condos, so we can't comment on the single-family home side.\nUltimately, we have done three transactions with them (2x buy, 1x sell).",
        "ownerResponse": null
      },
      {
        "author": "Steve Stojak",
        "rating": 5.0,
        "review": "I'm not someone who leaves a lot of reviews but when its called for you make the exception.\nWe just recently decided to purchase a vacation property near MT Baker and were not sure how to go about it as we are from Canada.\nWe didn't know anyone to help us but found a listing that Brian Hefter was sell selling and reached out to him.\nWe talked on the phone a couple of times and then we were able to meet the next week when we came down. Brian showed us several properties that were interesting and met our needs. We had a great time getting to know each other and talk about how things work.\nWe ended up finding our dream property that day thanks to Brian's hard work and time. He then introduced us to the rest of the team at ReMax that we would be dealing with for the rest of the purchase.\nFrom day one everyone has been incredibly helpful and beyond friendly to us. There have been parts of the transaction that went butter smooth and there were some large hiccup's due to the seller. I was shocked at how fast and efficient the whole office  were able to find solutions. Mark Frye was able to pull a rabbit out of a hat to help with one of the situations I was getting stressed about.\nWhen the sale finalized the team was very gracious to us and Brian came to the property and did a massive walk through to make sure everything was good. He has also offered his own time to remove some items that were left by the old owners.\nThe story doesn't end there. We got a call this week from the propane company that our tank was empty and the had filled it but couldn't turn the heat back on. I reached out to Brian to ask who we could call to help get it back on? He said don't worry about it. He drove 45 min to go turn it on for us.\nThe ReMax team is a very special group and I now consider Brian a friend.\nIf you are looking for professional and more importantly friendly people who will do whatever it takes to help and make you happy do yourself a favor and call them.",
        "ownerResponse": {
          "text": "Thank you so much for the kind review, Steve! We're so happy you had a wonderful experience with Brian and the team. They truly are an amazing group of brokers. Congratulations on the purchase of your dream vacation home!! "
        }
      },
      {
        "author": "David Fox",
        "rating": 5.0,
        "review": "Lilia Orlova is a wonderful agent with Bellingham Remax. She worked tirelessly to get answers about properties we were interested in and constantly refined the properties to show us based on the places we saw and liked. Once we had seen the properties in Bellingham, she pulled in nearby properties until we found the perfect place that suited our needs. She has a group of contractors who she called on whenever we needed them and they also responded in a timely manner. She was willing to make a three hour round trip to pick us up from the airport and return us when we had to leave. She is very good at communicating where we were in the process of buying our home, and making us feel welcome in the community.",
        "ownerResponse": null
      },
      {
        "author": "Sommer Nyte",
        "rating": 5.0,
        "review": "I am a broker with RE/MAX Whatcom County, Inc. and cannot say enough good things about the team that Lori Reece has built and nurtured. From new agents to 40+ year real estate veterans, there are brokers with a variety of experience, niches, and market focus. As a team member myself, I appreciate the camaraderie among agents and the training and support we are provided. We are continually given opportunities to improve ourselves and our business, which allows us to offer the best service to our clients. You really can't go wrong with a RE/MAX Whatcom County, Inc. agent!",
        "ownerResponse": {
          "text": "Thank you Sommer for being one of our most loyal and engaged agents. It has been our pleasure working with you and helping you."
        }
      },
      {
        "author": "Forrest Copeland",
        "rating": 5.0,
        "review": "Laura Sanderson at RE/MAX did a fantastic job helping us find our first home in Bellingham!  Weve been in our home for a few months now and are very happy with the decision we made with Lauras help.  Before beginning the home buying process, we met with several different realtors from a variety of companies in Bellingham.  We chose Laura because she took the time to explain everything clearly, gave us honest answers/opinions, had years of experience, and most importantly, made us feel at ease.\n\nWorking with Laura was great.  She was always available to answer questions and schedule showings.  Her responses were prompt and honest and we really valued her thoughtful and methodical insights.\n\nFirst time home buying is difficult and stressful.  We encountered errors and negligence in almost every step of our home-buying process (credit union, inspection, bank, title company).  Laura was the one exception.  Her professionalism and diligence really showed.  She was always prepared, always accurate, always punctual, and always available to help.  We were glad to have Laura on our team and look forward to working with her again.  We highly recommend Laura Sanderson!",
        "ownerResponse": null
      },
      {
        "author": "Mark Frye",
        "rating": 5.0,
        "review": "I interviewed many brokers throughout Bellingham before I decided to work with RE/MAX Whatcom County. I made the right choice and am reminded every day in all the little things RE/MAX does to support, me, my family, and my business. The atmosphere is amazing and collaborative. It is a joy for me to be able to help our new agents like the others before me had (and still do) for me.",
        "ownerResponse": null
      },
      {
        "author": "Virsaviya Kim",
        "rating": 5.0,
        "review": "I had a great experience with RE/MAX. Andy Garcia and his showing agent Angela Egan have been very patient, diligent, and knowledgeable in helping my new husband and I find our first home. Overall, the people at the office are always very friendly and professional. I highly recommend RE/MAX Whatcom County, Inc. for any of your real estate needs.",
        "ownerResponse": null
      },
      {
        "author": "Tamara Nelson",
        "rating": 5.0,
        "review": "Kristi and Pete Coy are great.  Kristi helped us buy our first house 5 years ago, and she was the first call I made when I needed to sell my mother's house.  I recommend her and Pete to everyone I know looking for a realtor.",
        "ownerResponse": null
      },
      {
        "author": "Serge T",
        "rating": 5.0,
        "review": "Lilia Orlova-Savchuk was more than we could ask for as a realtor! Very professional, experienced, kind, and detail oriented. The communication was also excellent! Was more than willing to be available any time and go the extra mile, whether it was a very short notice appointment, going through and helping with documents in great detail, or digging up needed documents from various sources. Lilia was very up front and truthful with all that was happening. Would not hesitate a bit to use again as a selling or buying agent if we were not moving out of state. Wonderful experience! Thank you Lilia!",
        "ownerResponse": {
          "text": "We are so glad to hear that Lilia did such a wonderful job for you, Serge and Mary. Wishing you all the best in this next part of your journey."
        }
      },
      {
        "author": "Hugh R",
        "rating": 5.0,
        "review": "From Kathleen Shaw:  Steve Church has been my realtor of choice in Bellingham.  He is truly the greatest.  I was given good advice, kept informed at every step and was a pleasure to work with every time.  His approach is low key and I never felt pressured or rushed.  I would recommend him to anyone.",
        "ownerResponse": null
      },
      {
        "author": "M O Shokeir",
        "rating": 5.0,
        "review": "I have had the good fortune to work with Bryant Davis over the past 10 years.  During that time Bryant has become a close friend and a trusted advisor.\n\nBryant has represented me as both seller and buyer.  He is a knowledgable, energetic, wise and effective Agent.  Bryant's skill set is perfectly complemented by his wife and business partner Tami.  Bryant has stuck loyally to me through a variety of challenging situations, always helping me achieve successful business outcomes.\n\nI give my highest recommendation to Bryant Davis for all your real estate needs.\n\nM O Shokeir",
        "ownerResponse": null
      },
      {
        "author": "Daryl Dewell",
        "rating": 5.0,
        "review": "I Really Loved the service we received from Karin Dewell. Her and her assistant Daryl were exceptionally professional, informative and prompt at walking us through the Listing and Sale of our home. We definitely reccomendt them to anyone looking to list their home and sell it with the best possible service. Thank you  sincerely!\n\nSam and Dave",
        "ownerResponse": null
      },
      {
        "author": "Peter James",
        "rating": 5.0,
        "review": "Re/Max is a cornerstone in the Bellingham real Estate community.  I have had great experiences working with them and am always impressed by their knowledge of the area and their ability to consistently close even the trickiest of real estate transitions. Thank you Re/Max!",
        "ownerResponse": {
          "text": "Thank you Peter! Feedback like this is why we do what we do. Our goal is to help the community make knowledgeable real estate decisions. We are so glad to hear that you had a great experience with our agents."
        }
      },
      {
        "author": "Janet Riley",
        "rating": 5.0,
        "review": "A big shout out to Pete Hallett and Rick Moore for their superior and focused assistance and guidance during our house buying process. These are really great guys, and their hearts are set on making their client happy.\nThank you for making our dream a reality.",
        "ownerResponse": {
          "text": "Thank you Janet Riley. We are so happy to hear that you had a great experience with Rick and Pete. They really are great guys. We always strive to help you live your dreams."
        }
      },
      {
        "author": "Erik Davis",
        "rating": 5.0,
        "review": "We were just window shopping the neighborhood and Maureen found us exactly what we wanted. Not a small task considering we wanted a view and needed mother in law suite. The whole buying process was very well staged and much appreciated as we were over 2000 miles away. Thank you Maureen!",
        "ownerResponse": null
      },
      {
        "author": "Noreen Clark",
        "rating": 5.0,
        "review": "When I move to the Bellingham area in the near future I will link up with Kristin Clarkman to help me find a place to live.  I admire her knowledge of real estate, appreciate her thoughts on securing financing, and would trust her to guide me in the right direction.",
        "ownerResponse": null
      },
      {
        "author": "Zoae Spackman",
        "rating": 5.0,
        "review": "Karla is helping us find our 2nd home. It is such a joy to work with her as she learns what we want in a home!",
        "ownerResponse": null
      },
      {
        "author": "Christina EKrem",
        "rating": 1.0,
        "review": "Horrible experience, the communication was non - exsistent, I was loosing my home, trying to do a short sale and it was very hard for our family to go through this, there was no compassion. I will NEVER list another home or use them to purchase my next home.",
        "ownerResponse": {
          "text": "We are extremely sorry that your experience was less than satisfactory & know that it can be a very stressful situation given the circumstances you were going through.  We strive to help all clients, in all circumstances and regret we were unable to assist in your short sale."
        }
      },
      {
        "author": "John Palicka",
        "rating": 5.0,
        "review": "John Sands is no B.S.  Impartial (we needed him as a dual agent).  This guy is clean.",
        "ownerResponse": null
      },
      {
        "author": "Jason Yu",
        "rating": 5.0,
        "review": "Thank you Lori giving us very good professional advices",
        "ownerResponse": {
          "text": "Thank you Jason. So good to see you at the Broker Owner Conference in Washington DC! Hope you are well. :)"
        }
      },
      {
        "author": "Michael Hogan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 22,
  "adjusted_rating_average": 4.8
}