{
  "name": "Stateside",
  "slug": "stateside",
  "company_type": "property",
  "address": "929 N State St, Bellingham, WA 98225",
  "review_count": 57,
  "avg_rating": 3.8,
  "reviews": {
    "google_reviews": [
      {
        "author": "Carolyn Puppikerz",
        "rating": 3.0,
        "review": "I LIST BOTH POSITIVES AND NEGATIVES BELOW:\nI love this place HOWEVER it has some issues that all come down to staff. The staff is incredibly under trained and when you ask to talk to their boss they are always in a meeting. We had someone who wanted to become our roomate from another unit and stateside staff left us STRANDED. They offered zero help in any way, and while I understand that theres some stuff we had to do ourselves, they refused to help us get help with things that were very important. Weve asked for maintenance before, and it takes forever. They also dig through the recycling so that if you dont bring cardboard to the basement they will read your address off packages and fine you. This doesnt bother me as much but it really bothers my roommates. THAT BEING SAID, I love the building with all my heart view is beautiful. The units are clean and nice. The free coffee bar is awesome and the events are thoughtful (even though they are underwhelming when it comes to food sometimes). I wish they allowed reptiles but I love that its pet friendly, it really makes it feel like a community. Despite the problems I have experienced I signed in for another year because of the building and the people, and chose to try to tough it out when it comes to some of the folks running it. Also theres this INCREDIBLY annoying squeaky fan in the lobby that makes me crave a lobotomy no idea why that hasnt been fixed but it constantly sounds like a bunch of dying birds and makes me not want to hang out in the lobbys which sucks because I LOVE THE SWINGS!!! Overall its a new place, its got some kinks, but at the end of the day I personally find it worth it for what you get to live in, and while VERY expensive (which I think should be less until their service improves but thats wishful thinking) the units are great and I have really mostly enjoyed living here. Hope it improves where I havent totally loved it yet!",
        "ownerResponse": {
          "text": "We appreciate your feedback, Carolyn. We apologize for any inconvenience you experienced with our staff and their availability. We'll work on improving our response time and training to better assist our residents. We're glad to hear that you love the building, the units, and the community feel. We'll also take note of your comments regarding the events and lobby fan. Thank you for choosing to stay with us for another year. We'll strive to make your experience even better and will raise your comments about our team to the regional managers involved."
        }
      },
      {
        "author": "Manpreet Singh",
        "rating": 3.0,
        "review": "Really nice luxury apartments which I have never seen for students before. I stayed here in Summer as a sublet and really enjoyed the location. Good gym and internet amenities.\n\nJust an fyi, dont bother paying premium for Bay facing side, as 1) you dont get much of a view, 2) theres a train that runs pretty much every hour or so and its super load (really LOUD) with its horn blowing the entire time it is crossing downtown (even at 3 AM!), if you are a light sleeper you will not like it.\n\nAn oddity I found in this building was there was no AC in the rooms, theres AC in the hallways and common areas. During summer the rooms really heats up, I remember seeing ~ 88 degrees in the room. So definitely have a fan or may be a portable AC.\n\nAlso, they for some reason charged me a cleaning fee for washroom while I left washroom in nice condition. I had only stayed there for 2 months and I even cleaned up some mess left over by previous people. I didnt bother disputing the charges with them, I might give them a call.",
        "ownerResponse": {
          "text": "We appreciate your feedback about the property in the time that you'd spent with us, Manpreet. We're happy to go over any aspects of the community's location and what we're adjacent to if folks have questions following your review! Washington has a fairly standard \"no AC\" in apartment buildings, but we do apologize if that was a surprise to you and not previously discussed. If there are any lingering questions you have about any of the move-out charges you incur when taking on a sublet, we're here for you! Thanks so much for the review and your time, Manpreet."
        }
      },
      {
        "author": "Ariel Reyes",
        "rating": 5.0,
        "review": "This place is honestly one of the nicest places Ive stayed, the staff is super friendly and very informative.  The rent is affordable,The furniture and appliances are nice and modern and the community get togethers they hold are super cool. Such as free spritzer day, free plant day etc. The community areas are always clean and luckily the laundry is free so it helped me cut out extra costs. Im surprised any one can find any problem about this place compared to some places Ive rented previously its honestly nicer than some hotels Ive stayed in too lmao.",
        "ownerResponse": {
          "text": "We truly appreciate every sentence you've written here, Ariel. Thank you for listing out all of the things that have really made your Stateside experience perfect. :) Here if you ever need us!"
        }
      },
      {
        "author": "Finch Guzman",
        "rating": 1.0,
        "review": "I cant believe this place has such good reviews. The entire time I lived at Stateside the management was very poorly run and response times were incredibly slow. I was also charged $160 in damages that I did not cause and that Stateside management knows I did not cause. The previous tenant even admitted to causing them and they still charged me for it and were quite rude during communications about it as well. Everyone that I spoke with was clearly undertrained and usually quite vague and unhelpful, ultimately always directing me to write emails where issues were still not resolved. I would look elsewhere if you are a college student looking for housing outside of dorms. Its not worth the trouble of dealing with Statesides management and all the random fees theyll charge you on top of rent!",
        "ownerResponse": {
          "text": "Finch - we appreciate you summarizing your experience of living with Stateside in the time you had, as well as prompting action from our team to revisit your circumstance in full to better reply to your review. As a sub-letter, you'd accepted a unit in \"as-is condition\" which is nominal of foregoing any sort of damage repair, deep cleaning or administrative work that would typically go into readying a unit for a new tenant. What the previous tenant had claimed damage-wise in our outreach to them did not fully encompass the damage present in the unit, leaving those charges to you along with the FMO statement and inspection report with documentation. We'd hate for any of this situation to appear vague or unclear, so if you'd like to visit this conversation with our managers, Genevieve or Lindsay would be happy to discuss over the phone or in-office this week. Thank you again for your review and consideration."
        }
      },
      {
        "author": "Draegon Moss",
        "rating": 2.0,
        "review": "Great if you have mommys/daddys money. The rent is pretty steep, they charge an outrageous amount for parking in the garage, currently going for $350 each month on top of rent. Street parking is awful and there are times I have to drive around for 30-45 minutes just to find a legal parking spot that isnt over 3 blocks away. Plus my car has been keyed twice. So if having a car is a must, Id recommend going elsewhere.\n\nAs for the apartment itself, its nice, but to get a view of another window and pay $1445 a month for 2 people and a dog in a STUDIO, I think thats a bit much.\n\nThey had amenities listed on their website for over a week after moving in, like providing detergent for washing clothes, that wasnt true. They close the sky lounge at 10, which is rather annoying. They lack cleaning staff and the hallways get filthy, floors sticky, trash left in common areas for days, etc.\n\nThere are homeless people in the ally who, for the most part are peaceful, but the occasional crazy comes by. Theyve left used needles and baggies laying around. Graffiti on the walls that gets left or poorly covered. The flower beds get crazy over grown and left with trash in them. Not a deal breaker but wheres all the money going?? If things get broken like doors or the intercom system, they stay broken for days, in fact the intercom is still MIA and its been over a month.\n\nUpper management is pretty decent, I dont have any complaints about them, lovely people, but some of the lower staff lets just say theyre annoying college kids and when you have questions they either say yeah we dont do/have that or idk so they should definitely do some more vetting/training.\n\nInternet can be dodgy at times, and all the little activities they plan, which make this place seem fun, happen at very inconvenient times for people who have jobs. No one has time at 1:00-2:00 pm on a Tuesday to do anything fun while working a job and going to school.\n\nLast thing, trying to get any insight on what unit Id be in, how big it was, or even what it looked like was impossible. I had no idea until move in day, regardless of how many times I called. So dont expect to know what youre getting into.\n\nOverall, Im not pleased, especially for how much I pay and how little I get back. If youre a rich kid who doesnt have to worry about costs and working a job, good for you, welcome home. For everyone else, Id recommend elsewhere.",
        "ownerResponse": {
          "text": "Draegon, thank you for taking the time to thoroughly review Stateside and your time with us. We apologize for the negative experiences you have had during your time here, particularly with the parking and cleanliness. We take all feedback seriously and will take steps to address these issues. Additionally, we will work on improving our customer service and communication with prospective tenants. Thank you for bringing these issues to our attention. If you would like to discuss any further concerns or go deeper into anything mentioned here, please do not hesitate to reach out to us at (360) 762-3972."
        }
      },
      {
        "author": "L L",
        "rating": 1.0,
        "review": "Really disappointed with this place!!! How are you going to tell your residents to leave up their LED lights because your maintenance crew will take them down safely but still charge for the damage that your maintenance crew caused? We have personally removed lots of lights without causing damage!!!\nAlso the maintenance crew came into my daughters private room before her lease was up without her permission!! Her furniture was moved and the LED lights ripped down, at that point she still had at least 5 days left on her lease. How scary is that? Knowing that State Side allows their employees to enter apartments without permission?!?! Parents protect your college students!!!",
        "ownerResponse": {
          "text": "Hi, Laura. We apologize about your daughters experience concerning the lights, and invite you to please contact us if you have any further questions. Wed be happy to explain our maintenance process at Stateside in more detail."
        }
      },
      {
        "author": "Shayn Sath",
        "rating": 5.0,
        "review": "When I first heard about stateside I knew the name had a meaning behind it. A beautiful big 2 building structure with AMAZING views of the bay and the city. Had the opportunity to take a tour in January and walking into the very first unit I fell in love immediately. I signed a lease right after that and I have no regrets. Stateside offers many amenities that other apartments do not. I was amazed at what that offered and how I can know for sure Stateside will be my next home. As far that, Management has been outstanding and always checks up on their residents and their peers among the staff team. By far the best management I have seen by any apartment that are willing to strive for excellence as well as residential needs. If you're looking for your next home. I would highly recommend Stateside as your new home!",
        "ownerResponse": null
      },
      {
        "author": "Teagan Jones",
        "rating": 1.0,
        "review": "If I could put 0 stars, I would. Stateside is filthy, outrageously priced, and holds the most unprofessional leasing staff I have ever dealt with. Don't let the two year old photos fool you- the common areas in this place are filthy. Not once in my two years of living here was a main hallway or staircase vacuumed. On top of the filth, this establishment is  will suck every last penny from their residents. Rent is hundreds higher than comparative apartments, and staff will use every excuse to charge you for pre-existing damages/maintenance. I genuinely could not pick out one good part of my living experience here, except the day I got to move out.",
        "ownerResponse": {
          "text": "Teagan - thank you for providing your feedback and detailing where you feel Stateside's operations and maintenance could improve. We understand that we're currently in the midst of another conversation regarding your move-out so we will continue to update that thread moving forward. If you'd like to discuss anything mentioned here or otherwise, please do let us know there and Genevieve or Lindsay will be happy to assist you. Thank you so much."
        }
      },
      {
        "author": "Kashmere Carr",
        "rating": 5.0,
        "review": "Super excited to move in next month!! Everyone is so sweet and helpful, especially the leasing manager Lindsay Fulford. I did a virtual tour of the building with her, and just WOW. Ive lived in my fair share of homes and apartments, and this one is just about the prettiest. The attention to detail is incredible, they really understand their target audience (students). Soft-close cabinets to keep noise to a minimum when youre doing some late night snacking, fully furnished, and plenty of outlets. Cant wait to move in!!",
        "ownerResponse": null
      },
      {
        "author": "Jared Dirks",
        "rating": 1.0,
        "review": "I can only speak to my experience at Stateside, but from what I have heard from others who I met while living there I can say there is generally some things I can comment on confidently.\n\nFirst and foremost, over the year I lived there Stateside regularly restricted access to some of the amenities as a result of immature behavior from some of the buildings residents. Instead of punishing the people responsible, they restricted access to an amenity (that we all pay for in our lease) and offered no options besides telling us \"too bad\". Despite the outrageously expensive rent, things like washing machines remained broken/unrepaired for 6+ months. The idea that they would increase the rent, while also opting to charge for laundry moving forward contributed to my decision not to live there again.\n\nNow that my lease is up, they hit me with a 200$ charge for things like \"painting\" and \"waste removal\", and even charged me for a key that I returned to the front desk, despite being told by one of their employees it would be taken care of. Move out expenses are typical, but the fact that they charged each one of my roommates $100 for our individual rooms indicates to me that Stateside is just as bad as companies like Hammer and Landmark, fleecing college students and their parents for whatever dollar they can get. I called the leasing office to discuss the charges, only to be ignored and never get a call back.\n\nIf Stateside is going to charge me these vague expenses, the least they could do is give me a call back. Their current approach is \"pay it or we'll send it to collections\".\n\nFor students: Stateside is an upscaled private dorm that isn't close to the \"experience\" they like to market themselves as. If you are paying your own rent (not your parents) this place is way too expensive for what you are getting.\n\nFor parents: This place markets itself as an ideal place for students to live and meet people, but will nickel and dime you at whatever opportunity they can. There are better options, and the neighborhood is also extremely unsafe. Car break in's are common, and there has been multiple shootings (yes, shootings) only 2 blocks away on State st. Buyer beware.",
        "ownerResponse": {
          "text": "Jared - thank you for organizing your thoughts and experience in a review for us and others to evaluate. We want to apologize for the frustrating elements surrounding your experience, namely the closing of amenities while assessing the situations created and the laundry machines being repaired. We are fully functional in both of these areas as of now, and laundry is free as of this lease term. Any questions about move-out charges can be directed to manager@statesidebellingham.com, as we do not dodge conversations about them, we are only able to address complaints in writing and we apologize if that wasn't clear. If there are any questions related to the lease agreement or payment structure, as well as safety/security protocol on site, we are more than happy to discuss them in-office or over the phone. Again, thank you for your full perspective Jared."
        }
      },
      {
        "author": "Kristofferson Family",
        "rating": 5.0,
        "review": "From a parent's perspective so far so good.  Everything we have needed to do with Kasee and Lindsay as been so smooth.  Quick response to ALL of my many questions and very professional.  I hope this is an indicator of how our son's experience living there will be because so far everything is stellar.  He really is excited about moving with all the amenities, close access to downtown and campus and making friends.  I feel confident that he is set up for a great experience.  Thank you for the peace of mind!",
        "ownerResponse": null
      },
      {
        "author": "Lindsay Fulford",
        "rating": 5.0,
        "review": "It can be difficult to find student housing that checks off all the boxes like Stateside does. You are right where you need to be with all the popular shops and restaurants, WWU, and the South Bay Trail only minutes away on foot. As part of the team at Stateside, I am so thrilled to help facilitate the amazing experiences that our residents are going to have this fall. Stateside has such an amazing team working together to support our residents from thoughtful roommate matching to interactive resident events. I can't wait to meet everyone this September for our grand opening! See you soon :)",
        "ownerResponse": null
      },
      {
        "author": "Mason Woolbright",
        "rating": 1.0,
        "review": "If you have a car DO NOT MOVER HERE you will spend 30 minutes or MORE looking for a parking spot. If you dont want to pay the $400 a month for gated parking. The people who work here are rellly nice tho",
        "ownerResponse": {
          "text": "Mason - thank you for your review and perspective. We're sorry to hear that you've had a negative experience with parking at Stateside. We understand that parking can be challenging in urban areas, and that's birthed the offer of gated parking for our residents after concerns like this one. We would be happy to discuss this option with you further if you are interested - please feel free to reach out to us at your convenience."
        }
      },
      {
        "author": "ellie",
        "rating": 5.0,
        "review": "absolutely love the environment and the people! such a great place to live. everyone is loving and accepting and the staff does everything they can to help at any point!",
        "ownerResponse": {
          "text": "We really appreciate this day-making insight, Ellie - thank you for your joy and positivity! We will always do what we can for our community. :)"
        }
      },
      {
        "author": "Shelby Felthoven",
        "rating": 5.0,
        "review": "I recently signed my lease with stateside and I am ecstatic to move in. Everyone at stateside has been extremely helpful and made the process fast and easy. The apartments are beautiful with great views and a great staff and I cant wait to move in when they open up!",
        "ownerResponse": null
      },
      {
        "author": "Ruby Donaldson",
        "rating": 5.0,
        "review": "I toured stateside and it was amazing. I have already signed my lease but I wanted to see the buildings in person, everyone was so helpful and answered all my questions! They have free laundry and a community kitchen that is so spacious. I can't wait to move in.",
        "ownerResponse": null
      },
      {
        "author": "Emerson Sullivan",
        "rating": 5.0,
        "review": "Lindsay was very helpful and friendly working with her and the building looks beautiful! The fact that there is a bagel shop and fitness center on site is a huge plus. By far the greatest deal I could find in Bellingham for the  amenities and building.",
        "ownerResponse": null
      },
      {
        "author": "Carly Spradlin",
        "rating": 5.0,
        "review": "Hey there! I'm a CA at Stateside Bellingham, started here a couple of months ago.\n\nWhat really impresses me about this property is the diversity that is offered. There are many floorplans to choose from on 6 floors with multiple choices of amazing views, (city, bay, mountains, etc.) . There is definitely something for everyone. Also, the owners of this property have made it extremely student friendly. If you are in need of housing in Bellingham definitely check out Stateside!",
        "ownerResponse": null
      },
      {
        "author": "Taylor",
        "rating": 4.0,
        "review": "Great apartment! Love it so much, but the rent and parking is increasing to an unrealistic amount. My roomates and I cant afford the new prices.",
        "ownerResponse": {
          "text": "Thank you for the great and honest feedback, Taylor. Always happy to facilitate any discussion related to pricing and leasing if you'd like to chat about it this week or after the holidays! Thanks again for your review."
        }
      },
      {
        "author": "Lillie Adamson",
        "rating": 5.0,
        "review": "I love stateside! Everyone is so friendly and the rent is reasonable. Some of the apartments have funny layouts, but they are all furnished and pretty high quality.",
        "ownerResponse": null
      },
      {
        "author": "Sophia Collins",
        "rating": 5.0,
        "review": "Stateside is a brand new & absolutely beautiful student housing community in Bellingham. If youre on the housing hunt, give us a call- we are here to help make this process super fun and easy for yall!",
        "ownerResponse": null
      },
      {
        "author": "Kasee Castro",
        "rating": 5.0,
        "review": "Ownership and management come from experienced backgrounds and exceptional customer service. Excited to see this community come to the Bellingham market for students looking to elevate their housing experience!",
        "ownerResponse": null
      },
      {
        "author": "Charlie Schmid",
        "rating": 5.0,
        "review": "So clean and crazy modern. Best student housing for Western HANDS DOWN. 2 minute drive and 12 minute walk to campus.",
        "ownerResponse": null
      },
      {
        "author": "Dennis Alexandrow",
        "rating": 5.0,
        "review": "I love it here at stateside! The building is beautiful inside and out and the perfect distance from campus, making it very convenient for students!",
        "ownerResponse": null
      },
      {
        "author": "anna manry",
        "rating": 1.0,
        "review": "they left all the elevators down for hours, i am on crutches and could not leave my house. thank you stateside",
        "ownerResponse": {
          "text": "Anna - thank you for leaving us a review regarding this instance. A member of our team is reaching out today to discuss this further, as we'd love for you to know the available resources in the event this ever occurs again. The elevators in that building went down unexpectedly last night - but our elevator technician got them back up and running this morning which was the earliest we could get someone to fix it. Again, we're very sorry this left you in a situation and didn't have access to assistance. We hope to have the situation resolved completely, but will talk through this further today. Thanks again!"
        }
      },
      {
        "author": "Gabriel Grant",
        "rating": 5.0,
        "review": "There has been a lot of care and attention put into creating a great environment for residents, both in terms of great spaces and amenities as well as excellent management.",
        "ownerResponse": null
      },
      {
        "author": "Nathan Shamseldin",
        "rating": 5.0,
        "review": "This place looks absolutely amazing! From the views to the culture Id give it a solid 10/10. Shout out to Sophia for the awesome tour!",
        "ownerResponse": null
      },
      {
        "author": "eduardo castro",
        "rating": 5.0,
        "review": "Just moved in, loving my new apartment awesome views ;) and great location.. Staff made moving in a breeze. I think I made the right choice!",
        "ownerResponse": null
      },
      {
        "author": "Karla Hernandez",
        "rating": 5.0,
        "review": "The Stateside team was extremely helpful when I was applying. The units look gorgeous and I cant wait to move in!",
        "ownerResponse": null
      },
      {
        "author": "Irena Kolbert",
        "rating": 5.0,
        "review": "Very beautiful rooms and great location. The views are nice, and its super close to WWU.",
        "ownerResponse": {
          "text": "Thank you for this beautiful sentiment Irena. We are so glad you're enjoying Stateside for its location and views!"
        }
      },
      {
        "author": "Ava Martin",
        "rating": 5.0,
        "review": "Stateside Apartments make me feel right at home! I love the amenities and I love how close it is to down town.",
        "ownerResponse": {
          "text": "Thank you for the love and great review, Ava!"
        }
      },
      {
        "author": "Mackenzie Mast",
        "rating": 5.0,
        "review": "Our team is super excited to bring great new student-focused apartments and retail to Bellingham!",
        "ownerResponse": null
      },
      {
        "author": "P D S",
        "rating": 1.0,
        "review": "I am being charged continuously for electricity even when I am not living there anymore.",
        "ownerResponse": {
          "text": "Hey there - we're sorry that you're experiencing some trouble with the financial aspect of things. We're fairly certain the charges you're seeing are from the last two months, but in the event they're not, give us a call at (360) 946-0820 and we can sort it out together. Thanks for reaching out!"
        }
      },
      {
        "author": "Cooper Bronson",
        "rating": 5.0,
        "review": "Been living here for a bit now and the staff are great, super helpful and always friendly!",
        "ownerResponse": null
      },
      {
        "author": "Fernando Gonzalez",
        "rating": 5.0,
        "review": "Great Future student and local housing, great view of the Bay Area!",
        "ownerResponse": null
      },
      {
        "author": "Daniel Ivanov",
        "rating": 5.0,
        "review": "Fixed issues I had quickly and without hassle.",
        "ownerResponse": null
      },
      {
        "author": "Jillian Marie",
        "rating": 1.0,
        "review": "would rate lower if i could.",
        "ownerResponse": {
          "text": "Jillian, we are so sorry for the frustrations you've encountered with getting your rent paid. We understand that you spoke with our GM Laura yesterday about this situation and the late fee reversal, and we will update you at any point if the check doesn't clear this time around. Again, we do not wish this situation upon any resident and hope that this will be the last time we have to deal with this together."
        }
      },
      {
        "author": "Stephan Cox",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the all-star love, Stephan! Happy to see you having an amazing Stateside experience. "
        }
      },
      {
        "author": "Cassie Clate",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "So thankful for your incredible rating, Cassie - let us know if you need anything!"
        }
      },
      {
        "author": "Jesse Lonchar",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for your great rating, Jesse - please let your Stateside crew know if you need anything else from us. :)"
        }
      },
      {
        "author": "Emilia Galant",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Emilia - once again we would like to apologize for the after-hours situation and hope that we can avoid any discrepancies moving forward. Referencing Lindsay's email from yesterday, if you need to stop by for anything related to your keys, lock or otherwise let us know today. Thank you. "
        }
      },
      {
        "author": "Genevieve Boushey",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the all star rating, Genevieve! Anything we can do to continue this sentiment for you, just let our team know. :)"
        }
      },
      {
        "author": "Gavin Green",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "A beautiful picture to accompany a beautiful rating... made our day, Gavin. Thank you so much!"
        }
      },
      {
        "author": "Abby Gaffney",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for the great rating, Abby! Let our team know if there's anything we can do for you. :)"
        }
      },
      {
        "author": "lilli marie",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jordan selemani",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Alex Hurley",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Moki Gadbois",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jeff Baran",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Wren G.",
        "rating": 2,
        "review": "The employees were very friendly and the common areas were well-maintained. The bedrooms are very small, but there is a lot of storage space throughout the apartments. The windows only open about 6 inches from the bottom and there is no ventilation. It was unlivable in the summer and I had to couch surf because it was consistently at 95 degrees inside. There was also horrible chemical smells from high-VOC building materials. \n\nThe offsite parking is far away, expensive, and dangerous. I was put in quite a few bad situations while parking there, and my car was vandalized...twice. \n\nUpon moving out I spent days cleaning and left the apartment spotless.  Days later they sent everyone I know who was moving out a threatening email demanding at least $200. They managed to swindle over $1000 for carpet cleaning and a little repainting from me and my roommates. However, carpet cleaning is a move-in fee!",
        "ownerResponse": {
          "text": "Thank you so much for providing us with your feedback about living at Stateside, Wren. When residents move out, we have to ensure that apartments are given to the next resident in a condition they’re comfortable moving into. This is often a higher level of cleanliness than the apartments are left to us in, and we saw this primarily with paint and carpet cleaning this turn. Photos and final account statement insight were emailed to you in October related to your concerns about the charges, but if you need to discuss further we are happy to do so over the phone. Stateside does not have any move-in fees that would include any kind of cleaning, so unsure as to what you're referencing there. We have not heard any complaints about chemical smells from the building materials, so please clarify where this odor was represented most if you could. Our off-site parking is managed by the City of Bellingham and they provide 24/7 security and monitoring. Any concerns or circumstances involved with that amenity should be properly reported so that the proper authorities can conduct an investigation. As this merely serves as a review response, we do hope that you understand we're trying to communicate effectively about the elements of your review, though would love for any further discourse to occur over the phone or in-office if the opportunity allows. Thank you again for your time, Wren."
        }
      },
      {
        "author": "Maxwell S.",
        "rating": 1,
        "review": "I (tried) living here but quickly found it to be 80% a total money scheme directed at pet owners and students / 20% an actual space to rent equitably. \n\nThis place is largely geared towards a demographic of people who haven't rented before and simply do not know any better in terms of how the process gives and takes; it's an exchange between tenant and landlord.\n\nIn the case with Stateside, the narrative handed down from day 1 is that \"we are your dystopian overlords until your lease is up.\" \n\nI moved there because it was the only dog friendly, affordable option in Bellingham, sight unseen from NY because I wanted to start a new life there. Everything seemed nice and the staff seemed willing to help and communicate well throughout the whole process...so long as the concerns didn't in any way actually translate to addressing a real issue. That's because the people running the show here are under qualified, underpaid, and overworked, in conjunction with a business model that slightly resembles a pyramid scheme.\n\nThings seemed fine until a sprinkler system busted in the neighboring apartment, flooding the whole hallway at 3am and evacuating the building. According to a press release emailed to the residents, it was because a student had placed lights near the sprinkler head but upon asked my neighbor about it who lived in the same apartment, I was informed that there were actually no lights present on her ceiling and that she was receiving some form of compensation for keeping it on the hush. IE THEY CHEAPED OUT ON THE FIRE SYSTEM CONSTRUCTION AND THEN BLAMED A STUDENT SCAPEGOAT WHEN IT FAILED\n\nI come home from work the next day, no communication, no warning that my apartment was going to be entered, to 150 decibel air fans and dehumidifiers strewn throughout the place (6 total) and took them out. \n\nYou can't sign the lease without them having the explicit right to relocate you at any time, and for me, after I took the fans out, they threatened me with just that if I didn't just be a good little boy and capitulate to terrible landlord practices that make the idea of having a piece of mind obsolete in this scenario. \n\nTHESE PEOPLE ARE NOT LANDLORDS, THEY ARE DYSTOPIAN ALGORITHMS TRYING TO VACUUM YOUR MONEY.\n\nI left 6 months ago because I couldn't get a response to replace my door handle that my dog had figured out how to open when I was at work, making the apartment no long feasible since my roommates were uninterested in allowing him to roam the common area or properly storing trash so he can't get to it. The apartment was no longer feasibly dog friendly at that point. \n\nA few days ago I got a bill from a collections agency for the rest of the sum of rent for AFTER they wouldn't address my dog's concerns! 7k\n\nThis was after PLEADING with the manager to let me out of my lease because it was completely shady.\n\nI urge anybody considering this place as a living option to keep looking in your search and to try to find the least built up organization possible to rent from. \n\nUnscrupulous, predatory, business model.",
        "ownerResponse": {
          "text": "Maxwell, unfortunately, due to vacating your apartment before the lease was over, we had no other choice but to send your account to collections as required by Washington state law. As you know, we reached out a number of times to discuss matters, including the door handle issue, but you left before it could be addressed in a timely manner. Regarding the fire sprinkler incident, this was due to a plant hanging from it, and to accommodate residents affected by the minor flooding, not only did our maintenance team act swiftly, we also provided gifts cards for the inconvenience, of which you received. If you would like to discuss this further, our management team is happy to provide whatever details you need."
        }
      },
      {
        "author": "Dylan L.",
        "rating": 2,
        "review": "Loved the maintenance crew, but every day there's a new issue with how they're gonna try and get your money from you, with the overpriced rent, pet rent, the overpriced onsite and offsite parking, etc. The only thing cheap is the build quality.",
        "ownerResponse": {
          "text": "Dylan - appreciate your insight about Stateside as a resident here. It goes without saying we certainly are also very thankful for the maintenance crew comment, as they're essential to the operations here. We do regret that our operations aside from that have made your experience feel negative, primarily in the financial sense. If you'd like, we would greatly appreciate the chance to discuss any matters concerning fees/parking with you to further elaborate on pricing, structure and kinda why things are the way they are. If that conversation intrigues you, stop by the office and mention your Yelp review to our GM Laura and we can take things from there. Thanks again, Dylan!"
        }
      },
      {
        "author": "Luke L.",
        "rating": 1,
        "review": "Construction has been going on right below my unit for MONTHS. It is so loud we often have to leave our apartment. Other residents have complained and nothing has been done. Losing sleep almost daily now becasue the walls here are so thin it sounds like we are in a battle field as early as 7am. The managers have done nothing about this issue and said it would only last weeks. It's been months, DO NOT MOVE HERE.",
        "ownerResponse": null
      },
      {
        "author": "Maria S. B.",
        "rating": 1,
        "review": "Beware of off-site parking! \nMy daughter (Junior at WWU) signed a lease in May, 2021 for the 2021-2022 school year. At that time, the apartment building was not yet completely built and there were very few specifics available from Stateside (didn't know who roommates would be, etc.). She added an off-site parking space to her lease not knowing anything about it - but assuming it would be a reasonable distance away within a couple of blocks and it would be easier than having to constantly find street parking. \nThey did not provide complete information about the parking space (or cancellation policy) until move-in weekend in September. At that time she was told it was in an underground parking garage downtown (.6 miles away - and in the complete opposite direction of campus) and that she would have to move her car every 3 days. She does not feel safe in the parking garage when she's by herself - especially in the dark. \nShe immediately asked to cancel the space - and Stateside would not let her unless she can find another apartment resident to take the space over.  None of this information was spelled out in the lease at all, and once they had specific information they did not give her the option to opt out of that part of the contract. \nVery deceptive and very poor service especially for students who are likely signing a lease for the first time. \nMost other aspects of the apartment have gone well, but this is not unacceptible.",
        "ownerResponse": null
      },
      {
        "author": "Profound H.",
        "rating": 5,
        "review": "Nothing but good things to say about Stateside. Super close to WWU and downtown. Wonderful, accommodating staff + maintenance team. It has been a joy to live here- highly recommend.",
        "ownerResponse": null
      },
      {
        "author": "Connor K.",
        "rating": 1,
        "review": "Stateside apartments has been extremely frustrating. Not really sure where to start. First of all, they have been terrible as far as the process of renewing goes. They have repeatedly threatened that our room isn't going to be available for the next leasing cycle (which is 6 months away) if we don't renew ASAP. Many of us are unsure about whether to renew, and these threats over email about taking our room away from us a half a year from the next lease don't help. They have been extremely shady overall about this stuff, claiming that they told us that our rent would go up, and then in turn raising our rent for the next leasing cycle over $100 a month, even though they never told us specifically that this rate would increase, and never contacted our guarantor about it. I am expected to pay $200 more than my roommate, for a smaller room in the same apartment, just because stateside feels like raising our rate because I haven't renewed yet, when again, the next lease isn't for MONTHS, and we had been planning on renewing. Stateside has also been awful about maintenance. They have now postponed their maintenance scheduled dates 3 or 4 times, on late notice, so we've been waiting around for them to do their inspections for weeks now, with little communication on when it'll actually happen. Stateside has also sent other threatening emails about fining their tenants for silly things that are not included in the leasing agreement. They have said that noise, not wearing masks, skateboarding inside and other small things will warrant a $100 fine from them, which is ridiculous. Overall a very vague, shady group that doesn't care about their tenants needs or opinions. If you're going to rent at stateside, keep all of the above in mind, and expect it to happen to you.",
        "ownerResponse": null
      },
      {
        "author": "Jillian S.",
        "rating": 1,
        "review": "would rate lower if i could. they had issues clearing my check (they kept saying my bank couldn't find my account). i went to my bank twice in one day because i wanted to get it in writing that personal checks printed there are always linked to an account. couldn't get anything in writing because that branch couldn't speak for the entirety of chase, but they helped me try to cancel checks already written. stateside wouldn't give me back my check that didn't go through and charged me $90 for it not going through and for it being \"late\". i put my check well before the 1st of the month and they didn't try clearing it until then and then didn't notify me that it didn't go through on the day it was considered late. the next day, they tried depositing my check again. they will not give it back and kept saying the person who deals with checks is out sick. i'm reporting them to the better business bureau and the irs.",
        "ownerResponse": {
          "text": "Jillian, we are so sorry for the frustrations you've encountered with getting your rent paid. We understand that you spoke with our GM Laura yesterday about this situation and the late fee reversal, and we will update you at any point if the check doesn't clear this time around. Again, we do not wish this situation upon any resident and hope that this will be the last time we have to deal with this together."
        }
      }
    ]
  },
  "adjusted_review_count": 45,
  "adjusted_rating_average": 3.5
}