{
  "name": "Sun-Mark Properties",
  "slug": "sunmark-properties",
  "company_type": "company",
  "address": "1850 Lake Whatcom Blvd Bellingham, WA 98229",
  "review_count": 9,
  "avg_rating": 1.4,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Katie B.",
        "rating": 1,
        "review": "Wow. I have to say I'm taken aback. I missed a viewing when I regretfully entered it into my calander wrong. I called back to apologize and reschedule and was shamed by the woman who answered. Completely unnecessary. I'll be taking my business elsewhere. I'm glad she outed herself as a bad potential landlord. Mistakes happen. But she \"Pretty Womaned\" herself out of a big commission. No thank you.",
        "ownerResponse": null
      },
      {
        "author": "Michael K.",
        "rating": 1,
        "review": "Moved away but after experiencing 3 other property management companies, I can update this review. NONE are even close to as bad as Azam and SunMark Properties. \n\nSubMark was horrible, but in contrast to others, they are EVEN WORSE. Amazing.",
        "ownerResponse": null
      },
      {
        "author": "Courtney F.",
        "rating": 5,
        "review": "My father has lived in a property managed by Sun Mark since 2016 and has been nothing but happy with their attention and service. Every service request has been followed up in a timely fashion and with good communication. \n\nTo boot, when I was concerned we couldn't reach him, Azam made it a priority to leave the office and check on his welfare for us, then call us within the hour.  \n\nMy dad has said nothing but good things and her follow through and concern makes me think good things.",
        "ownerResponse": null
      },
      {
        "author": "A R.",
        "rating": 1,
        "review": "I agree with the others to avoid Sunmark if you need a property manager.\n\nIf you must use them, make sure only one person communicates with them and takes good notes about what was discussed. Otherwise, their current PM will change her story about what happened depending on who she talks so. She will claim she told owner A one thing while talking to B, having never mentioned it to owner A. She is very bad about bringing up problems and even worse about following up after. She barely replies to emails and is very defensive on the phone. \n\nI have no idea how often (if ever) she walks through the properties.\n\nCases in point: \nShe called, panicked, to tell us our water heater had \"exploded\" and the tenant's belongings were ruined. We followed up with the plumber and learned that the tank had leaked slightly but by the time they came out to fix it (the next day), the water had completely dried. There was no damage to the house.\nOn another call (instigated by us) she said the dishwasher had been broken for some time and needed to be replaced. I arranged purchase of a new one that night and emailed her to arrange for delivery. Days later she called saying that the tenant had fixed it and acted like we should have known that already.",
        "ownerResponse": null
      },
      {
        "author": "Kathy E.",
        "rating": 1,
        "review": "We were not happy with the property manager, Azam. She is not honest. She was caught lying to us that she met with renters to perform a walk through. She then told us the house was left in \" great condition\" but after inspection found repairs nearing $500 were needed. She asked us to hire her to list the house for sale. There is NO way we would ever consider this! She's lazy and dishonest. We have to call her to send us accounting statements for tax purposes of which she replies, \" my clients don't normally ask me for that and I don't work for you anymore\". Save yourself a lot of frustration and time and DO NOT HIRE this company to manage your house. It will be a mismanaged mess!",
        "ownerResponse": null
      },
      {
        "author": "Karen B.",
        "rating": 1,
        "review": "Stay away from these folks as Property Managers. First off, my error: I trusted them.  This was  really bad idea.  I was with them for 6 years.  For the first 4 everything was fine. 2 years ago something changed the managers clearly did not do the walk thoughs or truly check the tenants - a fungus stain they said \"wasn't there at the walk though\" had to have been in place for nearly a year.  The cause? A lot of a certain plant being grown in my house and the tenants had redirected the air vents into the crawl space.  The result? $35,000 worth of damage to the house (now repaired with not even an admission of culpability, and certainly no funds, from the owners of SunMark.  They did tell me this year they could smell a certain substance in the past, but never told me at the time nor did they follow though on checking out the situation.   No due diligence on their part.  They are strictly \"take the money and run\".  \n\nAgain stay away from these folks.  If you are currently with them and intend to stay, please do all the walk-throughs yourself and meet your tenants- protect yourself from them and the folks to whom they rent.\n\nOh, a comment on previous comment - the folks who did this to my house \"looked like nice people\" according to SunMark's staff.  They judge by looks, which really does not work.",
        "ownerResponse": null
      },
      {
        "author": "Redhed B.",
        "rating": 1,
        "review": "This has got to be one of the worst property management places in the Bellingham / Sudden Valley area.  They do not return your phone calls about properties listed.  I managed to get a property manager on the phone long enough to ask one question before being put on hold for minutes on end.  The receptionist then came on the line and asked if the property manager could call me back which hasn't happened!  I've called, emailed and left messages and no one has gotten back to me.  I suppose they would if you are selling a half-million dollar house but if you're just an average joe looking for a place to rent, look elsewhere than this property management place.",
        "ownerResponse": null
      },
      {
        "author": "Anne B.",
        "rating": 1,
        "review": "I, too, am an African-American and Native American individual who as the previous reviewer mentioned was completely blown away by the rudeness of the real estate agent/owner.  And this was on the phone just now.  I shall be filing a complaint via the appropriate channels.  As a writer who is completing a book, which is due to be published,  about how people are sometimes discriminated against in this country for a plethora of reasons, I was so taken aback at the way the owner/manager/agent spoke to me on the phone, and I shall be including this business in my book, although under a different name, as a prime example of how businesses definitely should NOT be.  I was interested in exploring a property in Sudden Valley, and the secretary/receptionist had been wonderful in providing info, but the agent she'd passed me to (who later also stated she was the manager/owner - she sounded Russian, but that's beside the point, just stating so that people may be aware of which individual it was I was corresponding with - who knows, she could have been lying about whether or not she was the manager in an attempt to throw me off from reporting her when I subsequently called to do that very thing).  Initially when I spoke to her regarding the property, she interrupted and barked \"What's your credit score?\" She wanted to know if it was 700+.  As soon as I half opened my mouth to deny it, she barked that she didn't want to talk to me further and had other lines waiting for her.  I was flabbergasted for I'd considered Bellingham to be an area I'd enjoy moving to to complete my manuscript.  I, too, am a hardworking individual and not behind on my rent, and I was going to ask her about other properties but she didn't even let me get to that point.. Basically barked me off the phone, and I told her that she sounded very rude.  When I called back, in hopes of speaking to a manager, she barked that she was the manager.  Notice how I've used the word \"barked\" ? It's an apt description.  May this serve to be as a head's up and a warning to people of her ilk who feel they can treat the public as if they were akin to trash.  And may people such as her realize one thing - that one day, they may be in a position to desire people to treat them with respect, as well.\n\nWishing all the most pleasant of days.",
        "ownerResponse": null
      },
      {
        "author": "Tj S.",
        "rating": 1,
        "review": "My wife and I went into sun-mark properties today to look for a rental house in the sudden valley area. I was absolutely blown away at how rude and judgmental the woman who we talked with was. I am a 28 year old man with dreadlocks. I am hard working, have a REAL job, and have perfect rental history for the past 9 years that i have been renting houses and apartments. The first thing she asked us was wether we were going to \"grow marijuana\". We were both completely taken aback by this and told her that we definitely were not planning on growing any marijuana. She then asked about our jobs and how we would pay for the rental. We told her we had both been traveling for the past year, but had a large amount of money saved, and both have steady jobs in bellingham that we were going back to as soon as we finished the stressful process of finding a new rental to move into. I also informed her that we had a co-signer lined up, at which point she literally scoffed at us and asked \"who would co-sign for YOU???\" I had had enough at that point and told her i felt she was being very judgmental and making assumptions based on our appearance. She claimed they ask everyone these questions. And mind you, this is before we had even been by to look at a property. My wife and I had both had enough and knew there was NO WAY we would EVER rent a property from someone so rude. We walked out and as we were getting in our car, she followed us out the front door to personally insult me by yelling something about my \"ratty hair\". It was absolutely unbelievable. Like i said, i have been renting for nine years, and NEVER been asked any of those questions in such an accusatory way, and have NEVER been treated so poorly by anyone. DO NOT RENT FROM THESE PEOPLE. THEY ARE RUDE, JUDGMENTAL, AND EXTREMELY PREJUDICE. . . . PS: this review wouldn't allow me to give ZERO STARS. They certainly do not deserve even one.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 9,
  "adjusted_rating_average": 1.4
}