{
  "name": "Sunset Pond Apartments",
  "slug": "sunset-pond-apartments",
  "company_type": "property",
  "address": "1205 Woodstock Way, Bellingham, WA 98226",
  "review_count": 17,
  "avg_rating": 3.3,
  "reviews": {
    "google_reviews": [
      {
        "author": "Gurpreet Duhra",
        "rating": 1.0,
        "review": "It doesnt even deserve the one star. We were robbed in multiple ways including, by a intruder, of our deposit, paying more due to fabricated lies of how we kept the condition of the place, management is not approachable and non supportive. After having a truder enter our apartment, we were verbally told that we could purchase security devices that would be reimbursed. Management refused to pay and stated she did not agree to that statement. Also, kept and left the space very clean to have lies stated of the condition the space was left in. Also, have to pay more than double the deposit. Very disappointed and definitely not recommend!",
        "ownerResponse": null
      },
      {
        "author": "Dona Nelson",
        "rating": 4.0,
        "review": "I want to reach out to the office and maintenance staff for all they do to around here. Every times I've had issues in our apartment it has been handled, in a timely fashion. It's not an easy job for them with apartment complex of this size. Good job!",
        "ownerResponse": null
      },
      {
        "author": "Lu Banyan",
        "rating": 5.0,
        "review": "I rented this gorgeous 3 bedroom 2 bathroom SPACIOUS unit here sight unseen. Admittedly I was extremely nervous to see it having had bad experiences in the past. I've been here 1 week and my jaw keeps hitting the floor with how amazing this place is and how kind and helpful the staff are. My first day here, the dryer wasn't working properly and maintenance showed up within the hour! Kasha at the front desk is warm and friendly, and she is the reason everything went so smoothly for us. She is an advanced problem solver and I feel very lucky to be here with my two kids.",
        "ownerResponse": null
      },
      {
        "author": "Karen Dickinson",
        "rating": 4.0,
        "review": "We've been here a year and are impressed with the management and maintenance to promptly help with problems or concerns.\nThe price might seem high, but the amenities, the nearby bus line and the convenient location really does help our day to day lives.",
        "ownerResponse": null
      },
      {
        "author": "Antoinette Munn",
        "rating": 5.0,
        "review": "I moved into sunset pond apartments at the end of March 2023. The application process was smooth and predictable thanks to Kasha, the office manager. Kasha is professional and kind. She made the acceptance criteria clear and was certain to reach out promptly if more information was required for approval. After approval I was given a move in date. Maintenance efficiently turned my unit and I moved in on schedule. Maintenance clearly takes pride in their work and it was obvious that they paid attention to the details while turning my unit. The cleaner also left my unit spotless.\n\nDo your research on the area so you understand and are comfortable in your new neighborhood. Overall I am completely satisfied with Sunset Pond Apartments, excited to live here, enjoy the amazing amenities, and pleased to work with Sunset Pond staff!",
        "ownerResponse": null
      },
      {
        "author": "Lisa",
        "rating": 5.0,
        "review": "I lived at this complex for many years, and had nothing but great experiences with the office manager Kasha she is very nice and does good at her job she always has a smile on her face . Apartments are nice and maintenance always comes and does the work orders in a timely manner. There is some homeless you will see but they are pretty harmless. I really enjoyed living here and will miss it!",
        "ownerResponse": null
      },
      {
        "author": "Rebecca Herman",
        "rating": 4.0,
        "review": "The apartment: Very large 2 bedroom with huge walk in closet, open concept living room/kitchen, nice locking storage off the patio, nice vinyl double pane windows and sliders lets in plenty of daylight, stack washer dryer too!. For the rent amount, you can't get better square footage.  The property: Free assigned, covered parking, large indoor pool, hot tub and sauna, nice workout room , pool table in clubhouse and yes, you can reserve the clubhouse for a party or gathering! Water, sewer and garbage is paid which is excellent! Walk-ability: Within walking to stores, movie theatre, restaurants, etc... On Site manager and Staff:  Kasha is a highly trained professional manager who happens to live on site.  This is getting rare as most apartment management companies are faceless and have no real vested interest in their home.  This is her home and she continually makes property improvements. The maint. staff are friendly and prompt. The housekeeper/groundskeeper does an excellent job as well.  We're moving to a warmer climate but I would recommend Sunset Pond Apartments.",
        "ownerResponse": null
      },
      {
        "author": "Nick Green",
        "rating": 2.0,
        "review": "Not a safe place to live, only has residents due to there not being many options elsewhere. Loud neighbors who threw toys and trash onto our patio. Didn't seem to be any consequences because of how often it happened. Loud all the time, had my car broken into, and bike stolen here. Parking sometimes wasn't guaranteed because cars had been abandoned there for months. Paying rent in out dated inconvenient ways, with only check or money order. Better off anywhere I promise you. 2 stars because you can sign a month to month lease, letting you move out as soon as you can.",
        "ownerResponse": null
      },
      {
        "author": "Lisa Loleas",
        "rating": 5.0,
        "review": "I am a current tenant here and have nothing but good thing to say about the manager Kasha and maintenance team! They are all very good at what they do. The manager is very professional and make sure she keeps the property is in good condition. She does everything in her power to take care of the homeless situation. Some of the reviewes are not fair she does all that she can when dealing with homless. I have lived here several years and plan on being here for several more. Keep up the good work Kasha!  You do a good job at doing your job.\n\nhave nothing but",
        "ownerResponse": null
      },
      {
        "author": "S D",
        "rating": 1.0,
        "review": "Worst place to live. Break ins and junkies running around in the buildings. Not a safe place to call it a home. On top of this, the management is very hostile and they lie to keep the deposit and charge more.",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Marissa C.",
        "rating": 1,
        "review": "Not a safe place to live. Outside: trash everywhere, homeless people, car windows bashed in, property stolen off porch. Inside: overflowing toilets, standing water inside that management not only won't care about but would then probably charge you for water damage upon move out. \n\nI was forced to pay other peoples bills when I lived here or threatened with eviction. I was never compensated for their mistake, just treated with hostility. \nI was also forced to pay for the carpets to be replaced when I moved out based on how the carpets looked on the bottom once ripped out, not the top that you can see. They did not let me see the state the bottom of the carpet upon move in yet that's what they judged it off of upon move out... they really just make their own rules here and will continue to take advantage of people\n\nDon't risk it! Live anywhere else.",
        "ownerResponse": null
      },
      {
        "author": "Jessica P.",
        "rating": 1,
        "review": "Avoid this place at all costs especially if you are a single woman! \nWe had issues on several occasions with the cleaner harassing and peering in windows, taking pictures, when many other units were far worse than my daughter's . Piles of trash all over balconies, throwing trash over the edge, screaming and yelling from other units. People park huge vehicles in compact spaces and others have to crawl in and out of cars. The office is always closed and the staff mean and rude.\n\nMy daughter was also harassed by homeless people and we called the police on several occasions. The police said the landlords were responsible to keep homeless people off of peoples patios and that motion lights/cameras should be installed. When I contacted the management they said it wasn't their problem.\n\nMy daughter has been targeted by rude bitter people who excuse the behavior of some and harass others.",
        "ownerResponse": null
      },
      {
        "author": "Taylor C.",
        "rating": 5,
        "review": "We had a 2nd floor apartment with a stunning view of the pond. Our apartment came with a discount and even though we had our rent raise it was still a very good price compared to those in town. The front office people were always kind to us, the maintenance here are hard workers and treat you with kindness. Overall we enjoyed our experience here.",
        "ownerResponse": null
      },
      {
        "author": "Farnoosh R.",
        "rating": 3,
        "review": "My wife lived there for a year (2017-2018), and I visited regularly. \n\nPros: \n-The area is clean and well taken care. \n-Contrary to the past the neighborhood is pretty safe. \n- In unit laundry \n-It's a walking distance to several shopping places in Sunset square \n- Adequate quest parking space \n- Most tenants were decent and respectful \n\nCons: \n- Parking is pretty tight especially if you have a mid to large size car. \n- Office staff, especially the old lady that works there was remarkably rude and condescending on many occasions when I visited the office\n- Our upper floor was unusually squeaky anytime someone walked up there to the point that it wakes you up if you're sleeping \n- It would take maintenance staff several days to come over and fix something simple",
        "ownerResponse": null
      },
      {
        "author": "Brianna M.",
        "rating": 2,
        "review": "Apartment has great view of the pond- Third floor, great window and balcony. We moved into the maintenance manager's old place so everything was in working order, cheap carpeting and plastic shower inserts, but very livable. We cleaned when me moved in. Parking spaces are very small and cars will be dinged by doors. I did also hear of a few neighbors cars being stollen.\n \nBeware of move out fees! We moved out and cleaned, but it was an off time when we were leaving so the apartment manager did not check us out. They charged us 5 hours of cleaning to a total of $159.87. Fine, whatever, I have always walked through before and if anything was not up to par, I would re-clean, but it was cleaner than when we moved in. We had steam cleaned the carpet, oven was clean, bathrooms spotless, balcony wiped down (moss & mold-less). We paid the bill, check cleared, no problem. Then a month later, we have collections trying to recollect this. \n\nThe office simply does not have their stuff together. Incorrectly sending a paid bill to collections should have some reprocussions, but it simply doesn't. \n\nRead more: http://www.apartmentratings.com/WA/Bellingham/Sunset-Pond-Apartments_360734772298226/review-111205729#ixzz2jh5WuC2P",
        "ownerResponse": null
      },
      {
        "author": "Ben B.",
        "rating": 4,
        "review": "Overall this place is very livable.  The area has been quiet, clean and I have appreciated the friendly neighbors.  The club is great!  A place to get away after a long day and get a quick workout in or soak in the hot tub.  The main complaint is the tight parking spaces and a lack of them for guests.",
        "ownerResponse": null
      },
      {
        "author": "Heather E.",
        "rating": 4,
        "review": "This was my second time living in these apartments while in my hometown and I have nothing but love for the managers and staff at this complex. Karl and Jeeter always are prompt, efficient and friendly. They helped me out more times than I can count. They kept the apartments, community rooms and parking lots looking clean and presentable. \n\nThe only reasons why the apartments themselves do not rate 5 stars in my book was the noise from the neighbors beside me penetrated through my walls, and the townhouse parking, although covered, was further away from my unit, so my children and i often got wet before getting to our car. That's Bellingham for ya, not that we mind to much.\n\nI highly recommend this complex and if my husband and I don't end up purchasing a house, we'll more than likely reside there again.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 17,
  "adjusted_rating_average": 3.3
}