{
  "name": "The U Apartments",
  "slug": "the-u-apartments",
  "company_type": "property",
  "address": "2401 Taylor Ave, Bellingham, WA 98225",
  "review_count": 26,
  "avg_rating": 2.8,
  "reviews": {
    "google_reviews": [
      {
        "author": "Austin Williamson",
        "rating": 1.0,
        "review": "Absolutely horrendous accommodations for students. Complete inflexibility and total managerial incompetence. After learning that I could not break my lease or transfer my lease to a third-party, the leasing office was barely tolerable during my many attempts to secure a lease take-over. One of the applicants that tried to take-over my lease grew so frustrated by the obtuseness of the leasing office that they gave up on the process entirely and looked elsewhere for their accommodations. I encourage anyone that is considering applying to lease from here to look elsewhere long and hard before realizing that this isnt even a worthy last option. Honestly youre probably better off living out of your car or on the street than living here.",
        "ownerResponse": {
          "text": "Hi Austin, this is Kailey with the Customer Service team. Thank you for the feedback. I am sorry to hear about your frustrations with your lease takeover at the community. It was the worst timing for our phone line to go down, we're so sorry that we missed your applicants. I understand our manager is working with accounting to get this resolved for you. We wish you the best. Take care, Kailey"
        }
      },
      {
        "author": "Nate Lloyd",
        "rating": 1.0,
        "review": "Changed my initial review after having lived here for a year.\n\nAbsolutely horrible!\n\nMy apartment was flooded from a hot water heater leak in the apartment above and they continued to charge me rent for the unlivable apartment while I arranged moving and found a new place while unable to walk because of an ankle surgery I had a few weeks earlier. So argumentative and money hungry. The maintenance crew is great, but management is horrible! Also raises rent by about 17% for the next year so I just count my ability to break the lease as a God send in the end! I'm glad to be rid of this overpriced and poorly maintained liability there are frequent parties until 3 am and was a drug overdose while I lived.\n\nLOOK ELSEWHERE",
        "ownerResponse": {
          "text": "Hi Nate, this is Kailey with Customer Service. I see you left similar feedback on multiple sites. We strive to offer outstanding service and value with every single interaction. We apologize if we missed the mark, but were always grateful for feedback. Please consider contacting our Customer Service department directly to try and resolve any outstanding issues you may have. We can be reached at customerservice@plpinc.net or via phone at 425-287-7438. Thanks and take care."
        }
      },
      {
        "author": "Sarah Taylor",
        "rating": 1.0,
        "review": "Management is like a rotating door through here. You're guaranteed to see an entirely different crew of people by the time you finish your lease. The apartments are cheaply made and fall apart. Don't fall for their \"bundle utilities\" scheme.Learn how to pay a utility bill and find an actually decent apartment for a fraction of the cost.",
        "ownerResponse": null
      },
      {
        "author": "Rachel Sandal",
        "rating": 1.0,
        "review": "Management and staff have been rude and somewhat unresponsive to our needs/questions. People have entered our apartment without any notice at all and it was scary! That experience left my roommates and I shaken up. In talking to the leasing office about our concerns, they have been rude and even threatened us with corporate lawyers. They have insinuated my roommate is unintelligent telling her that she just wouldnt understand the legal stuff. Its a good location, but honestly not worth it. I dont think anyone in the building is renewing their lease from our knowledge. We have had a horrible renters experience and will not be renting with this company again.",
        "ownerResponse": null
      },
      {
        "author": "K. M.",
        "rating": 1.0,
        "review": "Have to change my review.\n\nAvoid at all costs. Management is a joke, repairs of serious nature are rarely attended to and the parking situation is a wild west scenario.\nI moved out with a lease takeover because the managment \"lost\" or flat out had the wrong contact information for me. Better off being homeless, ngl.",
        "ownerResponse": {
          "text": "Hi there, this is Kailey with the Customer Service team. Thank you for the feedback. I am sorry to hear about your frustrations at the community. I would love the opportunity to speak with you in greater detail regarding your concerns so I can help address. Please feel free to contact me directly at 425-287-7438 or email at customerservice@plpinc.net Take care, Kailey"
        }
      },
      {
        "author": "Cameron Smith",
        "rating": 1.0,
        "review": "Overpriced and brittle apartments. Everything breaks apart, they charge you for every little thing and management lies to you. They provide absolutely no help with trying to move out and they pretend to care about residents. I hate living here and I have already recommended to several friends to STAY AWAY",
        "ownerResponse": {
          "text": "Hi Cameron, this is Kailey with Customer Service. We strive to offer outstanding service and value with every single interaction. We apologize if we missed the mark, but were always grateful for feedback  constructive and otherwise. We tried to locate you in our database and were unable to find any prior or current resident with your name, so our team is wondering if you've found the correct community to review. Please consider contacting our Customer Service department directly to try and resolve any outstanding issues you may have if you did indeed live at our Bellingham location. We can be reached at customerservice@plpinc.net or via phone at 425-287-7438. Thanks and take care."
        }
      },
      {
        "author": "Debbie Schmidt",
        "rating": 1.0,
        "review": "Update:  More collections calls. I sent in all the proof I had explaining the situation and showing all the sites that currently show no availability. They are supposed to attempt to re rent the unit. Month after month it shows no availability but there was a unit available. They know I cannot pay this amount right now and we are paying the rent on the unit my son moved to so he could get out of the situation he was in. If you think renting from a WWU living building means they will care about your student at all, please continue reading our story below. If they don't care in this extreme situation and with all that is going on right now, just be warned, they will not help you.\n\nPlease do not let your student rent here! We are currently in the middle of a pandemic and I just got a collections call from these people.  My son was extremely sick and was tested for covid-19. My son was so sick and didn't feel safe since others in the apartment were angry about possibly getting the virus.  We had to quickly find him a new place to live and move him out.  I explained to the staff that he was moving out because he felt unsafe. They said the would send us a bill for the utilities for the month when they got them.  I heard nothing from them at all. And now a collections call wanting the entire balance of the lease NOW. During a pandemic when no one is working and I'm still paying rent where he is actually living.\nThis is a tiny expensive apartment with 4 tenants! They bring in over $2800 just for this apartment. Once the lease was signed it was down hill. And I know I'm foolish for believing the management when we moved him out. But since we all thought he had covid they seemed happy to have him go and understood why his roommates wouldn't want him there. The office staff wouldn't even open the door when he went to drop off the keys.\nThey are supposed to make a reasonable effort to rerent the room but apatment search sites say they have no availability.\nYes. I realized I signed a lease. But we picked this building because it was newer and looked safe.  He should expect to feel safe in his own apartment.",
        "ownerResponse": {
          "text": "Hi Debbie, this is Kailey from Customer Service. Thank you for the feedback. I am sorry to hear about your frustrations with the lease break policy. I see you've left the same review on multiple sites. Our regional manager is available to speak with you directly should you like to contact him, he is reachable at 916-399-3227. Please share these photos to customerservice@plpinc.net Thanks and take care, Kailey"
        }
      },
      {
        "author": "Alex Jonees",
        "rating": 1.0,
        "review": "Terrible.. the place is extremely old and out dated. A lot of the amenities break too.",
        "ownerResponse": {
          "text": "Thank you for your feedback, Alex. We would love to address any maintenance issues you currently have. Please contact us at your earliest convenience!"
        }
      },
      {
        "author": "Tiger Rabbit",
        "rating": 1.0,
        "review": "terrible  management.  the floor makes super loud noise.  I literally can hear every movement my upper floor made.   I told the manager and staff in the office,  and no one give a f.",
        "ownerResponse": null
      },
      {
        "author": "Kai ZaneSon",
        "rating": 4.0,
        "review": "Look cool",
        "ownerResponse": null
      },
      {
        "author": "Ethan Marquardt",
        "rating": 1.0,
        "review": "Too expensive for what the units have to offer. Look for better alternatives.",
        "ownerResponse": {
          "text": "Hi Ethan, this is Kailey from Customer Service. Thank you for the feedback. I am sorry to hear that we fell short of expectations. I have found that we priced fairly with the market, although I personally wish I didn't have to pay rent too! I would love to chat more with you to find out what alternatives you would prefer so we can continue to better the community. Please feel free to contact me directly at 425-287-7438 or email me at customerservice@plpinc.net Take care, Kailey"
        }
      },
      {
        "author": "Lauren S",
        "rating": 1.0,
        "review": "An apartment is an apartment but this place is mediocre at best and horribly overpriced",
        "ownerResponse": {
          "text": "Hi Lauren, this is Kailey from Customer Service. I wish I could control the rental market prices but because we have such a strong market that is what dictates the pricing. Please feel free to call or email directly at 425-287-7438 or customerservice@plpinc.net if there is something more I could handle for you. Take care, Kailey"
        }
      },
      {
        "author": "Julie Rounds",
        "rating": 5.0,
        "review": "5 star staff, 5 star apartment",
        "ownerResponse": {
          "text": "Thanks for showing your support for The U! We appreciate it :)"
        }
      },
      {
        "author": "Kate Dolan",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the feedback Kate! Please let us know if there is anything further we can be of assistance with."
        }
      },
      {
        "author": "Kevin R",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Kevin, happy move in!! Thanks for the feedback :)"
        }
      },
      {
        "author": "Maddy Rae",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Maddy! We appreciate your 5 stars! :)"
        }
      },
      {
        "author": "Adrian Oh",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for showing your support for The U! We appreciate it :)"
        }
      },
      {
        "author": "Shen Stirling",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Shen, we think you rock too! Thanks!!"
        }
      },
      {
        "author": "Chloe Hoegger",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the feedback Chloe, it's much appreciated!"
        }
      },
      {
        "author": "Diviana Sumer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the shoutout!"
        }
      },
      {
        "author": "Emily Martin",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Emily, thanks for the feedback. We will show you that your experience here is 5 stars in no time! :)"
        }
      },
      {
        "author": "Ella Johnson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Ella, this is Kailey from Customer Service. Thank you for taking the time to post your review for The U. We strive for 5! If there is anything I may help assist with to make your experience with us even better, please feel free to call or email directly at 425-287-7438 or customerservice@plpinc.net Take care, Kailey"
        }
      },
      {
        "author": "Isaiah Courtad",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Isaiah, We are sorry to hear your experience was less than 5-star. If you have specific feedback you'd like to share to help us improve, please send it to customerservice@plpinc.net."
        }
      },
      {
        "author": "Conor Mittauer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Conor, Thank you for taking the time to post your review for The U apartments! We appreciate it!"
        }
      },
      {
        "author": "Clover",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Hunter, this is Kailey from Customer Service. Thank you for taking the time to post your review for The U. We strive for 5! If there is anything I may help assist with to make your experience with us even better, please feel free to call or email directly at 425-287-7438 or customerservice@plpinc.net Take care, Kailey"
        }
      },
      {
        "author": "Bailey Mendez",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 13,
  "adjusted_rating_average": 1.5
}