{
  "name": "The Village Apartments",
  "slug": "the-village-apartments",
  "company_type": "property",
  "address": "3310 Alderwood Ave Bellingham, WA 98225",
  "review_count": 3,
  "avg_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "C G.",
        "rating": 1,
        "review": "Believe online reviews. Apartments.com rent.com google.com, they are all accurate!!   Walk away!! It's incredibly unfortunate that noone has done anything for current or past tenants. \nDefinition of slumlord\n\n:a landlord who receives unusually large profits from substandard, poorly maintained properties.",
        "ownerResponse": null
      },
      {
        "author": "Tyler L.",
        "rating": 1,
        "review": "Horrible. Horrible. Horrible landlord/ manager. Sharlene should not be the manager. She doesn't care about the tenants or anybody but herself. She refuses to work with you to make your stay here even remotely livable. Mold is everywhere because nothing is insulated right and not up to code. She refuses to fix it and blames you for it. She will not give you your direct depot back because of the mold and other things that are wrong with the place and blame you for it! Her dogs are always barking. I've recently called animal control because they will not stop barking. She is just a horrible human being. I've never met somebody so mean and heartless. Her bubbly attitude is all an act. TRUST me.",
        "ownerResponse": null
      },
      {
        "author": "Joshua D.",
        "rating": 1,
        "review": "Your review helps others learn about great local businesses.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.\n\nWOW is all I can say. Simply called to get basic information about complex. The women who answered was extremely unprofessional, had no idea of the square footage, or rent rates on any of the units. \nEvery question I asked was met with \"I don't know\" or \"I don't have that available\" We established that there were no units available this month early in the phone call, and that I was looking for information, nothing more. This was met with indifference, and dismissal.\n\nIf it was management that answered......\n\nGood Luck to anyone who Rents here... let alone looking INTO renting Lmao!\n\nyou gonna need it.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_rating_average": 1.0
}