{
  "name": "Utopia Property Management | Bellingham, WA",
  "slug": "utopia-property-management-bellingham-wa",
  "company_type": "company",
  "address": "2900 Meridian St A Ste 102 Bellingham, WA 98225",
  "review_count": 2,
  "avg_rating": 3.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Micah E.",
        "rating": 1,
        "review": "Will take several weeks to respond to emails and/or ignore you altogether. Incompetent communication at best, although I'm beginning to realize possible careless or malicious intentions. Our house has been getting repeatedly vandalized and Utopia has pointed the finger at us, their justification being that it's \"concerning\" that it started happened after we moved in. Keep in mind that I've never had this problem before. I've put incredible effort into explaining to them why vandalism against a property is the homeowner's responsibility, to which I was told that we are responsible for \"damage\" (all damage - really?) and to let them know if I wanted to move out and then silence. I can't remember an instance of a disagreement being handled so immaturely since I was in high school (and that was 10 years ago!). And this has mostly been our experience with them this year, e.g. ignored maintenance requests, ignored emails.\nI'd expect communication to be a top skill from a company who claims to \"manage\" things. Perhaps I'd be a lot more sympathetic toward poor communication from folks in a different profession, like a bus driver or a bongo street performer. But this has truly been an outright failure of basic job duties, which was disappointing and low-key embarrassing to witness. I've had better experiences with even Hammer and Landmark, which are words I never imagined I'd be saying. If you intend to stick up for your rights as a tenant, expect the silent treatment. YMMV",
        "ownerResponse": {
          "text": "Hi Micah, \n\nWe are sorry that you feel this way. \n\nThe first vandalism event occurred over 9 months ago. We had asked you to clean the affected area, as vendors were unavailable at the time. The owners were sympathetic that this had happened and took proper steps with installing motion sensor lights to the exterior of the house. The second event in January did lead to concerns, as the property was previously occupied by the owners for many years. Neither the owners nor the HOA had records of previous vandalism in the area. \n\nYou had originally asked our office where to find in the lease that it states who's responsible for the clean-up of these events. Clear answers have been provided to you. We don't see any requests in our system that have not been addressed. Please reach out if you require assistance. \n\n\nSincerely, \n\nShayli"
        }
      },
      {
        "author": "Donna B.",
        "rating": 5,
        "review": "Utopia Property Management has been a game-changer in my renting experience. Their professionalism, attention to detail, and commitment to tenant satisfaction are second to none. From my initial inquiry to my move-in day, their team has been incredibly efficient and courteous. Maintenance requests are handled promptly, and they take proactive measures to keep the property in top condition. Their online portal is a lifesaver, making it easy to pay rent and communicate with them. Beyond their efficient management, what truly stands out is their dedication to creating a sense of community among tenants. They organize events and initiatives that genuinely bring residents together and foster a welcoming environment. Renting with Utopia Property Management has been an absolute delight, and I highly recommend them to anyone seeking an exceptional rental journey.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_rating_average": 3.0
}