{
  "name": "Canterbury Court Apts",
  "avg_rating": 3.2,
  "review_count": 6,
  "adjusted_review_count": 6,
  "reviews": [
    {
      "author": "Chantilly H.",
      "rating": 1.0,
      "review": "Amenities are not available due to what ever excuse they come up with month to month. I lived there a year and only got to use the pool/hot tube twice. Your heat bill will be $200.00 in winter, and the windows will condensate and freeze over and then mold. You will sweat to death in summer because you can not use a window AC. Washer and dryer is mini so power bill will also be high all year, due to having to do multiple loads and the appliances are outdated. If you are a lower unit you will hear everything from your neighbors upstairs. I mean everything and it will startle you out of bed at night as if they will fall through the ceiling. You will hear the neighbors toilet flush every single time. My neighbor used the toilet a lot! They won't properly clean the apartment before you move in, if you have a cat or dog on the lease , they will keep your entire deposit claiming the entire carpet in the unit needed to be replaced due to urine ,only proof of their false claim is a black light they apparently use after you move out but not when you move in.... You will be refused a walkthrough on exit and the the carpet cleaners are also, the same person who replaces carpet.. even though they never cleaned carpets before you moved in and will not show proof when you ask. To top it off you will be forced to pay an added amount to cover all the cost of replacing carpet after they already kept 1500.00 or be reported to collections. The time and cost of fighting them in court is costly and time consuming.",
      "ownerResponse": []
    },
    {
      "author": "Dan M.",
      "rating": 5.0,
      "review": "I've lived here for about ten months now, and while I wouldn't recommend moving across two states in the middle of February, Emileigh was amazing in helping an out-of-towner figure out how to get situated.  Everything from the screening process to the move-in to the pet approval was handled quickly and easily, and the facilities are really nice.\n\nNow, this is 2020, and some of the onsite amenities are sadly unavailable, but they're doing the responsible thing which I can respect.",
      "ownerResponse": []
    },
    {
      "author": "Kathy M.",
      "rating": 1.0,
      "review": "I gave a great review last month, then I received a lengthy explanation for why they were keeping my $600 deposit and charging me an additional $339.31 for replacing carpet that was disgusting when I first moved in!  I have NEVER been treated like this and I am so disappointed.  They claim there were traces of urine through most of the living room and dining room. They provided where this supposedly was and all of the areas were covered by my furniture and my cat would NOT have had access to them.  My cat NEVER peed on the carpet. She is a house cat and they are very picky.  She always uses her litter box.  Wish I could post without any stars!",
      "ownerResponse": []
    },
    {
      "author": "Kayla B.",
      "rating": 5.0,
      "review": "Wonderful neighborhood, quiet and private, maintenance does their job quickly and effectively, and the property manager Emily is wonderfully helpful and educated. Highly recommend this company.",
      "ownerResponse": []
    },
    {
      "author": "Naomi R.",
      "rating": 5.0,
      "review": "I loved living here! Emily, the woman at the office, was always professional, respectful, and remembered everyone's names. I thought the apartment complex seemed small enough to seem personable. Very quiet apartment and neighbors were great. Highly recommend living here. Will miss the great, convenient location.",
      "ownerResponse": []
    },
    {
      "author": "Lee R.",
      "rating": 2.0,
      "review": "My wife and I have lived at Canterbury Court on and off since 2001.  Our last move out was on December 29, 2013 just over a month ago after living there for eight years.  We expected to pay a reasonable cleaning fee as we have paid before in our other two move outs.  Unfortunately this did not happen this time.  We were charged an excessive cleaning fee which was very disappointing but we paid it and wrote a letter explaining our disappoint but no one has responded to our letter to see how we could improve this issue.  I know there are new owners which then caused a change in management at Canterbury Court which probably explains the reduction in customer care.  Before these changes took place we have written positive reviews in the past of the customer care that we received from the former owners and managers.  Obviously from our long stay at this site it has been a place that we have enjoyed living.  With the new direction owner/management has taken Canterbury Court  is not the great experience that we came to expect.",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "3790 Canterbury Ln Bellingham, WA 98225",
  "adjusted_avg_rating": 3.2,
  "summary": "# Canterbury Court Apts: A Comprehensive Review\n\nCanterbury Court Apts, located at 3790 Canterbury Ln Bellingham, WA 98225, has garnered an average rating of 3.2 stars. The mixed sentiments in its six user reviews reflect a variety of experiences, which we have categorized and summarized in this article. Please note, this article is generated by ChatGPT and is intended to serve as a tool to aid prospective tenants in evaluating this property management company.\n\n## Good\n\nTenants have found many positive aspects of living at Canterbury Court Apts. Some residents praise the leasing process, describing their interactions with the property manager, especially one named Emily, as extremely professional and accommodating. The quick and efficient manner in which administrative tasks such as screening, move-ins, and pet approvals were handled is commended, indicating a management that’s attentive and responsive to tenants' needs before they officially make Canterbury Court Apts their home. \n\nEvidently, this community has left a good impression on several residents who have recommended the company due to its quiet and private surroundings. Reviews point out the property manager's ability to remember resident names, creating a personable atmosphere in a conveniently located neighborhood. The timely completion of maintenance and an overall professional demeanor from the staff contribute to residents' satisfaction, offering an insight into the daily experiences of those happy to call Canterbury Court Apts home.\n\n## Great\n\nThere are aspects of Canterbury Court Apts that have particularly stood out as exceptional. Some tenants have experienced exceptional customer service, with one review highlighting a property manager's support in facilitating a move from out of state. This points to a level of service that goes beyond basic duties, providing genuine help during what can be a highly stressful life event. Additionally, the property manager’s respect for current social responsibilities, as seen during the year 2020, resonates with tenants who value community well-being.\n\nOther reviews focus on the exceptional community experience, describing their living environment as very quiet with great neighbors, solidifying Canterbury Court Apts as more than just a place to live, but a place to enjoy peace and cultivate relationships. Compliments towards maintenance staff also feature heavily in user reviews, with words such as \"quickly and effectively\" coming up, which is pivotal for tenant contentment as it assures them that their comfort and concerns are a top priority.\n\n## Bad\n\nHowever, not every experience shared in user reviews paints Canterbury Court Apts in a favorable light. There are concerns over high utility bills linked to inadequate insulation, with reports of window condensation, mold, and extremes in temperature regulation. These might indicate neglect in addressing fundamental infrastructure issues. The limitations on using personal appliances like window AC units further compound the discomfort during warmer seasons, posing significant drawbacks for the residents.\n\nAnother issue raised involves the noise levels, particularly for those living in lower units. Hearing all manners of sounds from neighbors, including toilets flushing, could imply poor soundproofing between apartments. This level of noise pollution can severely disrupt the peace and quiet that a home should ideally provide, leading to frustration and sleep disturbances for affected residents.\n\n## Ugly\n\nThe \"ugly\" truth, as reported by some tenants of Canterbury Court Apts, deals predominantly with security deposit disputes and lack of post-tenancy transparency. Some reviews detail unpleasant experiences whereby entire security deposits are withheld for reasons such as carpet replacement due to alleged pet damage. Accusations of using unreliable methods to prove damages and refusal to conduct walk-throughs upon move-out have painted a picture of a company that may be unfairly charging its tenants.\n\nAdditionally, reports suggest that after moving out, past residents face demands for additional payments on top of what was already forfeited from their security deposits. Lack of evidence provided for such claims and a sense of being unjustly targeted could be indicative of potential mishandling when it comes to tenant deposit returns. This not only strains the tenant-company relationship but may also tarnish the company’s reputation in the long term.\n\nIn conclusion, while there are both satisfactory and unfavorable reviews of Canterbury Court Apts, this article's intent is to present a balanced view from the existing user reviews. Prospective tenants should weigh these aspects carefully and further investigate to make an informed decision. It’s crucial to note that these are past experiences and may not necessarily reflect the current status or future experiences at Canterbury Court Apts."
}