{
  "name": "Cohen Group NW - Muljat Group",
  "address": "",
  "company_type": "Real estate agent",
  "review_count": 106,
  "avg_review": 5.0,
  "reviews": [
    {
      "author": "Nate Aplin",
      "rating": 5.0,
      "review": "Leo Cohen with Cohen Group NW has the skills we needed to get our dream home. My wife and I were first time home buyers with a tight budget and no knowledge of how real estate purchases work. Leo was very insightful and provided a lot of ",
      "ownerResponse": []
    },
    {
      "author": "Marielle Face",
      "rating": 5.0,
      "review": "Jed Holmes was friendly, helpful, and great at communication. As a first-time home buyer, the process seemed very scary to me at first. Working with Jed helped me feel like no question was too silly. He did a great job explaining everything ",
      "ownerResponse": []
    },
    {
      "author": "Barbara",
      "rating": 5.0,
      "review": "House sold in ONE WEEK! Excellent team of very talented people.  Leo was always accessible and very knowledgeable about resources,  and all things real estate The photography was exceptional. Paperwork was easily managed remotely and very well organized by Chris. I highly recommend this group.",
      "ownerResponse": []
    },
    {
      "author": "Anthony Gass",
      "rating": 5.0,
      "review": "Max Burrage and Cohen Group NW were the absolute dream team as I purchased my first house. I felt supported, not rushed, and totally prepared for the process. It went incredibly smoothly and I'm so happy with the spot I got. I'm so grateful to have worked with Max, Leo, and the team!",
      "ownerResponse": []
    },
    {
      "author": "Schantell Porter",
      "rating": 5.0,
      "review": "My husband and I bought our first home with the Cohen Group in February. Max Burrage was our realtor. He was extremely communicative, positive, and overall so great to work with. The Cohen Group team kept us in the loop and guided us through the home buying process with ease. Thanks, Max! We absolutely love our new home.",
      "ownerResponse": []
    },
    {
      "author": "Nate Brown",
      "rating": 5.0,
      "review": "This company has 5 stars and you can see why. Their whole crew is so genuine, so caring and clearly passionate of what they do. I think real estate is obvious a huge part of it, but more so it's them connecting with and helping people. If ",
      "ownerResponse": []
    },
    {
      "author": "Rachel Hale",
      "rating": 5.0,
      "review": "Max and his team were amazing to work with. They helped us to buy our first home!\nWe knew nothing about buying a house, and Max helped to get us setup with a ",
      "ownerResponse": []
    },
    {
      "author": "Gila Macdonald",
      "rating": 5.0,
      "review": "Leo and his team were very professional in everything they did. They answered every question we had in a fast and timely manner. Leo's team took excellent pictures and helped to make everything look great. we had never sold a house before ",
      "ownerResponse": []
    },
    {
      "author": "Lewis Jensen",
      "rating": 5.0,
      "review": "Purchased my second property through Leo and the Cohen group because they made it so easy the first time! Leo is super personable, and is always quick to answer questions through text or email, which shows his professionalism and investment to make sure your buying or selling experience goes smoothly. Cannot thank him enough.",
      "ownerResponse": []
    },
    {
      "author": "Jason Smith",
      "rating": 5.0,
      "review": "Leo Cohen and the Cohen Group NW are singularly responsible for getting my wife and I our dream home.  It all started in 2018 when Leo helped me purchase my house in Bellingham.  Leo adeptly navigated the entire process, kept me fully ",
      "ownerResponse": []
    },
    {
      "author": "Cameron Dunn",
      "rating": 5.0,
      "review": "Leo and his partner Chris were always available whenever I wanted to look at a house, and were immediately on top of any offers. They were great with communicating with other agents to help us stay on top, and ultimately helped me find a great house.",
      "ownerResponse": []
    },
    {
      "author": "Megan McClelland",
      "rating": 5.0,
      "review": "Buying our first home in a highly competitive market was daunting! Leo made the process less so. Here is what we loved about Leo: ",
      "ownerResponse": []
    },
    {
      "author": "Peter Hegman",
      "rating": 5.0,
      "review": "We worked with Leo for around 5 months trying to buy a house and he was great the whole time! In the end we bought a house that was pretty much exactly what we were looking for and I am sure that would not have been possible without Leo's ",
      "ownerResponse": []
    },
    {
      "author": "Bridget Sauer",
      "rating": 5.0,
      "review": "Leo and the Cohen Group are the reason we were able to secure our dream home in Bellingham! Leo helped make the home buying process easy and enjoyable. In a competitive market, it was key to have a realtor who was savvy, well connected, and ",
      "ownerResponse": [
        {
          "text": "Bridget! It has been great getting to know you both better and lockdown a pretty awesome house in the process. You both were great to work with and dove into the process for the first time without fear so, kudos to you as well for  More"
        }
      ]
    },
    {
      "author": "Justin Singh",
      "rating": 5.0,
      "review": "Leo and the team at Cohen Group NW are to be highly recognized for their unique and extremely effective manner of caring for the client. ",
      "ownerResponse": [
        {
          "text": "Justin, Thank you so much for choosing us to join you on the journey of making a move up north! Glad our paths crossed. You and Michelle (and Kiddos) were awesome to work with and reminded my of why we do what we do. So glad to see that ya'll are living it up! Cheers!"
        }
      ]
    },
    {
      "author": "Jane Mauk",
      "rating": 5.0,
      "review": "We had the best experience working with Leo and Chris at Cohen Group NW. From market analysis to presale advice Leo's expertise is spot on. Chris's help throught the sale and closing process made the transaction seamless. I highly recommend their team.",
      "ownerResponse": []
    },
    {
      "author": "Clare Schmidt",
      "rating": 5.0,
      "review": "Working with Leo was great from the start. As first time home buyers, we were very uncertain about how to go about the process. Leo took us under his wing and made sure not a single question was left unanswered. We felt like we could trust ",
      "ownerResponse": [
        {
          "text": "Clare! I am so glad that our paths crossed when they did. From meeting Kevin back in the day, to reconnecting, to getting the property search going, to finding the one!  More"
        }
      ]
    },
    {
      "author": "Madison Emry",
      "rating": 5.0,
      "review": "Max and the team are amazing! We were intimidated to shop for our first home in a wild market, but Max was so supportive and his help relieved a lot of the stress of the process. He was always just a phone call or text away when we had ",
      "ownerResponse": []
    },
    {
      "author": "Lindsey Sawtell",
      "rating": 5.0,
      "review": "Working with this team was such a breath of fresh air compared to past experiences. Leo got things started for us and was swiftly responsive and very helpful in getting us connected with Christopher. My husband and I were absolutely blown ",
      "ownerResponse": []
    },
    {
      "author": "Howard Valentine",
      "rating": 5.0,
      "review": "John Angier helped us buy and sell our townhome.  John is a knowledgeable, personable, experienced realtor with outstanding communication skills.  He was with us every step of the way. He was instrumental in selling our townhome when there ",
      "ownerResponse": []
    },
    {
      "author": "Robbie Carrasco",
      "rating": 5.0,
      "review": "Working with Leo made our first home buying experience so much less intimidating. Leo walked us through the entire process from start to finish. He toured dozens of homes with us, helped us submit multiple offers, and when we finally found ",
      "ownerResponse": [
        {
          "text": "Robbie! The market that you guys jumped in on (as you found out) was very competitive but thank you for sticking with it and having patience/diligence. I'm super stoked that you both are in Bellingham now and am excited to kick back with  More"
        }
      ]
    },
    {
      "author": "Colin Edwards",
      "rating": 5.0,
      "review": "We worked with Max Burrage to buy a house in Bellingham this Summer. Max was recommended to us and was a great realtor for my partner and I. Max was super knowledgeable of the areas that we were looking into. We were in the process of ",
      "ownerResponse": []
    },
    {
      "author": "Amy D",
      "rating": 5.0,
      "review": "My husband and I worked with Christopher Lee. He helped us understand the process of first time home buying, navigating a crazy housing market, and all while my husband was deployed. So thankful for all the time and effort Chris and his ",
      "ownerResponse": [
        {
          "text": "Amy, thank you for your very kind words. I'm incredibly thankful to have been part of your journey to finding the perfect home. Who would have thought that the 4th time is actually the charm?! Thank you for the perseverance and positive  More"
        }
      ]
    },
    {
      "author": "Mike Falette",
      "rating": 5.0,
      "review": "Buying a house during times of COVID certainly made for an interesting first time home buying experience but, Leo and his team made it as painless as possible during these interesting times. ",
      "ownerResponse": [
        {
          "text": "Mike, Thank you for the kind words and for trusting our team to help you and Arianna to purchase your FIRST HOME! Congrats again to you both."
        }
      ]
    },
    {
      "author": "N T",
      "rating": 5.0,
      "review": "So you are looking at this review because you are trying to find a solid person to help you buy or sell one of the most expensive things you will ever purchase or sell...no stress, right?!?! ",
      "ownerResponse": []
    },
    {
      "author": "Miranda Brewer",
      "rating": 5.0,
      "review": "We were referred to Leo from a trusted agent in a different region. From the moment we were introduced, Leo got to work helping us find the house that \"checked all the boxes\" without putting any pressure on us. He used his experience and ",
      "ownerResponse": [
        {
          "text": "Miranda! It has been a pleasure getting to know you and Dustin throughout the process of making the move up to Bellingham. Thank you for trusting in the team and I to get the job done! We all appreciate your patience and diligence to get  More"
        }
      ]
    },
    {
      "author": "Keith Robert",
      "rating": 5.0,
      "review": "Working with Leo and team was the definition of a seamless experience! I had a plethora of questions as a first-time home buyer and found Leo to be extremely responsive, knowledgeable, and personable. There were so many unknowns heading ",
      "ownerResponse": [
        {
          "text": "Keith, It was a blast getting to know you throughout the process of finding you a home. We definitely had some challenges and lost a few (given the crazy market) but we ultimately landed on the best one. I am so stoked for you, the setting  More"
        }
      ]
    },
    {
      "author": "Jason Smith",
      "rating": 5.0,
      "review": "Leo has been a spectacular realtor.  Ive been wanting to move into Bellingham for a couple years now but with my very demanding job I wasnt able to make the time to get through the process.  Until I connected with Leo.  He met me at his ",
      "ownerResponse": [
        {
          "text": "Jason,\n\nThank you for the kind words! It has been a pleasure working with you. I really  More"
        }
      ]
    },
    {
      "author": "Veronica Gonzalez",
      "rating": 5.0,
      "review": "Max from Cohen Group NW is not only a great realtor, but a great person! Buying a first home is a big process and he helped me through every part. Max is patient, friendly, and knows his stuff. Any questions I had, he knew the answer and ",
      "ownerResponse": []
    },
    {
      "author": "Danielle Evans",
      "rating": 5.0,
      "review": "Leo & his team did an excellent job in helping us sell our home. They communicated very well - especially since we lived out of state. I would highly recommend them to everyone. Leo was very knowledgeable in the market and helped sell our ",
      "ownerResponse": [
        {
          "text": "Danielle, we are all grateful that we had the opportunity to work with awesome people like you and Levi! Thank you for your kind words!"
        }
      ]
    },
    {
      "author": "Floyd Jones",
      "rating": 5.0,
      "review": "A friend recommended Leo and the Cohen Group when we were planning our home sale in another state. We're so grateful to have found Leo as our buyer's agent. We knew only a little about Bellingham from previous visits, and we hadn't even ",
      "ownerResponse": []
    },
    {
      "author": "Kevin",
      "rating": 5.0,
      "review": "Worked with Max Burrage who was fantastic! He was able to get us into our first home smoothly and we really enjoyed the home buying process with him and the cohen group team. Everything was organized and the whole team was very knowledgeable regarding the local real estate market. Highly recommend!",
      "ownerResponse": []
    },
    {
      "author": "Kristen Hawks",
      "rating": 5.0,
      "review": "Words cannot begin to describe the proficiency, professionalism, and passion of the Cohen Group -NW Keller Williams Realty. My time-frame for purchase was unexpectedly and drastically reduced during the process, leaving only 10 days under ",
      "ownerResponse": [
        {
          "text": "Kristen, this is by far the best feedback on our group that we have ever gotten. Your kind words are truly appreciated. We know that the process of buying a home is 1. not easy 2. not always fun 3. (can be) very stressful at times. Our goal  More"
        }
      ]
    },
    {
      "author": "Rhiana Breedlove",
      "rating": 5.0,
      "review": "We decided to use The Cohen Group NW to help us find our very first home. My fianc and I love everything this company stands for and how they care so deeply for this community. Our Real Estate agent was Christopher Lee who was outstanding! ",
      "ownerResponse": [
        {
          "text": "Ray, thank you both for trusting me to guide you this this huge milestone in your life. The journey was full of laughs, protective gear and plenty of adventure. I can't wait to see how you change this home to make it your own. And it will be just in time for us to throw you a house warming party!"
        }
      ]
    },
    {
      "author": "Semere Woldetatios",
      "rating": 5.0,
      "review": "Worked with Leo and his team and was a great experience from initial consult through the closing process. Worked with the team from out of town, but always received quick updates and attention. Waited for the home we wanted and won a very ",
      "ownerResponse": []
    },
    {
      "author": "Laura Hamilton",
      "rating": 5.0,
      "review": "Leo Cohen and everyone at Cohen Group NW were so helpful in helping us find our new home! From the beginning, Leo was very professional and personable and listened to what was important to us, in order to ensure we found the perfect place. ",
      "ownerResponse": [
        {
          "text": "Laura, Thank you so much for the kind words! I know it can be difficult searching for a home from far away but Im honored that you trusted in me to find you the right home and get it done during these crazy times. Ive enjoyed working with  More"
        }
      ]
    },
    {
      "author": "Louis Johnson",
      "rating": 5.0,
      "review": "Leo and his associates were the smartest thing my wife and I did during our moving process. We had a very unique property but Leo was able to market it to the kinds of people who were within that niche'. Out property sold quickly and for ",
      "ownerResponse": [
        {
          "text": "Lou, Thank you so much for the kind words. You're right it was definitely a unique property but our partnership to get that sold made all the difference! Honored that you chose us my friend!"
        }
      ]
    },
    {
      "author": "Allyson Rosman",
      "rating": 5.0,
      "review": "Leo Cohen is an absolute joy to work with. He manages to make the daunting task of finding a property in this competitive area seem easy. He is reassuring, composed, and confident in his abilities as a realtor - as he should be, given the ",
      "ownerResponse": [
        {
          "text": "Allyson, Thank you so much for the kind words and the opportunity to work with you and Tyler. Not only were you guys a blast to work with but thank you for making my job fun as well. We are all excited for you guys to get the ball rolling  More"
        }
      ]
    },
    {
      "author": "Grimm Northwest",
      "rating": 5.0,
      "review": "I couldn't be more ecstatic about the experience my fiance and I have had with the Cohen Group. Layla and Margaret have been with us every step of the way going above and beyond to make sure we are comfortable. This is our first time buying ",
      "ownerResponse": []
    },
    {
      "author": "Andrea LaPlant",
      "rating": 5.0,
      "review": "My husband and I worked with Max Burrage at the Cohen Group and had the most amazing experience! We are not local to Bellingham but were looking for an investment property in the area. Initially we didn't have a realtor so we showed up at a ",
      "ownerResponse": []
    },
    {
      "author": "Erin Willis",
      "rating": 5.0,
      "review": "Leo and team were attentive, courteous, and knowledgeable about our local real estate market. His photographer took excellent photos of the property, and their team professionally handled all open houses and interactions with the buyer on ",
      "ownerResponse": [
        {
          "text": "Erin, It has been an absolute pleasure working with you and Geoff! Jamie is an awesome photographer isn't she? We are so happy that we were able to help you guys accurately price, market and navigate the real estate market here in  More"
        }
      ]
    },
    {
      "author": "Diane B.",
      "rating": 5.0,
      "review": "Leo is affable, extremely knowledgeable, efficient, caring, considerate, full of integrity, energetic, persistent, and just plain a joy to work with! I was extremely pleased with the outcome of my sale. I would--and will--highly recommend ",
      "ownerResponse": [
        {
          "text": "Diane! Thank you so much for the kind words. It has been a pleasure getting to know you and working with you! Couldnt have done it without Christopher and your persistence to get this done."
        }
      ]
    },
    {
      "author": "Deborah Wu",
      "rating": 5.0,
      "review": "My husband and I are new homeowners and we've had the privilege of working with Leo throughout the entire process. Leo has been great. He has been patient with us and has not been pushy at all. He has been very considerate of our needs and ",
      "ownerResponse": [
        {
          "text": "Deb, Working with both you and Mark was not only easy (because you guys are awesome) but was fun. People like you guys are the reason I enjoy my job so much! Congratulations on the new home and most importantly I am glad that through the process we have become friends. Cheers to your new home!"
        }
      ]
    },
    {
      "author": "Rhonda Bolton",
      "rating": 5.0,
      "review": "Leo Cohen was great to work because he is honest, sincere, knowledgeable  and sincerely wants to find a home that fits your needs.  He worked with our family to find a place for us and patiently explored every neighborhood in Bellingham - ",
      "ownerResponse": [
        {
          "text": "Rhonda! It was most definitely was a journey but at the end of the day it led you to the ONE! Thank you for your patience and diligence to make this happen. It truly takes a village and I am honored that you chose us to make the move finally happen. Cheers many years in Bellingham!"
        }
      ]
    },
    {
      "author": "Robert Bortner",
      "rating": 5.0,
      "review": "Although we had a bit of a rough ride in the sale of our house due in part to market weirdness related to Covid, and part due to an inexperienced team from the buyers, Leo and his team stood with us all along the way. They provided ",
      "ownerResponse": [
        {
          "text": "Bob! Thank you for the kind words. I agree that this was a wild ride from start to finish but I appreciate your trust and patience in us to get this done either way. It's been great getting to know both you and Larry over the course of the  More"
        }
      ]
    },
    {
      "author": "Kelsey Klevenberg",
      "rating": 5.0,
      "review": "We purchased our 1st home through Leo and the Cohen Group NW. They were professional and super easy to work with. We were 1st time homebuyers, buyers coming from out of town, and during the pandemic. That could've been a recipe for ",
      "ownerResponse": [
        {
          "text": "KK! Thank you for the kind words man and for yours (and Monica's) patience throughout the adventure of today's wild market. I agree that there were some ups and some downs but we are all super excited to have you both in Bellingham. Most  More"
        }
      ]
    },
    {
      "author": "jessica rose",
      "rating": 5.0,
      "review": "Working with Christopher Lee and the Cohen group NW has been wonderful. They are detail oriented and timely with deadlines. Christopher Lee and the Cohen Group NW made sure to to keep us updated throughout the entire process of buying our ",
      "ownerResponse": [
        {
          "text": "Jessica, thank you so much for the kind words! I was so happy to find you and your partner the perfect home. I look forward to supporting you through the move and beyond!"
        }
      ]
    },
    {
      "author": "Edward Romero",
      "rating": 5.0,
      "review": "Leo is by far the best and most attentive Real Estate agent that I have ever had the pleasure to work with. He is personable, helpful, and extremely down to earth. He made the homebuying process as painless as possible and I'd recommend him to anyone buying real estate in the Pacific Northwest.",
      "ownerResponse": [
        {
          "text": "Daniel! Thank you for the kind words my friend. It's been great getting to know you and Ally throughout the adventure of buying your FIRST home! We are all so excited for your new chapter. Thank you for trusting us to guide you through the process!"
        }
      ]
    },
    {
      "author": "Tatiana Stone",
      "rating": 5.0,
      "review": "Working with the Cohen Group NW has been nothing short of a god send. It was our first time buying a house and Leo made the process so simple. He shared as much information as we asked for (which is hard to find!) yet kept the burdens of ",
      "ownerResponse": [
        {
          "text": "Tatiana, It was an absolute pleasure working with you, Lynn and Will! We all appreciate the kind words and are so happy that it was a smooth transition. You guys made our job fun and remind us as to why we got into the business! Congrats on your new home and WELCOME to Washington!"
        }
      ]
    },
    {
      "author": "Jordyn Kehle",
      "rating": 5.0,
      "review": "Leo and Chris were extremely calm and patient with us when buying a new home and selling our home all happened on, what felt like, a tight timeline. We appreciated their communication (using a variety of mediums) and always assuring us throughout the process. They are very professional!",
      "ownerResponse": [
        {
          "text": "Jordyn, Thank you very much for the kind words! It was great getting to know you and Kevin! I agree, the timelines were tight and it takes a village... including you! We couldn't have made this happen without you both. Cheers to you and your new chapter!"
        }
      ]
    },
    {
      "author": "Whatcom Dental Lab",
      "rating": 5.0,
      "review": "Cheers to the Cohen Group! Leo, Chris and Cooper did an amazing job leasing out our commercial unit. We previously had it listed with another agent for a lengthy period of time, once Leo took it over we had multiple showings and before we ",
      "ownerResponse": [
        {
          "text": "Nate and Mike, Thank you for your continued support and kind words! We are grateful to be in business with you"
        }
      ]
    },
    {
      "author": "Howard Jacobs",
      "rating": 5.0,
      "review": "We are grateful for the hard working and focused efforts of Leo, Chris and the team @ Cohen Group. They represented us as the sellers with a collaborative approach, creativity and expertise that allowed for a smooth sale of our property. I highly recommend Leo, Chris and the Cohen Group !",
      "ownerResponse": [
        {
          "text": "Howard, thank you so much for the kind words! We couldn't have asked for a better client to partner with on this sale and look forward to providing more great service in the future!"
        }
      ]
    },
    {
      "author": "Robert Riese",
      "rating": 5.0,
      "review": "Leo and his team are fantastic! We have contracted their services for buying and selling of homes. They are professional but authentic at the same time. Do yourself a favor and let Leo do the work for you.",
      "ownerResponse": []
    },
    {
      "author": "Rachel Finck",
      "rating": 5.0,
      "review": "Leo made the process of buying our first home feel far easier than we expected it could be. He is an excellent communicator who clearly answered our questions, listened to our preferences, and kept us informed at every stage.",
      "ownerResponse": []
    },
    {
      "author": "B Pearl",
      "rating": 5.0,
      "review": "Mike and Leo were amazing! When i listed my house i was working with a different realtor. My house was on the market for a year and still not sold. Thats when i decided to go with mike and Leo. They took new (better) pictures and revamped ",
      "ownerResponse": [
        {
          "text": "Thank you so much for the kind review! it was a pleasure working for you and Clint, you are 5 star clients and I hope we have the chance to do business with you again!  More"
        }
      ]
    },
    {
      "author": "Alec Burke",
      "rating": 5.0,
      "review": "Well its been a few months since closing on my adorable new home and I can safely say that buying my first house in the middle of the pandemic home-buying crush was a uniquely intense experience Luckily I found Chris! I was connected with ",
      "ownerResponse": []
    },
    {
      "author": "Alex Mynatt",
      "rating": 5.0,
      "review": "Max Burrage and his team were wonderful to work with and made what is normally a stressful process much more manageable and enjoyable. I worked with him for both transactions, purchasing my new home and selling my old one. I would strongly recommend using Max as your realtor!",
      "ownerResponse": []
    },
    {
      "author": "Stephen Winters",
      "rating": 5.0,
      "review": "Leo, Chris and Tiffany are a professional team that made the sale of our house in Burlington and the purchase of a buildable lot in Semiahmoo as smooth as possible.   They communicated clearly and responded to our requests for information ",
      "ownerResponse": [
        {
          "text": "Steve! It has been such a pleasure getting to know you and Becky throughout the last 4 months. Thank you for being awesome to work with! We are all so happy that you have found your place at Sea Smoke and are able to downsize (no more  More"
        }
      ]
    },
    {
      "author": "Paul Cohen",
      "rating": 5.0,
      "review": "Leo patiently stayed with me as I changed my mind over the course of the year looking for investment property.  He is quite responsive and inventive trying connecting the Bellingham real estate market and my expectations! Generally, buying a house isn't a lot of fun but Leo made it  go smoothly.  I highly recommend him!",
      "ownerResponse": [
        {
          "text": "Paul! Thank you so much for the kind words. Im glad buying a home was fun for you. I know it wasnt always easy but you guys were great to work with. Im so happy we found the right investment that fit your needs!"
        }
      ]
    },
    {
      "author": "Grace Stauffer",
      "rating": 5.0,
      "review": "The Cohen Group made our out of state purchase of a Bellingham home smooth and painless.  Our realtor Layla Pollack was perfect - informative about everything in buying a home in this area, and also patient and an excellent communicator - I ",
      "ownerResponse": [
        {
          "text": "Grace, your family was an absolute pleasure to work with, and it has been an honor to help you. Please know that our relationship doesn't end after your home buying experience. I am still here for you!  - Layla"
        }
      ]
    },
    {
      "author": "Peter Allen",
      "rating": 5.0,
      "review": "Leo is first and foremost a caring individual. Our conversations were as much about how he values his marriage, his friends and those he works with and for... as the property we might have been working together on. That is not to say Leo is ",
      "ownerResponse": [
        {
          "text": "Peter, thank you so much for the kind words. I know this was one of the most complex deals but I am so glad that we all found a way to make it work! You and Michelle were an absolute pleasure to work with."
        }
      ]
    },
    {
      "author": "Jeremy",
      "rating": 5.0,
      "review": "Leo and his team are simply the best you can find. The amount of comfort and knowledge they gave us throughout homebuying process can't be beat. I would and will recommend Leo and his team to anyone.",
      "ownerResponse": [
        {
          "text": "Jeremy! Thank you for the kind words my friend. We had a blast working with you and Stacy. Excited to see what you guys do to your FIRST HOME! Congrats again!"
        }
      ]
    },
    {
      "author": "Kate Fadden",
      "rating": 5.0,
      "review": "Leo and his team were wonderful to work with! My clients and I received great communication from start to finish and we were able to provide a smooth transaction for all parties. I look forward to doing business with the Cohen Group again!",
      "ownerResponse": [
        {
          "text": "Kate! Thank you for the kind words. It was a pleasure to work with you as well. We all look forward to working with you again."
        }
      ]
    },
    {
      "author": "Terri Allen",
      "rating": 5.0,
      "review": "Chris made our dreams of unlikely homeownership a reality.  We were in a unique position to buy the home we were currently renting.  This was our first experience as homebuyers and Chris held our hand the entire time.  I dont think Ive ",
      "ownerResponse": [
        {
          "text": "Terri, thank you for these wonderfully kind words. I'm so happy to have met you and had the pleasure of working together. Jessica definitely knows how to match make!"
        }
      ]
    },
    {
      "author": "Symone Maruyama",
      "rating": 5.0,
      "review": "Leo and his team were easy to work, helpful and made the process very easy in buying our first house. so happy we ended up working with the Cohen Group!",
      "ownerResponse": [
        {
          "text": "Symone! It was a pleasure working with both you and Reo. We are so glad that we were able to find your first home so quickly. We are all so happy for you both on taking a step in the direction of homeownership :)"
        }
      ]
    },
    {
      "author": "Olivia Lord",
      "rating": 5.0,
      "review": "Leo and Chris were awesome to work with on our first home. Every thing was speedy, efficient, and this team was extremely knowledgeable about things while maintaining a professional yet laid back attitudes. If we are ever in the market to buy or sell, we will definitely make a call their way. Thank you again!",
      "ownerResponse": [
        {
          "text": "Olivia, It was a pleasure to work with both you and Darren! We appreciate the kind words! Congrats on your first home :)"
        }
      ]
    },
    {
      "author": "Rita John",
      "rating": 5.0,
      "review": "Christopher Lee represented us when we bought a house in May 2021.  Christopher is professional, responsive, thorough, and has a great attitude.  He provided additional data to help ease our concerns with costs, and he has infectious optimism.  We have purchased many homes over 30 years and Christopher Lee is our favorite relator!",
      "ownerResponse": [
        {
          "text": "Rita and Brian, thank you so very much for these kind words. I'm so grateful to have met you both and had the chance to work together. Cheers to years of happiness in Semiahmoo!"
        }
      ]
    },
    {
      "author": "Sierra Beard",
      "rating": 5.0,
      "review": "Best real estate agent ever!! Super friendly and easy to work with. He got us everything we wanted in a home and was super patient with our requests! If anyone is looking for a home I would 100% suggest Leo Cohen as your agent.",
      "ownerResponse": [
        {
          "text": "Sierra! Thank you for the kind words. We are are honored that you and Josh chose us to help you buy your first home! I know it wasn't always the easiest journey but we are so happy for you both. Onward and upwards!"
        }
      ]
    },
    {
      "author": "Stefanie Hindmarch",
      "rating": 5.0,
      "review": "We had a fantastic experience working with Max Burrage on the purchase of our first home! Max and his team were communicative and super easy to work with. We would definitely work with them again in the future.",
      "ownerResponse": []
    },
    {
      "author": "Levi Evans",
      "rating": 5.0,
      "review": "Leo and Chris are a great team! They were able to sell me house in WA in 3 days while I currently live in Indiana. You can expect honest and fast communication with Leo",
      "ownerResponse": [
        {
          "text": "Levi, Great to meet you and we are all so happy that your home sold so quickly! Again, thank you for your kind words and we look forward to staying in touch."
        }
      ]
    },
    {
      "author": "travisandrebecca fox",
      "rating": 5.0,
      "review": "It was a great pleasure working with the Cohen Group. Top notch communication. So many Realtors forget we all have the same goal no matter which side we represent, and that is to sell the house. It was a collaborative effort with this one, and I wish all Realtors had your mindset. Keep up the good work and we'll see you on the next one.",
      "ownerResponse": [
        {
          "text": "Travis, Thank you again for another smooth experience. I couldn't agree with you more. I really appreciate your mindset and collaboration to make this work. We are most definitely on the same page. Thank you for doing a great job for your clients and we look forward to working with you again!"
        }
      ]
    },
    {
      "author": "Lauren Pena",
      "rating": 5.0,
      "review": "Leo, Chris and Mike did an amazing job on the sale of my condo. It sold in a week over asking price! I couldn't be more thrilled with the service that was provided (Photography, Open Houses, Time lines and Communication). I plan on using them for any of my upcoming real estate needs and referring them to friends and family.",
      "ownerResponse": [
        {
          "text": "Lauren, thank you for the kind words and we are all so glad we were able to help you guys get your condo sold and on to the next phase of life! We are all happy it went so smoothly and are honored that you chose our team to help you do so!"
        }
      ]
    },
    {
      "author": "Tamara Lyn Robbins",
      "rating": 5.0,
      "review": "Working with Leo and the entire Cohen Group NW was fabulous! They are meticulous, professional, and on top of everything that needs to be done! We were kept in the loop with all communication and we knew they had everything under control! And as an added bonus....they are super fun to work with!!!!",
      "ownerResponse": [
        {
          "text": "Tamara! Thank you for the kind words :) As much as we are bummed to see you and Dirk leave down south, we are so happy for you in finding your next home! Thank you for your trust in our team to get the job done. Em and I will miss you both!"
        }
      ]
    },
    {
      "author": "Tom Dietrich",
      "rating": 5.0,
      "review": "We worked with Jess Davis as an agent, and she's amazing. Jess was very communicative and responded to any questions very fast. She is extremely knowledgeable about the Bellingham area and real estate there. She also has a ton of inside ",
      "ownerResponse": []
    },
    {
      "author": "Dylan Langei",
      "rating": 5.0,
      "review": "Buy or sell, Leo is the guy. Not only does he have his thumb on the pulse of the market, but he puts you at ease with his stellar communication and friendly personality. If you want to buy or sell your next home and receive top notch service, call Leo.",
      "ownerResponse": [
        {
          "text": "Dylan, thank you for your kind words and trust in us!"
        }
      ]
    },
    {
      "author": "Jensen Lowell",
      "rating": 5.0,
      "review": "Leo and his team are the best choice in the business. They have strong knowledge of the market, take a hands on approach to selling property, and invested all the time needed for our deal to be successful.",
      "ownerResponse": []
    },
    {
      "author": "Christo Bolger",
      "rating": 5.0,
      "review": "Leo and his team are top notch. Very knowledgeable about the area and puts in the effort to find you a home. He's the type of person that I'd feel 110% comfortable referring my mom to which is feel like is saying a lot about someone. I'd highly recommend him.",
      "ownerResponse": [
        {
          "text": "Christo, Thank you for the kind words! Doing business with you has been a pleasure!"
        }
      ]
    },
    {
      "author": "Sarah Sisk",
      "rating": 5.0,
      "review": "I highly recommend Cohen Group NW in Bellingham. They recently helped me buy a home in the neighborhood I chose and for the right price. Their communication was awesome and everyone on the team very friendly, helpful and knowledgeable. They ",
      "ownerResponse": [
        {
          "text": "Sarah, It was so great to meet both you and Laura through your purchase of a home up here in Bellingham! I know it was definitely a challenge buying sight unseen but we are grateful that we were able to help keep things simple and smooth. Congrats on yours/Laura's purchase!"
        }
      ]
    },
    {
      "author": "C. Monster",
      "rating": 5.0,
      "review": "Leo and his team are amazing to work with. Their knowledge of local real estate and their professionalism make them my go to for all things real estate in Bellingham. Add to that they are fun to be around!",
      "ownerResponse": [
        {
          "text": "Gary! Thank you for the kind words and thank you for contributing so much locally from both Click Monster and 122 West!"
        }
      ]
    },
    {
      "author": "Adam Morvee",
      "rating": 5.0,
      "review": "Leo is an enthusiastic Real Estate professional, who has his clients best interests in mind. I would recommend using Leo to sell or buy your next home.",
      "ownerResponse": [
        {
          "text": "Adam, Thank you! Your recommendation is much appreciated. You have been great to work with!"
        }
      ]
    },
    {
      "author": "Paul Cohen",
      "rating": 5.0,
      "review": "I am retiring soon and Leo has been very resourceful, attentive, and explains well the process of purchasing my first investment property. He understands my situation, knows the region, and has a lot of contacts.",
      "ownerResponse": [
        {
          "text": "Paul, It has been a pleasure working with you!"
        }
      ]
    },
    {
      "author": "Steve Mullenix",
      "rating": 5.0,
      "review": "Big shout out to Leo Cohen and Chris Lee at Cohen Group NW! This team is professional, punctual, and personable. I recommend them to anyone and hope we can close more deals together. Steve Mullenix, owner/broker at Peace Arch Real Estate in Blaine, WA.",
      "ownerResponse": [
        {
          "text": "Steve, it was an absolute pleasure to work with both you and Julia! It always makes it easier for our clients when there are other great agents on the other end."
        }
      ]
    },
    {
      "author": "Andy Brandt",
      "rating": 5.0,
      "review": "Leo did a fantastic job taking care of me when I was shopping for a new home this summer. Very hands on and proactive. I wouldn't hesitate to recommend him to anyone looking in the area!",
      "ownerResponse": [
        {
          "text": "Andy, thank you for the kind words. I know our situation wasnt the easiest road but Im so glad we found an off market home for you and everything ended up working out."
        }
      ]
    },
    {
      "author": "J. Dobson",
      "rating": 5.0,
      "review": "Leo was easy to work with and very responsive to our needs.  He works hard to make the experience of buying a house as painless as possible.",
      "ownerResponse": [
        {
          "text": "Jennifer! Thank you for the kind words. It was a pleasure working with you both to find the right investment property"
        }
      ]
    },
    {
      "author": "Alicia Shropshire",
      "rating": 5.0,
      "review": "Leo is an absolute pleasure to work with. He is reliable, knowledgeable and personable. He truly cared about his clients and will go above and beyond to meet your needs!",
      "ownerResponse": [
        {
          "text": "Alicia, Thank you for the kind words! We are happy that we have been able to help you with your real estate adventure and are excited for what the future holds for you!"
        }
      ]
    },
    {
      "author": "Jim Burrage",
      "rating": 5.0,
      "review": "Max Burrage and the Cohen group sold our home for us in Puyallup and did an excellent job. More money, less hassle and a great smooth transaction",
      "ownerResponse": []
    },
    {
      "author": "Viry Bugarini",
      "rating": 5.0,
      "review": "What a smooth process to buy your house! From day one, Leo understood what we were searching for, and we did! I recommend him at a heartbeat to all my family, friends, and everyone!",
      "ownerResponse": [
        {
          "text": "Viry, It was an absolute pleasure working with you, Matt and Kathy! We are all very excited for your new adventure and to see what you guys end up doing with the extra shop space!"
        }
      ]
    },
    {
      "author": "Shawn VanLeeuwen",
      "rating": 5.0,
      "review": "Im an electrical contractor who deals a lot with realtors.  These people are the best to work for when the times come for our services.  They coordinate everything and are very organized and punctual.  All their clients seem to be very ",
      "ownerResponse": [
        {
          "text": "Shawn! Thank you so much for your support and providing such a high level of service to our clients."
        }
      ]
    },
    {
      "author": "Banipal Benjamin",
      "rating": 5.0,
      "review": "Leo Cohen and his team made our purchase transaction very easy and smooth.  We are looking forward to work with Cohen team as we are planning to relocate in Bellingham Washington near future.",
      "ownerResponse": [
        {
          "text": "Ben, it was our pleasure! Thank you for choosing our team. We look forward to continuing to help you and your family in the future!"
        }
      ]
    },
    {
      "author": "Jordan Levien",
      "rating": 5.0,
      "review": "Layla and the team went above and beyond for me. Our home sold for well over asking in just 4 days! They worked hard to minimize the inconvenience of showings and were in constant communication through the whole process. I highly recommend them!",
      "ownerResponse": []
    },
    {
      "author": "Melissa Walpole",
      "rating": 5.0,
      "review": "Leo and crew helped us find the perfect home! The whole process was smooth and fast! Much faster than I expected! This was due largely to Leo's expertise and attention! I highly recommend using Leo!",
      "ownerResponse": [
        {
          "text": "Melissa, thank you for the kind words. We had a blast working with you and Charles and are so glad you guys are able to move from all of the traffic in seattle to your wooded paradise in Bellingham!"
        }
      ]
    },
    {
      "author": "Kristy Kuehfuss",
      "rating": 5.0,
      "review": "Leo and his team were excellent to work with from start to finish! We would recommend Leo without hesitation to our closest friends and family.",
      "ownerResponse": [
        {
          "text": "Kristy! It was an absolute pleasure getting to know you and Jesse throughout this adventure making the move out to the west coast! We are so glad that you are finally able to move and happy with the service. We wish you nothing but happiness in your new home!"
        }
      ]
    },
    {
      "author": "joshuaeg88",
      "rating": 5.0,
      "review": "I highly suggest using Leo as your realtor. He is super knowledgable, patient and very easy to talk to. I would absolutely use Leo again. Thanks for helping us find a home.",
      "ownerResponse": [
        {
          "text": "Josh! We are so glad that we were able to find you and Sierra the right home. Thank you for trusting in us to do so. Congrats on buying your first home my friend!"
        }
      ]
    },
    {
      "author": "Briddick Webb",
      "rating": 5.0,
      "review": "Leo is a rockstar real estate agent. Great negotiator, hard worker and nice guy. Cant say enough good things about Leo",
      "ownerResponse": [
        {
          "text": "Briddick! Always a pleasure doing business with you and I am glad to be in business with you as well!"
        }
      ]
    },
    {
      "author": "Laura Randall",
      "rating": 5.0,
      "review": "We got the privilege to get to know Emelie a bit.  She was kind and considerate and so very patient even when we brought kiddos with us.  She listened to our wants and needs and found homes that fit our description.  Truly a delight!",
      "ownerResponse": [
        {
          "text": "Thank you, Laura! It was such a pleasure getting to know you and your family. I appreciate the time you spent with me and the time you took to write this review. I look forward to seeing you out on the trails around town! - Emelie"
        }
      ]
    },
    {
      "author": "Coralee Lack",
      "rating": 5.0,
      "review": "Emelie and Chris went above and beyond!  Our home buying process was as quick and painless as possible.  They were both always available to answer our questions and solve problems.  Highly recommend!",
      "ownerResponse": [
        {
          "text": "Coralee, thank you for your 5 star review! It was a pleasure working with you and Richard finding that right home with the perfect garage! We look forward to seeing the yard and home improvements in the months to come, please don't hesitate to reach out for vendor recommendations or questions moving forward. - Emelie & the entire CGNW"
        }
      ]
    },
    {
      "author": "Rebecca Sadwick Shaddix",
      "rating": 5.0,
      "review": "We purchased a home listed by this group and were blown away by their professionalism, honesty, and communication skills. 10/10 would recommend working with them to buy or sell.",
      "ownerResponse": [
        {
          "text": "Rebecca! You made our day (especially Layla's!) when you posted this. We're so glad to hear that Layla's work on the listing side made your buying experience a smoother process. Thanks for your vote of confidence!"
        }
      ]
    },
    {
      "author": "PNW RiotGirl",
      "rating": 5.0,
      "review": "Best realtor in Whatcom and Skagit. Oh hell, THE ENTIRE WORLD! Leo will do whatever he has to do to make sure you feel like #1. Highly recommend!",
      "ownerResponse": [
        {
          "text": "Chrystina! Thank you for my friend. I am so happy that we were able to get you a home and with 0 down!!"
        }
      ]
    },
    {
      "author": "Dustin Michaelis",
      "rating": 5.0,
      "review": "Cohen Group had great communication and are always willing to go above and beyond to take care of their clients. Highly recommend these amazing people.",
      "ownerResponse": [
        {
          "text": "Thank you for the kind words my friend! We very much enjoyed working with you and getting to know you better in the process! Cheers to a new chapter in your life and we are excited to celebrate at your housewarming party!"
        }
      ]
    },
    {
      "author": "Ken Craig",
      "rating": 5.0,
      "review": "Layla, Margaret, and the entire team have been great to work with, and made buying our first home a great experience.",
      "ownerResponse": []
    },
    {
      "author": "molly brewer",
      "rating": 5.0,
      "review": "Outstanding service from start to finish. Would use them again in a heartbeat...professional, knowledgeable, and hardworking. And they have continued to help me long after the closing!",
      "ownerResponse": [
        {
          "text": "Molly, thank you so much for the wonderful review! We all have loved working for you and getting to know you over the past year. Looking forward to meeting your horses when you make the final move! - Emelie  More"
        }
      ]
    },
    {
      "author": "Jesse Nelson",
      "rating": 5.0,
      "review": "This group of awesome people donate a portion of every house sale to help people in need of clean drinking water in developing companies. That is rad!",
      "ownerResponse": [
        {
          "text": "Jesse! Being in partnership with you not only as a local collaborative business but more importantly to continue the mission of bringing clean water to the world has been an absolute pleasure. We look forward to the future and continuing to grow together!"
        }
      ]
    },
    {
      "author": "Darren Richardson (Muphynz)",
      "rating": 5.0,
      "review": "Absolutely fantastic. Leo and Chris were on the ball and answered every question I had at any time . Day or night.",
      "ownerResponse": [
        {
          "text": "Darren, we definitely pride ourselves in being on the ball and being responsive! So happy for you and Olivia on closing on your first home! This is just the beginning my friend. Cheers to being a homeowner!"
        }
      ]
    },
    {
      "author": "A",
      "rating": 5.0,
      "review": "Did a fantastic job, can't recommend them enough.",
      "ownerResponse": [
        {
          "text": "Allyn, It was a pleasure working with you! Multiple offers in 3 days :) Thank you for being a great business partner and we are excited for you future. Cheers!"
        }
      ]
    },
    {
      "author": "Amy Powless",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Amy! Thank you for the review. We appreciate you!"
        }
      ]
    },
    {
      "author": "Kayla Russ",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 104,
  "adjusted_review_average": 5.0,
  "summary": "# Balanced Article on Cohen Group NW - Muljat Group\n\nIn this article, we will take a closer look at the Cohen Group NW - Muljat Group based on user reviews. Our goal is to provide a balanced and fair overview of the company's performance as a property management company.\n\n## The Good\n\nMany user reviews laud the Cohen Group NW - Muljat Group for their exceptional service, particularly noting their professionalism and ability to deliver results swiftly. Users mention homes being sold within just one week and many customers were happy with purchases and sales being handled smoothly and efficiently. For first-time homebuyers, the Cohen Group is often hailed as a guiding hand throughout their entire home purchasing journey. From the company’s responsiveness to its detailed guidance, users feel supported and valued.\n\nClients have expressed sincere appreciation for the team's willingness to go above and beyond their expectations. Recent reviews talk about the high level of commitment, communication skills, and the personal, yet professional, touch the team composes when handling real estate transactions. The team's expert execution of sales and purchases during trying times such as the COVID-19 pandemic has not gone unnoticed, with buyers and sellers feeling reassured by the company's proactive approach.\n\n## The Great\n\nContinuing with positive sentiments, many reviewers echo statements of the Cohen Group NW being a dream team. The team's communication, especially, receives praises, with users stating that no question was too small and they felt well-informed throughout the process. Moreover, the company has repeatedly helped clients navigate the competitive housing market, securing dream homes against all odds.\n\nThe approachability and availability of the Cohen Group NW staff also make a big impact on clients. Whether by phone, text, or email, users state that team members, including Leo Cohen, were quick to answer questions and provide advice, demonstrating a clear investment in their clients' satisfaction. This drive to connect with clients on a personal level transitions into genuine long-term relationships, a service that can't be quantified.\n\n## The Bad\n\nDespite the overall positivity in user reviews, no company can be perfect. For the purpose of creating a balanced article, an exploration into the less favorable aspects is necessary. However, among the wealth of reviews provided, none included any explicitly negative experiences with the Cohen Group NW - Muljat Group. Without any substantial material to draw from, we cannot conclusively detail specific instances of dissatisfaction or areas of improvement that customers might have encountered.\n\nIn such scenarios, it's essential to consider that not all reviews may be submitted online, and some clients may choose to share their concerns directly with the company rather than through public forums.\n\n## The Ugly\n\nThis section typically covers the more severe issues or complaints that customers may have experienced, but in this case, there does not appear to be any glaring problems brought up by users. Such a lack of \"ugly\" feedback suggests that the Cohen Group NW - Muljat Group has been successful in maintaining a very positive reputation among its clients.\n\nIt should be noted, however, that the absence of negative comments in the data provided doesn't necessarily mean that every single experience with the company has been flawless. As with any service industry, there is a range of customer interactions. It is possible that some negative experiences have simply not been publicly shared or have been resolved privately between the company and the client.\n\n## Conclusion\n\nCohen Group NW - Muljat Group seems to have built a strong and positive reputation based on the user reviews analyzed in this article. The company has demonstrated significant strengths such as excellent customer service, responsiveness, effective communication, and a genuine passion for helping clients navigate the real estate market. Although the absence of negative reviews limits our capacity for a fully balanced outlook, the overwhelming positivity shared by clients is a testament to the company's dedication to excellence.\n\nThese reviews are generated by ChatGPT and are only intended to be a tool to help you find a property management company or rental property. Always complement this article's findings with your own research to ensure the best decision for your needs."
}