{
  "name": "Fairhaven Park Apartments",
  "avg_rating": 1.8,
  "review_count": 5,
  "adjusted_review_count": 5,
  "reviews": [
    {
      "author": "Britney B.",
      "rating": 5.0,
      "review": "Loved living at these apartments. Always super nice and friendly at the front. Lived here for 2 years and never had a problem. They allowed us to have our dog in the newly renovated apartment. Location is great - the Interurban trail goes right through the complex. Has a dog park, nice pool and gym, sauna! Everything you could want. Only thing missing, laundry was not in unit but you get used to it (or pay more money to have an in unit washer/dryer). Maintenance was always quick. Would definitely live here again if I had a need for an apartment.",
      "ownerResponse": []
    },
    {
      "author": "Lauren D.",
      "rating": 1.0,
      "review": "This is the worst place I've ever rented from. They gave me 10 incorrect copies of my lease with move in costs ranging from $1300-$2700. \n\nThey told me I was renting a 2 bedroom sight unseen unit for the first 3 weeks and then a week before I was supposed to move in they told me \"whoops, it's actually a 1 bedroom\" which they were about to charge me a 2 bedroom price for. This error caused me to spend more money and I ended up having to move my office and my apartment in the same weekend because it pushed out my move in date one full week.\n\nThey lost my paperwork and application in the portal and put the lease under my ex husbands name instead of mine. Why? I have now been waiting for my deposit check to be returned to me which is 3 weeks late and I have been told 3 times it is in the mail (all different dates). I am still waiting. Don't rent from them if you have other options available!",
      "ownerResponse": []
    },
    {
      "author": "NotHappy 1.",
      "rating": 1.0,
      "review": "I moved here because I liked the location and I could not find a cheaper rental in the area. I never planned on staying for long but they raise the rent every year making it impossible for me to save money and now I am paying as much for my apartment as I would for a nice home. Whenever neighbors move out and new flooring is installed in my neighboring apartments I am suffocated and probably harmed by the toxic floor glue fumes and off gassing that persists for weeks. I am using albuterol at higher doses than my doctor recommended just to sleep through the night. It is the worst in the bathroom where the fumes likely come through the ceiling fan vent. The first time it happened I taped plastic over the bathroom fan and left all my windows cracked open so I could breath. The second time it happened, I explained the situation and I asked a maintenance guy if he would please leave the windows open and tape plastic over the bathroom fan in the apartment where they were installing the flooring. He said \"I'm not going to do that.\" Besides that, I have been woken up many times by maintenance work right on the other side of the wall and it seems there is always a reason they need to disturb residents. Chainsaw work, hammering, hammer drill right outside my bedroom, leaf blowers, etc. I work from home and originally thought this seemed like a quiet out of the way place to get work done but it is not quiet. On top of that there is black mold in the walls and ceiling the grows through several times a year and all maintenance dose is add another layer of paint over the mold which is not a solution. I had read other reviews about mold so I asked specifically about that when I was considering renting here and was assured by the office staff and maintenance guy that there had never been mold in my apartment but I could not inspect it myself prior to signing a lease. When I got the keys I was very upset to discover all of the areas of fresh paint in the corners of the bedrooms that I guessed were covering up mold. As soon as the fall rain arrived the mold grew out through those spots and maintenance swore that was the first time it had grown there. Liars. I have other grievances but that's enough of a rant. Don't rent here",
      "ownerResponse": []
    },
    {
      "author": "A C.",
      "rating": 1.0,
      "review": "Like other reviewers have stated, GET EVERYTHING IN DETAILED WRITING. We paid a deposit for what we were told was a 2-bedroom apartment about six weeks in advance. First, we were given the wrong apartment number. After that was straightened out, the managers were super insistent on not letting us see the apartment before signing the lease. It didn't seem right so we held off on signing the lease early. Two weeks before our move-in date, we found out it was only a 1-bedroom apartment even though our lease had the price of a 2-bedroom apartment listed. I don't know that management had any intention of voluntarily telling us it was a 1-bedroom before the day we moved in because I had to prod them for the information after I spoke to one of the neighbors who told me it was a 1-bedroom. Lucky for us, the apartment wasn't ready by our expected move-in date so the RCW states we get our money back. We ended up using Windermere Property Management and found a MUCH better place that we're super happy with. I'm a newbie to the area and if you have the time to look around, there are better apartments in Bellingham and the surrounding areas for about the same price (or less!) that INCLUDE washer/dryers and mircowaves in their units. \nIt's now been three weeks and we still haven't seen the return of our deposit. Calls and emails to Suhrco (the property management company) go unanswered. I'll update the review if this lands in small claims court.",
      "ownerResponse": []
    },
    {
      "author": "Kelsey M.",
      "rating": 1.0,
      "review": "If I could give this NO STARS I would. My husband was a property manager back in his day, so we have lived in MANY places and this is BY FAR THE WORST. I have story after story of not just my own experience but friends' stories also. The management of this property is unprofessional, unreliable, and offers terrible customer service. They have their own \"interpretations\" of the lease after it's signed. Meghan is a co-manager of this property- DON'T TRUST ANYTHING SHE SAYS. Do not live here. It's a great location, but IT'S NOT WORTH IT. You will get screwed in the end.",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "1900 18th St Bellingham, WA 98225",
  "adjusted_avg_rating": 1.8,
  "summary": "# Balanced Review of Fairhaven Park Apartments\n\nThe reviews we are about to delve into are generated by ChatGPT and reflect the sentiments and experiences of individuals who have interacted with Fairhaven Park Apartments. This article is designed as a balanced overview to assist those looking for insights into this apartment complex. Remember, these reviews are a product of user experiences and do not necessarily represent the absolute qualities of the services offered by Fairhaven Park Apartments.\n\n## The Good\n\nThe apartment complex shines bright in some aspects, according to a portion of user reviews. One resident expressed high satisfaction, noting that the staff at the front desk were consistently friendly and helpful throughout their 2-year tenure. They praised the pet-friendly environment and modern amenities, such as a pool, gym, and sauna, which enhanced their living experience. This resident also underlined the convenience of the location, with access to the Interurban trail and a dog park, although they mentioned the absence of in-unit laundry as a minor inconvenience that one could adjust to.\n\nMoreover, the maintenance team at Fairhaven Park Apartments received compliments for their prompt service. Quick responses to issues add a layer of comfort and trust for residents, making them feel taken care of. Having an efficient service team is critical in property management, and here, Fairhaven Park Apartments seemed to meet and possibly exceed expectations in ensuring the well-being and contentment of their tenants.\n\n## The Great\n\nDespite the overall low average rating, it's crucial to note that there were residents who had a great experience at Fairhaven Park Apartments. Some tenants found the combination of renovated apartments that allowed pets and valuable recreational facilities a significant advantage, creating a comfortable and fulfilling residential experience. The existence of a dog park, nicely maintained pool, and fitness amenities are examples that the apartment complex may offer a vibrant community lifestyle catering to the needs of residents.\n\nAdditionally, the strategic location was a highlight for some, with easy trail access for those who enjoy outdoor activities and desire a blend of urban and natural environments. For residents who value these features, the apartment complex offered a well-rounded living experience that went beyond just the basic shelter and addressed a wider range of lifestyle preferences.\n\n## The Bad\n\nUnfortunately, several user reviews outline a series of issues with Fairhaven Park Apartments. There were complaints about the leasing process, wherein incorrect lease copies with dramatically varying move-in costs caused significant stress to incoming tenants. One reviewer detailed an incident where they were initially promised a 2-bedroom apartment, only to be informed later it was a 1-bedroom and nearly charged the higher price. Such discrepancies signal concerning administrative errors and lack of attention to detail.\n\nFurthermore, incidents of paperwork and application materials going missing, along with delays and miscommunication regarding security deposit returns, paint a picture of a potentially disorganized management system. The issues with documentation and financial transactions appear to be a repetitive theme that has impacted the trust and satisfaction of several tenants, leading them to advise others to secure everything in detailed writing to avoid similar pitfalls.\n\n## The Ugly\n\nThe uglier aspects of Fairhaven Park Apartments reveal more severe concerns that go beyond administrative challenges. Residents have reported unacceptable living conditions, such as persistent toxic fumes from new flooring installations, which have negatively affected their health. One tenant resorted to using an increased dose of medication due to the fumes, a significant red flag regarding apartment maintenance and the well-being of residents. The same individual also cited the presence of black mold, which was allegedly just painted over instead of being properly remediated.\n\nNoise disturbances, with frequent maintenance work that disrupts peace and quiet, also surfaced in user reviews. These disruptions, alongside the more critical issues of ignored maintenance requests, have understandably led to profound dissatisfaction among some residents. It's important to note, however, that while these reviews highlight some extreme cases, they do reflect the experiences of real tenants, suggesting areas where Fairhaven Park Apartments could significantly improve.\n\nIn conclusion, this article aims to present a balanced view of Fairhaven Park Apartments by summarizing user reviews. Though there are a few accounts of positive experiences, several serious issues have been raised that suggest a potential need for improvement in property management practices. Prospective tenants are advised to consider these reviews in the context of their own needs and preferences when making a housing decision."
}