{
  "name": "Integra Condominium Association Management, Inc.",
  "address": "",
  "company_type": "Property management company",
  "review_count": 34,
  "reviews": [
    {
      "author": "Jennifer Craig",
      "rating": 5.0,
      "review": "I have been a tenant under Integra for over a year and a half now, they have been seamless to work with, respond promptly if I need maintainence, always keep me in the loop on anything happening in my building. After dealing with other ",
      "ownerResponse": [
        {
          "text": "Thank you for the kind words!!"
        }
      ]
    },
    {
      "author": "Michele M.",
      "rating": 5.0,
      "review": "Our 55+ community in Bellingham had two previous property management companies before Integra. Our HOA Board was very dissatisfied with those two previous companies; and very satisfied with Integra. As an owner, I have been impressed by ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words."
        }
      ]
    },
    {
      "author": "NJ GP",
      "rating": 5.0,
      "review": "I have had very good experiences with the Integra office over 3+ years .Have called 3-4 times about issues which were handled effectively, promptly and well. The latest rate of response was-same day-impressive. ",
      "ownerResponse": []
    },
    {
      "author": "OnTheRoadAgain",
      "rating": 1.0,
      "review": "Yes, yes, yes! Sadie Sullivan, the absolute most unprofessional of the bunch. No clue how to speak to homeowners. Thank you so much to all of the other reviewers who are posting about their negative experiences with this company. I am ",
      "ownerResponse": []
    },
    {
      "author": "Mareyoko Butler",
      "rating": 1.0,
      "review": "I rented a condo in birch bay through Integra years ago and had the WORST experience I have EVER had with any kind of business of that kind. I always look back on it and laugh at the irony of their name. From my experience they are ",
      "ownerResponse": []
    },
    {
      "author": "Kat DeVaney",
      "rating": 1.0,
      "review": "We have had multiple interactions with Integra in which they have lost keys, blamed us for it, yelled at us and then told US that we were unprofessional, incorrectly identified who the owners of the property were, and generally have been ",
      "ownerResponse": [
        {
          "text": "It is unfortunate that you lost your keys.  As we tried to explain, we have never had keys to your unit as it was on the master system and we had no need of them.  A key for you was located with the Board of Directors, of which you were  More"
        }
      ]
    },
    {
      "author": "Dee Brown",
      "rating": 1.0,
      "review": "Awful company. I couldn't agree more with the previous reviewers.\n\nI deal with Integra as a tenant. They have threatened to evict me and have also ",
      "ownerResponse": []
    },
    {
      "author": "Joann Childs",
      "rating": 5.0,
      "review": "Efficient process ascertaining knowledge regarding my dues.",
      "ownerResponse": [
        {
          "text": "Thank you.  We are always happy to assist anyway we can."
        }
      ]
    },
    {
      "author": "Ed DeVaney",
      "rating": 1.0,
      "review": "In response to Integra's response to Kat DeVaney:\nYour response is simply false. It is plain you have no problem being dishonest with your customers. At your company's request, to accommodate fire inspections ",
      "ownerResponse": []
    },
    {
      "author": "Pres Play",
      "rating": 5.0,
      "review": "I'll preface by saying, based on my recent encounter with Integra I was quite shocked to see all the negative reviews. I can only presume that my positive experience with Integra is perhaps a result of that feedback and reflection on how a ",
      "ownerResponse": []
    },
    {
      "author": "Ms Down to earth",
      "rating": 1.0,
      "review": "I talked with Tess on the phone because I am in the process of buying a condo under her management. She was rude and seemed to resent answering my questions. Finally she told me she gets paid for answering questions. My mortgage broker ",
      "ownerResponse": []
    },
    {
      "author": "Erin Smith",
      "rating": 1.0,
      "review": "I couldn't agree more with the other reviews!  This company has the absolute worst customer service I have ever experienced.  They don't seem to understand who the customer is and how they get paid.  They are horribly rude on the phone when ",
      "ownerResponse": []
    },
    {
      "author": "Jesfer Mikesell",
      "rating": 1.0,
      "review": "worst experience renting through them... dealt with numerous package thefts and car break ins. Never respond or do anything about these types of incidents.",
      "ownerResponse": [
        {
          "text": "We would be happy to assist you, however you are not listed as a resident at any of our managed properties."
        }
      ]
    },
    {
      "author": "Scott Brown",
      "rating": 5.0,
      "review": "I am a long term Board Member of an HOA in Blaine Wa. I and our association have been associated with Integra and Tess and Cindy Rae for more than 10 years as our Property Managers. We  have always found them to be very professional, extremely helpful and experts in providing the oversite and planning we require.",
      "ownerResponse": []
    },
    {
      "author": "Zach Dugan",
      "rating": 1.0,
      "review": "I have never felt so awful about customer service than I have with this company. In particular one person Sadie Sullivan, the way I was treated by her was incomprehensible. I was simply trying to resolve an issue and she consistently talked down to me and even raised her voice towards me. STAY AWAY",
      "ownerResponse": []
    },
    {
      "author": "Taf Kama",
      "rating": 2.0,
      "review": "My experience with Integra has been awful. Their front desk desk staff members are rude and full of excuses. They have no real interest in helping condo owners and instead will look for any opportunity to deflect responsibility away from ",
      "ownerResponse": []
    },
    {
      "author": "caleb young",
      "rating": 1.0,
      "review": "I don't even want to give them a star!  And after reading their 'mission statement' I wonder what they are supposed to do for us, unless being super disrespectful is one of their tenets. Someone at the company  told us to do something, then ",
      "ownerResponse": []
    },
    {
      "author": "Richard Huizenga",
      "rating": 5.0,
      "review": "Over the years Integra and I have worked together. All experiences with the staff have been professional, ethical and organized. They are great people and skilled at there services.",
      "ownerResponse": []
    },
    {
      "author": "Michael Bell",
      "rating": 1.0,
      "review": "Read the other reviews, they are all 100% on point. How does it reflect on an HOA that every single review of their organization is scathingly negative? ",
      "ownerResponse": []
    },
    {
      "author": "Tim Heredia",
      "rating": 1.0,
      "review": "I have tried to contact manager several times within the past two years,  left my phone number requesting call back , she has not returned any of my calls , receptionist always states she is out to lunch or in a meeting , called this time due to fire issue , no return call again , not very professional of this management company .",
      "ownerResponse": []
    },
    {
      "author": "Jenna Ruud",
      "rating": 5.0,
      "review": "The women here were lovely and helpful. And very cool office, too",
      "ownerResponse": [
        {
          "text": "Thank you!!  Always happy to help!"
        }
      ]
    },
    {
      "author": "Jasmine Munro",
      "rating": 1.0,
      "review": "Sorry to say this, but don't do any business with them. Don't trust their websites because it's not true.\nThe stuffs are rude on the phone/in person. Unprofessional.\nMy advice is be far away from them.",
      "ownerResponse": []
    },
    {
      "author": "Samuel Conrad",
      "rating": 5.0,
      "review": "Have rented from them for 3 years now, easy to deal with.",
      "ownerResponse": []
    },
    {
      "author": "Tim Adkins",
      "rating": 1.0,
      "review": "Be very careful before doing any business with this company. Ironically named.",
      "ownerResponse": []
    },
    {
      "author": "Max Archer",
      "rating": 5.0,
      "review": "Great management company.",
      "ownerResponse": []
    },
    {
      "author": "Rob Miranda",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "John Hess",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you!!"
        }
      ]
    },
    {
      "author": "Zach Dugan",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jessyca Murphy",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Julia B",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Koopa Paratroopa",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Can you please explain the reason for your displeasure.  We would welcome the opportunity to improve your impression of our company."
        }
      ]
    },
    {
      "author": "Audrey Miller",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "jess mcnutt",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Julie B",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 25,
  "avg_rating": 2.7,
  "adjusted_avg_rating": 2.6,
  "summary": "# Integra Condominium Association Management, Inc.: An In-Depth Review\n\nThis article's intent is to provide a well-balanced summary of reviews for Integra Condominium Association Management, Inc., to assist those looking for insights into this particular property management company. These reviews are generated by ChatGPT and should only be used as a tool to help find a property management company or rental property.\n\n## Good\n\nIntegra Condominium Association Management, Inc. receives high praise from certain quarters of its clientele. Some residents and HOA board members describe their experiences as overwhelmingly positive. A 55+ community, for example, expressed satisfaction with the professionalism and responsiveness they received after transitioning from previous management. The staff are described as professional, ethical, and organized, with particular appreciation for their swift handling of maintenance requests, which sometimes are resolved on the same day.\n\nIt's commendable when a property management company can keep its tenants in the loop, and it seems that Integra has succeeded in this area for some. According to user reviews, they maintain a seamless communication channel with their tenants, keeping them updated on building happenings and promptly addressing inquiries about dues or management practices. This level of attentiveness contributes to a sense of security and well-being among the tenants who have had favorable interactions with the company.\n\n## Great\n\nThere are tenants who are singing high praise for the company, reflecting exceptional satisfaction with the services rendered. Long-standing collaborations with HOA boards highlight Integra's expertise in providing the necessary oversight and planning required by their clients. Their professional conduct is underlined by the positive feedback left, reinforcing the importance of a management company that is both skilled and personable in its services.\n\nThe user reviews also point to successful property management endeavors. Residents describe efficient and helpful interactions with staff, reinforcing the image of a company that listens to its clients and addresses their needs. The physical spaces managed by Integra, such as offices, are mentioned as being pleasant and cool—an indication of the care put into the properties under their stewardship.\n\n## Bad\n\nHowever, not all user reviews reflect a positive light on Integra Condominium Association Management, Inc. Some users report a lack of thoroughness and accountability, stating that staff can be dismissive or neglectful when engaging with residents' concerns. There are mentions of incidents involving lost keys, misplaced blame, and notably poor communication during attempts to resolve issues.\n\nThe range of services offered by any property management company is critical, and some reviews suggest that Integra might sometimes fall short of expectations. Residents recount experiences where their pleas for assistance in dealing with thefts and security concerns went unheeded. When looking for prompt and effective action, these residents felt left in the lurch, painting a picture of a company that could be at times unreliable.\n\n## Ugly\n\nDigging deeper into the ugly side of things, some user reviews depict a more troubling scene. There are accusations of dishonesty and unprofessional behavior, with one user review explicitly describing interactions with staff as incomprehensible and disrespectful. Experiences such as being talked down to, or having customer service issues handled poorly can be quite disconcerting.\n\nThe level of customer satisfaction can sharply influence a company's reputation, and Integra faces some severe criticism on this front. Numerous accounts speak of rude behavior from the company's representatives, a seemingly cavalier attitude towards client concerns, and a disappointing lack of follow-through on important safety issues like fire hazards. These grave concerns, according to the reviews, indicate systemic issues within the company's customer service and operational protocols.\n\nIn conclusion, while Integra Condominium Association Management, Inc. shows instances of excellent property management practices, with commendable service for some clients, there is a notable number of user reviews that reveal significant dissatisfaction among other parties. Potential customers and residents should weigh these mixed reviews carefully when considering this company for their property management needs."
}