{
  "name": "John L. Scott Real Estate | Bellingham",
  "address": "",
  "company_type": "Real estate agency",
  "review_count": 107,
  "avg_review": 4.9,
  "reviews": [
    {
      "author": "savannah demery",
      "rating": 5.0,
      "review": "Mira is so much more than a realtor to us. We moved from the east side of the state and wanted to make sure that this move was into a home, not just a house. Mira was recommended to us by our realtor Jessica Griffiths-Granly. Jessica had ",
      "ownerResponse": [
        {
          "text": "Hi Savannah, thank you for the amazing review about Mira! Congrats on  your new home as well. "
        }
      ]
    },
    {
      "author": "Brenda Schoolfield",
      "rating": 5.0,
      "review": "When it comes to finding a dream  vacation home, the journey is almost as important as the destination. Lee and Mira made the process of real estate shopping enjoyable and fun. From our very first meeting, both these ladies worked hard to ",
      "ownerResponse": [
        {
          "text": "Congrats Brenda! And thank you for the wonderful testimonial about Mira and Lee."
        }
      ]
    },
    {
      "author": "Roger Hanson",
      "rating": 5.0,
      "review": "Most everyone will agree that there is more than enough stress and uncertainty when selling a home, and you truly need a helping and trusted hand guiding you through it from the beginning to the very end.  It makes all the difference in the ",
      "ownerResponse": []
    },
    {
      "author": "Don Reville",
      "rating": 5.0,
      "review": "I truly cannot say enough good things about my selling experience with Mira and Lee. ",
      "ownerResponse": [
        {
          "text": "This is such a wonderful testimonial and thank you so much for the review! Congrats on your home sale Don!"
        }
      ]
    },
    {
      "author": "Brian Strutzel",
      "rating": 5.0,
      "review": "As a first time home buyer I was terrified of the entire process but finding a real estate agent that I could trust had my family's best interest in mind was my biggest concern.  However I got everything I could ask for and then some in a ",
      "ownerResponse": [
        {
          "text": "Thank you for this amazing review about William. And congrats on becoming a homeowner Brian!"
        }
      ]
    },
    {
      "author": "Lena Burgin",
      "rating": 5.0,
      "review": "Mira and Lee are exceptional. We have a unique situation- we are living in California, moving to Louisiana and selling our home in Washington. I dont even know how this all would have been logistically possible without them. ",
      "ownerResponse": [
        {
          "text": "Hi Lena, thank you for the wonderful review of Mira and Lee! This is a fabulous testimonial and we really appreciate it!"
        }
      ]
    },
    {
      "author": "Courtney Pohl",
      "rating": 5.0,
      "review": "Paul and Travis at John L. Scott in Bellingham are a fantastic real estate team!  They helped my husband and I navigate the home buying process from out of state.  Their extensive knowledge of the local market helped us find the perfect ",
      "ownerResponse": [
        {
          "text": "Thank you Courtney for the good word about Travis Boyd and Paul Balzotti. Congrats on your investment purchase as well! "
        }
      ]
    },
    {
      "author": "Else Jones",
      "rating": 5.0,
      "review": "We really struck gold when we ended up with Mira as our realtor for our first house. From the start she proved she had our best interests in mind by sitting us down to explain the house buying process and really preparing us. Mira dedicated ",
      "ownerResponse": [
        {
          "text": "Hi Else, thank you for the amazing testimonial about Mira...She is indeed fabulous! Congrats on your new home purchase as well!"
        }
      ]
    },
    {
      "author": "Robert DeVaux",
      "rating": 5.0,
      "review": "Mira Gregory is a very professional and highly competent real estate practitioner. Weve used her to buy our house and used her to sell that house.  Her marketing plan and strategy was successful and the sell went perfectly.  She educated ",
      "ownerResponse": [
        {
          "text": "Thank you for the review Robert!"
        }
      ]
    },
    {
      "author": "William Elmer",
      "rating": 5.0,
      "review": "I recently joined the this office and it is everything I could want out of a local real estate brokerage. From the high level of professionalism and polish, the immense depth of knowledge and experience from the managing brokers, and the ",
      "ownerResponse": []
    },
    {
      "author": "Scott Packer",
      "rating": 5.0,
      "review": "This is a review for Mira Gregory. She recently sold our condo.\n\nI've worked with a lot of realtors over the years. Mira is simply the best one. ",
      "ownerResponse": [
        {
          "text": "Thank you Scott!"
        }
      ]
    },
    {
      "author": "Bernie Saks",
      "rating": 5.0,
      "review": "Peter Roberts is the best realtor. He is knowledgeable fair and to the point. He has always given me great advice and facilitated easy real estate transactions whether I have been the buyer or seller",
      "ownerResponse": [
        {
          "text": "Thank you Bernie! Peter is an outstanding broker and we appreciate your endorsement!"
        }
      ]
    },
    {
      "author": "MARGARET \"Peg\" NEVA",
      "rating": 5.0,
      "review": "Kerry Zender and Paul Bazzotti at John L. Scott, are wonderful realtors and my wife Crystal and I highly recommend them.  They met with us frequently, with Kerry especially involved in the staging of our house, the timing of the sale, the ",
      "ownerResponse": []
    },
    {
      "author": "Valerie Goetz",
      "rating": 5.0,
      "review": "Buying a home can be intimidating, but Mira helped us over every hurdle and through each step of the process.  She is so very friendly, encouraging and knowledgeable of all areas of real estate practices and local area information.  Her ",
      "ownerResponse": [
        {
          "text": "Hi Valerie, thank you so much for the good word, and recommendation of Mira Gregory. Congrats on your purchase as well!"
        }
      ]
    },
    {
      "author": "Crissy Impero",
      "rating": 5.0,
      "review": "I researched all the local firms prior to finishing my real estate courses and interviewed with a few. As soon as I walked thru the door of the Bellingham John L Scott I knew I was home. Such warm and friendly brokers who bring such value ",
      "ownerResponse": [
        {
          "text": "We love working with you Crissy --you are an outstanding broker and person. Thank you for sharing the good word!"
        }
      ]
    },
    {
      "author": "Mary McDougall",
      "rating": 5.0,
      "review": "Kerri Zender was a pleasure to work with in buying our new home in Bellingham.  She was knowledgeable, friendly, and responsive to all of our questions and concerns.  As a lifelong local resident, her familiarity with the town, ",
      "ownerResponse": [
        {
          "text": "HI Mary, congratulations on your new home! And thank you for the positive review about Kerri!"
        }
      ]
    },
    {
      "author": "Two_Wheel_ Feels",
      "rating": 5.0,
      "review": "Patient, pleasant and professional. Working with the John L Scott team and Vanessa Treadway made my home shopping experience a breeze.  Vanessa was an extremely knowledgeable resource for someone new to the area. She went above and beyond ",
      "ownerResponse": [
        {
          "text": "Vanessa is a total pro and we really appreciate your for the testimonial!"
        }
      ]
    },
    {
      "author": "Brittany Rose",
      "rating": 5.0,
      "review": "Mira was the absolute best realtor to guide me through the process of purchasing my first home. She was quick to respond when I had questions or concerns. I highly recommend her to anyone that needs a trusting realtor. Buying my first home ",
      "ownerResponse": [
        {
          "text": "Brittany, congrats on your home purchase! And thank you so much for the glowing review about Mira!"
        }
      ]
    },
    {
      "author": "Taylor Rebekah",
      "rating": 5.0,
      "review": "My first time buying a home and Mira was awesome! I was very scared / stressed the entire time, she probably handled WAY more things out side her job requires her to do, and then some. If there was something mentally I couldn't handle to do ",
      "ownerResponse": [
        {
          "text": "Congrats on becoming a homeowner Taylor! It is indeed a stressful process and we are thrilled that things worked out. We very much appreciate you sharing the positive review about Mira."
        }
      ]
    },
    {
      "author": "Joanna Powell Colbert",
      "rating": 5.0,
      "review": "I'm very glad Mira Gregory was my agent when I was buying my home. She is professional, efficient, and a pleasure to work with. She answered all my questions and always responded promptly to my messages. She helped me make informed ",
      "ownerResponse": [
        {
          "text": "We appreciate the wonderful review Joanna!"
        }
      ]
    },
    {
      "author": "Dayna Del Mar",
      "rating": 5.0,
      "review": "We worked with Brianna Robbins and she was amazing to work with! Wed connected with her via our friends who run a local Forest School, so we knew she was going to understand us and our values and interests well. ",
      "ownerResponse": [
        {
          "text": "Thank you for this amazing testimonial about your experience working with Brianna and congrats on your new home!"
        }
      ]
    },
    {
      "author": "G Martin",
      "rating": 5.0,
      "review": "Mira provided superb representation during our recent purchase of a home in Sudden Valley. Her assistance began 8 months earlier, helping my wife during a trip to Washington to scout possible relocation areas in the PNW. We were living in ",
      "ownerResponse": []
    },
    {
      "author": "Mac Pickens",
      "rating": 5.0,
      "review": "Mira has been an absolute joy to work with, from start to finish, and my husband and I feel so lucky to have connected with her in our home search, as we have come out of the transaction not only with a gorgeous new home, but with a new ",
      "ownerResponse": []
    },
    {
      "author": "Kelli Hagin",
      "rating": 5.0,
      "review": "I worked with an agent named Sarah Aguirre and she was fantastic!\n\nSarah always took the time to listen carefully to my needs and clearly ",
      "ownerResponse": [
        {
          "text": "Thank you for the great review Kelli! Sarah is an amazing person and Realtor, and so happy you had a positive experience with her."
        }
      ]
    },
    {
      "author": "Barb Demorest",
      "rating": 5.0,
      "review": "Mira Gregory patiently helped us over 2 years on our quest for just the right place for our next season of life. She was always there for us even on a rainy night to view a place quickly. She worked with us to purchase a highly sought after ",
      "ownerResponse": [
        {
          "text": "Thank you for sharing your experience with Mira! What a great testimonial of her professionalism and service. Congrats to you on your new home Barb!"
        }
      ]
    },
    {
      "author": "Theresa Butcher",
      "rating": 5.0,
      "review": "Im a big fan of John L. Scott in Bellingham. The office and the staff have a fresh modern vibe, but they are part of a bigger company that has been around for decades so you know youre getting the infrastructure and accountability you ",
      "ownerResponse": [
        {
          "text": "Thank you Theresa. Nathan Butcher is a top notch broker too!"
        }
      ]
    },
    {
      "author": "Emily Carraux",
      "rating": 5.0,
      "review": "Mira Gregory has been absolutely the best realtor we could have asked for! She went above and beyond to support us through the entire process of searching for the perfect home and then navigating the stressful purchasing process. She was ",
      "ownerResponse": []
    },
    {
      "author": "Tom Dorn",
      "rating": 5.0,
      "review": "Mira Gregory is more than a real estate agent.  She is gracious, very professional, and respectful, not only toward us as buyers but all parties involved in our pursuit.  Mira is! very knowledgeable about Bellingham, the market, lifestyles, ",
      "ownerResponse": []
    },
    {
      "author": "Michael Hodel",
      "rating": 5.0,
      "review": "Marsha Brown was a fantastic real estate agent during my recent home purchase.  She was super responsive, experienced, very detail oriented, data driven, and even suggested creative ideas to increase our offer's chance of success.  Marsha ",
      "ownerResponse": [
        {
          "text": "Thank you Michael for the great testimonial about Marsha! We appreciate it, and agree with all of your notes about Marsha. Also, congrats on your new home!"
        }
      ]
    },
    {
      "author": "Amy Siemens",
      "rating": 5.0,
      "review": "I worked with Jessica Vanoy. She was so helpful and so quick to answer questions or reassure us. She is kind and down to earth. She helped us find our perfect new home.  She had said we will take as long as needed until we find the right ",
      "ownerResponse": [
        {
          "text": "Hi Amy, Congrats on your home purchase, and thank you so much for the wonderful review about working with Jessica!"
        }
      ]
    },
    {
      "author": "Taylor Garrod",
      "rating": 5.0,
      "review": "Jennifer Hebert at John L. Scott helped me buy my first home and I could not be happier! After viewing a property I wanted to pursue, Jenn helped me get pre-approved for a home loan AND got my offer accepted in a competitive offer situation ",
      "ownerResponse": [
        {
          "text": "Thank you Taylor! You said it right, Jennifer is both outstanding at her job and fun! We appreciate the review."
        }
      ]
    },
    {
      "author": "Charlotte Gazak",
      "rating": 5.0,
      "review": "I was working  with Marsha Brown, who works with JL Scott. She is a wonderful agent who cares a lot about her clients, she made things so easy, and dealt\nso patiently with my anxiety. She managed to have the closing of both properties ",
      "ownerResponse": [
        {
          "text": "Thank you Charlotte for the wonderful review of your experience with Marsha. That is one of the things we specialize in is helping people make that sell/buy move, which can be tricky sometimes. Congrats on your home sale and new home purchase!"
        }
      ]
    },
    {
      "author": "Vicki Buffer",
      "rating": 5.0,
      "review": "My daughter and I recently worked with Allison Kennedy of John L Scott Bellingham in purchasing our new home together.  Allison was amazing to work with.  She was very professional, caring, helpful and always there every step of the way ",
      "ownerResponse": [
        {
          "text": "Thank you for the review about Alison! Congrats on your new home, and we are thrilled you had a great experience with your purchase."
        }
      ]
    },
    {
      "author": "Karin Baylor",
      "rating": 5.0,
      "review": "We are over the moon happy with our experience with John L Scott Real Estate and specifically with our wonderful agent, Molly Visser, in the sale of our home. Molly listened attentively and really empathized with our needs, had lots of ",
      "ownerResponse": [
        {
          "text": "This is awesome! We are thrilled you had an awesome experience with Molly. She is an incredible Realtor, and a genuine person who cares deeply about her clients. Molly's  personality is positive and enthusiastic, so this testimonial matches her perfectly. Thank you so much for the review and congrats on your home sale!"
        }
      ]
    },
    {
      "author": "Carolyn Phillips",
      "rating": 5.0,
      "review": "Mira was a great agent. She was very knowledgable about the Bellingham area and was able to help us get the best price for our property in a changing market. We would definitely recommend her.",
      "ownerResponse": [
        {
          "text": "Hi Carolyn,  Congrats on your sale, and thank you so much for the wonderful review about Mira Gregory!"
        }
      ]
    },
    {
      "author": "Joyce Lawrence",
      "rating": 5.0,
      "review": "Just purchased a home with the help of Marsha Brown, who is such a patient and knowledgeable realtor. She listened closely to our needs, was extremely responsive, and guided us through the whole process. Highly recommend working with her. ",
      "ownerResponse": [
        {
          "text": "Hi Joyce, thank you so much for the review about Marsha, and congrats on your home purchase!"
        }
      ]
    },
    {
      "author": "valerie h",
      "rating": 5.0,
      "review": "Jessica VanNoy is one of the most professional yet kindest people I have ever worked with. In a decade of working with her I always knew I could count on her for anything regardless of what it was, even when it was a personal issue rather ",
      "ownerResponse": [
        {
          "text": "Valerie, thank you for the wonderful review of Jessica. We agree she is an amazing and genuinely caring person, as you have noted! We are proud to have Jessica representing our firm"
        }
      ]
    },
    {
      "author": "Kellie Strong",
      "rating": 5.0,
      "review": "John L. Scott Bellingham is owned by Paul Balzotti. I have worked with with them for the past 3 years of my 20 year career. Paul and his team are amazing! Through their ongoing training and the constant support, they provide an endless ",
      "ownerResponse": [
        {
          "text": "Thank you so much Kellie for the testimonial!"
        }
      ]
    },
    {
      "author": "Laura Newgard",
      "rating": 5.0,
      "review": "Heather Stevenson is absolutely, hands down, my most loved agent. Her level of communication, transparency, knowledge and dedication to her clients is well above the standards in the area. Her knowledge of the market as well as connections ",
      "ownerResponse": [
        {
          "text": "Hi Laura, Thank you so much for the wonderful review about Heather!"
        }
      ]
    },
    {
      "author": "Grant Scarlett",
      "rating": 5.0,
      "review": "I worked with Jessica VanNoy as my agent through John L. Scott and she was very responsive and engaging. She always had our best interests in mind and helped us get our first place! I am very happy with the service provided. If Im ever buying another house or property, Ill be sure to come back here again. 5/5 stars.",
      "ownerResponse": [
        {
          "text": "That is great to hear Grant, and thank you for the good word about Jessica!"
        }
      ]
    },
    {
      "author": "traci johnson",
      "rating": 5.0,
      "review": "We have worked with Molly on four different occasions...clearly she is fantastic to work with which is why we continue to call on her as the opportunity arises. We know that she is on it and always working for us. She always responds ",
      "ownerResponse": [
        {
          "text": "We really appreciate the amazing review! Molly is an outstanding agent and we are so proud to have her as part of our team. Thank you Traci for taking the time to share your experience with Molly and our brokerage."
        }
      ]
    },
    {
      "author": "morgan libby",
      "rating": 5.0,
      "review": "Heather Stevenson  was a dream agent. She walked me through the entire step of the way and made me feel confident about the process. I appreciated her knowledge and the way she alleviated my anxiety. She is incredibly detailed and that ",
      "ownerResponse": [
        {
          "text": "Thank you Morgan! Heather is incredibly detail oriented, and absolutely a first class person and Realtor. We appreciate the fantastic review!"
        }
      ]
    },
    {
      "author": "Dayton Sanchez",
      "rating": 5.0,
      "review": "Sarah Aguirre is one of my most favorable , hands down fantastic, wonderful realtor. The most family oriented realtor I have ever met! Outstanding performance. She is #1 at John L. Scott! You won't be disappointed, I am very picky with my realtors but I was very pleased with her performance! 100%!",
      "ownerResponse": [
        {
          "text": "Thank you Dayton! We agree, and thank you for sharing your wonderful experience working with her!"
        }
      ]
    },
    {
      "author": "Joey Dotolo",
      "rating": 5.0,
      "review": "Heather  has been fantastic about showing us around Bellingham - her knowledge and expertise in the area has been incredibly helpful in finding the right home for me and my family.  Working with Heather was a delight!  her system was well ",
      "ownerResponse": [
        {
          "text": "We really appreciate the good word about your experience with Heather! She is an outstanding broker and we are proud to have her as part of our team. Thank you again for the review!"
        }
      ]
    },
    {
      "author": "Parker Worthington",
      "rating": 5.0,
      "review": "We had a fantastic experience working with Paul Balzotti to purchase our first home in Bellingham. Paul was referred by a trusted source, and came through for us in a very competitve market. He has the right temperament as a realtor, and ",
      "ownerResponse": [
        {
          "text": "Thank you for the review Parker!"
        }
      ]
    },
    {
      "author": "Teresa Sutphin",
      "rating": 5.0,
      "review": "I trust Jessica VanNoy with all my real estate needs. I have known Jessica for 20+ years. She is smart, hard-working, professional,  responsive and  is a people person.  Finding all of those traits in one real estate agent is everything that a home buyer or home seller what desire.",
      "ownerResponse": [
        {
          "text": "Hi Teresa, Thank you for the amazing testimonial about Jessica!"
        }
      ]
    },
    {
      "author": "Michele Siemion",
      "rating": 5.0,
      "review": "I worked with Molly Visser at John L Scott last summer buying and selling a home in Bellingham, WA.  The market here is crazy, with homes moving within days!!! Molly was fearless, she was on the phone with me daily helping navigate the ",
      "ownerResponse": [
        {
          "text": "Thank you for the review Michele! That sounds like the Molly we know and love, and we appreciate the testimonial!"
        }
      ]
    },
    {
      "author": "Stacy Meissner",
      "rating": 5.0,
      "review": "Our family had some complex and changing housing requirements.  We were very satisfied working with Molly Visser.  She always took the time to explain our options, the pros and cons, and documented what each would mean from a cost ",
      "ownerResponse": [
        {
          "text": "Hi Stacy, we really appreciate the fantastic review about Molly! Also love that you were able to take advantage of our app as well. Thank you!"
        }
      ]
    },
    {
      "author": "B H",
      "rating": 5.0,
      "review": "What an incredible experience I had purchasing a home with Tracy Peterson-Nienaber's help.  She is a wealth of information on the area, her recommendations are solid and she's a joy to be around.  Tracy's knowledge of the buying process is ",
      "ownerResponse": [
        {
          "text": "Thank you for the wonderful review! Tracy is indeed an outstanding broker."
        }
      ]
    },
    {
      "author": "Anne",
      "rating": 5.0,
      "review": "Agent: someone or something that makes something happen.\n\nTracy Peterson-Nienaber, a John L. Scott broker/agent, is not only a friend, ",
      "ownerResponse": [
        {
          "text": "Tracy is an amazing broker, and we were thrilled to have her as part of the JLS family. Your testimonial means a lot. Thank you!"
        }
      ]
    },
    {
      "author": "Pamela Shaffer",
      "rating": 5.0,
      "review": "I have enjoyed working with Oksana over the past few years.  She is willing to go the extra mile and has a pleasant and uplifting attitude.  She is knowledgeable in her field and enthusiastic with most everything she does.   Working with ",
      "ownerResponse": [
        {
          "text": "Thank you Pamela for the fabulous review of Oksana! We really appreciate it!"
        }
      ]
    },
    {
      "author": "ken cantrell",
      "rating": 5.0,
      "review": "Extremely hard working, goes the extra mile, and then some.  Very engaging personality, real, down to earth.  When she says her clients are important, you actually believe her. Tireless in her commitment to search and find the perfect home for her clients.",
      "ownerResponse": [
        {
          "text": "Hi Ken, thank you for the endorsement of Mira Gregory! We agree on all accounts, and appreciate the review."
        }
      ]
    },
    {
      "author": "Julie Ann Smith",
      "rating": 5.0,
      "review": "Jessica is amazing! She goes above and beyond to ensure that her clients needs are met. She truly has their best interests at heart. Her work ethic and integrity speak volumes of her caring and genuine nature. I highly recommend her to anyone!",
      "ownerResponse": [
        {
          "text": "We agree and thank you! Jessica is such a caring person and we appreciate the testimonial!"
        }
      ]
    },
    {
      "author": "N V",
      "rating": 5.0,
      "review": "There is no other than Mira!!!  She came to me highly recommended for the sale of the home and was every bit of the professional, diligent, communicative, and efficient person I was told to expect.   But there is more....Mira went above and ",
      "ownerResponse": [
        {
          "text": "This is such a fantastic endorsement of Mira! Thank you so much, and we are thrilled you had such a great experience working with her!"
        }
      ]
    },
    {
      "author": "Margaret Sun",
      "rating": 5.0,
      "review": "Patrick Britton represented us in a recent transaction. He was very responsible and professional. He has great knowledge about the real estate market in the area and was very pleasant to work with. I felt that as our agent, he had our best ",
      "ownerResponse": [
        {
          "text": "Margaret, thank you for taking the time to review Patrick. We agree he is an amazing broker!"
        }
      ]
    },
    {
      "author": "Dana Pound",
      "rating": 5.0,
      "review": "Molly Visser never hesitated to bend over backwards to help us find the perfect property to fit our very unique needs. She even took us out to look at houses after a huge snow event that had all the schools and many businesses closed down ",
      "ownerResponse": [
        {
          "text": "We appreciate this amazing review Dana!  We love that Molly was there for you in all weather conditions! Awesome testimonial and congrats on your new home."
        }
      ]
    },
    {
      "author": "Jennifer Hebert",
      "rating": 5.0,
      "review": "You cannot go wrong with these agents to buy or sell your next property! The team at JLS Bellingham are highly trained professionals with up-to-the minute insights on what is happening in the local market. Luxury properties...investment...buying your first home...Look no further!",
      "ownerResponse": [
        {
          "text": "Thank you Jennifer! You are a fantastic loan officer, and our team loves working with you!"
        }
      ]
    },
    {
      "author": "Ryver Wyse",
      "rating": 5.0,
      "review": "Working with Jeff Willson is such a pleasant experience!  His calmness and optimism about the real estate process is refreshing, as well as the clarity and solid communication that he exudes.  Just what you want in a good Realtor: quality listening and and active success!",
      "ownerResponse": [
        {
          "text": "Hi Ryver, thank you for the wonderful review of Jeff, we like to call \"the Zen Realtor\"!  We appreciate the testimonial and congratulations to you!"
        }
      ]
    },
    {
      "author": "Kayla McIntyre",
      "rating": 5.0,
      "review": "Sarah is a wonderful addition to your team. She is always ready and able to help me in whatever way I need. Super responsive and professional, her work ethic speaks volumes.  Thank you for always offering me sound advice when thinking about purchasing a home, Sarah!!",
      "ownerResponse": [
        {
          "text": "Hi Kayla, thank you for the positive review about Sarah! Good luck on your search as well."
        }
      ]
    },
    {
      "author": "Catherine Collier",
      "rating": 5.0,
      "review": "Crissy Impero went above and beyond any real estate transactions Ive ever had. A real star!! Plus she is very nice!",
      "ownerResponse": [
        {
          "text": "Thank you for the wonderful review Catherine!"
        }
      ]
    },
    {
      "author": "Robert Freeborn",
      "rating": 5.0,
      "review": "I loved working with Patrick Britton. Not only is he pleasant to work with, but he is an amazing expert on the area.  When investing in Real Estate, it is essential that you have accurate valuations so you can run your numbers. Pat's comps ",
      "ownerResponse": []
    },
    {
      "author": "Michelle Lewis",
      "rating": 5.0,
      "review": "Alison is someone I have known for years, and I completely trust her judgement. My friend Joyce bought a home through John L. Scott as her realtor and gave rave reviews over the service she gave. Currently I am in search of a home and the only agent I would choose is Alison!",
      "ownerResponse": [
        {
          "text": "Thank you for the review about Alison Kennedy! Alison is an excellent broker, and has a heart of gold -and we are grateful to have her as part of our team. Your in good hands and best of luck on your home search!"
        }
      ]
    },
    {
      "author": "Hannah Jones (Hannah's Homes)",
      "rating": 5.0,
      "review": "I have love working here from the moment I walked in! Each broker is supportive, educated about the current market, and wanting to give their clients the absolute best experience in their real estate transactions. I highly recommend John L Scott for any of your real estate transactions.",
      "ownerResponse": [
        {
          "text": "Thank you for Hannah! You are an amazing broker, and we are grateful you chose John L Scott Bellingham!"
        }
      ]
    },
    {
      "author": "Katy Hagin",
      "rating": 5.0,
      "review": "Sarah Aguirre attentively walked me through the process of what it would be like buying a home as a first time buyer. I never thought I would be able to afford a home, but Sarah educated me on credit, down payments, and loans to help make my dream a reality. Very professional and full of good advice!",
      "ownerResponse": [
        {
          "text": "Hi Katy, that is an amazing review, and thank you so much for sharing your  experience with Sarah. Also, congrats on becoming a homeowner!"
        }
      ]
    },
    {
      "author": "Linda Kidwell",
      "rating": 5.0,
      "review": "Jessica VanNoy was so helpful in getting our home ready to sell and \" show\". She is from Bellingham so her knowing a Lot of people was very advantageous thru out the entire process. Jessica is honest and takes pride in helping you . Our ",
      "ownerResponse": [
        {
          "text": "Linda, thank you for sharing a 5 star rating!"
        }
      ]
    },
    {
      "author": "Linda Pettigrew",
      "rating": 5.0,
      "review": "It was great! I felt like Hannah (Cranny) had my back through the whole process. She is absolutely delightful, thoughtful and extremely intelligent when it comes to the details. She outshines every other realtor I've worked with! ",
      "ownerResponse": [
        {
          "text": "Hi Linda, thank you so much for the testimonial about Hannah. Hannah is amazing, and we are thrilled to hear you had such a great experience. Congrats on your move!"
        }
      ]
    },
    {
      "author": "Susan Royal",
      "rating": 5.0,
      "review": "Working with Jeff Willson was our 'calm in the storm' of our home buying process. In this frenzied/chaotic/high pressure/discouraging market, Jeff was able to steer us to appropriate properties in a relaxed but focused manner. He took time ",
      "ownerResponse": [
        {
          "text": "Thank you for the wonderful review about Jeff, and congrats to you on your new home!"
        }
      ]
    },
    {
      "author": "joseph wystup",
      "rating": 5.0,
      "review": "This is hands down the best real estate office in whatcom county. I was so impressed with this office and their listing broker, Peter Robert's when I bought my house from them. Fast forward 3 years later, I got my real estate license and ",
      "ownerResponse": [
        {
          "text": "Thanks Joe! We love having you as part of the JLS family!"
        }
      ]
    },
    {
      "author": "Wyatt Jarvis",
      "rating": 5.0,
      "review": "As first time home buyers we are grateful that our realtor, Joe Wystup, was extremely accommodating and energetic throughout the process of buying this house. I have a big personality, and we liked that Joe was always willing to meet us ",
      "ownerResponse": [
        {
          "text": "Wyatt, we appreciate the great review of Joe! He is such a great guy who is extremely dedicated and resourceful, as you noted! We are thrilled you had such a positive experience."
        }
      ]
    },
    {
      "author": "Chauvin Rupley",
      "rating": 5.0,
      "review": "My family and I worked solely with Patrick Britton from John L Scott on our home purchase in Bellingham and we truly could not have closed on a better deal without him. I outlined exactly what we were looking for and what fit our budget --- ",
      "ownerResponse": [
        {
          "text": "Patrick is an exceptional Realtor and we appreciate the positive review!"
        }
      ]
    },
    {
      "author": "Theresa Stanley",
      "rating": 5.0,
      "review": "We just had to let you know that working with John L Scott and our realtor, Alison Kennedy, has been a true pleasure. She really heard our needs and put the client first. Her personality and ability to hear what we were really saying made ",
      "ownerResponse": [
        {
          "text": "Thank you for the review! Alison is an outstanding broker and wonderful person, and we are thrilled that you had a great experience with Alison and our brokerage."
        }
      ]
    },
    {
      "author": "kayla",
      "rating": 5.0,
      "review": "Amazing real estate agent! Jennifer Hebert was knowledgeable, kind, and more than willing to help! Being a first-time home buyer she helped me understand every step of the process in its entirety so I was not confused or ill-informed when decisions came around. Jenn made this process #easybreezy!",
      "ownerResponse": [
        {
          "text": "Thank you for positive review about Jennifer! She is a rising star and we agree with all of the above!"
        }
      ]
    },
    {
      "author": "Elaine Shelley",
      "rating": 5.0,
      "review": "Jessica VanNoy is one of the nicest, genuine, hardworking and compassionate people I know. She is dedicated to her clients and friends and takes every opportunity to help others. I think everyone knows and would agree, Jessica is the type of person you can count on.",
      "ownerResponse": [
        {
          "text": "Hi Elaine, thank you for the wonderful review about Jessica!"
        }
      ]
    },
    {
      "author": "Ian Siemens",
      "rating": 5.0,
      "review": "We worked with Jessica Vanoy and had a great experience. She was very well informed and on top of new properties. Jessica worked with us to ensure our wants and needs were met. A+",
      "ownerResponse": [
        {
          "text": "Thank you for the wonderful review Ian! Jessica is fantastic and we are thrilled that you had a great experience working with her."
        }
      ]
    },
    {
      "author": "Joshua Top",
      "rating": 5.0,
      "review": "We worked with Eric Green from the Bellingham John L. Scott office.  Eric was a pleasure to work with!  He is knowledgeable, professional, and was focused on taking care of us through our home sale.  We are very happy with the outcome and would highly recommend Eric.",
      "ownerResponse": [
        {
          "text": "Thank you for the good word about Eric! Eric has been in the business a long time and is absolutely a nop notch broker. Thank you Joshua for taking the time to share the positive experience and congrats on your home sale!"
        }
      ]
    },
    {
      "author": "Martha Redpath",
      "rating": 5.0,
      "review": "I have worked with Oksana Najibi in the past. She is a person with great integrity and is personable. Oksana pays close attention to detail, which will be a great asset from helping clients find their perfect home to making sure the closing process goes smoothly. I highly recommend Oksana Najibi as a realtor.",
      "ownerResponse": [
        {
          "text": "Thank you for the good word about Oksana! Everything you noted about Oksana is so very true, and we appreciate your endorsement!"
        }
      ]
    },
    {
      "author": "Luis Aguirre Bueno",
      "rating": 5.0,
      "review": "My wife Sarah joined John L Scott in January and it really has been a great move for her. Seems like everyone in her office was very welcoming. Its a really great local company and I highly recommend John L Scott in Bellingham!",
      "ownerResponse": [
        {
          "text": "Thank you Luis! Sarah is a rising star in this profession, and we are thrilled she made the move to John L Scott Bellingham."
        }
      ]
    },
    {
      "author": "J. Bellerive",
      "rating": 5.0,
      "review": "We sold our home and purchased a new one with Peter Roberts at John L Scott in Bellingham.  On more than one occaision Peter's expertise in real estate and negotiating avoided complications and helped us get the very best deal both in our ",
      "ownerResponse": [
        {
          "text": "Peter is one of our veteran brokers that have been with us since John L Scott Real Estate arrived in Bellingham about 20 years ago, and we are proud to have Peter as part of our team. Thank you for the nod to www.johnlscott.com as well!"
        }
      ]
    },
    {
      "author": "Amy Baker",
      "rating": 5.0,
      "review": "Patrick Britton is a wealth of knowledge for the investor! He is very knowledgeable, patient, and kind with his clients. He is amazing to work with and I will defiantly be recommending him to friends and family.",
      "ownerResponse": [
        {
          "text": "Thank you Amy!"
        }
      ]
    },
    {
      "author": "Melanie Ginoza",
      "rating": 5.0,
      "review": "Valerie has quickly become one of my favorite people. She is completely reliable, honest and trustworthy.  She has excellent communication and is a dedicated professional who loves helping people.",
      "ownerResponse": [
        {
          "text": "Valerie has incredible energy and she is one of our favorite people too :-) Thank you for the wonderful testimonial Melanie!"
        }
      ]
    },
    {
      "author": "Jo Baner",
      "rating": 5.0,
      "review": "I've been working with Julia Menkee, a John  L. Scott agent for several months during a fast moving market. She has hung in there with all our specific needs giving us good advice. Professional and caring.",
      "ownerResponse": [
        {
          "text": "Thank you Jo, for the positive feedback! We hope you find that perfect home soon!"
        }
      ]
    },
    {
      "author": "Nathan Butcher (chutterhanban)",
      "rating": 5.0,
      "review": "Everyone here has such great experience and a wonderful disposition. The staff have it on lockdown and the ownership has all the vision and all the follow-through. Truly the pinnacle option for local Realtors.",
      "ownerResponse": [
        {
          "text": "The team loves working with you Nathan, and we appreciate the endorsement! You are an exceptional broker, and we are honored that you choose JLS to partner with for your business."
        }
      ]
    },
    {
      "author": "Sandra Dean McKee",
      "rating": 5.0,
      "review": "John L Scott Bellingham is an incredible place to work.  The support i get from our managing broker Darin Stenvers and Paul Balzotti or fearless owner is unbelievable.",
      "ownerResponse": [
        {
          "text": "Thank you Sandra! You are such a top notch Realtor, and even more important, fantastic person that we are honored to work with."
        }
      ]
    },
    {
      "author": "Marilyn Larson",
      "rating": 5.0,
      "review": "We've known Dennis VanBeek for over 30 years.  Dennis has proven his good character in this county in many capacities, from volunteer fire fighter to dedicated employee and supervisor for a local location of a large national industry. ",
      "ownerResponse": [
        {
          "text": "Thank you Marilyn for the testimonial about our broker associate Dennis Van Beek. We agree Dennis is a top notch Realtor and a top notch person. We appreciate the good word!"
        }
      ]
    },
    {
      "author": "Melissa Scott",
      "rating": 5.0,
      "review": "Jessica VanNoy is a great addition to the Bellingham team!  Shes reliable, helpful and knows the community like the back of her hand. Its a pleasure working with her!",
      "ownerResponse": [
        {
          "text": "Thank you Melissa for the wonderful testimonial about Jessica!"
        }
      ]
    },
    {
      "author": "Brenda",
      "rating": 5.0,
      "review": "Oksana Najibi is smart, friendly, and a go-getter! She has integrity and will go above and beyond expectations in everything she takes on.  She is on my short list of favorite people!!!",
      "ownerResponse": [
        {
          "text": "Thank you Brenda for the wonderful review of Oksana!"
        }
      ]
    },
    {
      "author": "Nathan Barbo",
      "rating": 5.0,
      "review": "Keith was awesome! He worked hard to find us the perfect house and get us in quickly with no set-backs. Great experience!\n Nathan & Hana",
      "ownerResponse": [
        {
          "text": "Thank you for the good word! Keith is a true pro!"
        }
      ]
    },
    {
      "author": "Gregory Stinson",
      "rating": 5.0,
      "review": "I worked with an agent named Marty Kutschbach, this is the second property he has sold for our family. Very professional and patient when things get stressful . Thank you Marty and John L Scott",
      "ownerResponse": [
        {
          "text": "We appreciate the good word, and for your patronage working with Marty on 2 transactions. Thank you Greg!"
        }
      ]
    },
    {
      "author": "Angelo G",
      "rating": 5.0,
      "review": "Jessica VanNoy has been great! She has helped me on 2 purchases in the last several months and Ill go to her again when the time comes.",
      "ownerResponse": [
        {
          "text": "Thank you Angelo! 2 is better than one.\nand shows the trust you have in her. Congrats on your latest purchase, and we appreciate the positive review!"
        }
      ]
    },
    {
      "author": "Phil Rose",
      "rating": 5.0,
      "review": "I worked with Valerie Lynne, a John L Scott realtor in a professional capacity and family experience to be excellent. I would recommend her unreservedly.",
      "ownerResponse": [
        {
          "text": "Phil we appreciate your positive review about Valerie Hansen!  She has amazing energy and enthusiasm for what she does and your recommendation means a lot to us."
        }
      ]
    },
    {
      "author": "Nina Zamudio",
      "rating": 5.0,
      "review": "If youre looking for a lovely person wholl be in your corner, give you time, patience and answer any/all your questions with a smile and get the deal done, then Andrea is your agent.",
      "ownerResponse": [
        {
          "text": "Thank you for the wonderful testimonial about Andrea Campion!"
        }
      ]
    },
    {
      "author": "Barb",
      "rating": 5.0,
      "review": "Love the energy and positivity that Jessica VanNoy puts forth in her efforts for first time home buyers She makes you feel like family ",
      "ownerResponse": [
        {
          "text": "Thank you Barb! She absolutely does, and thank you for sharing your experience with Jessica!"
        }
      ]
    },
    {
      "author": "Irena Kolbert",
      "rating": 5.0,
      "review": "Very satisfied with the service of JLS Bellingham! Hands down the nicest and most professional team I've worked with.",
      "ownerResponse": [
        {
          "text": "Thank you Irena! We are thrilled to work with you!"
        }
      ]
    },
    {
      "author": "Courtney Jenkins",
      "rating": 5.0,
      "review": "Super thoughtful and catches all the details to find my perfect opportunity. I would recommend Jessica to anyone!",
      "ownerResponse": [
        {
          "text": "Thank you Courtney!"
        }
      ]
    },
    {
      "author": "Dexter Andrews III",
      "rating": 5.0,
      "review": "Super knowledgeable real estate agents!",
      "ownerResponse": [
        {
          "text": "Thank you Dexter! You are a top-notch broker with a thrilled to partner with!"
        }
      ]
    },
    {
      "author": "Amber Johnson",
      "rating": 4.0,
      "review": "Must say Patrick was quick and efficient.  Will use John L Scott again.",
      "ownerResponse": [
        {
          "text": "Thank you for the good word Amber!"
        }
      ]
    },
    {
      "author": "Aaron Ludtke Lyon",
      "rating": 5.0,
      "review": "awesome!",
      "ownerResponse": [
        {
          "text": "Thanks Aaron!"
        }
      ]
    },
    {
      "author": "Dale Lee Bailey",
      "rating": 4.0,
      "review": "Nic real estate center",
      "ownerResponse": [
        {
          "text": "Thank you Dale!"
        }
      ]
    },
    {
      "author": "Becks Kobel",
      "rating": 5.0,
      "review": "Mira has been one of the most amazing real estate agents to ever work with. Not only was she prepared and professional when we met for the first time, but personable as well. ",
      "ownerResponse": [
        {
          "text": "Thank you Becks! Congrats to you as well. "
        }
      ]
    },
    {
      "author": "Blythe Torok",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Ryan Driscoll",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Sarah Aguirre",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Todd W",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Tyler Gaudioso",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Tyler!"
        }
      ]
    },
    {
      "author": "Gerent G",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for rating! We hope to reach 5 stars in your experience with our brokerage in the future. If there is anything we could have done to make it a better experience, please reach out to us anytime."
        }
      ]
    },
    {
      "author": "scott crook",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "B Thevenaz",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 99,
  "adjusted_review_average": 5.0,
  "summary": "# John L. Scott Real Estate | Bellingham: A Balanced Review\n\nJohn L. Scott Real Estate in Bellingham is a company with a significant presence in the real estate market. This article is generated by ChatGPT, summarizing the user reviews to offer insightful perspectives for those in search of a reputable property management company or rental property. It is important to note that these reviews are synthesized to provide a balanced view and should serve as a tool for users to gauge the performance and reliability of John L. Scott Real Estate | Bellingham.\n\n## Good\n\nUsers have overwhelmingly praised John L. Scott Real Estate for its professionalism and competency in handling real estate transactions. Numerous reviewers have cited that the agents they worked with were not only capable but went above and beyond in their roles. Agents like Mira have been highlighted for their exceptional guidance through complex processes, such as out-of-state moves and first-time home buying experiences. The company’s communicative approach and emphasis on client interest have received laudable mentions, which is indicative of their dedication to service.\n\nFurthermore, the responsiveness of agents has been a recurring theme, with many users mentioning how agents from John L. Scott Real Estate were always prompt in replying to queries and concerns. Be it a chaotic market or a specific demand, the firm has been credited for having insightful market knowledge and an empathetic touch. Comments on the company’s professional demeanor and the positive impact on clients' transactions imply that professionalism is deeply ingrained in the company culture.\n\n## Great\n\nSeveral reviewers touched upon the personalized attention they received from John L. Scott Real Estate staff. Agents like Mira, Lee, and Paul were mentioned for making processes like house hunting, selling, and navigating intricate real estate matters not only bearable but enjoyable. The collaboration seemed seamless, which attests to the skilled and amiable nature of the personnel. This led to numerous successful transactions that were remarked upon for their smooth execution, echoing a sense of pride and satisfaction from the users.\n\nThe company’s local market knowledge is another aspect that has been given high marks. Agents’ understanding of the complexities of the Bellingham real estate market has been instrumental in helping clients find and secure their desired properties. Users felt well-informed and equipped to make decisions, thanks to the detailed guidance provided by the John L. Scott Real Estate team. Also, the company has shown a high level of adaptability, efficiently navigating market changes to the clients' benefit.\n\n## Bad\n\nDespite the high average review score and a raft of positive comments, there were a few areas where the company received criticism. Some users felt that there was room for improvement in the realm of client-agent communication. While the company was praised for responsive communication, this wasn’t a universal experience, with a handful of reviewers indicating a desire for more timely and informative updates during their transactions.\n\nAnother area that seemed to warrant attention was the handling of high-stress situations. A couple of reviewers indicated that, while the company was generally deft in managing sales and purchases, there were instances during particularly nuanced or hurried transactions where they felt the support could have been more robust or empathetic.\n\n## Ugly\n\nIt is a testament to the company’s reputation that there were no significantly negative incidents reported in the user reviews made available. There was an absence of any \"ugly\" experiences shared by users, suggesting John L. Scott Real Estate | Bellingham maintains a high standard of service consistently.\n\n## Conclusion\n\nIn conclusion, John L. Scott Real Estate | Bellingham has largely been met with acclaim from its clients, highlighting their professionalism, exceptional real estate knowledge, responsiveness, and the ability to foster pleasant client relations. While there are rare criticisms of communication and managing high-pressure transactions, these do not heavily detract from the overall positive sentiment. This article has outlined the sentiments of past clients and hopes to assist you in making an informed decision when considering their services. Remember, the reviews in this article are generated by ChatGPT and are intended to be a tool to help find a property management company or rental property.\n"
}