{
  "name": "Lark Bellingham",
  "review_count": 57,
  "avg_rating": 1.8,
  "adjusted_review_count": 57,
  "reviews": [
    {
      "author": "Allie S.",
      "rating": 4.0,
      "review": "This place is great. It has tons of amenities and free coffee is always a plus. The only down side is that if people are hanging out in the court yard it makes everything very loud.",
      "ownerResponse": []
    },
    {
      "author": "Danielle L.",
      "rating": 4.0,
      "review": "NXNW is a beautiful site, with the most luxurious amenities. The maintainable staff is outstanding and is not thanked enough for their never ending hard work. I think some of the managers are not the kindest or easiest to work with, they are sales people, but over all, I cannot imagine living anywhere in Bellingham after living in such a beautiful community.",
      "ownerResponse": []
    },
    {
      "author": "Kim R.",
      "rating": 1.0,
      "review": "I wish there was a zero star...alas but I have to give one.  My son lived there for a year.  Early spring before move out in August he kept getting hammered to sign a lease for the next year.  He did so and then they told him he did not qualify without a co-signer.  I got an email to co-sign for him.  I called them in less than 24 hours after he signed and asked that it be cancelled as he did not qualify and I was between jobs at that time and was not in a position to co-sign and I felt like he could do better than the outrageous rent he was paying there.  The person I spoke with said no problem it would be cancelled.  I again asked, \"so I will not be getting a final fee for this at move out?\"  Rep--\"oh, definitely not m'am we will tear it up\".  Even though I provided multiple emails and told them about this conversation I had to pay over 500 bucks or they were going to turn him and myself into collections.  They also charged for an HDMI cord that never existed.  Run, don't walk, away from this place.",
      "ownerResponse": []
    },
    {
      "author": "Lynne D.",
      "rating": 1.0,
      "review": "Please be wary of the pressure tactics used by NXNW on these young inexperienced college students.  My child was high pressured into re-signing a lease for another year thinking there was a way to easily back out.  The price was hiked up without his knowledge as well.  There is NO CANCELLATION POLICY once you sign a rental agreement.  NO WAY OUT.  As the guarantor (I pay the rent, not my kid), I was contacted by email AFTER the 72 hour period where we could have legally gotten out of the contract, asking me to sign the new lease, which I find very suspicious.  The staff was very friendly when it came to seducing us on leasing an apartment last August for the first time but, now, after my child unwittingly renewed the lease and we notified them of the misunderstanding, their \"customer service\" took a complete 180 degree turn.  NXNW is owned by a large corporation and staff has obviously been trained in this strategy of high pressure sales and retention, then once a contract is signed, they behave with complete inflexibility if a misunderstanding has occurred in dealing with the young and inexperienced tenants.",
      "ownerResponse": []
    },
    {
      "author": "Morgan P.",
      "rating": 4.0,
      "review": "a nice modern living space for a decent price, NXNW is a pretty nice place to live for a student. Not only are there various amenities at our disposal, but all students can ride the shuttle bus back and forth from school, saving $$ on transportation. the free coffee in the game room is a nice addition. Honestly just having my own bathroom is a blessing in itself. Maintenance is always there to fix any issues that come about.",
      "ownerResponse": []
    },
    {
      "author": "Kendra D.",
      "rating": 4.0,
      "review": "Everything seems to be very good, except I don't like that the tanning beds are included in our rent since I never use them and never will. However, I do really like that the staff is nice and very helpful! The club house is also super awesome by including a mini market, free coffee, a 24hr gym, computers, and plenty of space to hang out with roommates and friends.",
      "ownerResponse": []
    },
    {
      "author": "Sidney N.",
      "rating": 5.0,
      "review": "So far I,ve had a great experience with the NXWN apartment buildings. Everyone who works there is super kind and ready to answer any questions or concerns you have!",
      "ownerResponse": []
    },
    {
      "author": "Clark D.",
      "rating": 1.0,
      "review": "I lived here for multiple years in undergrad. Parking was always ABYSMAL, multiple times the \"secure\" package room was broken into (a friend of mine lost multiple hundreds of dollars worth of contents and was not reimbursed), and having a kind staff member interaction is a rare occurrence.\n\nThere are so few reason to live in these hospital room looking apartments that were NOT clean when you move in that I struggle to identify a positive reason to live here unless the ONLY alternative is the sidewalk outside (then I would have to think on it)\n\nRenting from this place is setting yourself up for failure, I can honestly say that paying a hundred more dollars for ANYWHERE else is more than worth it to save yourself from such a horrendous and predatory tenet experience.",
      "ownerResponse": [
        {
          "text": "Hi Clark, thank you for taking the time to leave your feedback. We regret to hear of your concerns, and we sincerely apologize for the experience you've described, as this does not meet our standards. We would appreciate the opportunity to discuss these items with you directly if you would reach out to us at Live@Larkbellingham.com."
        }
      ]
    },
    {
      "author": "Beth C.",
      "rating": 1.0,
      "review": "DO NOT RENT from this company!! Do not sign a contract because even if you do not qualify to rent from them, they will charge you for an entire year of rent even though you NEVER move in. They offer a sketchy 3rd party guarantor that is how they get you. I turned them in to consumer fraud through the state and working with the BBB. Please beware. I don't want other families to go through what our daughter has gone through.",
      "ownerResponse": [
        {
          "text": "Hi Beth, we are sorry to hear that your experience has not lived up to your expectations. We do offer multiple methods to qualify to live here, including guarantors, credit and income qualifying on your own, or paying an administrative fee. Even so, we understand that sometimes plans change even after contracts are signed, so we have a couple of options to meet your contractual obligations if you choose not to move in. Feel free to reach out directly at Live@LarkBellingham.com if you would like to discuss these options or if you have any specific questions we can help you with."
        }
      ]
    },
    {
      "author": "Eleni W.",
      "rating": 1.0,
      "review": "Be extremely cautious when trying to rent a unit from them!\nI'm currently locked into a contract with them even though they refuse to allow me to rent due to a past missed payment on an old electric bill from years ago, which has already been paid for. I told them, after months of trying to move past that issue and trying to find alternative routes to rent the room (their only other options were to get another person to guarantor me or guarantor with a sketchy 3rd party, neither of which were an option for me), that I was no longer interested in renting with them if they were going to make things so needlessly complicated. Their response was that I needed to find a new person to take over my lease (I have NEVER in my life ever heard of this practice when renting from an apartment before.)\n\nFrom what I've been told by my partner, who I was going to room with, was that spot has already been taken over by a new person, and they were able to do it relatively quick too. If you guys can fill a room yourselves no problem, then why do you make the potential renters take on the responsibility once they sign a lease and can't move in? It doesn't make any sense.\n\nNow, I'm getting past due rent reminders every so often, stating that I owe thousands of dollars worth of rent for an apartment that I was never even able to get in the first place. It's complete madness. This was even after I got a hold of management and tried to sort out the rent due issues. It's been nothing but phone tag, being forgotten about, and being ignored by them countless times. \n\nBesides that headache, every time I've gone to visit my partner at this place last summer, there seems to be problems. He can almost never find a decent parking spot during certain hours and has to resort to parking at Fred Meyer (which they eventually wrote a letter to their tenants saying that they were no longer allowed to park there, leaving many to park outside the gates sometimes), there are sometimes MOUNTAINS of trash piled up outside the waste bins, other tenants are loud and party during the odd hours of the night and there's animal waste everywhere.\n \nIf they treat potential renters this unfairly, I can only imagine what people who have lived here long term must experience. \n\nMaybe just look elsewhere.",
      "ownerResponse": [
        {
          "text": "Hello Eleni, thank you for taking the time to share your feedback with us. Our financial qualification guidelines have been designed with students in mind. We understand that prospects might have little or no credit history, which is why we offer a guarantor option. We are always excited to add new members to our Lark Bellingham Community, but we also know that sometimes plans and circumstances change. For this reason, we have a couple of options available to release you from the legally binding contract and financial obligation associated with signing a housing agreement. Feel free to call us at (360) 778-1500, or email us at Live@LarkBellingham.com if you have any other questions."
        }
      ]
    },
    {
      "author": "Jon B.",
      "rating": 1.0,
      "review": "This place is such a scam don't let you child rent from this place they will scam them because they are young Becky the manager is part of it she just say there is nothing we can do but place other people's debt on your child's name and they know it is not her bull they just want someone to pay will be taking all party to small claims court recommend don't rent from here they will scam you and probably thousands of other people",
      "ownerResponse": [
        {
          "text": "Hi Jon, we are sorry to hear that your experience with Lark Bellingham has been anything less than satisfactory. Please reach out to us at Live@LarkBellingham.com so that we can discuss your outstanding concerns and ways that we can improve our customer service in the future."
        }
      ]
    },
    {
      "author": "Maegan B.",
      "rating": 1.0,
      "review": "As a resident, I only am staying cause I have a lease and can't break it. They don't care if you're with a bad roommate or that they have a homeless dude living on the couch every night cause they just claim them as a guest. They will charge you for everything and anything they can. I would never in my right mind advise anyone to live here",
      "ownerResponse": [
        {
          "text": "Maegan, we are sorry to hear of your concerns, but we are glad to welcome you back home this year. We'd appreciate the opportunity to further discuss your concerns so that we may work toward providing a better experience for you. Feel free to reach out to Live@LarkBellingham.com and let us know how we can make this year a great one, or drop by our office for a chat."
        }
      ]
    },
    {
      "author": "Dallas H.",
      "rating": 1.0,
      "review": "Probably the worst experience I've ever had. 2 shootings in the span of a few months. Staff is rude. No parking. Homeless constantly prowling and breaking into cars.\n\nMaintenance has come into my apartment and room Multiple times without announcing themselves.  \n\nI love how the trauma I have from SWAT walking outside my window with guns drawn and pointing them into my apartment because of a shooting wasn't taken seriously.\n\nNora constantly lies and makes things up because they're either ignorant or think because they're the GM, they can say whatever, \n\nThis place is money hungry. I havnt seen green grass since last august, and now suddenly the grass is green again for move in and tours? \n\nSave yourself the headache.",
      "ownerResponse": [
        {
          "text": "Dallas, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to hear of the challenges you have faced while living with us and we would love the opportunity to hear more about your individual experience. Please don't hesitate to reach out to us at (360) 778-1500 or live@larkbellingham.com."
        }
      ]
    },
    {
      "author": "Javin H.",
      "rating": 1.0,
      "review": "this place has terrible management that just wants to take advantage of students and their parents. First coming to Lark I was told via email contract and phone call that I would receive $200 off my rent for the time period of one lease. they only gave me one month and claimed it was an error. they also force tenants to have a guarantor and if they don't have one they will offer a terrible third party company. They told my partner this after her lease was signed and she was given a move in date. they denied her the apartment and later asked for the whole years worth of rent. even after they immediately filled the space. terrible here. don't give them any of your money.",
      "ownerResponse": [
        {
          "text": "Javin, thank you for taking the time to leave your thoughts with us. We do offer concessions to all of our residents, and the amount of your concession is determined by when you sign your housing agreement. The earlier you sign your contract, the higher your concession will be. Additionally, our contracts state the full amount of the concession, as well as the way that the concession will be applied monthly. We apologize for any confusion and would appreciate the chance to speak with you directly. Please feel free to reach out to us and we will happily go over it with you. 360.778.1500"
        }
      ]
    },
    {
      "author": "Makena M.",
      "rating": 1.0,
      "review": "My roommate and I will be going on our second year living here and the only reason we renewed our lease is because we were told if we did (very early and months in advance) that our rate would stay the same as we had a discounted rate for applying when we did. Our rent was increased by 30$ with no notice or explanation.\n\nWhen you move in lark says a cleaning company comes into the unit and cleans it, this is either the worst cleaning company ever or a bald faced lie. there was dust everywhere, the bathroom was disgusting and the floors. THE FLOORS. I had to get on my hands and knees and scrub them for hours. After going over them maybe 3 times the water kept coming back disgusting. Due to the color of them you can't see the dirt but trust me it's there. My bathroom door is missing a latch strike plate (I think thats what it is) also the rubber that separates my carpet from the living room constantly comes off and isn't attached. \n\nThe apartment two floors below me consistently has EXTREMELY loud parties at 2-6 am and when I've emailed and submitted noise complaints I have gotten absolutely ZERO response. Anytime I try to contact them they are extremely unresponsive and don't actually help with anything. \n\nSomeone literally got shot amongst other things/ injuries that happened at a raging party and they literally did nothing. Some of our friends literally had people begging to come through their window because they were running from the party. They sent out a crappy letter that addressed nothing and then they got the cops called on them AGAIN at another party and all lark did was take away our gate code which just caused a million more problems and inconveniences than it solved. I think they did end up moving out but they should have been evicted immediately after the first incident.\n\nThe parking is an absolute nightmare. You pay 45$ a month for a \"reserved pass\" to park in the reserved spots and so you're \"guaranteed a spot\" and yet when people with the resident passes park there they do NOTHING. AND if you get home after like 8pm good luck finding a spot anywhere near your building if at all. If I had known parking was just a free for all I wouldn't have paid the 45$ and just parked wherever I wanted because apparently that's ok. Apparently we are getting assigned spots for reserved people. Excited to see if I get a spot anywhere near my unit. \n\nWe were having problems with our circuits and our breaker would flip up to 8 or 9 times in a night and we requested maintenance many times and he was the most unhelpful unknowledgeable man ever. It took like 3 months for them to finally get someone who was able to help us identify and fix the problem. (We also weren't the only people with breaker issues) \n\nNot to mention the washer and dryer included in the unit are absolute trash. My clothes have been pilling so badly and it's really ruining the quality of them. The dishwasher isn't great either. Yes it's nice to have them included but I  just thought for how much we are paying my clothes wouldn't be getting ruined and my dishes would be clean. I also had to unclog my own sink and fix my garbage disposal with my dad on the phone. gross. \n\nWhen we moved in we had issues with our wifi and lark was no help, they just told us to go to xfinity and figure it out ourselves. When we finally got it figured out and got a new modem a couple weeks later lark had these incredibly large and inconvenient boxes put into all the units to replace the nice small one we had before and the wifi is worse than it was before. Also getting a device put onto the wifi is now a bigger annoying process that you have to go through the website to do. \n\nUnfortunately the apartment below us caught on fire a couple months ago and luckily everyone was ok. The only issue is the fact that there are people doing construction from 6 or 7am until literally 11pm. Frequently. And its been happening for a while I'm not sure how they aren't done yet. \n\nThe garbage is also an issue. It's like they don't know how many people they have living here and how to accommodate correctly. The garbage spills out of the compactor a lot into a big pile and once I was taking my garbage down and since the thing was full there was a huge pile so I put my garbage on the pile as it was the only place to put it and someone on a golf cart came around and told me \"we don't leave our garbage on the ground here\" um sir where else should I put it. I'm not going to just leave it in my apartment until you decide to take care of it. \n\nThey are pet friendly but in the pet contract it says you have to declaw your cats which is not only incredibly inhumane but just messed up. I obviously did not declaw my fur babies and I'll gladly pay for a new, sh*tty couch, if need be. \n\nOne of my friends worked for them for a while and said they've already been reported to the better business bureau multiple times. Speaks for itself. \n\nSo yea, I don't recommend living here.",
      "ownerResponse": [
        {
          "text": "Makena, we appreciate your feedback and review of your experience at our community. We are sorry to read that your experience has not been as you expected. If you would e-mail us at live@larkbellingham.com, we would be happy to discuss your concerns further."
        }
      ]
    },
    {
      "author": "Brenda W.",
      "rating": 1.0,
      "review": "Lark was the most horrible experience I have ever had. Please go somewhere else!! Amount many other things, the management was deceptive, the manger promised one unit during tour and confirmed with email. But when moving in, a totally different unit was given.",
      "ownerResponse": [
        {
          "text": "Brenda, thank you for taking the time to provide your feedback to us. We regret to hear that you have not had the best experience here at Lark Bellingham. We aim for all of our residents to have the best experience and would love to further discuss any issues you've faced while living with us. Please feel free to reach out to us at live@larkbellingham.com so we can discuss how to make this right."
        }
      ]
    },
    {
      "author": "Mercedes N.",
      "rating": 1.0,
      "review": "The worst place to live! They towed my car, charged me $1,600 on my account and didnt explain the charges, threatened to have animal control take my cat even though they are pet friendly, and they will NOT terminate a lease under any circumstances. They are dealing with several lawsuits right now and they claim they are \"student apartments\" when they are not affiliated with the college AT ALL.",
      "ownerResponse": [
        {
          "text": "Mercedes, thank you for taking the time to share your experiences at Lark Bellingham, we are extremely sorry to hear of the challenges you encountered and would love an opportunity to discuss your individual experiences. Please do not hesitate to reach out to us at (360) 778-1500, live@larkbellingham.com, or by visiting our leasing office. We look forward to hearing from you."
        }
      ]
    },
    {
      "author": "Jennie A.",
      "rating": 1.0,
      "review": "Where do I even begin--Lark seems nice at first glance, just like how any place that calls themselves \"luxurious\" should look like. They draw you in with fancy amenities, spacious rooms, their location being close to the WWU campus, etc. That's all a faade for how horrible this company is at managing a so-called student living complex.\n\nLet me start off that when I moved in, I put in a roommate application saying I would prefer to live with someone who is female and generally keeps themselves and their living environment clean. What did Lark match me with? The exact opposite. They assigned me a male roommate, when I explicitly said that I only wanted to live with females and living with a male would make me uncomfortable. My male roommate was also extremely unhygienic and incompetent, since he didn't seem to know how to pick up a broom and sweep the floor.\n\nWhen I first moved in, he was already living there for a year prior. The place stunk with a foul stench, the kitchen was horrendously dirty, and the floors were unable to walk on barefoot due to how much grime was covering the floor. When I arrived at my bedroom space, the toilet was covered in dried up urine, the carpets weren't vacuumed and I didn't even have a screen installed to my window. I thought to myself, this is what I'm paying close to $900 for each month? In this kind of living condition? And Lark didn't even do anything about it.\n\nAlso they invade your space every week or so, emailing you that they'll be doing some sort of \"maintenance\" that involves trespassing into your apartment. Also, if no one is home, they'll just barge in anyways. Isn't that illegal or something for landlords to enter into your place without your permission? Whatever.\n\nGood luck trying to break your lease if you don't want to pay upwards of $2,500 to mitigate the loss on their end. For a place that calls themselves student living, they're not very accommodating to their own residents, whom they know are college aged and have issues pertaining to life circumstances, ESPECIALLY during COVID-19 where students would rather live with their families instead of their disgusting roommates.\n\nMy roommate left me with a giant mess to clean up on my own. The absolute worst experience with a roommate I've ever had--and that's on Lark for assigning him to me.\n\nI didn't have an issue with parking spaces as I always had a spot close to my building, but that's probably due to not enough people living inside the units. I've walked past several ground floor units where the bedrooms are not occupied, which tells me they're struggling to find gullible students to fill in the spots.\n\nLark is so desperate for new residents that they've contacted people on instagram via direct messages that have \"WWU\" in their bio and ask if they're interested in signing a lease with them. They've also emailed residents and offered free items, food and accommodations to those who leave good reviews on google. How disingenuous and pathetic.\n\nDon't forget the absolute ridiculous astounding charges they slap you with after you move out--either pay those soon or they'll send you to collections! I left my apartment cleaner than when I moved in and they still charged me over a whopping $250 for a \"deep clean of the kitchen & living room\" even though I cleaned that place spotless before I moved out.\n\nThey also charged me well over $150 to \"repaint\" all the holes from tacks in the walls even though I had hung up one poster and the rest of it was already there from the previous tenant. All Lark does is charge their residents for maintenance, cleaning, and repairs and then don't actually repair or clean the place at all. They just pocket the money.\n\nThe only good thing about Lark is the student-led staff in their main office--they're somewhat kind and accommodating to your questions and concerns, but the other managers are a nightmare.\n\nDO NOT live here--even if it's your last choice. Just like everyone else who left a nasty review, this place deserves ZERO stars. Avoid this place like the plague, or reap the consequences.",
      "ownerResponse": [
        {
          "text": "Jennie, we are extremely sorry to hear of your negative experiences with roommate matching at Lark Bellingham during your time living here. As a student housing provider who offers per room leasing, it is always our upmost intention to match you with a potential future best friend and apologize that we did not meet this goal during your occupancy. We would greatly appreciate you reaching out to us via phone or email to share your individual experience and to offer us any advice on making Lark Bellingham the best place for students to call home in Bellingham."
        }
      ]
    },
    {
      "author": "Aliyah Z.",
      "rating": 1.0,
      "review": "Apparently my review was deleted. Would give 0 stars if possible.\nLived here for 2 years and management turned into a joke a month after move in.\nParking is a nightmare. And they tow residents cars. \nApartments and furnishings are so cheaply built.\nHave electrical issues, as the breaker constantly flips.\nTrash is everywhere\nAmenities are always closed (even 1 1/2 years without the shuttle)\nNot ESA friendly (which isn't legal).\nWay too much money for what you get.\nThey tried to charge me at move out for a bunch of things until I sent them back the lease agreement and correspondence about damage from original roommate.\nEveryone in Bellingham knows the gate code, not that they'd need it to get in the gate (which frequently was stuck open)",
      "ownerResponse": [
        {
          "text": "Hi Aliyah, thank you so much for taking the time to express your concerns and frustrations, so we can help resolve these challenges for you. We're sorry to hear you have had some difficult experiences during your time as a resident here, but glad that we've been able to speak with you directly to assist with all your concerns.  We closely follow Washington Law to provide accommodations for anyone with disabilities. These requests are addressed directly by our attorneys who are trained specifically in Federal Fair Housing Law as well as state laws. We are happy to speak with you directly if you have any questions about this process."
        }
      ]
    },
    {
      "author": "Holly C.",
      "rating": 1.0,
      "review": "I wrote a review on here a year ago and took it down because I wanted to give them a chance to turn things around for my second year of leasing since there was a major staff change. I'm not surprised at all that very little has changed.\n\nLet me just start by saying Lark Bellingham totally takes advantage of college students. The marketing is aggressive, they prey on you through social media (AND I was even told that they use social media to match roommates together - which is completely unethical). The system of renting through individual leases is just one of the many loopholes this place uses to abuse tenant's rights and unfortunately, many college students are just trying to get their first place on their own so we fall victim to it.\n\nMy first year here parking was a nightmare. I would get home late from work and have to park at Fred Meyer when it was very dark outside and walk over because there wasn't a single spot available. This is how they get you to pay the extra $40 a month for a Reserved spot. I witnessed so many college students get towed for parking at their own apartment complex. This year, I gave in on paying for a spot only to have nothing enforced and lots of parking available since there were so many vacancies during the pandemic. I could have saved thousands of dollars on this pass. \n\nThe \"security\" does not exist. Wait... let me correct myself. They do exist, but they sleep on the job and can't actually respond to calls about safety. Yes, I witnessed a security guard sleeping in their car last year after cars were broken into. \n\nThere was a good month and a half where my packages would continually \"go missing\" since they are delivered to the office and not straight to our door. The old manager here tried to convince me I was lying and then 2 weeks later my package magically reappeared. \n\nWhen it came to having roommates on this individual-lease system, I got completely screwed over. My old roommate worked for the complex and told me many times that she would be the one picking my roommates for this year, told us that she memorized our phone numbers, and would speak poorly of other staff members and residents while in our unit. I ended up being alone this year after I raised concerns about my safety given that my privacy was violated, but now only 4 weeks from me finally moving out of this place, I received 6 days notice that I would be getting a roommate and only 17 hours notice that someone would be entering my apartment the following day. The staff was nice enough to follow the law and wait until 24 hours+ to enter after I raised my concerns, but did nothing about giving me very little time to make arrangements for the person moving in with me. \n\nThe new staff members are very kind and try their best to be helpful, but it seems like they don't really have the right training to provide guidance to residents. I feel bad for them because it really isn't their fault, but it's also difficult to be paying $800+ to live here and not have great resources when it comes to the leases and issues with the space.\n\nAlso, be aware if you move here that the power seems to go out more than anywhere else I've ever lived. So stock up with flashlights and portable chargers. \n\nOh, and they bribed residents with pizza if they left a good review for them on Google.\n\nI will also add that all the responses from Scion seem to just be trying to delegitimize the negative experiences shared by other residents.",
      "ownerResponse": [
        {
          "text": "Hi Holly, thank you for addressing your concerns with us. We completely understand your frustration with these situations. It is always our top priority that our residents feel comfortable in their homes. Our team has worked with you along the way in an attempt to assist you through the obstacles you have faced, but we apologize that our actions did not remedy the situations. We appreciate your feedback in stating your concerns, and are always here should you want to reach out to us in the future (360) 778-1500."
        }
      ]
    },
    {
      "author": "Casea S.",
      "rating": 1.0,
      "review": "Edit: I - like my husband - do not answer to my legal name and thus do not have my legal name listed through my account. I have emailed Scion to clear this up. Haven't heard back from them at all. My roommate has also been trying to pay for damages and get some disputes resolved for a month now and has yet to have them resolved, which has prevented us from finding a new place to live. \n\nI lived here for two years. During that time, the office staff was transphobic, incompetent, and rude. They often misgendered my husband and called him by the wrong name, even after multiple attempts to correct them. One of the staff there, Selena, was particularly malicious and seemed to make it her personal mission to make our living experience there terrible. Throughout our every experience with her, she never once showed my husband any ounce of respect in his gender identity. Keep in mind, he goes by his middle name. It is LEGALLY his name. There is no excuse for their dismissiveness on our request that he be called by the correct name.\n\nOnce, he ordered something online and though he knew it was there, office staff insisted it wasn't. He had ordered same sized products from the same company before. They were always only delivered to the office. The staff, moments later, SHOVED into our open mailbox for us to collect.\n\nThe printer in the computer room was known for not working very often. The computers sometimes didn't work either. \n\nWe were once accused of not picking up after our dog, the official story being that someone tried calling after my husband to get him to clean up, but that my husband ignored them. Not only did nobody ever talk to him about his dog, but it wasn't even our dog. He was our roommate's dog, so they should have contacted her. Not him.\n\nThe outdoor amenities weren't what we expected. The hammocks were sometimes broken or missing. We found a few times that the grills were left on at night leaking propane. At one point, the fire pits wouldn't even turn on and I have no idea if that ever got fixed.\n\nDog trash cans were frequently overflowing and empty of any bags, sometimes left that way for weeks. \n\nThe dumpsters tended to overflow too, piles of trash and recycling so high you couldn't even get through. \n\nThe quarterly inspections were often unorganized and sometimes rescheduled to the day after they were supposed to have been done, which was incredibly inconvenient for us. \n\nDuring one of the inspections, they had trouble opening my bedroom door. I told them of they just lift the handle up instead of pushing it down, it opens just fine. A few days later, unbeknownst to us, maintenance came by because they were scheduled to fix it. After the inconvenience of the late inspection, the unwanted and spontaneous presence of maintenance was especially frustrating. \n\nAnother inspection happened on Halloween. I had to cancel my plans. My pets don't deal well with strangers coming into our home and I didn't like the idea of them entering unsupervised. So, with my plans canceled, we waited around for hours. I kept calling throughout the day, getting a different estimated time of when they would be getting to my building. No one seemed to be certain or even know what building they were currently working on. By the end of the day, NO ONE EVEN SHOWED UP. I called the manager and left an angry voicemail. The next day, I get a call back with the manager saying that they simply ran out of time, something I already knew because that was blatantly obvious. The worst part of it was that I didn't get an apology. The call was just a condescending excuse for them not doing their job correctly and having little consideration for their tenants.\n\nWhen we worked late, there was often no parking at all. We frequently had to park at the Fred Meyer parking lot. They advertise \"free parking\" but don't have enough parking spaces for everyone, so that's completely misleading. Even people who pay for RESERVED parking can't find spots at the end of the night!\n\nThere was a hole in the fence that led out to the Fred Meyer parking lot. It was continuously broken open again whenever it was repaired. The smart thing to do would be to put a gate there. (But it's Lark. They aren't exactly smart.) It's the least they can do for the people who aren't able to actually PARK in the Lark parking lot and have to walk around the fence in the middle of the night just to get home. But whatever. Keep wasting money replacing it, I guess. \n\nThey call themselves \"luxury apartments,\" but don't bother to even put backsplash in the kitchen or proper insulation in their walls. You can hear everything your neighbor does and the entire apartment is freezing during the winter.\n\nThis is by far the worst, most poorly managed place I've ever lived. Do not live here. Believe me, you'll regret it.",
      "ownerResponse": [
        {
          "text": "We are concerned about your report of a negative experience at our community.  We are unable to locate any record of you as a current or previous resident. If you would e-mail us at live@larkbellingham.com, we would be happy to assist you further as these experiences you stated are a concern for us."
        }
      ]
    },
    {
      "author": "Grayce P.",
      "rating": 1.0,
      "review": "My experience here was horrendous. not only was practically everything they advertised a lie, but my apartment practically fell apart. There was a leak in the ceiling and it cause my kitchen ceiling to cave in. The maintenance team was not kind, and i was left with gigantic holes in my walls and ceiling because the team 'FORGOT' they were supposed to fill the holes. Management feels entitled to the space you occupy, and barely give you any time to answer the door, they will just walk right in. Kyle, the property manager, makes it his goal to swindle college kids into giving them more money. Parking is not free, it's an additional 50 a month and your spot isn't even guarantied. i think there's about 7-10 guest parking spots for a complex with literally over 700 residents. and THEN they have the audacity to just stick towing stickers to everyone's windows. also, if you have a roomate move out, get ready for maintenence to stain you furniture with their god awful fugly turquoise paint.",
      "ownerResponse": [
        {
          "text": "Grayce, thank you for your feedback. We are sorry that your experience didn't live up to your expectations. Our team works hard to address issues in the most timely and courteous manner possible. We will continue to keep working to make sure that the Lark Bellingham experience is a great one. We'd appreciate the opportunity to connect with your to discuss your concerns further and work toward improving your experience with us. Please feel free to reach out to us at (360) 778-1500."
        }
      ]
    },
    {
      "author": "Em T.",
      "rating": 1.0,
      "review": "Please do not rent from here. They advertise as off campus housing. They claim to be pet friendly. They aim for an aesthetic that isn't true. They also pressure you into signing another lease less than 3 months after move in. They provide all these \"community\" activities during \"move in month.\" After that month is over, they reduce activities and ask for residents to help contribute to resident activities and morale via providing their own games and etc. \n\nAlso, there is bunny poop everywhere. The grounds are only green during the tour and move in month. They sprinkle pesticides around plants that aren't pet friendly. They allow pets to be off leash. They allow trash to be left everywhere. \n\nAnother issue is that there are drugs being sold here. Cops constantly being called...\n\nPlease do not make the same mistake I did!\n\nEdit: you do not host 5 events a month and last time I tried to communicate my issues, Nora attacked me personally and acted like a psycho. Kellie, you don't even work at this location. You're just the community outreach for a lot of their apartments in multiple locations. No ty!",
      "ownerResponse": [
        {
          "text": "We are extremely sorry to hear of your negative experiences with Lark Bellingham. Our team aims to exceed the expectations of our residents by providing a wonderful place to live, fair and consistent policies, and hosting five resident events each month. We would greatly appreciate you reaching out to us via phone, or email, in order to address to your concerns and for you to offer any advice that would ensure Lark Bellingham is the best place for students to live in Whatcom County. "
        }
      ]
    },
    {
      "author": "Justin G.",
      "rating": 5.0,
      "review": "Loved here for 4 years the the staff are amazing. The place comes with a gym, study space, free coffee, and with your own room/bathroom! Recommend living here!!!",
      "ownerResponse": [
        {
          "text": "Hi Justin, thank you for taking your time to share your experiences at Lark Bellingham. We are so happy to hear of your 4 years of loving Lark! Providing our residents with great places to live, along with experiences that make Lark Bellingham the best place for students to live in Bellingham. We hope you continue to use all the great amenity spaces during your last year.\n"
        }
      ]
    },
    {
      "author": "Emily D.",
      "rating": 1.0,
      "review": "I lived here for approximately a year and a few months. I can honestly say this is one of, if not the worst places I've ever lived. I have waited a full year before writing this review so that my anger could subside and I could be concise, but this is still a lot. The prices are insane, and they are very aggressive in forcing you to sign and resign your lease. Our lease started in September and by October they were already egging us on to signing another year. So, we did, because we didn't want the prices to go up...what a mistake that was. \n\nWe all ended up moving out early because of the pandemic. But before that, we witnessed so many things that made none of us want to return. \n\nThe people who lived above us would constantly have parties late into the night, sometimes as late as 4 or 5am on a weekday. Blaring music and the sounds of moving tables, beer pong, and fireworks were just some of the noises. We would call security and nobody would pick up, or nothing would happen. Parking was also a nightmare, we bought reserved spots but even then if you came home after 5pm it was nearly impossible to find a spot (this was before the pandemic). The shuttle is an absolute joke- you would not only have to wait in line (most of the time in the rain because it's Washington) but there were hardly ever enough seats. It also would be shut down randomly so you'd have to find another form of transportation to get on campus, which normally is fine, except for the fact that the shuttle is advertised as a main selling point for the complex. The dumpsters were always overflowing and never seemed to be emptied. All of the amenities were a sham.\n\nThe other thing that was always incredibly frustrating was the front desk. I get it, college students need jobs; but they were never trained well and could never answer any questions you would have as a tenant- they were trained to get people to sign leases. That's it. \n\nAll in all, I urge you, do not get stuck in the trap that is this place. Their leases prey on innocent young students just trying to find a place to live.",
      "ownerResponse": [
        {
          "text": "Emily, we are extremely sorry to hear of your past negative experiences as a resident of Lark Bellingham. While we have been hard at work over the last 12 months to make Lark Bellingham the best place for students to live in Bellingham, we would love a chance to speak with you regarding your individual experiences. We have attempted to reach out to you via phone and would greatly appreciate a return call, (360) 778-1500, or email."
        }
      ]
    },
    {
      "author": "Jessica H.",
      "rating": 1.0,
      "review": "If I could give no stars I would. I have lived here for 2 years and have had nothing but trouble. The office is ran by college students who are little to no help. It is way too expensive for the quality. The gate is a joke. It is open all day allowing anybody to come in which is why so many people have had things stolen. There is never any parking except during this global pandemic. Quiet hours are a joke that they tell you to deal with yourself. The maintenance people don't know anything about what they are doing and end up incorrectly fixing it so it breaks a week later. I have attached a few pictures of inside my apartment damage. There are lots of other damages as well I have a whole Google drive of damages because they try and price gouge you at any turning point at move out unless you call them out. I have also attached a photo of damage to the side of building 807. Absolutely the worst place I have ever lived.",
      "ownerResponse": [
        {
          "text": "Jessica, thank you for taking the time to share your concerns regarding living at Lark Bellingham. It is always our utmost priority to provide or residents with the best community possible. We have reached out to you via phone in hopes of further discussing these concerns. We would love for you to give us a call back at (360) 778-1500, or swing by our office to learn how we can make Lark Bellingham the best place for you to live."
        }
      ]
    },
    {
      "author": "Kate D.",
      "rating": 1.0,
      "review": "Predatory apartment complex. They appeal to younger individuals who may not know what should be expected of them. I signed a lease thinking I wouldn't need to move out, which all college students believe. However life happens and Lark allows no flexibility when it comes to moving out. \n\nStaff will do their very best to avoid you if you need to move out. I got married in the middle of the school year and decided to transfer to an online school since my husband is in the military. I planned on moving in with him in SC. While I understand I signed a lease, no one in the office wanted to help start me with the move out process and there was zero communication. I sent emails, called the office and showed up yet it took weeks to hear back from them. I genuinely only think I was able to move out because of luck, and because my parents called and yelled at staff. There was also a point I was sent a refund, and they shorted me. I had to remind them how much I was supposed to get, THEN they sent me the proper amount back. \n\nDoesn't matter if you're 18-19, they will treat you like a child and avoid communication.\n\nSince moving out I have lived in 4 different apartment complexes around the US, and Lark will always be my worst experience.",
      "ownerResponse": [
        {
          "text": "Hi Kathryn, we regret to learn that you did not enjoy your experience at our community and felt that our staff didn't have your best interest at heart.  We work hard to provide a great experience for all our residents and guests, and will use your feedback as we continue to improve our communication.  If you have any further concerns or issues, please do not hesitate emailing us at live@larkbellingham.com or giving us a call. We would love to help you in any way we can, and wish you the best."
        }
      ]
    },
    {
      "author": "Kassy P.",
      "rating": 1.0,
      "review": "If I could give 0 starts I would. I had such a horrible experience here. It started out nice when the good managers were there but the 2nd year was the start of the downward spiral. I lived here from August 2016 when the opened to February 2018.\n\nLet's start with a few positive before I get to the real tea. The apartments are nice. It looks quaint with IKEA furniture and with a decent amount of storage place. Each bedroom is huge and comes with a desk, full size extra long bed with mattress and storage under the bed, a bathroom with a tub and a walk in closet. The roommate match is hit or miss it honestly just seems like a just placing people randomly.\n\nNow let's start spilling:\n\nThere's trash (a Fred Meyer cart on the 3rd floor) and dog shit everywhere (including in the sand of the volleyball court), there's only 1/3 free parking spaces and 2/3 paid but there are always empty paid parking spots but supposedly they can't sell the exact number of parking passes for the exact number of spots. I would get home at 11 and they would call me  in the morning saying if I didn't move they would tow me and I kept asking for a parking pass but they said we sold the max. One night they decided to tow people parked in the paid spots at 3 am without notice.\n\nThey wouldn't give notice to enter the apartment, and would just come in. My unit had shitty insulation and we could feel the cold air coming through the outlets and windows so our heating bill in the winter would be like $100-130 a person in a 3 bedroom. We had a roommate who stole prescription medication from my other roommate and I but they wouldn't help us and they wouldn't kick him out. People who didn't live here would be in and out at all hours through the gates because the access codes were posted online so you never know who would be in the GATED community. People would either be throwing parties or be ridiculously loud at all hours with no one doing anything about noise complaints. When I first moved there people were throwing fireworks into random apartments as a prank. My boyfriend's bike got stolen there (it was locked and everything) and management would not help us out at all. \n\nLet's not even get started with the 60 page airtight lease where it even says that you're not allowed to give negative feedback online while you live there. They are a greedy and selfish company. I was asked to vacate but here's the fucked up part, they made me still pay rent for the rest of my lease even though someone had moved into my room but since it wasn't a new lease and because no one would take my lease I had to pay 650 a month for 7 month ( which was the cheap because i locked in my price in January 2016)\nThey never really had any events like they promised (they promised every month but it was like once every 4 months). The printers a lot of the time were either out of paper or out of ink.\n\nTo everyone thinking about moving here, it seems nice online and on paper but it's run by the worse property management company ever being operated by the bitchest managers who would never be helpful. Honestly if you're gonna do something like this try Elevate Bellingham ( I never lived there but I had friends who did) which is clean, has even bigger spaces and a lot nice amenities for about the same price and owned by a different company.",
      "ownerResponse": [
        {
          "text": "Hi Kassy, thank you for sharing your feedback with us. We hope all our residents have a great experience at our community and are sorry to hear we did not provide that for you. We rely on feedback from our residents so that we can address concerns and improve the overall community and resident experience. \nPlease reach out to us at live@larkbellingham.com if you have further concerns we can address."
        }
      ]
    },
    {
      "author": "Gen B.",
      "rating": 1.0,
      "review": "When my former roommate moved out, Lark assigned me a new roommate. Online, I informed them that I cannot live with a smoker, but the new roommate smokes, which leaves an odor in the living room. Even though the smell makes me sick, Lark refused to do anything about it because the roommate doesn't smoke inside. They would not waive the $200 fee to move units or the professional cleaning fee to remove the smell, despite ignoring my health needs. At least they were polite about it. In addition, the furniture they provide is cheap and the floors of my unit are warped. \n\nManagement is awful. Flooding in an electrical room damaged my friends' unit, and all they did was plug in fans... using the tenant's electricity, which the tenants had to pay for. A lot of the units have a mold problem in the vents, too. They enter units for inspection without notice beforehand. The upsides of Lark is that the units are furnished, there's a bus stop right outside, and a shuttle service to campus for students... and that's about it. Look elsewhere for housing!",
      "ownerResponse": [
        {
          "text": "Genevieve, we are concerned to learn that you are not enjoying your experience to the fullest extent.  We understand that our Accounts Manager has been speaking with you in regards to your options about your roommate concerns. As always, based on our availability we are more than happy to transfer you to a different apartment on our property. The policies outlined state that we do not allow smoking inside the apartments.  If it is brought to our attention that smoking is occurring inside of an apartment, we would be more than happy to take proper action. As for any maintenance concerns, we always encourage residents to put in a service request, so we can address any issues you may be experiencing.  Mold is a common occurrence in the North West. We have included a section in our Housing Agreement that goes over the proper way to clean areas with mold. If someone sees mold in their apartment, maintenance is more than happy to assist them with proper clean up. We have attempted to reach out to you to discuss your concerns further, however we've been unsuccessful in reaching you.  If you would like to discuss your concerns further, please feel free to stop by the office or e-mail us at live@larkbellingham.com."
        }
      ]
    },
    {
      "author": "Lana A.",
      "rating": 1.0,
      "review": "Honestly, I would say avoid living here at all costs. Lark's management is entirely for profit, at the expense of your own well being, and I had several red flag issues while living there.\n\n1. Lark will bankrupt you if that what it takes to extract profit. The move out process is not friendly to the resident. During the winter 2020 peak of the COVID-19 pandemic I was unemployed and needed to move out. When I notified Lark of my financial hardship they did not respond with sympathy, they instead replied saying I owed the full balance of my lease, and they threatened that they would pursue debt collection if I couldn't pay. \n\nAdditionally, Lark is unwilling to take reasonable efforts to mitigate damages and re-lease your unit, which is a fragrant dismissal of state property law. When I explained to the leasing office management that I would be moving to Seattle for law school and if they didn't allow me to exit the lease I'd be paying double rent, the manager looked me in the eyes and said she was sorry that I would be forced into starvation but there's nothing she could due about the remaining balance on my lease, including moving the unit into someone else's name.\n\nFast forward to me being here in law school--I've paid off my debt to Lark and I am left $128 dollars to my name! Did I mention I'm in school and cannot work? Yeah, it's really nice that my credit score is still intact since I did not go into debt collection, but I am one utility bill away from total bankruptcy and starvation! I hope the Lark staff is having fun using my blood sweat and tears to redecorate the lobby every 6 weeks.\n\n2. Living at Lark is not safe for a young woman. I have had several near misses of sexual assault with Lark. There have been several occasions where I am in my individual room, with the door locked, showering or naked or in my underwear, and a maintenance employee has tried to gain entry. I remember once I had just gotten out of the shower, heard maintenance unlocking my room door, and had only seconds to grab a towel and throw my body against the door to stop the man from entering. I literally had to push against the door and scream as he was opening it so that he wouldn't see me naked. \nAnother time, in August 2020 an unidentified man entered my apartment and tried to gain entry to my roommate's room. This incident occurred during the turnaround time where Lark deep cleans units for new residents. Lark employs an off-site cleaning service, and they will be in your unit with the door open and unlocked for several hours at a time. A man who was not associated with the cleaning crew came into our house, walked past the workers, and tried to enter my roommates room. He hung around the unit, inside and outside, and waited for one of us to come out because I saw him watching my door when I went to the kitchen and when he saw me he just left. I was very alarmed and went to text my roommate, but as soon as I saw my phone I saw frantic messages from her asking if I was the one knocking and shaking her door handle. It took both my roommate and I expressing fear of our safety multiple times for Lark to do the bare minimum and notify us when maintenance would be arriving at our unit. I still deal with trauma from these occasions and the constant fear that I am not safe inside my own apartment, even if the door is locked.\n\n3. Lark's lackadaisical, contemptuous and profit motivated approach to property management is disgusting, and it will be a lifelong regret of mine that I allowed myself to fork over thousands of dollars to a company that doesn't care whether I live or die.",
      "ownerResponse": [
        {
          "text": "Lana, we are extremely sorry to hear of your negative experience with Lark Bellingham as it is always are upmost priority to provide our resident with the best possible place to live while maintaining fair and consistent policies for all of our residents. We would appreciate if you would be willing to reach out to us in order to discuss you individual situation and for you to offer any available advice to make Lark Bellingham the best possible place for students to live."
        }
      ]
    },
    {
      "author": "Xichen J.",
      "rating": 4.0,
      "review": "This is a brand new construction behind Fred Meyers. This place boasts of all the luxury amenities for a price of about $785 a month for a room in a two-bedroom apartment. Electricity is not included. Internet and water are included. I moved into this place a day ago and for the most part, it has been good. There were some issues such as no internet modem in my apartment and no shuttle for the first week. However, the front desk have been courteous and helpful. One thing that I do want to warn future residents is that the kitchen and bathroom sink are quite small. There is one sink and the space around that sink is not that large. There are also small bathtubs in the units. Parking can be notoriously hard to find at night (all of the designated $30/month spots have been sold out). Other than that, this place is great if you want to pay the high price tag.",
      "ownerResponse": []
    },
    {
      "author": "Emily T.",
      "rating": 1.0,
      "review": "The apartment itself is nice but everything else is crap maintenance will walk in unannounced. I was laying in bed asleep and a male maintenance person walked into my locked bedroom. There is no parking. Ever. And if you can't find parking the want you to park at Fred meyers and walk. They continue to give out parking passes when they don't have enough spots. Do not recommend living here.",
      "ownerResponse": [
        {
          "text": "Emily, we are very sorry to hear of the issues you have been experiencing related to park at Lark Bellingham. While our Resident parking spaces at Lark Bellingham are unassigned and available on a first come first serve basis, we are diligently working to remedy these ongoing issues. By eliminating the high number of unauthorized guest vehicles utilizing our resident parking spaces, we aim to ensure that there is available parking for all residents at Lark Bellingham."
        }
      ]
    },
    {
      "author": "Emily N.",
      "rating": 1.0,
      "review": "Pet friendly - absolutely! However I've been here 2 weeks and was attacked by a dog off leash my first day living here. Sent photos and information to management and didn't receive a response. I witnessed several other animals off leash. When dogs off leash approached me, I explained that it would be considerate if your pet was leashed because I also have a dog and do not want any incidents. The owners have rolled their eyes and blew me off. Also, several residents are working with rover and those dogs they have here are not allowed to be here.\nTwo homeless people have approached me asking for money. I asked if they lived here and they both said no but the gates open. I've had a homeless man yell at me as I walked outside the gates during daylight. I witnessed another homeless person run around naked in the field in front of lark screaming.\nI asked the office what is it I can do about these incidents and asked if I should call the police and they said \"there is nothing we can do, don't call the police. We don't own the land outside the gates and welfare (Idk what welfare is) is checking up on them.\" Maintenance has now left my door unlocked twice. Everything I've experienced has been reported to the office via email and verbal reports that the front desk submitted for me.  From the moment we applied...it's been a absolute nightmare. I really wanted lark to be everything it advertised. It's upsetting I'm having to be scared of where I live.\n\nDon't let the fake 5 star reviews fool you.",
      "ownerResponse": [
        {
          "text": "Hi Dallas, thank you so much for addressing your concerns with us. We completely understand your frustration with this situation. It is always our top priority that our residents feel comfortable in their homes. We attempted to reach out to you earlier today to discuss how we can improve your experience but were unable to reach you. Please reach out at (360)778-1500 or at live@larkbellingham.com at your earliest convenience so that we can address and improve your experience at our community."
        }
      ]
    },
    {
      "author": "Sunny L.",
      "rating": 1.0,
      "review": "The worst community, the worst management of all time! Run away as fast as you can when they sugarcoate everything to make you sign a lease.",
      "ownerResponse": [
        {
          "text": "We are concerned about your report of a negative experience at our community.  We are unable to locate any record of you as a current or previous resident.  If you would e-mail us at live@larkbellingham.com, we would be happy to assist you further."
        }
      ]
    },
    {
      "author": "Sasha T.",
      "rating": 3.0,
      "review": "Haven't even moved in yet and I'm already encountering problems. Before signing my lease I spoke to the marketing manager Lani, and asked her specifically if animals in aquariums/vivariums would be allowed as I collect exotic animals. She told me that yes the pet addendum would show that they were fine and I would have no problems. Fast forward a few months, it's getting closer to move in and I've already signed my lease, they email me a copy of the pet addendum and what do you know, exotic animals of any kind are prohibited. Pretty sleezy if you ask me. Had I known they weren't allowed I would not have signed a lease with them.",
      "ownerResponse": [
        {
          "text": "Sasha, we are sorry to learn that your experience has not been as you expected thus far. We understand that our office has reached out to you to attempt to clarify the situation. Based on the notes on our account and the verbiage in the Housing Agreement - Fish in aquariums are allowed.  If you would like to bring an animal that is not pre-approved, you will need to submit a request to the office in writing.  We are more than happy to discuss any further questions you may have if you would stop by the office or email us at live@larkbellingham.com."
        }
      ]
    },
    {
      "author": "Ryan M.",
      "rating": 1.0,
      "review": "the few consistent amenities were nice. other than that, living here was a nightmare. \n\nmost of the staff were unhelpful and clueless (apart from Rita and maybe one person that worked the desk occasionally), parking sucked even though site advertises free parking. they don't even have enough spots for the amount of leases they do. \n\noverall, horrible. i hated living here.\n\nEDIT (because i don't know if i'm able to respond to comments):\n\ni understand reserved parking vs resident parking. i lived there for two years. the problem is that the website advertises free parking. therefore implying that there is enough parking for residents to park freely without paying for the reserved spots. but there was not enough parking for the amount of tenants. \n\ni would have loved to have discussed all of this with the business themselves but upon completing my move out survey, i selected that i wanted to be contacted by the lark \"dream team\" to discuss my dissatisfaction and was never contacted after. \n\ni don't appreciate the unprofessional responses that i receive from lark whenever i try to speak to them about things that end up just questioning my intelligence and comprehension rather than actually trying to solve problems.",
      "ownerResponse": [
        {
          "text": "Ryan, thank you for leaving us your feedback on your experience at Lark Bellingham.  We're glad to hear that you have enjoyed the amenities we offer at our community. We do offer two types of parking, Reserve Parking and Resident Parking. If you have Reserve Parking, you are always guaranteed a parking spot. If you have Resident Parking, it is on a  first come basis.  Please let us know if we can assist you further in any way."
        }
      ]
    },
    {
      "author": "Barb C.",
      "rating": 5.0,
      "review": "OMG!!! I'm the parent and my son and his friend had nothing but great experiences here at NXNW Student Housing for Western up in Bellingham, WA. We moved him in today and this place is amazing!!! Fully furnished two bedroom with private bathrooms and walk in closest, all utilities except electricity, shuttle service to campus all day long, complimentary coffee bar, tons of parking, close to stores, etc etc. And the management has been amazing and helpful all summer long with all of our questions and concerns. And all this for $799. What a great deal!!! As a parent, I feel very thankful and appreciative that our young adults will have an amazing college experience. I'm jealous. Nothing like this existed in my time.",
      "ownerResponse": [
        {
          "text": "Barb, thank you so much for the feedback and review.  We love hearing that our residents as well as our parents are so happy with the NXNW Community. We are working on rolling out some great events over the next couple of months, and hope you can make it back up to visit us. If you have any questions or concerns, please do not hesitate reaching out to us!"
        }
      ]
    },
    {
      "author": "Lisa W.",
      "rating": 1.0,
      "review": "Management is unethical, profit driven, and manipulative. The sales team is intrusive from the moment tenants arrive, with a full court press on gaining a second year contract that starts immediately after arrival. The management team is syrupy sweet but unresponsive and disorganized. Read the 14 page lease carefully to see all the tactics they use to undermine tenant rights and evade accountability. Although the facilities are nice, the quality and integrity of the management team makes this a low quality experience for many residents. I would strongly urge prospective tenants to look elsewhere. BTW your lease may start on the first of the month, but they will not let you move in until two weeks later...one of many strategies designed to line their pockets at your expense.",
      "ownerResponse": [
        {
          "text": "Hello Lisa, thank you for providing this feedback. We offer residents to keep their same space at our lowest rate in the beginning of our leasing term for the next housing term as a priority to our current residents that renew with us. Every year, we release our lowest rates in October. As for having resident pay on the first, total rent of the housing agreement is a single fixed price for the entire term. We then divide this total contract price into equal installments and make them payable on the first day of each month for convenience , as our residents typically prefer to budget for equal installments on a set payment calendar. Please reach out to us at live@larkbellingham.com, we would love to help assist with any further concerns."
        }
      ]
    },
    {
      "author": "Emma B.",
      "rating": 3.0,
      "review": "Brand new apartments, although they do have their ups and downs it's not terrible. \n\nI do love the locations and the rooms themselves are quite nice. Buying a parking spot is a MUST though. The shuttle is very convenient as well. \n\nThere are problem here a there like the lack of security presence, especially when it comes to noise complaints at night. And the Internet connection can be a pain, it often cuts out. \n\nOverall the biggest thing to be said is they are new apartments, so I don't expect perfection but they are very nice and if things continue to go well I will renew my lease for sure!!",
      "ownerResponse": []
    },
    {
      "author": "Emily E.",
      "rating": 1.0,
      "review": "NXNW is one of the worst places you could live as a student or as an adult in the Bellingham area. I know when touring it seems great and adult like, but it's not all it seems. \n\n1. The shuttle seems like a great idea until you actually get there and realize it doesn't actually have the capacity to hold the amount of students that it needs to. Unless you plan on standing outside for 30 minutes waiting for the shuttle to finally pick you up, I would recommend walking.\n\n2. Parking is extra which is complete bullshit. For the amount they are charging parking should be free and come with an assigned  parking spot by your apartment. This place is just a ripoff and not worth what you're spending. \n\n3. Management sucks. They are the least helpful people in the world. People will be screaming and playing music until 3 in the morning and they won't do anything. People leave their DOG POOP everywhere and they won't do anything. The computers in the lab don't work and they don't do anything. The people working here are honestly useless.\n\n4. Don't move here just because the outside stuff/gym look fun. You won't really get to use it during the winter because it's so cold/rainy, and based on most of the people who live here, you're probably going to go home for the summer. And the gym is always packed. Just use the western/whatcom gym.\n\n5. The price for the apartment is not worth the cheap apartments/furniture you are getting. Just move to a better cheaper place and buy furniture. Trust me.\n\nThis place comes off as great during the tour (I felt the same way) but it's honestly the worst.",
      "ownerResponse": [
        {
          "text": "We are sorry to hear your experience with NXNW has not been a positive one. As for transportation to campus, at peak times the shuttle can get full. WTA has a bus stop at the front of the NXNW driveway, which goes directly to campus as well and is free with your full time Student ID. We offer free and paid reserved parking at NXNW. Per city regulations the property was not built with a 1 to 1 ratio of parking per resident. We always encourage residents to come down to the office if they have questions or concerns, and would be more than happy to discuss your issues further.  Please feel free to e-mail us at office@nxnw-bellingham.com or call us at 360-778-1500."
        }
      ]
    },
    {
      "author": "Megan C.",
      "rating": 1.0,
      "review": "I have lived at Lark Bellingham for about a month now. I have encountered a number of problems that has made living here a miserable experience. \n\nFirst and foremost, the parking. This complex has to have the most atrocious parking setup. There are two types of parking--residential and reserved. If you are lucky enough to be able to get on the list for reserved parking then parking won't be a problem. But is you do not get granted reserved parking you will be stuck with residential parking. There are not enough parking spaces and during the afternoon the parking lot becomes a free-for-all with people seemingly ready to crash into another car just to get a spot. If you work late or have classes later in the day you will NOT be able to park within the community. Many people park outside the fence or at the Fred Meyers located next to the Lark. If you drive a car are not sure you will be able to get a reserved parking space like many of the residents here, I suggest turning around and driving to another complex. \n\nThe staff are not helpful. They are ill equipped to solve any problem that is presented with them and quite a number a very rude if you are insistent on having a problem solved. \n\nScion Group itself is not helpful as well. I reached out to them with my complaints while taking the post move-in survey. They said they would be in contact but weeks have passed an I have yet to hear from them. There are clear problems from upper level management and this incompetency can be seen within the planning of the Lark community. \n\nOn a less serious note, I hope everyone looking into living here is ready to invest in physical therapy as the furniture is extremely uncomfortable. \n\nI will suggest to anyone reading this review to not live here. Find somewhere else with more competent staff and a more competent parent company preferably. It truest has been a regret living here and I'm looking forward to the remaining 11 months of torture ahead.",
      "ownerResponse": []
    },
    {
      "author": "Kari B.",
      "rating": 1.0,
      "review": "Wish I could give 0 stars honestly. This is an extremely predatory apartment complex. They prey on first time students who are desperate for a place, and then they try and suck every last dime out of you. When I first moved in there were FLEAS in my room (which had supposedly been cleaned before I moved in). It took almost 3 weeks to get rid of the fleas, during which time I got eaten alive and didn't get any reimbursement on my rent or anything. They did not tell me the people already in the unit had pets, and then when I asked to switch rooms they told me I WOULD HAVE TO PAY TO SWITCH! Even though it was their mistake! And don't even get me started on the parking- there is never enough spaces if you go anywhere past 5 PM you won't get a space. I even paid for \"premium parking\" and I wouldn't get a space if I worked late that night. They were completely unhelpful during covid, all they did was extend the late period for rent payments by 10 days. The roommates they picked for me were extremely obnoxious and loud, even though on my roommate form I said I would prefer quiet and studious people. DO NOT MOVE IN HERE!! It may seem like a good deal for the price but it's not. Avoid at all costs!!",
      "ownerResponse": [
        {
          "text": "Hi Kari, We work with an exterminator to prevent any infestations and apologize that your experience was unpleasant. For flea infestations, our vendor requires there to be 2 sessions that take about 2 weeks to complete in order to fully exterminate the fleas and their eggs. We consider all application preferences when finding placements for our residents, but not all preferences are guaranteed to be met, including preferences on pets. We offer a limited number of transfers for residents with a fee that covers the required admin work. We understand that finding a parking space is difficult in the evening and late at night, but it is always first come, first served. We do enforce towing during office hours and through our after-hours line. We appreciate your honest feedback so we can work to continually make improvements toward our property. Please feel free to reach out if there is anything else we can help you with."
        }
      ]
    },
    {
      "author": "Paola C.",
      "rating": 5.0,
      "review": "I lived in one of the NXNW apartment for six months. I loved living there. Everything is brand new, the rooms are very spacious, the kitchen is great. The clubhouse is amazing, you can get as much gourmet coffee as your body can handle, FOR FREE! They do activities  very frequently, they even had a Thanksgiving dinner for the residents! The staff is very good too. I had to break my lease because I got a position in Seattle, and they helped me a lot with the process of breaking the lease. I highly recommend living in NXNW.",
      "ownerResponse": [
        {
          "text": "Paola, thank you so much for the review. We too love the amenities we have to offer, and loved having you as a resident.  We are happy you were able to go through the delegation process with ease, and would love to have you as a resident again if you are ever in the Bellingham area."
        }
      ]
    },
    {
      "author": "Scott R.",
      "rating": 1.0,
      "review": "DON'T SIGN A LEASE HERE!!!\n\n(You guys really suck, can't wait for your business model to collapse on itself!!)\n \nIf you're thinking of living here don't! The monthly electric bill is through the roof (My average is $100 for 2 people) and you hear all your neighbors having sex because the walls are so poorly insulated. Yeah, cool, its fancier than the dorms, but most-certiantly not worth it for the collective $1530+ they charge for a 2-room apartment ---- THERE AREN'T ENOUGH PARKING SPOTS FOR EVERYONE AND ABOUT 1/2 OF THE SPOTS THEY HAVE COST $30/MONTH EXTRA!!! ---- They also like to have \"Quarterly Inspections\" that, for me, resulted in $400+ damage charges, 2 months after the inspection, to replace a couch that isn't even worth $400!!",
      "ownerResponse": []
    },
    {
      "author": "Hailey B.",
      "rating": 5.0,
      "review": "Rooms are furnished and are perfect for off campus housing! NXNW has community events that helps connect residents and makes everyone feel welcome! The workers are very helpful and strive to make all the residents satisfied. This is my second year and I have loved staying here! If you're looking for a great place to live then this is a great selection!",
      "ownerResponse": [
        {
          "text": "Hailey, thank you so much for your review.  We love hearing from residents about their experience while living at NXNW.  If we can be of any further assistance, please do not hesitate reaching out to us!"
        }
      ]
    },
    {
      "author": "Samantha B.",
      "rating": 1.0,
      "review": "Do not move here. It was probably the worst experience of my life. They say they provide a bus but half of the time it's shut down. When you leave if there's a tiny bend in your blinds they will charge you a huge amount for anything they don't think is perfect-even if when you moved in it everything was already scratched. Our sink even fell through our counter that's how cheap everything is made. They will sign you up for insurance you don't want without asking which my insurance agency said is illegal. This all happened to me first hand.",
      "ownerResponse": [
        {
          "text": "Hi Samantha, thank you for providing your feedback. We apologize that you have experienced our shuttle being out of service due to maintenance repairs. We do have the city WTA shuttle that comes by our property everyday. Renter's insurance is required while residing at Lark; however, residents are able to provide their own renter's insurance instead of going through our preferred insurance. We apologize that you had an unpleasant experience during your time here. Please let us know if we can help you with anything."
        }
      ]
    },
    {
      "author": "Danny A.",
      "rating": 1.0,
      "review": "To give you an example of how much Lark actually cares for their tenants, let me layout how I was recently treated. I have lived here the entire year with my car and recently found out my car was towed. How I found out is where the issue lies; my phone number is on call, my license plate and car description is connected with my car (as well as a sticker showing that I am a resident here), but I had to CALL the towing company myself after however many days it's been impounded and find out that I'm being charged $500 to retrieve my car that I have parked in my own apartment complex. Not ONCE was I notified by any of management that my car was being towed nor do I know WHY my car was towed. I have been unable to reach any of management for the urgency of this issue to find recourse for this or to even find out why I wasn't even simply contacted. Lark Bellingham takes a shoot first, ask questions later kind of aggressive approach with all issues that don't concern them, yet when you as a tenant have an issue, I guarantee most of the time you won't actually get more than a \"We're sorry!\" This has occurred in multiple situations. My roommates car was broken into earlier this year while parked on the complex and had an expensive subwoofer in (his car was lock, the window was literally smashed.) Something like this would normally be easily solved by having security on site, right? Well, Lark claims they do, but they have gone through at least 6 security officers in the span of this year and none of them have offered any actual protection to a complex as big as this. When he contacted management, all they did was point to the lease and say they're not responsible. Lark will take to their lease agreement and offer no recourse or assistance in any time of need; my neighbors were broken into and it took them weeks to send out an email which just stated \"Just keep your doors locked!\" I would not recommend Lark to anyone.",
      "ownerResponse": []
    },
    {
      "author": "Alaina S.",
      "rating": 1.0,
      "review": "I would give 0 stars if I could. Way too overpriced, terrible customer service, the office is run by college students who have no idea how to help or what direction to point you in if you do need help, everything is broken constantly, parking is a nightmare unless there's a global pandemic happening so students are staying home, and no noise complaints are enforced (they told me it was my problem to tell them to be quiet). Not to mention the carpenter ant infestation we complained about and were told that it was probably due to our living conditions insinuating we were unsanitary. The garbage and recycling are constantly overflowing and there is broke glass everywhere, even the parking lot in the back corner of the complex where my building is located. There's a serious mold problem in both units I've lived in. When you move out of a unit they charge you ridiculous rates for cleaning services and maintenance only for the unit you move into to be disgusting and in disrepair. The units have paint all over the floors and when we moved in there was a giant white spot on the teal wall from them patching a hole and not bothering to repaint. The previous tenants broke the couch but it wasn't replaced so we will probably be charged for it when we move out despite us not being the ones to break it. I think I would have preferred to live in someone's basement. At least it would have been quieter.",
      "ownerResponse": [
        {
          "text": "Hi Alaina, thank you for taking the time to provide feedback.  We are extremely sorry to hear about your negative experiences at Lark Bellingham. Feedback like this helps us to continue improving our residents experiences. We have tried reaching out to you via phone, but we must've caught you at a bad time. At your earliest convenience please give us a call back at (360) 778-1500, our office hours are Monday-Friday 10am-7pm and Saturdays 10am-5pm."
        }
      ]
    },
    {
      "author": "Jayda D.",
      "rating": 1.0,
      "review": "PLEASE READ!!!!!!\nThis place deserves 0 stars. I have lived here for only a few months and it is already terrible. I woke up one morning to find that my car been improperly towed, no notification from lark at all but they okayed the tow. I was told I didn't have a sticker but I had it placed where I was told to put it and their excuse was that \"it was dark and we didn't see it\" have you ever heard of a flashlight?! Lark makes residents pay and extra $30 for a reserved spot yet they can't seem to enforce parking AT ALL! They will lie to you and say their doing their best but it's all a lie. I was told that after hours there is nothing they can do! Residents are the one that need to call the towing company and report improperly parked cars! So my question is why are we having to pay an extra $30 each month if you can't even enforce the parking rules 24/7?! Lark also states that this is a gated community which in some cases it is but in reality they leave the gate open from 7am to 7pm for anyone and everyone to come in and if it's after 7 people that don't live there park outside the gate and wait for someone else to scan their card and sneak in. The management is corrupt saying that they care for their residents yet they suck them dry of their money. Because of larks mistakes I missed work as well as my dad because he had to get my car that they improperly towed having to drive all the way from downtown Seattle to Bellingham and all they offered was to take $30 off my next rent... is that a joke? That was slap in the face to me and clearly showed that all this place cares about is talking as much money as they can from students. It's so sad. Please do not sign a lease here, lark does not deserve the time of day or your money find a place that actually cares for its residents and not just suck them dry. Lark was also formerly known as NXNW and many residents believe the name changed happened because a naked man was masterbating outside in the apartment complex and the police had to shoot him with salt bullets, lark makes it seem like they are a perfect student houseing center but in reality it's party central drugs party's and alcohol 24/7 with no ways to file a complaint. Management is as fake as they come! If you want to have a happy year I would think again before signing here \n\nHere is proof https://youtu.be/iUKMG6ZtTeY",
      "ownerResponse": []
    },
    {
      "author": "T P.",
      "rating": 1.0,
      "review": "My daughter signed a lease last spring without my permission. I was sent a guarantor request, but never signed it. Literally the day after she signed it, we let Lark know that this was not going to work out. My daughter and her friend found a roommate to take my daughter's place in the apartment, yet Lark is still insisting that they did that, and she needs to pay $400. If she doesn't they are threatening to send her and me to collections. I'm still not sure how I am on the hook never having signed anything.\nIf this group is supposed to be providing housing for students, they should not be using predatory practices to get students who are still in high school to sign leases, and then using punitive charges to make money off of them. \nKeep your child away if possible. The university is there for kids. This place is just out to make money.",
      "ownerResponse": []
    },
    {
      "author": "Elle P.",
      "rating": 1.0,
      "review": "As a parent, I would say we are pretty disappointed with this place. Each and everything possible thing about this place is cheap-- except the rent. The walls are paper thin; you can hear everything that is happening in every room around you. The furniture and lighting are horrible, so plan to pay more for things that make it more comfortable.  The amenities are a joke. It is far from campus and kids really feel burdened to get to class. The location is so depressing: stuck between the ass end of a Fred Myer and the highway. Our daughter and her roommates can't wait to get out and boy oh boy is she bummed that she agreed that she'd be responsible for paying rent over the summer. There's nothing luxurious, convenient or healthy about this place. Help your child find somewhere else and don't be talked into this place. You will both regret it.",
      "ownerResponse": [
        {
          "text": "Elle, were sorry to hear you feel that way but we thank you for the feedback. We always want to have our ear to the ground so we can better assist our residents. In terms of access to campus, we offer a shuttle that runs 5 days a week to and from Western every half an hour during normal class times. As for the location, many residents find it convenient being next to a full service grocery store. Look for a direct message from us and we can come to some solutions!"
        }
      ]
    },
    {
      "author": "Kim K.",
      "rating": 1.0,
      "review": "We were seduced early 2015 before the apartments were completed. It looked like an awesome place for my child to live. However, her roommate backed out before school ended and it has been a nightmare since then.  My daughter is being bullied by the roommate that they (NXNW) matched her with and is living in a less than ideal situation. We have talked to management numerous times but it always comes back to the fact that we signed a contract.  Bottom line, big corporation with little regard for the student's/tenant's welfare.",
      "ownerResponse": []
    },
    {
      "author": "Madison M.",
      "rating": 1.0,
      "review": "Please for the love of god don't rent here. Don't mistake my one star for actually having any appreciation for this place; everything about this place is terrible and while half the stuff they advertise is complete lies, the other half is majorly exaggerated. \n\n- free parking? Nope! Their website implies that parking is free for everyone and that spots are always available, 90% of the time all parking is entirely full except for spots you pay $40 A MONTH FOR. Not only is it $40 extra to have access to an amenity they promised was free, but I have been on the waiting list for a reserved pass for almost 3 months. So, yeah, I'd even pay for parking if i could. Also, don't try temporarily using a reserved spot just until a resident spot opens; your car will get towed at 1 am 30 minutes after parking there! \n- private shuttle bus to WWU? Yeah, if you can manage to get a spot! Students are stuffed on the bus like sardines, some sitting on the floor just to pray they can make it to class on time. For a complex with hundreds of students, you think the shuttle would be able to fit more than maybe 25 people. Also, the shuttle is frequently shut down with no more than 12 hours notice for \"maintenance\"; once it was gone for three days while they gave it an ugly new decal. \n- $200 pet fee per year? Yeah, but there are rules they don't advertise: you can't have more than 2 pets, it's $200 per pet, and they'll make it as hard as possible to get any information. I was trying to emergency foster a small litter of kittens and the office was rude and condescending to me, as well as completely unwilling to help. \n\nThe walls to other apartments are thin. Noise complaints aren't verified and you'll be held responsible even if you and your roommate were ASLEEP when the complaint was filed. The desk attendants are friendly but absolutely clueless and all give different information. When I filed a complaint about parking, the response i got was rude and suggested that I uber to work so I don't have to worry about their incompetent amount of parking (ubering to my job would cost around $30-$40 every night, which is almost as much as I make in one shift). When I filed a maintenance request about my dishwasher that wasn't cleaning dishes, I was told that I was \"putting the dishes in wrong\" and that bowls and pots weren't supposed to go on the bottom rack of the dishwasher even though that's exactly how a dishwasher works. Maintenance was either clueless or too lazy to fix it. Maintenance will enter your apartment with no regard for you or your privacy completely unannounced. Amenities will be taken away with 0 notification to the students; one of the biggest things that drew me to this place was the tanning beds they advertised. I suffer from seasonal depression and I was thrilled when I learned they offered tanning beds, only to be replaced with a \"meditation room\" with no notification to the residents. Security once yelled at us for playing music with our windows open at 9:30 pm on a Friday. Rooms are much smaller than they show them off to be. Wifi that's provided is slow and unreliable. All communication with the complex is condescending and rude. Drywall is cracked and waterlogged because of faulty appliances. Lights frequently flicker for no reason. \n\nOn top of all of this, our rent is $1700 a month. Lark Bellingham is taking advantage of and scamming students. I loved this place at first but everything advertised is gold plated. Take your money somewhere else.",
      "ownerResponse": []
    },
    {
      "author": "Jarod S.",
      "rating": 1.0,
      "review": "I pay extra for parking and just in 3 months I have had to park outside of the complex so many time just because I work late. I get the reserve sticker but it means nothing people can park wherever they want. If you want you car to be in the lot just make sure you dont go anywhere past 7 especially on the weekends.",
      "ownerResponse": []
    },
    {
      "author": "Ai H.",
      "rating": 5.0,
      "review": "nice place. Nice officers and quickly solve the problems. Furniture. Include and they are nice. Also a safe place to live and you need card to get in after 8in weekdays and 6 at weekends. Shuttle bus also helps a lot.",
      "ownerResponse": []
    },
    {
      "author": "Gordon Schiff S.",
      "rating": 1.0,
      "review": "The apartments are fairly nice.  Be aware that this company is very aggressive about collecting any move out fees and will send you threatening letter indicating that they will report you to National Credit Services if you do not pay this fee within 2 weeks.   Take this threat seriously and pay your fees or they will attempt to ruin you credit.  We paid the fees within a month of move out and they did report us to a credit agency the month after payment. It has been a hassle getting our credit fixed.  We were able to prove payment prior to the company sending us to collections and I think this is straight now.  Probably best to avoid this company from the start.",
      "ownerResponse": []
    },
    {
      "author": "Debbie T.",
      "rating": 1.0,
      "review": "Be aware of their move out policy. My son paid the penalty fee for an extra 24 hours to vacate his apartment, but staff and vendors cleared it within the 24 hours and without his permission. There was also no system in place: some items were bagged/tagged for him, although many items were tagged incorrectly; some items had been thrown away; and some items were on staff member's desks - it looked like they were keeping things for themselves! Staff were not helpful and simply called it a 'miscommunication within their team'. They did waive the penalty fee. However, there are many important documents and personal items that are now permanently lost. Just be warned!",
      "ownerResponse": [
        {
          "text": "Debbie, thank you for your feedback and review of our community. Our accounts manager has already spoken with you about this matter. When we go into the apartment upon move out, we do identify items of value and importance, and things that are irreplaceable. This would include documents, electronics, clothes, etc. When it comes to trashing out any other items, this would be any trash that was left such as toiletries, dishes, pans, household items, etc. A holdover fee was assessed due to the apartment still being occupied past his agreement end date. Our staff did reach out to Joseph on move out to explain that there was a fee being assessed, and he confirmed he would be getting his items that night. It is simply a holdover fee for not turning in keys on time, we still take possession of the apartment at that time. As he did not come to remove his belongings that night, at that point, we do go in and begin clearing the apartment. We did bag and tag his items, and then set it aside in our office for him to come pick them up. If you have any further questions about this, please reach out to our office at 360-778-1500 or office@larkbellingham.com"
        }
      ]
    }
  ],
  "address": "800 Viking Cir Bellingham, WA 98229",
  "company_type": "company",
  "adjusted_avg_rating": 1.8,
  "summary": "# Lark Bellingham: A Mixed Bag of Student Housing Experiences\n\n## Good\nLark Bellingham, a university housing facility, seems to have a few redeemable qualities according to some user reviews. Positive aspects include the provision of essential amenities like a shuttle service to campus and a coffee bar, which are appreciated by the residents. Commendation has also been given to the spacious rooms, with each bedroom inclusive of a bathroom and walk-in closet, indicating a degree of comfort and privacy. The complex’s location close to stores adds a layer of convenience for the residents, and the availability of furnished rooms reduces the need for students to outlay extra money for furniture.\n\n## Great\nSome residents have had positive experiences at Lark Bellingham, highlighting the helpful and courteous front desk staff as a highlight. Community events are mentioned as a means to forge connections among the residents, fostering a sense of community. The efforts of the staff, particularly during move-out processes, are evident, with some users feeling their concerns were adequately addressed. Moreover, the security provided by gated access appears to offer peace of mind to some tenants, and a few residents have expressed an eagerness to renew their leases, suggesting that their overall living experience was satisfying.\n\n## Bad\nOn the more negative side, common themes of dissatisfaction permeate several user reviews. Parking has been a source of frustration for many, with inadequate spaces and additional costs for reserved spots causing significant inconvenience. The shuttle service, while a valuable amenity, is criticized for its insufficiency in terms of seats and reliability. Residents have reported issues with maintenance, citing unresponsive actions to reported problems. Additionally, some users report aggressive sales tactics that pressure tenants into signing leases early, and find fault in the complex’s response to noise complaints and lack of enforcement of community rules.\n\n## Ugly\nA more disturbing picture emerges from the ugliest aspects depicted in user reviews. Claims of predatory and unethical business practices have been alleged, with users stating that they felt victimized by the complex’s management strategies. In some instances, tenants experienced poor living conditions, including hygiene issues and safety concerns. Issues with maintenance entering apartments without proper notice create a lack of privacy and sense of security among residents. Furthermore, there have been reports of unexpected fees and charges, lack of transparency during the leasing process, and perceived indifference to students' financial and personal hardships. The culmination of these issues suggests a fundamental disconnect between the management and the welfare of the tenants.\n\nIn synthesizing these sentiments, it's clear that while Lark Bellingham offers various amenities and conveniences that some tenants appreciate, there’s a prevalence of critical issues that overshadow the overall experience. The management’s approach to addressing tenants' concerns and its commitment to maintaining a healthy living environment are essential factors that require improvement.\n\nThis article intends to serve as a helpful insight into real user reviews for those considering Lark Bellingham as a housing option. Remember, reviews are generated by ChatGPT and aim to present a well-rounded perspective on the property management company. As a prospective tenant, it's always important to conduct thorough research and take into account both the positive and negative aspects presented here."
}