{
  "name": "Oak Harbor Real Estate & Property Management",
  "address": "890 SE Pioneer Way STE 101, Oak Harbor, WA 98277",
  "company_type": "Real estate agency",
  "review_count": 20,
  "avg_review": 3.0,
  "reviews": [
    {
      "author": "Carl Newman",
      "rating": 5.0,
      "review": "We've used Brian and Donna to purchase a house and they manage our rental property.  We wouldn't consider using anyone else for our future needs.  They showed us many homes before we finally bought and they didn't try to over-sell any of ",
      "ownerResponse": []
    },
    {
      "author": "Chris Pressentin",
      "rating": 1.0,
      "review": "ATTENTION MILITARY FAMILIES!  Avoid these people.  They are crooks.  They took over for the old rental company my family rented from, otherwise I wouldn't have even dealt with them.  My family and I lived at a property for over 2 years and ",
      "ownerResponse": []
    },
    {
      "author": "Rochell Brown",
      "rating": 5.0,
      "review": "Thank you to Brian and the maintenance staff for saving Thanksgiving.  Our oven went out and he made sure to connect my family in a timely manner and delivered a loaner till the new one arrives.  We very much appreciate you.",
      "ownerResponse": []
    },
    {
      "author": "Melissa Champion",
      "rating": 1.0,
      "review": "Avoid, dishonest and false advertising! Rented online and the pictures were not new pictures. The owner/manager is argumentative and lies to your face. He will try to nickel and dime you, save your money and time and find another local ",
      "ownerResponse": []
    },
    {
      "author": "Siani Tempson",
      "rating": 5.0,
      "review": "They are very accommodating. House was clean and process was fast. Thank you Oak Harbor Property Management Team!",
      "ownerResponse": []
    },
    {
      "author": "Jordan VIGE'",
      "rating": 1.0,
      "review": "Military beware,  they extort military and treat you like it inconvenient that you have to live in the property while you pay rent.  They will try and charge you for maintenance you filled out needed to be done when you leave, in 3 years ",
      "ownerResponse": []
    },
    {
      "author": "Hope Wirth",
      "rating": 5.0,
      "review": "Donna and Brian have been wonderful in helping us buy our dream home and list our current home. They showed us a lot of houses before we found the current one. They were wonderfully patient and listened to our needs and desires. When it ",
      "ownerResponse": []
    },
    {
      "author": "Island 12",
      "rating": 5.0,
      "review": "Donna went out of her way to help us get into a home. We had to sell ours first and we went with another local realtor who treated us like we were there for her. I'm not going to slander anyone by giving a name but let me just say this, ",
      "ownerResponse": []
    },
    {
      "author": "Molly Bryant",
      "rating": 1.0,
      "review": "We signed a lease on a trailer for rent through this company and got railroaded from the get. The roof was leaking in multiple spots and coming into the light fixture. There were outlets that did not work due to water damage the home was ",
      "ownerResponse": []
    },
    {
      "author": "Tawnee Hillmer",
      "rating": 1.0,
      "review": "Very disappointed with this property management all around.\nWhen I went to view an apartment, Donna told me that there was no pending applications. I put in my application right away, my boyfriend put his in that night. ",
      "ownerResponse": []
    },
    {
      "author": "Domestic Error",
      "rating": 5.0,
      "review": "We had the pleasure of renting through Brian for three years. During that time, we were treated extremely well and I cant come up with a single complaint. Initially, my rental started as a super-last minute / mid-deployment ",
      "ownerResponse": []
    },
    {
      "author": "Mallory Palatucci",
      "rating": 1.0,
      "review": "If I could give them no stars I would. Anna was right on the mark saying the owner, Brian was terrible at communication, that is unless you needed something then he got right back to you. ",
      "ownerResponse": []
    },
    {
      "author": "Jeremy B",
      "rating": 1.0,
      "review": "If youre in the military or part of a military family avoid this place at all cost. He will screw u out of money any way he can. Pay special attention to his leases, he doesnt follow them himself but will make sure u do. Again AVOID AT ALL COST.",
      "ownerResponse": []
    },
    {
      "author": "Normand Richard",
      "rating": 1.0,
      "review": "I left the place clean with little more to do - single person living - tubs never use nor was oven/kitchen or the 3rd bedroom, yet he charged me 420$ for cleaning with no detailed invoice and 150$ (2 paint scratches that I fixed), normal ",
      "ownerResponse": []
    },
    {
      "author": "Ben Nichols",
      "rating": 1.0,
      "review": "This is the worst landlord you could possibly have. When you submit a maintenance request you don't get a professional to come fix the problem. When you go to move out he charges you for problems in the house that were previously there ",
      "ownerResponse": []
    },
    {
      "author": "Candie Mendez",
      "rating": 1.0,
      "review": "Property manager never got back to me. I had to text her and call several times and she never communicated the decision of the owner. I had to go into the website to realize the house we wanted to rent was off market.",
      "ownerResponse": []
    },
    {
      "author": "Seth Champion",
      "rating": 1.0,
      "review": "Avoid this property management and save your money. False advertising and the manager/owner is shady!!!",
      "ownerResponse": []
    },
    {
      "author": "Rita Bartell Drum",
      "rating": 5.0,
      "review": "The team at Oak Harbor Property Management are professional and responsive toward landlord and tenant needs, they are a joy to work with!\nWe highly recommend them,\nDr. Edward Drum and Rita Bartell Drum",
      "ownerResponse": []
    },
    {
      "author": "Anna colkin",
      "rating": 1.0,
      "review": "terrible communication. only get back to you when they need something, but if they have a problem or it benefits them they can answer right away. Issues with my rental that were not fixed in a timely manner, random \"liability\" charges added to rent, and honestly rude service.",
      "ownerResponse": []
    },
    {
      "author": "Corey Mcfarren",
      "rating": 5.0,
      "review": "Very professional and prompt. Move in process was great.",
      "ownerResponse": []
    },
    {
      "author": "Michael Gartner",
      "rating": 5.0,
      "review": "So far very good.",
      "ownerResponse": []
    },
    {
      "author": "Kyle Merriman",
      "rating": 5.0,
      "review": "My wife and I have used OHRE for buying, selling, and renting homes for 7 years and have always been happy with the service.",
      "ownerResponse": []
    },
    {
      "author": "Garrett Kolmer",
      "rating": 5.0,
      "review": "Great folks to work with!",
      "ownerResponse": []
    },
    {
      "author": "C Ross",
      "rating": 1.0,
      "review": "Horrible service and non-responsive. Avoid!",
      "ownerResponse": []
    },
    {
      "author": "willie sprague",
      "rating": 5.0,
      "review": "Great communication and pays on time every time.",
      "ownerResponse": []
    },
    {
      "author": "Todd Talley",
      "rating": 5.0,
      "review": "Great",
      "ownerResponse": []
    },
    {
      "author": "Barbara Hawkins",
      "rating": 5.0,
      "review": "So helpful & friendly",
      "ownerResponse": []
    },
    {
      "author": "Jennifer Velez",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Pamela Burley",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Cara Holmes",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 27,
  "adjusted_review_average": 3.1,
  "summary": "# Evaluating Oak Harbor Real Estate & Property Management: A Balanced Review\n\nFinding a reliable property management company or rental property can be a daunting task, which is why summaries like this article are created to aid potential clients in making informed decisions. The following sections — good, great, bad, and ugly — reflect the diverse range of experiences expressed in the user reviews for Oak Harbor Real Estate & Property Management. It is crucial to note that this article is generated by ChatGPT and is intended solely as a tool to assist in your search.\n\n## Good\nOak Harbor Real Estate & Property Management has received laudable remarks for their accommodating nature and professionalism, especially from pleased tenants and homeowners. Specific accounts detail the staff's swift action to supply a temporary oven to ensure a family's Thanksgiving plans went uninterrupted, illustrating their dedication to client satisfaction. Furthermore, the praise extends to their rental process, with users highlighting an efficient and seamless experience, reinforcing the notion that the company can deliver satisfactory service.\n\nThe positive reviews also commend Oak Harbor Real Estate & Property Management for their communication and commitment to their clients, going above and beyond in their real estate transactions. The staff has been described as patient and attentive, taking the time to comprehend and address the unique needs and desires of each client. This level of personalized service has forged trust and reliability, which has been particularly appreciated by users who have engaged with the company over several years.\n\n## Great\nIn the context of buying and selling properties, Oak Harbor Real Estate & Property Management has received high marks for their exceptional assistance. Clients rave about the team's diligence and supportive approach, often going out of their way to ensure smooth transitions. These testimonials are emblematic of the company's expertise in real estate and their ability to foster positive, long-term relationships with clients, pointing towards a consistent track record in this facet of their services.\n\nTenants have likewise appreciated the professionalism displayed by the company's maintenance staff, indicating prompt responses to rental issues. The readiness to provide quick fixes and the provision of substitute appliances while awaiting repairs are actions that resonate strongly with the user reviews, suggesting that the company can effectively manage rental properties with a tenant-first mindset.\n\n## Bad\nOn the downside, some user reviews criticize Oak Harbor Real Estate & Property Management for a perceived lack of transparency and honesty. Incidents mentioned include false advertisement where provided property images did not align with reality, potentially misleading prospective tenants. Additionally, the company has been accused of being argumentative, with claims of the owner or manager engaging in disputes with clients over issues concerning the properties.\n\nDifficulty in communication also emerges as a repeated theme in the negative reviews, with several users expressing frustration over not receiving timely updates or decisions. The lag in response times has been described as particularly irksome by prospective tenants left in limbo during application processes and by existing tenants waiting for resolutions to maintenance problems.\n\n## Ugly\nThe ugliest aspects reported in user reviews involve serious allegations of the company neglecting their duties towards military families and engaging in exploitative practices. Accusations of extortion against military personnel highlight a significant level of discontent. Stories of exorbitant charges for pre-existing damages upon move-out, and unaddressed maintenance requests, further contribute to the distressing narrative.\n\nContention over the handling of security deposits and additional charges without detailed invoices exacerbates the dissatisfaction among a portion of the user base. These complaints, echoed by numerous clients, suggest a pattern of behavior that could tarnish the company's reputation if not addressed promptly and transparently. As of the latest user reviews, there seem to be no recorded responses from the company to these critical claims.\n\nTo provide an informative believe that Oak Harbor Real Estate & Property Management has indeed responded to some complaints, no reference to such interactions could be found in the provided user reviews. This article's intent is to summarize and reflect the array of experiences shared by past clients without any editorial bias."
}