{
  "name": "Pacific Continental Realty LLC",
  "address": "",
  "company_type": "company",
  "review_count": 32,
  "reviews": [
    {
      "author": "Ryan Reynolds",
      "rating": 5.0,
      "review": "Property management companies can be good and bad, but often it comes down to a combination of a management company and owner. Gabby is the glue that brings these two things together correctly. She is prompt when I have concerns and ",
      "ownerResponse": []
    },
    {
      "author": "June Quick",
      "rating": 1.0,
      "review": "PCR took over management of my building and raised the rent by over 30% in less than two years while maintaining it worse than the previous company. After moving out they illegally tried to keep part of my deposit without providing a statement.",
      "ownerResponse": []
    },
    {
      "author": "Destiney Chavez",
      "rating": 5.0,
      "review": "My experience with PCR has been great! Gabby is the sweetest property manager EVER! She will take care of your needs. The maintenance guys are also very friendly and helpful!! They will take good care of you! Thanks again GABBY for everything you do & taking care of my family :)",
      "ownerResponse": []
    },
    {
      "author": "india burgin",
      "rating": 5.0,
      "review": "My familys experience with Pacific Continental Realty (specifically our property manager with Gabby) has been very pleasant. We have been lucky enough to be working with Gabby, who quickly processed our applications and was extremely ",
      "ownerResponse": []
    },
    {
      "author": "Christina Engel",
      "rating": 5.0,
      "review": "I have been using PCR going on 3 years now for commercial office space. Ben Black in particular. They are great. I usually communicate through email & always get a response in a timely manner. The rent is fair & reasonable. They do a great ",
      "ownerResponse": []
    },
    {
      "author": "Tiana Brennan",
      "rating": 5.0,
      "review": "Ive had an amazing experience renting from PCR, especially working with Gabby as my property manager. She is SO kind and respectful. She is prompt in responding to requests and urgent needs and always goes above and beyond. Out of all the ",
      "ownerResponse": []
    },
    {
      "author": "A M",
      "rating": 5.0,
      "review": "We turned to PCR a year ago to manage our 50+ unit residential complex. They have transformed the entire property, well beyond expectations. Gabby Marcuzzo, our agent, is efficient, detail-oriented, and unflappably courteous. She's at ease ",
      "ownerResponse": []
    },
    {
      "author": "Rick Hippe",
      "rating": 5.0,
      "review": "My wife and I have interacted with the principals at PCR (KC Coonc and Ryan Martin) for over a decade and more recently with Gabby Marcuzzo as our current property manager. Throughout this relationship, initially with acquisition of the ",
      "ownerResponse": []
    },
    {
      "author": "Jeannie Cox",
      "rating": 5.0,
      "review": "I had an awesome experience working with PETE WASLEY! He was very personable and professional. Pete prepared a thorough evaluation of my propertys value and explained everything clearly, answering all of my questions and giving helpful advice. I highly recommend him!",
      "ownerResponse": []
    },
    {
      "author": "Tyler Moritz",
      "rating": 1.0,
      "review": "I am writing this review because the company seems to respond more to bad reviews online than they do to emails from their tenants. The unit was advertised to have a dishwasher on multiple rental sites, when we moved in we found out that ",
      "ownerResponse": []
    },
    {
      "author": "mackenzie carlton",
      "rating": 5.0,
      "review": "I love living in the apartment that we are renting. I love my property manager and shes super responsive. They take great care of our building and are always looking out for the tenants. I would definitely recommend renting from them.",
      "ownerResponse": []
    },
    {
      "author": "Lori Wise-Dowd",
      "rating": 5.0,
      "review": "An amazing experience! Richard and Gabby are an explosive team! They made me feel like my time matters. Deadlines were met and I was treated very professionally.",
      "ownerResponse": []
    },
    {
      "author": "Katy Henderson",
      "rating": 5.0,
      "review": "Recently rented my first apartment with the help of Gabby and she has been amazing so far! Very helpful, efficient and will go the extra mile to answer all of my questions!",
      "ownerResponse": []
    },
    {
      "author": "Ben Black",
      "rating": 5.0,
      "review": "Worked at PCR for over three years as a commercial property manger. Learned a lot and was always treated fairly. You will have to put in the effort, but you will be rewarded!",
      "ownerResponse": []
    },
    {
      "author": "Manuel Castellon",
      "rating": 5.0,
      "review": "Recently got an apartment with the help of Gabby, she was very helpful knowledgeable and made the process of finding an apartment lot less stressful. Would highly recommend.",
      "ownerResponse": []
    },
    {
      "author": "Bradley Ebinger",
      "rating": 5.0,
      "review": "My experience for getting into my apartment has been a smooth process. Thanks go to Gabby for her incredible help and guidance. Thank you Gabby!",
      "ownerResponse": []
    },
    {
      "author": "Bri Hackler",
      "rating": 1.0,
      "review": "poor business practices, poor management, unrealistic expectations for employees, not all necessary tools provided for jobs in order to complete necessary tasks, barely if any training. property management company should not offer janitorial services without proper employees/ equipment.",
      "ownerResponse": [
        {
          "text": "We are sorry your employment at Pacific Continental Maintenance did not work out. We wish you the best and hope you find what you are looking for."
        }
      ]
    },
    {
      "author": "Ann Brandi Campanilla",
      "rating": 1.0,
      "review": "Pacific Continental is super unprofessional, Im really upset we signed a lease with them. I don't even make reviews but I'm stuck with them for a year and they continue to be disrespectful even after complaints. They only care about their ",
      "ownerResponse": [
        {
          "text": "Hi Brandi,\nWe are so sorry to hear that you have had a 1-star experience with us! You are correct that it was a rush to meet the timeline and we are pleased that we were  More"
        }
      ]
    },
    {
      "author": "Keone Henry",
      "rating": 5.0,
      "review": "Richard Bomhard is the best maintenance manager I have ever worked with,his knowledge and experience are second to none he's very pleasant and helpful all while being extremely professional",
      "ownerResponse": []
    },
    {
      "author": "NIK STRUBLE",
      "rating": 2.0,
      "review": "Typical property management they dont care about you just fleecing people for as much as possible for sub par properties.",
      "ownerResponse": []
    },
    {
      "author": "Dakota Vondrachek",
      "rating": 5.0,
      "review": "Richard with Pacific Continental  Maintenance was very professional with his work, and his communication while performing the job was amazing!!! Thank You",
      "ownerResponse": []
    },
    {
      "author": "Pacific NorthWest ProWash",
      "rating": 5.0,
      "review": "Talk with SCOTT WALKER!! He is the man!! Scott has a serious business background and can help you find the best solution to your situation!! Call him today dont delay!!",
      "ownerResponse": []
    },
    {
      "author": "Duane Glass",
      "rating": 5.0,
      "review": "Richard Bomhard works hard and gets it done. Cant thank him enough for such great work!",
      "ownerResponse": []
    },
    {
      "author": "Savanna Balfour",
      "rating": 5.0,
      "review": "Professional and convenient! Everyone in the office is super friendly and helpful!",
      "ownerResponse": []
    },
    {
      "author": "Jesse Gaona",
      "rating": 5.0,
      "review": "They were super helpful in answering questions when I was trying to find my first place",
      "ownerResponse": []
    },
    {
      "author": "Marianne Uhrig",
      "rating": 5.0,
      "review": "Wonderful company to work for!",
      "ownerResponse": []
    },
    {
      "author": "Sean Cummings",
      "rating": 5.0,
      "review": "Very responsive and professional company.",
      "ownerResponse": []
    },
    {
      "author": "Matthew Moritz",
      "rating": 1.0,
      "review": "This place is dirty and smells funny",
      "ownerResponse": []
    },
    {
      "author": "Echo Mae",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "FatherChris Laine",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "kara marklin",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Sharon Moritz",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 28,
  "avg_rating": 4.2,
  "adjusted_avg_rating": 4.2,
  "summary": "# Pacific Continental Realty LLC: A Balanced Look at Property Management\n\n## Good\n\nPacific Continental Realty LLC has garnered positive attention, earning high praise particularly for individual property managers such as Gabby, who is consistently described as the 'sweetest property manager EVER' and highly valued for her responsiveness and warmth towards tenants. Many user reviews highlight the company's effective communication channels, with tenants experiencing quick and efficient responses to their queries and requests. The approachability of the maintenance staff is also frequently mentioned, with their prompt service and friendly demeanor contributing to a satisfying tenant experience.\n\nThe professional conduct of Pacific Continental Realty LLC's agents and their attention to detail have not gone unnoticed. For example, a property manager named Gabby is regularly cited for her efficiency and courteous nature, effectively transforming the management of a 50+ unit residential complex. Additionally, positive feedback about fair and reasonable rent, especially in regard to commercial office spaces, suggests that Pacific Continental Realty LLC is managing to strike a balance between profitability and tenant satisfaction.\n\n## Great\n\nBeyond the day-to-day operations, some tenants laud the company for going the extra mile. This is especially apparent in the way Pacific Continental Realty LLC makes clients feel valued and heard, meeting deadlines, and providing a sense of professionalism that instills confidence. The personal touch can go a long way, as evidenced by a user's experience with Pete Wasley who provided a thorough evaluation of their property with clear explanations and helpful advice.\n\nThe company's ability to foster long-term relationships is showcased in reviews that celebrate over a decade-long association with principals of Pacific Continental Realty LLC. The continuity of service and consistent performance over the years have kept certain clients feeling secure and attended to, reflecting the deep-rooted commitment the company has to its clientele. For employees, as well, there's a sense of reward for effort put in, suggesting a culture of internal fairness and learning.\n\n## Bad\n\nNevertheless, not all experiences have been glowing. Some tenants have raised concerns about rental increases, with one user citing a rent hike of over 30% within two years, intimating a disconnect between cost and value provided. Moreover, there have been allegations of mismanagement, such as reports of tenants not receiving itemized statements for withheld deposits, which stands contrary to what is typically expected from a professional property management firm.\n\nCommunication, while generally praised, has not been uniformly excellent; one user review speaks of greater attentiveness to online negative reviews than to actual emails from tenants. This suggests inconsistencies in communication which might lead to tenant frustration. Specifically, complaints about advertised amenities, such as dishwashers, not being present upon move-in reflect a gap between marketing and reality that can cause dissatisfaction and mistrust.\n\n## Ugly\n\nThe ugliest aspects of the user reviews relate to accusations of outright unprofessional behavior and poor business practices. Some tenants express regret at signing leases due to what they claim are disrespectful interactions, even after lodging complaints. Such experiences can mar the reputation of a management company and highlight potential areas where more sensitive handling of tenant relations is needed.\n\nFurthermore, one particularly scathing review from an employee suggests the company falls short in providing necessary tools and training for certain jobs, along with having unrealistic expectations. While this has been addressed with an owner response, the existence of such a viewpoint indicates internal challenges and discontent that can affect overall service delivery and employee morale.\n\nThis article’s intent is simply to summarize and balance out the varying opinions present in the user reviews, providing an overall picture of Pacific Continental Realty LLC based on the experiences shared online. The content has been generated by ChatGPT, and is intended to be a tool to help potential clients find a property management company or rental property that best suits their needs."
}