{
  "name": "Porchlight Property Management LLC",
  "address": "",
  "company_type": "Property management company",
  "review_count": 33,
  "avg_review": 3.8,
  "reviews": [
    {
      "author": "Rashel lyn",
      "rating": 5.0,
      "review": "This may be a a 2 part review, this is the review for the start of my rental process:\nI had the pleaser in meeting Haleigh for 3 different available apartments- She ",
      "ownerResponse": []
    },
    {
      "author": "Angela Huidekoper",
      "rating": 1.0,
      "review": "DO NOT RENT FROM THIS COMPANY!\n\nThey withheld $430 of our deposit and refused to do a move-out walkthrough. They ",
      "ownerResponse": []
    },
    {
      "author": "deedee zarate",
      "rating": 1.0,
      "review": "I hate writing bad reviews but this couldn't go unnoticed. We were excited to move into the La Villa apartments and at first the staff was really helpful and nice. As time progressed, we had a few problems with our upstairs neighbors (a ",
      "ownerResponse": [
        {
          "text": "We're disappointed to hear you didn't have a great experience with Porchlight. We try to foster good relationships, but always recommend that tenants reach out to law enforcement when they have problems with neighboring tenants or feel  More"
        }
      ]
    },
    {
      "author": "Kaitlyn Graves",
      "rating": 1.0,
      "review": "I had applied for a commercial unit porch light was responsible for. After a month of emailing back and forth,  I was informed that I had been approved for the unit and that they would write up the lease for it.  And since i had been ",
      "ownerResponse": []
    },
    {
      "author": "C.A. Carebear Starr",
      "rating": 5.0,
      "review": "Wonderful experience with the different staff members that I've been able to work with.  Marlae is great at what she does,  but is also a STELLAR HUMAN BEING. The entire experience & time in which I was living in a rental managed by ",
      "ownerResponse": []
    },
    {
      "author": "Sergio Coln",
      "rating": 5.0,
      "review": "I helped my tenant relocate to a property managed by Porchlight Properties.  Brandee was very professional and informative.  Great communication and very responsive with email and phone.  Thank you!!",
      "ownerResponse": []
    },
    {
      "author": "Timothy Radch",
      "rating": 5.0,
      "review": "Great company and friendly people, was a pleasure dealing with them.",
      "ownerResponse": []
    },
    {
      "author": "Vitaliy Shtempel",
      "rating": 1.0,
      "review": "Pure scam - showed me 2 apartments, after coming and seen those apartments, she told me that they are NOT AVAILABLE right away during showings, because someone already applied and been approved. Charged 40$ TWICE for showing UNAVAILABLE TO ",
      "ownerResponse": [
        {
          "text": "Hi Vitaliy, I'm sorry you had a negative experience with our company. Properties have been renting very quickly lately, and we're not always immediately aware when someone applies online for one of our units. Also, documents we requested  More"
        }
      ]
    },
    {
      "author": "gunarmc",
      "rating": 5.0,
      "review": "Excellent people to do with. The office staff is so nice!",
      "ownerResponse": []
    },
    {
      "author": "Yevgeniy Zadneprovskiy",
      "rating": 5.0,
      "review": "Best Property Management company weve worked with. They were very professional, response times were quick and when we had a couple issues come up at our rental we had resolution quickly. Both Mitzi and Marlae were awesome and wed happily work with them again.",
      "ownerResponse": []
    },
    {
      "author": "Jeff Pygott",
      "rating": 1.0,
      "review": "I would not use them again.\nLots of tenant damage, and they didn't do a walk through before the tenants left. ",
      "ownerResponse": [
        {
          "text": "Our policy is to conduct a final walk-through after the tenants turn in keys. In this case, the tenants dropped the keys through our night slot over a weekend, and by Monday morning, the owners had moved back into the property (without  More"
        }
      ]
    },
    {
      "author": "cory daniel wolf",
      "rating": 5.0,
      "review": "I sure appreciate the management team at Porchlight Property Management, they are always very pleasant and helpful if I have any problems!",
      "ownerResponse": []
    },
    {
      "author": "Jan Szczygielski",
      "rating": 1.0,
      "review": "It's just my personal experience, but when they go and start making false accusations about my dog biting people that is going to far. ",
      "ownerResponse": []
    },
    {
      "author": "Derek Schranz",
      "rating": 1.0,
      "review": "These property managers are not professional by any means!!  They wont fix things, wont correspond with you, talk down to you and treat people unfairly!!   I would not recommend renting from them at all!!!  STAY FAR FAR AWAY FROM THEM OR THEIR BUSINESSES!!",
      "ownerResponse": []
    },
    {
      "author": "DeeNaaLee",
      "rating": 5.0,
      "review": "These kind folks have been wonderful",
      "ownerResponse": []
    },
    {
      "author": "Sherryann Johnson",
      "rating": 5.0,
      "review": "Never rented from a property management co before but they were wonderful and we are very happily settling into our new house  ",
      "ownerResponse": []
    },
    {
      "author": "Sorceress Mystic",
      "rating": 1.0,
      "review": "Dishonest if used as a reference once you move from a property managed by them\nreally difficult to deal with when it comes to maintenance issues",
      "ownerResponse": []
    },
    {
      "author": "Jem Hayes",
      "rating": 5.0,
      "review": "Much love for porch light property management always there for you, very understanding and flexible",
      "ownerResponse": [
        {
          "text": "Thanks Jem!"
        }
      ]
    },
    {
      "author": "1One Love",
      "rating": 1.0,
      "review": "They lied about renting a unit to me and tried to take my deposit",
      "ownerResponse": [
        {
          "text": "Since this person provided vague 1-star reviews for several property management firms at nearly the same time, it appears to be an unfounded negative campaign against property managers in general. We only take a deposit after someone is  More"
        }
      ]
    },
    {
      "author": "Juniorprincetroyneilesia Loeak",
      "rating": 5.0,
      "review": "Marlae and the other Lady theyre Personnel friendly and helpful. Would recommend Porchlight management  to anyone. ",
      "ownerResponse": []
    },
    {
      "author": "Kennedy Chauvin",
      "rating": 5.0,
      "review": "I  love these guuuurls! ",
      "ownerResponse": []
    },
    {
      "author": "jose lobo fernandez",
      "rating": 5.0,
      "review": "Nice and gently people",
      "ownerResponse": []
    },
    {
      "author": "G GT T",
      "rating": 5.0,
      "review": "The best",
      "ownerResponse": [
        {
          "text": "Thank you Geoff!"
        }
      ]
    },
    {
      "author": "Vicki Ballinger",
      "rating": 1.0,
      "review": "Not very responsive to the tenant.",
      "ownerResponse": []
    },
    {
      "author": "William Jackson",
      "rating": 5.0,
      "review": "Would recommend highly",
      "ownerResponse": []
    },
    {
      "author": "Cody S",
      "rating": 5.0,
      "review": "Mitzi is very nice",
      "ownerResponse": []
    },
    {
      "author": "Human",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Gurwinder Gill",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Kylee King",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Charmae Scheffer",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Steven George",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Daniel Crutchfield",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the review Daniel. We appreciate constructive criticism, and would love to know where we could do to improve and earn that fifth star! "
        }
      ]
    },
    {
      "author": "Mongol Rain Pix",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 26,
  "adjusted_review_average": 3.5,
  "summary": "# Porchlight Property Management LLC: A Balanced Review\n\nThis article reflects on the array of user reviews for Porchlight Property Management LLC. The intent is to offer readers a comprehensive summary of experiences with this property management company. Please note that these reviews are generated by ChatGPT and are to be used as a tool to help in finding a property management company or rental.\n\n## Good\n\nMany tenants have expressed immense satisfaction with their interactions with Porchlight Property Management LLC. From the professionalism exhibited by staff members to the quick response times for communications, they certainly seem to impress in these areas. Particularly, users emphasized positive experiences when dealing with maintenance concerns, extolling how swiftly and efficiently their issues were resolved. There were commendations for individual staff members, who were praised not just for their effectiveness in their roles, but also for their wonderful human qualities, which significantly enhanced the rental experience.\n\nIt's also heartening to see that the good Samaritans are vocal within this community. A number of reviews specifically laud the friendly nature of the people at Porchlight Property Management LLC, the ease of dealing with the company, and the overall excellent service provided. This has led some reviewers to declare the company as the best property management they've worked with, reflecting highly on the company's reputation.\n\n## Great\n\nWhen it comes to Porchlight's staff, the accolades continue. Many residents appreciated the staff for being understanding and flexible, ensuring that every interaction was both warm and accommodating. The approachability and professionalism of team members like Marlae are often highlighted, indicating that the company invests in hiring personnel who are both skilled and empathetic. The willingness to engage with residents and the personalized care provided have left many feeling valued and well taken care of.\n\nMoreover, reviewers have mentioned how Porchlight Property Management LLC's staff is exceptional at fostering tenant relationships. There are multiple shout-outs to the team for going above and beyond to facilitate smooth relocations and address concerns as they arise. Compliments about great communication, especially through email and phone, suggest that the company makes it a priority to stay accessible and responsive to its clientele.\n\n## Bad\n\nNevertheless, despite the glowing testimonials, some negative sentiments are apparent among the user reviews. There have been instances where reviewers felt that the company did not live up to its responsibilities, citing poor communication as a primary grievance. For example, concerns are raised about lack of action in dealing with tenant disputes or damage, leaving some to feel neglected in their times of need. These criticisms shed light on areas where the company's operations could perhaps be improved.\n\nComplaints about the handling of security deposits are also recurring themes in the feedback. Some users describe their frustration with Porchlight retaining parts of the deposit without adequate justification or failing to conduct walk-through inspections with tenants. This has led to perceptions of mistrust and disputes over financial matters, which is a sensitive issue for most renters.\n\n## Ugly\n\nRegrettably, in some cases, the experiences detailed in the reviews get even grimmer. Allegations of dishonesty in their business practices, such as misleading prospective tenants about the availability of apartments, have surfaced. And while the company has responded to some critiques, the ratio of responses to the number of negative reviews may suggest a need for improved engagement with dissatisfied customers.\n\nOne review recounted a troubling issue of false accusations towards a tenant's pet, an event that highlights the potential for significant disputes and distress in the landlord-tenant relationship. Additionally, some renters characterized Porchlight Property Management LLC as unprofessional and unfair, with a few going as far as to warn others to stay away from the company's properties. These strong words reflect deep dissatisfaction and signal the necessity for the company to address such concerns earnestly.\n\nThis article's intent is to present a neutral, honest assessment of Porchlight Property Management LLC based on user reviews. While there are numerous positive accounts, the negative experiences cannot be overlooked. It is crucial for potential tenants to weigh both sides and perhaps engage directly with the company to ascertain its current standards of service."
}