{
  "name": "PURE Property Management of Washington",
  "address": "",
  "company_type": "Property management company",
  "review_count": 114,
  "reviews": [
    {
      "author": "Tru Aging Solutions Marketing",
      "rating": 4.0,
      "review": "My hot water quit working on Sunday. I was appreciative of the timely response end of the recognition of my experience in the h vac industry. As to the recommendations to replace the water heater. It was done quickly and efficiently and timely.",
      "ownerResponse": []
    },
    {
      "author": "River Kley",
      "rating": 5.0,
      "review": "I appreciate the timely and efficient work order process! The manager, Barbara Flores Reta made the process of getting my dryer fixed quick and easy and allowed me to resume laundry in no time! Thank you to the Pure Property Management for resolving my issues so quickly!",
      "ownerResponse": []
    },
    {
      "author": "Larry Lindborg",
      "rating": 5.0,
      "review": "I want to compliment Barbara on her great help with my rental maintenance in Ferndale  she was very attentive responsive  informative and prompt  it was nice working with someone that is professional and personal  so many businesses are not ",
      "ownerResponse": []
    },
    {
      "author": "Space Cowboy",
      "rating": 1.0,
      "review": "One of the worse companies Ive ever had the displeasure to be involved with. Taking over from the last company, they have done the impressive task of making Son-Rise a proactive business. Issues ranging from toilet not flushing, constant ",
      "ownerResponse": []
    },
    {
      "author": "Aaron Schardein",
      "rating": 1.0,
      "review": "Why would you have showings with boxes you don't have access to now I wasted an hour of my time and there is no solution till Monday maybe only allow showing when someone on staff can oversee operations machines can only do so much.",
      "ownerResponse": []
    },
    {
      "author": "lisa r",
      "rating": 5.0,
      "review": "From the moment we entered the Son-Rise office in July 2022, we had excellent service. They were easy to work with during the application process and available to answer all our questions and concerns.  Last week there was an issue with the ",
      "ownerResponse": [
        {
          "text": "Hi Lisa:  Wow! Thank you for giving us a 5-star review. We appreciate your time and effort in letting us know that you are happy with our service. All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Tabitha Cox",
      "rating": 5.0,
      "review": "Son-Rise has been flexible, easy to work with, and understanding. We just signed our third lease with them, and though we've only paid rent late once, they were understanding and empathetic during that hard time. They have a very balanced ",
      "ownerResponse": [
        {
          "text": "Dear Tabitha,\n\nThank you so much for taking the time to share your positive experience with  More"
        }
      ]
    },
    {
      "author": "Darren Bell",
      "rating": 5.0,
      "review": "Very responsive and professional. Barbara Reta was a pleasure to work with when we were sorting things out.\nVery impressive. I would highly recommend this service",
      "ownerResponse": []
    },
    {
      "author": "Rick Blair",
      "rating": 5.0,
      "review": "Great service, work with Barbara Flores regularly and she gets work orders approved and the job complete!",
      "ownerResponse": []
    },
    {
      "author": "Gina Aiello",
      "rating": 5.0,
      "review": "Maintenance issues resolved quickly. Barbara Flores Reta was a pleasure to work with, professional and timely.",
      "ownerResponse": []
    },
    {
      "author": "Julie Oldham",
      "rating": 5.0,
      "review": "Service was excellent. Response time was very good. The job got quickly was very satisfied  the service.",
      "ownerResponse": []
    },
    {
      "author": "erich cosgrove",
      "rating": 5.0,
      "review": "Team is very pleasant to work with and always quick to respond to our requests.  They treat our property as if it were their own, as well as take care of all tenant issues with efficiency and pride.  Excellent management company.  Would recommend to any property owner.",
      "ownerResponse": [
        {
          "text": "Hello Erich: Thank you very much for the 5* review!  We really appreciate owners like you who are prompt in responding to tenant issues. All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Adam Mcgary",
      "rating": 4.0,
      "review": "Kandis, with Son Rise has been very helpful with our transition from one rental we've had for years to the next, that is about to be our place!  She worked with us, which we really appreciate.  Knowing it's a hard time of year to move, they ",
      "ownerResponse": [
        {
          "text": "Hello Adam and Shandra: Thank you for taking the time to send us a 4-star review!  We really appreciate your feedback and look forward to working with you in the coming years.  All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "javier felix",
      "rating": 1.0,
      "review": "Submitted application for Rental property, 2 weeks later told property already has approval application. My application was never looked at, now they wont refund fee. Scammers,  dont apply! Asked to created pet profile for another $25",
      "ownerResponse": []
    },
    {
      "author": "Ashley Zalucha",
      "rating": 5.0,
      "review": "I spoke with Jennifer with Son-rise earlier today and I greatly appreciated her time and assistance. She was kind, professional, and extremely helpful as she went above and beyond to help answer my questions. While I unfortunately will most ",
      "ownerResponse": [
        {
          "text": "Hello Jennifer! Thank you for your 5 star review.  We really appreciate your feedback and agree that Jennifer provides awesome customer service.  She certainly does go \"above and beyond\"!  All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Paul Backus",
      "rating": 3.0,
      "review": "This was the third management company for my apartment after the property sold, so my experience doesn't encompass beginning or ending a lease with them yet. ",
      "ownerResponse": [
        {
          "text": "While we are thankful for your feedback, we would like to learn more about why your experience was not an exceptional one. Reach out to us at (360) 738-3700 to let us know how we can improve for your next visit."
        }
      ]
    },
    {
      "author": "Lynn Kalsbeek",
      "rating": 5.0,
      "review": "Son-Rise has been providing property management services for me for the past 6 years. They make it easy to own a rental property as they take care of finding and screening tenants, scheduling maintenance and looking after repairs and ",
      "ownerResponse": [
        {
          "text": "Thank you, Lynn. We appreciate you taking the time to leave your kind review of Son-Rise Property Management, Inc... We look forward to taking care of your needs in the future. Have a wonderful day!"
        }
      ]
    },
    {
      "author": "jake schmitt",
      "rating": 1.0,
      "review": "They don't give any care for their tenants and only care about the money they make. You'll never get your full deposit back and just throw random charges on there. ( Ie. Cleaning all day to make it spotless and have a charge for 199 for ",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to voice your concerns. Please reach out to us at (360) 738-3700 to further discuss your concerns. Thank you and we hope to hear from you promptly."
        }
      ]
    },
    {
      "author": "Amber Suedekum",
      "rating": 5.0,
      "review": "Have been renting from them for a little over 2 years now and they have been nothing but awesome. Whenever we go in to pay rent and the kiddos come with us inside, everyone is so nice to them, even if they are doing something else, they are ",
      "ownerResponse": [
        {
          "text": "Hello Amber, thank you for your kind review! Whenever your family comes in to Son-Rise you always put a smile on our faces."
        }
      ]
    },
    {
      "author": "Cheri Beri",
      "rating": 5.0,
      "review": "Ive been with son-rise for a long time and as a responsible tenant, I have nothing but good things to say about them. They have been responsive and handled every need right away. They are fair and understand special circumstances. You have ",
      "ownerResponse": [
        {
          "text": "Hey there! Thank you so much for taking the time to share your feedback with us. We truly appreciate any comments we receive as it's a great way to gain unbiased insight on how we're doing. It's fantastic to know that you had a positive experience and we hope to see you again soon at Son-Rise Property Management, Inc.."
        }
      ]
    },
    {
      "author": "Nicole Jackson",
      "rating": 5.0,
      "review": "I have had the BEST experience so far with Son-Rise. I had spent hundreds of dollars on applying for apartments through other Property Management companies (even signed a lease and paid a deposit but was taken off of the lease without my ",
      "ownerResponse": [
        {
          "text": "Hello Nicole. Thank you for taking the time to share your detailed feedback! Our team at Son-Rise Property Management, Inc. always strives for the highest standards. We are delighted we made your experience a positive one. Until next time, take care."
        }
      ]
    },
    {
      "author": "Whitney",
      "rating": 3.0,
      "review": "Janet went out of her way for a lot of things.  Because we spent 15 hours cleaning, we received our deposit back. ",
      "ownerResponse": [
        {
          "text": "Hello there, Whitney. Our customers are very important to us and we are sorry to hear about this experience. Let us know more about what happened and how we can remedy that for you. Please call our office at (360)738-3700 when you're able. Thank you."
        }
      ]
    },
    {
      "author": "Adrienne Manwaring",
      "rating": 5.0,
      "review": "I have had nothing but positive experiences with Son-Rise. The leasing agent who handles the property I'm in is very responsive and typically gets things in my condo fixed within a couple of days. She is very professional and treats me with respect.  I am a very happy \"customer\".",
      "ownerResponse": [
        {
          "text": "Hey there, Adrienne! Thank you so much for taking the time to share your feedback with us. We truly appreciate any comments we receive as it's a great way to gain unbiased insight on how we're doing. It's fantastic to know that you had a positive experience and we hope to see you again soon at Son-Rise Property Management, Inc.."
        }
      ]
    },
    {
      "author": "Helen Schoenfeld",
      "rating": 5.0,
      "review": "I've managed my own rentals in the past, and it's always been time-consuming and stressful. When I needed to rent this property I contacted Son-Rise on the advise of a friend, and I couldn't be more satisfied. When I first listed it, the ",
      "ownerResponse": []
    },
    {
      "author": "Colter Bolaski",
      "rating": 1.0,
      "review": "I have had many interactions with this company both on a personal level and a professional level. This company is by far one of the most sued property management companies in the county. They rip off their tenants with high prices, lack of ",
      "ownerResponse": [
        {
          "text": "While we are thankful for your feedback, we would like to learn more about why your experience was not an exceptional one. Reach out to us at (360) 738-3700 to let us know how we can improve for your next visit."
        }
      ]
    },
    {
      "author": "Travis Shaflik",
      "rating": 1.0,
      "review": "Pros: Apps were quick and good with maintenance\nCons: Don't expect your deposits back. They took 400$ alone for cleaning (separate from carpet cleaning) after we spent 2 weekends doing everything on a ",
      "ownerResponse": [
        {
          "text": "Hi Travis,\nThank you for your review. We want to be sure that your account is correct, and any charges are without error.  If you have any questions regarding this, please contact our office."
        }
      ]
    },
    {
      "author": "Bao Chau Tran",
      "rating": 5.0,
      "review": "I have been renting here for one year and I loved it so far. The initial application process was very quick (one week top I think). The manager and their staff really care about our needs and are very understanding. Maintenance is very ",
      "ownerResponse": []
    },
    {
      "author": "Nicholas Pickard",
      "rating": 1.0,
      "review": "These property managers do not care for their tenants. They did not inform me of mold issues before I moved in, I reported mold issues many times after this. Mold built up in the bedroom closet and window sill, ruining some of my cloths. ",
      "ownerResponse": [
        {
          "text": "Dear Nicholas: Thank you for taking the time to let us know your concerns.  Our files indicate that there no mold found during your move out process nor were you assessed any clean up charges for mold.  Please call our office if you would  More"
        }
      ]
    },
    {
      "author": "Soheyl Ghiami",
      "rating": 1.0,
      "review": "This is how I felt ripped off with Son-Rise:\nThe time we entered the apartment, carpets were full of stains, spots and holes as well as the walls. ",
      "ownerResponse": [
        {
          "text": "We're sorry to hear that you didn't have a great experience. Please call us at (360) 738-3700 to let us know more."
        }
      ]
    },
    {
      "author": "Derek Worchel",
      "rating": 5.0,
      "review": "Son Rise Property Management is an incredible company comprised of caring, considerate, and professional property managers and staff. I highly recommend working with them when your real estate asset needs professional management. I have ",
      "ownerResponse": [
        {
          "text": "That is so amazing to hear, Derek! Thank you so much for taking the time to share your feedback with our team at Son-Rise Property Management, Inc.. It's great to know that we continue to provide our customers with everything they need. Have a great day!"
        }
      ]
    },
    {
      "author": "Taylor Trettevik",
      "rating": 1.0,
      "review": "I'm tempted to join the board of my condo association with the express concern being to find new property management. The reception is rude 90% of the time. There is only one person in the whole office that can do anything associated with ",
      "ownerResponse": [
        {
          "text": "We appreciate you taking the time to leave your feedback. We're sorry we didn't provide you with the best experience that we could have. Please reach out to us at (360) 738-3700 to let us know how we can improve."
        }
      ]
    },
    {
      "author": "Grant Rich",
      "rating": 1.0,
      "review": "We have been renting with Son Rise for a year in a 650 sq ft apartment. We always paid our rent on time, never smoked or had pets or had any strange drug party's like just about everyone else in the surrounding areas did. ",
      "ownerResponse": [
        {
          "text": "Hello Grant. Thank you for your feedback. We aim to provide an exceptional experience for all of our customers and would be glad to discuss this further offline. Please reach out to us at (360) 738-3700 to let us know how we can do better."
        }
      ]
    },
    {
      "author": "Alison Roll",
      "rating": 1.0,
      "review": "My father in-law was just injured due to son rise refusing to move a vehicle blocking safe and reasonable access to his unit. This vehicle came from another building and street, yet they refused. ",
      "ownerResponse": [
        {
          "text": "Our team wants to extend our sincerest apologies concerning the issues that you have faced. We pride ourselves on maintaining the highest quality standards for our customers we hope you will give us an opportunity to discuss your concerns further with you. You can reach out to us at (360) 738-3700. We hope to find a solution promptly."
        }
      ]
    },
    {
      "author": "T Nicole",
      "rating": 5.0,
      "review": "Rented through them for almost three years with no problems. They are quick to fix issues and since we didn't do any damage and left the place clean, we got our full deposit back. Only problem was them raising the rent really high, but that's Bellingham for you.",
      "ownerResponse": [
        {
          "text": "Hello and thank you for taking the time to share your detailed feedback! We are thrilled to hear that you have nothing but amazing things to say about our team at Son-Rise Property Management, Inc. and what we offer. Thank you and have a wonderful day!"
        }
      ]
    },
    {
      "author": "Edwina Gomez",
      "rating": 1.0,
      "review": "Do Not Live At Their Properties!! I have lived all around the country and have never had more complications then with Son Rise, they never did half the things that I asked for. Such as fixing a burner on the stove top, even after I showed management when they visited the house. Be careful!!",
      "ownerResponse": [
        {
          "text": "Good Afternoon Edwina, I am sorry to hear about your unfortunate experience and anyone at our office would be happy to discuss it with you offline. Here at Son-Rise Property Management we really try to make sure that all of our tenants needs are met. We look forward to hearing from you."
        }
      ]
    },
    {
      "author": "Evan Rhodes",
      "rating": 2.0,
      "review": "They lied to me about cleaning my unit after handing me the keys. There were disgusting, crusty stains all over the carpet, smoke damage on the walls, and a disgusting smell coming from my bathroom. I even paid for my own carpet cleaner to finish the mandatory task that they failed to achieve.",
      "ownerResponse": []
    },
    {
      "author": "Andrew Liebel",
      "rating": 1.0,
      "review": "Pretty awful experience.\n\nThey towed and impounded my car that was registered on my lease and parked next ",
      "ownerResponse": []
    },
    {
      "author": "Pure 149 Design",
      "rating": 1.0,
      "review": "They manage  my property for 7 years, suddenly they changed the person in charge of my account, and I got a letter saying that I needed to spend $ 6,000.00 in repairs, and had 2 weeks to approved them or they will not represent me anymore. ",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to voice your concerns. Please reach out to us at (360) 738-3700 to further discuss your concerns. Thank you and we hope to hear from you promptly."
        }
      ]
    },
    {
      "author": "April Gassman",
      "rating": 1.0,
      "review": "This is a horibble company and the BBB needs to be called. They treated former neighbors horribly. Charged for cleaning that never happened (I live next door I saw how long the cleaners were there) and claimed the house was a mess when I ",
      "ownerResponse": [
        {
          "text": "Hi there April,  I am sorry that you feel we charged your friend unfairly.  Here at Son-Rise Property Management we outsource our vendors to keep move-out cleaning and repairs as transparent as possible, and only remove what we were charged  More"
        }
      ]
    },
    {
      "author": "Jordan",
      "rating": 1.0,
      "review": "called in and asked for the owner because my uncle is a private investor looking for a prop management company.... the receptionist said \"FOR WHAT WE HAVE LOTS OF THEM\" with the worse attitude and disrespect you could ever encounter. Her ",
      "ownerResponse": []
    },
    {
      "author": "Lucas Robinson",
      "rating": 5.0,
      "review": "Only rental company I can say I've had all positive experiences with. Extended my lease and cleaned out my new apartment days early so that I wouldn't have to couch surf between. Always nice and honest about expectations",
      "ownerResponse": [
        {
          "text": "Hi Lucas,\nThank you so much for your review.  Here at Son-Rise we strive to exceed expectations of our tenants and owners."
        }
      ]
    },
    {
      "author": "Amanda Burk",
      "rating": 1.0,
      "review": "Submitted an application over 2 weeks ago and so far have not heard back. Called Son-Rise multiple times since then and were told the processing delay was a result of the pandemic and the company being too busy. Given that people have deadlines to move in and out, we found this management company not professional.",
      "ownerResponse": [
        {
          "text": "Hello Amanda: Thank you for reaching out. We checked our inbox and files and we could not find an application from you.  Please let us know if you submitted an online application through our website.  You may call us at 360-738-3700 or email at info@son-rise.net. All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Ben Thompson",
      "rating": 5.0,
      "review": "Everyone at Son-Rise was very friendly and quick to answer questions. Sandra was especially helpful. Another bonus was the online maintenance requests which had extremely fast response time. Couldn't ask for a better experience.",
      "ownerResponse": [
        {
          "text": "Hey there, Ben. We're happy to hear you had an awesome time with us at Son-Rise Property Management, Inc.! Thanks for sharing your experience. We hope you stop by and see us again soon."
        }
      ]
    },
    {
      "author": "Greg Campbell",
      "rating": 1.0,
      "review": "Reply to response from the owner:\n\nAs a property management group, it would be very simple for you to search your ",
      "ownerResponse": [
        {
          "text": "We greatly appreciate your response; however, we are unable to find a record for you as a past or current tenant or an affiliated vendor. Please contact our office at 360-738-3700 or e-mail us at info@son-rise.net, so we can better  More"
        }
      ]
    },
    {
      "author": "Chandler Hines",
      "rating": 1.0,
      "review": "Not sure what you have to do to get a call back, left several messages.\n\nOnly communication I get is when they want my 44$ every month",
      "ownerResponse": []
    },
    {
      "author": "Adrienne Martin",
      "rating": 5.0,
      "review": "Son-Rise is proof that not all property management companies are terrible! Their office staff are professional and kind, and Kandis was absolutely wonderful to work with.",
      "ownerResponse": [
        {
          "text": "We're grateful to know that your experience with us was an amazing one, and that Kandis was able to take care of your needs! We're always happy to hear appreciation from our customers. We look forward to seeing you again soon at Son-Rise Property Management, Inc."
        }
      ]
    },
    {
      "author": "Taylor Ingram",
      "rating": 1.0,
      "review": "I wish I could give zero stars. Every time I call and politely try to speak to someone, whoever answers is SO incredibly rude. I just moved into an apartment under their management about two months ago and they have made settling in so difficult. I really wish they could be a tad more conscious about how they treat people.",
      "ownerResponse": [
        {
          "text": "We want to sincerely apologize for your negative experience with us, however, we'd like to learn more about the situation. We want to make things right. Please contact us at (360) 738-3700 and we will get back to you promptly. We look forward to hearing from you."
        }
      ]
    },
    {
      "author": "Zach Welch",
      "rating": 1.0,
      "review": "I don't have time to go into how much this company sucks. They treat their tenets like crap. They essentially have long term contracts with big property owners and no accountability because of it. If you have an option, I'm warning you, don't rent from them, or anyone who uses them to manage a property.",
      "ownerResponse": []
    },
    {
      "author": "Sarah Mccutchen",
      "rating": 5.0,
      "review": "So Son-rise was on top of every maintenance need we had the short time we were there. Kandis is awesome to work with and met all our needs.",
      "ownerResponse": [
        {
          "text": "Hello Sarah. We're grateful to know that your experience with us was an amazing one! We're always happy to hear appreciation from our customers. We look forward to seeing you again soon at Son-Rise Property Management, Inc.."
        }
      ]
    },
    {
      "author": "Matthew Engelhardt",
      "rating": 1.0,
      "review": "If you want to spend half your paycheck and have a 700+ credit score this is the place for you",
      "ownerResponse": []
    },
    {
      "author": "jo schoenecker",
      "rating": 5.0,
      "review": "The property manager is prompt and professional in addressing tenant and landlord concerns  communicating clearly  and providing informative solutions to the satisfaction of both parties.",
      "ownerResponse": [
        {
          "text": "Thank you Jo for the wonderful review of Son-Rise Property Management, Inc.! We appreciate you taking time to leave your feedback and we look forward to seeing you again soon."
        }
      ]
    },
    {
      "author": "Sarah Matonis",
      "rating": 1.0,
      "review": "This review is about Brittany. She is impossible to get a hold of by email or phone call, and the office was closed during business hours when I tried to just drop by",
      "ownerResponse": [
        {
          "text": "Good morning Sarah: We do not have a Brittany in our office and believe that you have mistaken us with another company. Would you please remove your review as it does not pertain to Son-Rise Property Management.  Thank you for your kind attention to this matter!"
        }
      ]
    },
    {
      "author": "Andrea Benson",
      "rating": 4.0,
      "review": "My small family had a good experience with Son-Rise. Maintenance was usually prompt, and the employees were always polite and professional.",
      "ownerResponse": []
    },
    {
      "author": "casey pratt",
      "rating": 1.0,
      "review": "Bunch of turds. Kicked my girlfriend out of her apartment the she had lived in for 4 years with a 20 day notice in the middle of winter. Good business ethics I would say.",
      "ownerResponse": [
        {
          "text": "We're extremely sorry that you had to face such difficulties. Issues in our customer service is not something we are known for. As you can see from our other reviews, we pride ourselves on providing great service and we'd like to do the  More"
        }
      ]
    },
    {
      "author": "Tom Butler",
      "rating": 5.0,
      "review": "Is great staff that takes care of their clients. They stay on top of safety requirements and the requirements and make the properties look great",
      "ownerResponse": [
        {
          "text": "Thank you Tom for leaving us a 5* review.  We really appreciate the time that you took to let us know!  All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Sergey Nazarov",
      "rating": 5.0,
      "review": "I work with this company as a vendor.\nI like the way they work and take care of their tenants. Amanda is amazing.",
      "ownerResponse": [
        {
          "text": "We appreciate the lovely feedback of Son-Rise Property Management, Inc.. Thank you and have a great day!"
        }
      ]
    },
    {
      "author": "sergej mijic",
      "rating": 5.0,
      "review": "Without no doubt, best management company in Bellingham area. They always come through no matter what the problem is. Thank you son-rise!",
      "ownerResponse": [
        {
          "text": "We appreciate your kind feedback of Son-Rise Property Management, Inc. and thank you for taking the time to leave us a review. Please do not hesitate to visit us again soon! Have a great day and thanks again."
        }
      ]
    },
    {
      "author": "chas Pinyard",
      "rating": 4.0,
      "review": "Work done in timely manner, closely monitored by son-rise. Personnel friendly and helpful. Would recommend to anyone.",
      "ownerResponse": [
        {
          "text": "That is so amazing to hear, Chas! Thank you so much for taking the time to share your feedback with our team at Son-Rise Property Management, Inc.. It's great to know that we continue to provide our customers with everything they need. Have a great day!"
        }
      ]
    },
    {
      "author": "Avery VanKirk",
      "rating": 5.0,
      "review": "Stayed in 808s for 2 years. Staff was friendly when I had to go into the office and I got nearly my entire deposit back.",
      "ownerResponse": [
        {
          "text": "Thanks Avery for the wonderful review of Son-Rise Property Management, Inc.. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"
        }
      ]
    },
    {
      "author": "Barbara Lynn",
      "rating": 4.0,
      "review": "These guys are way better than APEX property management. APEX  makes son-rise look like angels.",
      "ownerResponse": [
        {
          "text": "Thanks Barbara for the wonderful review of Son-Rise Property Management, Inc.. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"
        }
      ]
    },
    {
      "author": "Amy Baker",
      "rating": 1.0,
      "review": "They don't give people second chances in life and if u have a criminal background they don't rent to u",
      "ownerResponse": [
        {
          "text": "We're sorry to hear that you didn't have a great experience. Please call us at (360) 738-3700 to let us know more."
        }
      ]
    },
    {
      "author": "james Wadkins",
      "rating": 1.0,
      "review": "60K a year wasn't enough to get approved for a 1200/month rental. This place is a JOKE.",
      "ownerResponse": [
        {
          "text": "Hello there, James. We're sorry to hear your experience with us was less than amazing. Please reach out to us at (360) 738-3700 so we can understand what happened and how we can improve."
        }
      ]
    },
    {
      "author": "Mike Harka",
      "rating": 4.0,
      "review": "This is the Property Management, Company that manages the Voltaire, Apts. were i live. Good people.   ",
      "ownerResponse": [
        {
          "text": "Thanks Mike for the wonderful review of Son-Rise Property Management, Inc.. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"
        }
      ]
    },
    {
      "author": "Linden Nolen",
      "rating": 4.0,
      "review": "no major problems, rent was raised significantly for following year though",
      "ownerResponse": [
        {
          "text": "Hello Linden. Thank you so much for taking the time to share your feedback with us. We truly appreciate any comments we receive as it's a great way to gain unbiased insight on how we're doing. We're so glad to know that you had a positive experience and we hope to see you again soon at Son-Rise Property Management, Inc.."
        }
      ]
    },
    {
      "author": "Brittany Rose",
      "rating": 5.0,
      "review": "Wonderful professional property managers! Its a pleasure working with them.  ",
      "ownerResponse": [
        {
          "text": "Thank you so much Brittany for taking the time to share this short but sweet feedback. We're happy to hear that you have had a wonderful experience with us at Son-Rise Property Management, Inc. and we hope to continue serving you in the future!"
        }
      ]
    },
    {
      "author": "NIK STRUBLE",
      "rating": 4.0,
      "review": "Well the office has been closed since the outbreak but everyone I've dealt with here is friendly and professional.",
      "ownerResponse": [
        {
          "text": "That is so amazing to hear! Thank you so much for taking the time to share your feedback with our team at Son-Rise Property Management, Inc.. While we are closed to the public, we are currently in the office from 9 AM to 3 PM Monday through Friday, and can assist via email (info@son-rise.net) or phone at (360)738-3700. Have a great day!"
        }
      ]
    },
    {
      "author": "Jdubsky",
      "rating": 4.0,
      "review": "Rented from for years pretty much do their job lol",
      "ownerResponse": [
        {
          "text": "Thank you Jdubsky for your 4* review.  We appreciate your feedback! All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "John K Cummings",
      "rating": 2.0,
      "review": "A rule about this a rule about that, listings all over the internet and not one of them are available",
      "ownerResponse": [
        {
          "text": "Hello John:  We are sorry that you had a disappointing experience with finding a rental. Should you have any questions about the leasing requirements, please call us directly and we will be happy to assist you.  All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Brittany Evans",
      "rating": 2.0,
      "review": "Was trying to rent from them and I just did not like it at all",
      "ownerResponse": [
        {
          "text": "Hello Brittany and thank you for leaving a review. It sounds like we may have failed to deliver our best for you. Please feel free to give our office a call at (360)738-3700 to discuss how we can improve."
        }
      ]
    },
    {
      "author": "Ian McAllaster",
      "rating": 5.0,
      "review": "They helped my sister find an apartment!!",
      "ownerResponse": [
        {
          "text": "Hi Ian. Thank you so much for your 5-star review. We hope your sister is happy with her new home.  All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Theo Radke",
      "rating": 5.0,
      "review": "Best property management company you can find!",
      "ownerResponse": [
        {
          "text": "Thank you Theo for the wonderful review of Son-Rise Property Management, Inc.. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"
        }
      ]
    },
    {
      "author": "C. Hamner",
      "rating": 5.0,
      "review": "Top notch maintenance.   Very professional staff.",
      "ownerResponse": [
        {
          "text": "Thank you for your kind review of Son-Rise Property Management, Inc.. We appreciate you taking the time and hope you will visit us again soon. Have a great day and thanks again!"
        }
      ]
    },
    {
      "author": "Molly Pearson",
      "rating": 1.0,
      "review": "Absolutely worthless. Don't waste your time or money here.",
      "ownerResponse": [
        {
          "text": "We want to sincerely apologize for your negative experience with us, however, we'd like to learn more about the situation. We want to make things right. Please contact us at (360) 738-3700 and we will get back to you promptly."
        }
      ]
    },
    {
      "author": "Benjamin Branigh",
      "rating": 5.0,
      "review": "Helped me get a better life.",
      "ownerResponse": [
        {
          "text": "Thank you Benjamin for leaving us a 5 star review! We are so happy to here that we made an impact on your life. If you ever have anything come up always feel free to give us a call."
        }
      ]
    },
    {
      "author": "Viera Matuska",
      "rating": 5.0,
      "review": "I love this place. Thank you guys.",
      "ownerResponse": [
        {
          "text": "Thanks so much for taking the time to share this short but sweet feedback. We're happy to hear that you have had a great experience with us at Son-Rise Property Management, Inc. and we hope to continue serving you in the future!"
        }
      ]
    },
    {
      "author": "Maria Salazar",
      "rating": 1.0,
      "review": "Not happy",
      "ownerResponse": [
        {
          "text": "Hello Maria and thank you for taking the time to leave us a review. We would appreciate feedback on how we can improve. Please call (360) 738-3700 at your earliest convenience. Thank you!"
        }
      ]
    },
    {
      "author": "Shaun Mckay",
      "rating": 5.0,
      "review": "My son is not here though",
      "ownerResponse": [
        {
          "text": "We appreciate the 5 star review! Thank you for taking the time to leave us a review. If you ever need to contact us please don't hesitate!"
        }
      ]
    },
    {
      "author": "Steve Skippy Austin",
      "rating": 3.0,
      "review": "Over priced bellingham at its finest.",
      "ownerResponse": [
        {
          "text": "Steve, thank you for taking time to review us. We are concerned that we didn't meet your expectations. Please call (360) 738-3700 when you have the chance. Take care."
        }
      ]
    },
    {
      "author": "Mitch Lundy",
      "rating": 5.0,
      "review": "Great team and mangment",
      "ownerResponse": [
        {
          "text": "That is so amazing to hear, Mitch! Thank you so much for taking the time to share your feedback with our team at Son-Rise Property Management, Inc.. It's great to know that we continue to provide our customers with everything they need. Have a great day!"
        }
      ]
    },
    {
      "author": "Justina Owens",
      "rating": 2.0,
      "review": "Need maintain better.",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to leave us a review. Unfortunately, we don't see you in our system as a current or past tenant. Could you please contact our office so that we can address any concerns that you have. (360)738-3700"
        }
      ]
    },
    {
      "author": "Eric Jones",
      "rating": 5.0,
      "review": "Awesome",
      "ownerResponse": [
        {
          "text": "Thanks so much for taking the time to share this short but sweet feedback! We're happy to hear that you had a great experience with us at Son-Rise Property Management, Inc. and hope to see you again take care!"
        }
      ]
    },
    {
      "author": "Peter Withall",
      "rating": 5.0,
      "review": "Handy postion",
      "ownerResponse": [
        {
          "text": "Thank you for your five star review. The Son-Rise Property Management, Inc. team is delighted we could serve you so well."
        }
      ]
    },
    {
      "author": "Jackson Snyder",
      "rating": 4.0,
      "review": "Friendly staff!!",
      "ownerResponse": [
        {
          "text": "We appreciate the lovely feedback of Son-Rise Property Management, Inc.. Thank you and have a great day!"
        }
      ]
    },
    {
      "author": "Catalina Ramos",
      "rating": 5.0,
      "review": "Excellent Barbara.",
      "ownerResponse": []
    },
    {
      "author": "Teresa Fortanel",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hi Teresa, It looks like you had a negative experience with Son-Rise Property Management. If you would like to contact the office with more details, I'm sure someone here would be happy to assist you."
        }
      ]
    },
    {
      "author": "James Dixon (Mr.magic360)",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hello James: Thank you for your 4-star review. Please let us know what we did right or if we can be of further assistance. All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "kyle DAVIS",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "It looks as though you may have had a less than stellar experience with us. We would like to remedy that. Please give our office a call at (360)738-3700. We look forward to hearing from you. Thank you."
        }
      ]
    },
    {
      "author": "Mick H",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Mick H,\n\nThank you for taking the time to share your feedback with us. We are sorry to  More"
        }
      ]
    },
    {
      "author": "Kim",
      "rating": 2.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "I see you are giving us a 2 star review.  We work hard to give the highest quality service to our customers.  Can you please explain how we can do better?"
        }
      ]
    },
    {
      "author": "Brenden Finnerty",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We hope to see you again soon at Son-Rise Property Management, Inc.. Until then, take care!"
        }
      ]
    },
    {
      "author": "John Carrington",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to leave us a review. However, we have searched our files and you are not a past or current tenant. Please contact our office so that we can address any concerns that you may have - (360)738-3700."
        }
      ]
    },
    {
      "author": "Thomas Mordal",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jalen Wright",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Allison Quillen",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hi Allison! Thank you for taking the time to leave us a review! We see that you are a past tent, I hope your tenancy with us was great. We look forward to working with you again in the future."
        }
      ]
    },
    {
      "author": "BASHY McRae",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "While we are thankful for your feedback, we would like to learn more about why your experience was not an exceptional one. Reach out to us at (360) 738-3700 to let us know how we can improve for your next visit."
        }
      ]
    },
    {
      "author": "Emilio Esparza Salazar",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hello Emilio! Thanks for the 5-star review. All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Mary Annala",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hi Mary: Thank you for taking the time to submit a review.  We are unable to identify you as a tenant or applicant so it would be very helpful if you would let us know your concerns. You may call us at (360)738-3700 or email at info@son-rise.net. Thank you. All the best, Son-Rise Property Management"
        }
      ]
    },
    {
      "author": "Jody White",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hey there, Jody. It appears you did not have the best experience with us. Please reach out to us at (360) 738-3700 so we can understand what happened and how we can improve. We look forward to hearing from you."
        }
      ]
    },
    {
      "author": "Mackenzie frost",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Mackenzie for your great review! We look forward to helping any need you have in the future. Have a great day!"
        }
      ]
    },
    {
      "author": "Lialofateru Always",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "While we are thankful for your feedback, we would like to learn more about why your experience was not an exceptional one. Reach out to us at (360) 738-3700 to let us know how we can improve for your next visit."
        }
      ]
    },
    {
      "author": "PAYPAY CHIGURH",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "It looks like you may have had a negative experience with Son-Rise Property Management. If you would like to contact the office at (360)738-3700 with more details, I'm sure someone here would be happy to assist you."
        }
      ]
    },
    {
      "author": "Native Don",
      "rating": 3.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to leave us a review. We strive to make each customer experience a positive one and are disappointed that this wasn't the case for you. We would appreciate feedback on how we can improve and make your visit memorable for the right reasons. Please call (360) 738-3700 at your earliest convenience."
        }
      ]
    },
    {
      "author": "Art Morgan",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Natassja Primozich",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We appreciate the five stars! Thank you for rating Son-Rise Property Management, Inc. and have a great day."
        }
      ]
    },
    {
      "author": "bananasaurus rex",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hello Anastasia: We see that you withdrew your application because you found another place. We are sorry that you found our service only merited a one-star rating and hope that we can be of assistance in the future. All the best, Son-Rise"
        }
      ]
    },
    {
      "author": "mitchell.fox24",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your feedback. We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us at (360) 738-3700 to let us know how we can do better."
        }
      ]
    },
    {
      "author": "Andy Kiesel",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to leave us a review.  We see that you are a past tenant.  Please contact our office so that we can address any concerns that you may have. (360)738-3700"
        }
      ]
    },
    {
      "author": "Benton Slater",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for taking the time to leave us a review. However, we have searched our files and you are not a past or current tenant. Please contact our office so that we can address any concerns that you may have - (360)738-3700"
        }
      ]
    },
    {
      "author": "Rachel Gibson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Rachel Marx",
      "rating": 3.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thanks for leaving your rating, Rachel. We are concerned that we didn't deliver on our high standards and hope you will give us the opportunity to make it a positive one. Please call (360) 738-3700 when you're free."
        }
      ]
    },
    {
      "author": "Filip Szymaszek",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "K wake",
      "rating": 2.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your feedback. We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us at (360) 738-3700 to let us know how we can do better."
        }
      ]
    },
    {
      "author": "Bay Ryan",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Eric Lindborg",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Hello Eric: Thank you for taking the time to review us and for providing us with 5 Stars! We appreciate the feedback from Property Owners like you. All the best, Son-Rise"
        }
      ]
    }
  ],
  "adjusted_review_count": 84,
  "avg_rating": 3.1,
  "adjusted_avg_rating": 3.3,
  "summary": "# PURE Property Management of Washington: A Balanced Overview\n\n## Good\n\nPURE Property Management of Washington has garnered appreciation for being proactive and responsive in addressing tenant concerns. Several user reviews highlight specific employees by name who have demonstrated professionalism and attentiveness, contributing to positive rental experiences. For instance, one tenant expressed gratitude for the prompt repair of a malfunctioning water heater, stating that the situation was handled quickly, efficiently, and timely. Another tenant reported that their maintenance issues were resolved swiftly, and the property manager was a pleasure to work with.\n\nMoreover, some tenants have had great interactions during the length of their lease with PURE Property Management. One emphasized that their numerous maintenance requests were addressed with speed and professionalism. Others praised the company's efficiency in dealing with the application process, easy-to-use work order systems, and empathetic support during challenging times when rent payments were slightly delayed.\n\n## Great\n\nCompliments towards individual team members are a common theme in user reviews. Tenants frequently describe staff as responsive, helpful, and eager to resolve maintenance concerns, which has fostered trust and long-term tenancies. This engagement is a testament to the property management company's dedication to providing good customer service. Several tenants who signed successive leases expressed their thanks for the understanding and empathy the staff showed them during hard times.\n\nFurthermore, the reviews highlight instances of the PURE Property Management team going above and beyond, such as cleaners clearing out apartments early to help tenants avoid couch surfing, and staff being accommodating towards children when families visit the office. Landlords who opted for PURE Property Management services to handle their rentals have also indicated satisfaction with how the company manages tenant issues, screenings, and maintenance, which eases the burden of property ownership.\n\n## Bad\n\nDespite numerous positive testimonies, PURE Property Management of Washington's user reviews reveal a trend of dissatisfaction among a significant number of tenants and property owners. Common complaints include poor communication, delays in addressing maintenance requests, and a perceived lack of concern for tenants' well-being. One review, for example, described an instance where a seemingly critical application was overlooked, causing frustration over wasted effort and time.\n\nAdditional grievances include conflicts over security deposit refunds, with several tenants feeling unfairly charged upon move-out. Instances were noted of tenants spending considerable time and effort to clean properties only to be met with what they consider unjust cleaning fees deducted from their deposits. These examples reflect a broader concern over the perceived lack of fairness and transparency in the company's dealings with its renters.\n\n## Ugly\n\nCertain user reviews point to more severe issues with PURE Property Management of Washington. One alarming review mentions a situation where a resident did not receive prior warning about mold problems, citing ongoing unaddressed mold build-up that caused property damage. From a professional standpoint, there are laments of poor experience both personally and for a property owner encountering legal challenges with the company.\n\nIssues extend to accusations of predatory financial practices, wherein tenants and potential tenants claim that the company demands excessive or unnecessary fees. For example, one prospective tenant describes feeling compelled to pay for additional services like pet profiles without justification. These stories create an image of a property management company that, at its worst, prioritizes profit over tenant and owner satisfaction.\n\nThis article is generated by ChatGPT, and the intent is to serve as a balanced review summary of PURE Property Management of Washington based on user reviews. Please note that the specifics mentioned here rely on the sentiment expressed through user reviews and are intended for guidance in finding a suitable property management company or rental property."
}