{
  "name": "Real Property Management North Puget Sound",
  "address": "1325 State Ave, Marysville, WA 98270",
  "company_type": "company",
  "review_count": 217,
  "reviews": [
    {
      "author": "Srivatsan Venkatesan",
      "rating": 5.0,
      "review": "I chose this property management company  for renting my property and the experience has been great. The staff is very professional and is very good at getting things done quickly and in taking care of my rental property. I appreciate the ",
      "ownerResponse": [
        {
          "text": "Thank you for the wonderful 5-star review! We're thrilled to hear that your experience with Real Property Management North Puget Sound has been great. It's fantastic to know that our staff has been professional, responsive, and efficient in  More"
        }
      ]
    },
    {
      "author": "Pam de Sautelle",
      "rating": 5.0,
      "review": "Joseph Butcher is an amazing employee of RPM. He is professional and personable, shows empathy for situations well and pays attention to detail. ",
      "ownerResponse": [
        {
          "text": "Pam,\nThanks for the fantastic 5-star review! We're thrilled that Joseph Butcher from Real Property Management North Puget Sound impressed you with his  More"
        }
      ]
    },
    {
      "author": "Timothy Gilmore",
      "rating": 5.0,
      "review": "Rose and Cynthia were amazing to work with. They were professional, courteous and knowledgeable about everything. They made the application process seamless. They answered all my questions and were great to work with. This was my first ",
      "ownerResponse": [
        {
          "text": " Thank you for your kind words an 5 star review. Rose and Cinthia, on our leasing team, are awesome and are always trying to help people with the move-in process. They are some of our \"A\" players. We are glad to have you as one of our tenants."
        }
      ]
    },
    {
      "author": "Tracy DeLorm",
      "rating": 5.0,
      "review": "I have had the pleasure of working with Real Property Management North Puget Sound for two years now and I am thrilled with the level of service they provide. ",
      "ownerResponse": [
        {
          "text": "Thank you, Tracy! We appreciate your kind words and are grateful for the opportunity to serve you. It's been a pleasure working with you for the past two years and we're glad to hear that our rental analysis, yearly inspections, and focus on quality repairs have met your expectations. We value your trust and recommendation."
        }
      ]
    },
    {
      "author": "Kristin Johnson",
      "rating": 5.0,
      "review": "The staff at RPMNPS are all terrific.  Being a first time landlord, Frank was so helpful with getting me started with the whole process.  Gail and Rose were quick to respond with my many questions.   They all worked hard to get my house ready and up on the market.   I am so Thankful I chose them as my property management company.",
      "ownerResponse": [
        {
          "text": "Thank you, Kristin! We're grateful to have been able to assist you with becoming a first-time landlord. Our team, including Frank, Gail, and Rose, is dedicated to providing helpful and responsive service. We appreciate your trust in us as your property management company."
        }
      ]
    },
    {
      "author": "Artur Nekrasov",
      "rating": 5.0,
      "review": "I wanna say that Real Property management has done an amazing job managing the house we currently live in! We had such a great experience with them through the entire process, from finding the listing on the web to moving in - they are very ",
      "ownerResponse": [
        {
          "text": "Thanks so much for the glowing review! We're thrilled to hear you had a great experience with Real Property Management North Puget Sound. We're here to make things smooth for you, from finding the listing to sorting maintenance requests. If you ever need anything else, just give us a shout."
        }
      ]
    },
    {
      "author": "Lifetime Heating",
      "rating": 5.0,
      "review": "Terry is an amazing addition to the RPM team! He continues to make sure our mutual clients are taken care of and goes above and beyond to ensure that timely and necessary repairs get scheduled as soon as possible. We love working with RPM and everyone on their team!!",
      "ownerResponse": [
        {
          "text": "Dear Lifetime Heating,\n\nThank you for the fantastic 5-star review! We appreciate your positive feedback  More"
        }
      ]
    },
    {
      "author": "Angel",
      "rating": 5.0,
      "review": "The staff has all been very personable and professional. We have had a few hiccups along the way but it's our first year with them. ",
      "ownerResponse": [
        {
          "text": "Angel,\nThank you for taking the time to share your experience. We're pleased to hear that our staff has been personable and professional. We understand that the first  More"
        }
      ]
    },
    {
      "author": "Johnny Blackstar",
      "rating": 5.0,
      "review": "Real Property Management  got clear communication, responsiveness, expertise, professionalism, you can really trust them, they are very friendly.",
      "ownerResponse": [
        {
          "text": "Thank you so much, Johnny! We appreciate your kind words and are grateful for your trust in our services. It means a lot to us that you found our communication clear and our team responsive and friendly."
        }
      ]
    },
    {
      "author": "razedonradio",
      "rating": 5.0,
      "review": "We enlisted RPM's services to manage our properties about two years ago.  We have been very pleased with their promptness and attention our properties specific needs.  They have been integral to elevating our tenants reasons to stay long term.  Thank you RPM",
      "ownerResponse": [
        {
          "text": "Thank you for choosing Real Property Management North Puget Sound to manage your properties! We greatly appreciate your kind words and the trust you have placed in us. It's been a pleasure working with you these past two years and we're  More"
        }
      ]
    },
    {
      "author": "Homes with Celine",
      "rating": 5.0,
      "review": "I love working with Greg and the RPM team. They are always quick to respond to my questions and inquiries and treat my clients very well! I appreciate them so much I plan to use them for my own investment property.",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words! We appreciate your support and are grateful for the opportunity to assist you and your clients. We look forward to working with you on your investment property Celine!"
        }
      ]
    },
    {
      "author": "Garage Tech",
      "rating": 5.0,
      "review": "Terry the maintenance coordinator has been a pleasure to work with. As a vendor, we appreciate his promptness to respond to our requests for information or approval to move forward on repairs. We find the entire process working with Real Property Management N Puget Sound to be easy and efficient.",
      "ownerResponse": [
        {
          "text": "Dear Garage Tech,\n\nThank you for the fantastic 5-star review! We appreciate your positive feedback  More"
        }
      ]
    },
    {
      "author": "Ley Daffodil",
      "rating": 1.0,
      "review": "I cant say anything good about this property management. Moved into a very dirty (but surfaced cleaned, so couldnt tell until actually moving in), poorly taken care of home. Had many issues throughout the stay. Countless emails and ",
      "ownerResponse": [
        {
          "text": "We apologize for the experience you had with our property management. We understand your frustration with the cleanliness and maintenance issues you encountered during your stay. We strive to provide a well-maintained living environment for  More"
        }
      ]
    },
    {
      "author": "Nicole Tennison",
      "rating": 5.0,
      "review": "I highly recommend Real Property Management if you are looking to rent a property. They are professional, great to work with and will take all the stress out of having a rental property. They even have a Diamond Guarantee if a tenant doesnt pay their rent for some reason, you will still get paid!!!",
      "ownerResponse": [
        {
          "text": "Thank you, Nicole! We appreciate your kind words and recommendation. It's great to hear that our team provided you with a stress-free rental experience. We're glad you appreciate our Diamond Guarantee as well."
        }
      ]
    },
    {
      "author": "Ang Nova",
      "rating": 5.0,
      "review": "My husband and I have loved working with RPM. Such kind people, swift responses, helpful. Working with them as a middle man makes us feel really good about our rental.",
      "ownerResponse": [
        {
          "text": "Thank you so much for your kind words! We truly appreciate your feedback and are grateful to have you as valued customers."
        }
      ]
    },
    {
      "author": "Georges Smaha",
      "rating": 5.0,
      "review": "Great team to work with. Terry Bertucci has been of great assistance exemplifying the role of maintenance manager. Overall, great experience having Real Property manage my rental.",
      "ownerResponse": [
        {
          "text": "Thank you, Georges! Terry Bertucci is an exceptional and essential part to our maintenance team, and we're grateful to have him. We appreciate your kind words and are delighted to hear that you had a great experience with Real Property Management North Puget Sound managing your rental."
        }
      ]
    },
    {
      "author": "DEE M",
      "rating": 5.0,
      "review": "Real property management was amazing! As a new tenant and being new to the area they were able to answer all of my questions not just about the property but the area I would be staying in. They were kind, detailed, and patient! They were ",
      "ownerResponse": [
        {
          "text": "Thank you so much for your kind words and for choosing Real Property Management North Puget Sound! We're delighted to hear that we were able to provide you with the information and support you needed as a new tenant. We truly value your  More"
        }
      ]
    },
    {
      "author": "Debbie Groothuis",
      "rating": 5.0,
      "review": "RPM does such a great job working with their clients, vendors and making sure their rental units are in great shape, clean and getting renters in that are vetted! ",
      "ownerResponse": [
        {
          "text": "Thank you, Debbie! We truly appreciate your kind words and trust in our services. We prioritize our clients, vendors, and ensuring our rental units are in excellent condition. Your support means a lot to us!"
        }
      ]
    },
    {
      "author": "Rick Tilton",
      "rating": 5.0,
      "review": "Exceptional Property Management Experience with Real Property Management North Puget Sound. ",
      "ownerResponse": [
        {
          "text": "Thank you, Rick Tilton, for your exceptional review of our property management services at Real Property Management North Puget Sound! We are grateful for your trust and appreciate your kind words about Frank Volkert and our team. Your  More"
        }
      ]
    },
    {
      "author": "Guam Grub",
      "rating": 5.0,
      "review": "Joseph did an exceptionally great job while visiting for the repair. He explained each step of the process as it went along. He was very respectful and courteous. He was professional and quick too! He deserves a raise and a promotion! He definitely represents the company well and knows his stuff! Thank you, Joseph!",
      "ownerResponse": [
        {
          "text": "Thank you so much for your kind words, Guam Grub! We appreciate your feedback and are grateful to have Joseph on our team. He truly exemplifies our commitment to excellent service."
        }
      ]
    },
    {
      "author": "Kimberly Ramirez",
      "rating": 5.0,
      "review": "We love working with Real Property North Puget Sound! Terry and Harrison are quick to communicate and care about their tenants.",
      "ownerResponse": [
        {
          "text": "Kimberly,\nThank you for the glowing 5-star review! At Real Property North Puget Sound, providing excellent communication and care to our tenants is a top priority. We're  More"
        }
      ]
    },
    {
      "author": "Mark Kirshner",
      "rating": 5.0,
      "review": "Ive worked with Greg and team for years. They do a great job managing my rentals. Their Diamond level guarantee is amazing. Great job!",
      "ownerResponse": [
        {
          "text": "Mark,\nThank you for your ongoing trust and the wonderful 5-star review! At Real Property Management North Puget Sound, we greatly appreciate your long-term  More"
        }
      ]
    },
    {
      "author": "April Oliva",
      "rating": 5.0,
      "review": "We've only been with RPM for about a month and so far it's been a great experience with the property management and maintenance team. Ulises has been responsive, reliable. I appreciate their dedication and would definitely recommend their services!",
      "ownerResponse": [
        {
          "text": "Thank you, April! We're grateful for your kind words and glad to hear that you've had a great experience with our property management and maintenance team. Ulises truly values your satisfaction and will continue to provide responsive and reliable service. We appreciate your recommendation!"
        }
      ]
    },
    {
      "author": "tim corr",
      "rating": 5.0,
      "review": "I've been impressed by how professionally these guys are able to track and communicate the various items of a rental home. It feels like they have the best interest of the owner, tenant, and vendor as their aim. Attention to detail and ",
      "ownerResponse": [
        {
          "text": "Thank you, Tim! We truly appreciate your kind words and are grateful for the opportunity to work with you. Your satisfaction is our top priority, and we're glad you've noticed our dedication to excellence."
        }
      ]
    },
    {
      "author": "Christine Hoover",
      "rating": 5.0,
      "review": "I am in a business networking group with Greg. He is a great guy and Real Property Management North Puget Sound is a wonderful property management company. Keep your home you thought about selling and rent it out and have Real Property Management handle everything for you!",
      "ownerResponse": [
        {
          "text": "Thanks for your kind words, Christine! We appreciate your support and trust in us to handle your property management needs."
        }
      ]
    },
    {
      "author": "Jason",
      "rating": 5.0,
      "review": "If you want a great experience with a company that cares about your rental properties, give RPMNPS a call. Greg and the team definitely will take care of you.",
      "ownerResponse": [
        {
          "text": "Thank you, Jason! We appreciate your kind words and are grateful for your trust in us."
        }
      ]
    },
    {
      "author": "Jeff Haugland",
      "rating": 5.0,
      "review": "So far they have been fantastic to work with. Possibly a little on the pricey side compared to other companies, however their service and professionalism is well worth the cost. Would definitely recommend.",
      "ownerResponse": [
        {
          "text": "Thank you, Jeff! We appreciate your kind words and recommendation."
        }
      ]
    },
    {
      "author": "K F",
      "rating": 5.0,
      "review": "Terry Bertucci was\nvery helpful in getting everything I needed scheduled & completed. Joseph Butcher the technician was very helpful as well, knowledgeable & attentive with ",
      "ownerResponse": [
        {
          "text": "Thank you so much for your kind words! We're grateful for the opportunity to assist you and we're glad Terry and Joseph were able to provide such helpful and attentive service. We appreciate your business!"
        }
      ]
    },
    {
      "author": "Christie Thompson",
      "rating": 5.0,
      "review": "Love Greg at RPM!  They have an incredible diamond guarantee with timely rent payments guaranteed; one of the most important things to landlords.",
      "ownerResponse": [
        {
          "text": "Thank you, Christie! We're so glad you love Greg at Real Property Management North Puget Sound and appreciate our diamond guarantee with guaranteed timely rent payments."
        }
      ]
    },
    {
      "author": "Carl Mitchell",
      "rating": 5.0,
      "review": "Terry has been awesome to work with.  He has gone above and beyond to assist with our furnace replacement and hot water tank issues at our rental property.",
      "ownerResponse": [
        {
          "text": "Carl,\nThank you for your 5-star review! We're thrilled to hear that Terry has been awesome to work with and has gone above and beyond to assist with your furnace  More"
        }
      ]
    },
    {
      "author": "Sean Taylor",
      "rating": 5.0,
      "review": "Great experience so far with Real Property Management! Very responsive to any and all questions during the leasing process. They are willing to help out whenever. Found me a beautiful home and I am very happy!",
      "ownerResponse": [
        {
          "text": "Thank you for the kind words, Sean! We're glad you had a great experience with us and that we could help you find a beautiful home. We appreciate your feedback!"
        }
      ]
    },
    {
      "author": "Suhas Manangi",
      "rating": 1.0,
      "review": "Horrible company and horrible service. I signed up in Sept 2022, paid them 30% of rent in onboarding fees but they did not onboard tenants till late Oct, and didn't collect rent from one tenant for so long that led to eviction. Did the same ",
      "ownerResponse": [
        {
          "text": "Suhas, we work very hard for our clients and did our very best in the situation you asked us to help you with.  This a description of what happened.           \nLast year, when you first reached out to us about managing your 4-plex with  More"
        }
      ]
    },
    {
      "author": "Dave Leach",
      "rating": 5.0,
      "review": "RPM does a very good job of managing my rental property.  They keep the process simple and worry free.",
      "ownerResponse": [
        {
          "text": "Thank you, Dave! We appreciate your kind words and are glad to hear that our property management services have made your experience worry-free."
        }
      ]
    },
    {
      "author": "Courtney Evans",
      "rating": 5.0,
      "review": "Greg is wonderful to work with. He is incredibly communicative and very clearly cares about the people he is serving. I would highly recommend!",
      "ownerResponse": [
        {
          "text": "Dear Courtney,\n\nThank you for the fantastic 5-star review! We're thrilled to hear that you had a  More"
        }
      ]
    },
    {
      "author": "Temi Tope",
      "rating": 5.0,
      "review": "When you almost thought nothing good could come out of a mere view after so many disappointments. With continual feeling of disappointment which creeps in often and almost want you to give up and not make an attempt at something. Real ",
      "ownerResponse": [
        {
          "text": "Thank you so much for sharing your experience, Temi Tope! We're grateful to have been able to provide you and your family with the relief you needed. It means a lot to us that you found our listing on Zillow and took a chance with us. We're  More"
        }
      ]
    },
    {
      "author": "Kathy Christiansen",
      "rating": 5.0,
      "review": "We have been very happy with the prompt responses to questions, concerns and service from us as owners and from our renters. I strongly recommend considering using Real Property Management Northwest.",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words! We truly appreciate your recommendation and are grateful for your satisfaction with our prompt responses and service here at Real Property Management North Puget Sound."
        }
      ]
    },
    {
      "author": "CJ Stevenson",
      "rating": 5.0,
      "review": "There is so much relief in hiring a property manager! RPM is great and Greg is the best! Highly recommend!",
      "ownerResponse": [
        {
          "text": "Thank you, CJ! We're grateful for your kind words and recommendation. Greg truly is the best!"
        }
      ]
    },
    {
      "author": "Allison Vaden",
      "rating": 5.0,
      "review": "I would highly recommend Real Property North Puget Sound as a property manager.  They managed my property for several years.  They were quick to respond to\nany questions or issues.  I always felt like they were taking care of my ",
      "ownerResponse": [
        {
          "text": "Allison Thank You so much. We have really enjoyed working with you! Gail"
        }
      ]
    },
    {
      "author": "Gina Smith",
      "rating": 5.0,
      "review": "Terry in maintenance has been so helpful and responsive to my many inquiries about the property managed by RPM- Im very appreciative for his quick responses and willingness to assist during this recent storm.",
      "ownerResponse": [
        {
          "text": "Gina,\nThank you for taking the time to leave a 5-star review! We're delighted to hear that Terry in maintenance has been helpful and responsive to your inquiries  More"
        }
      ]
    },
    {
      "author": "michael woodward",
      "rating": 5.0,
      "review": "The staff here goes well above and beyond.Rose was great. I would recommend them to anyone looking for rental property. Could not have asked for a better group during this time.Thank you so much for everything.",
      "ownerResponse": [
        {
          "text": "Dear Michael,\nThanks for the 5-star review! We're glad Rose and our team could make your experience great. If you ever need help or want to recommend us, feel free to reach  More"
        }
      ]
    },
    {
      "author": "Nicole Burke",
      "rating": 5.0,
      "review": "The maintenance coordinator Terry has exceptional customer service and made repairs a smooth and easy process! Thankful for his help!",
      "ownerResponse": [
        {
          "text": "Thank you so much, Nicole! Terry is truly amazing at what he does for all our customers here at Real Property Management North Puget Sound and I'm glad he made your repair process smooth and easy!"
        }
      ]
    },
    {
      "author": "Blake Nelson",
      "rating": 5.0,
      "review": "Just moved into our rental, and it has been wonderful dealing with RPM. Rose and Cynthia were so great and made the process of getting into the rental so easy. Tons of communication which is always appreciated. Mike with maintenance has ",
      "ownerResponse": [
        {
          "text": "Blake, Thank you for your review. We will do all we can to make your tenancy as smooth as possible."
        }
      ]
    },
    {
      "author": "McTaco",
      "rating": 5.0,
      "review": "Terry is always attentive whether I have a last minute  question or need good direction. RPM really does take care of the people that take care of people.",
      "ownerResponse": [
        {
          "text": "Dear McTaco,\n\nThank you for the outstanding 5-star review! We're pleased to hear about your  More"
        }
      ]
    },
    {
      "author": "Sandy Bowen",
      "rating": 5.0,
      "review": "I have hired rpm this fall to manage my little house in Lake Stevens.\nSo far it has been a very wonderful experience working with Harison. He is so pleasant and easy to work with. He is their maintenance supervisor and maintenance ",
      "ownerResponse": [
        {
          "text": "Thank You Sandy. You have been a great Client to work with as well."
        }
      ]
    },
    {
      "author": "Jun Hong",
      "rating": 5.0,
      "review": "RPM was very helpful and stayed in  continuous communication for the entire leasing process. I got most of my help from Rose and Cynthia, and they did everything in their power to make the move in process as painless as possible.",
      "ownerResponse": [
        {
          "text": "Thank you so much, Jun Hong! We truly appreciate your kind words and are delighted that Rose and Cynthia were able to provide you with excellent service throughout your leasing process. We're glad we could make your move-in as smooth as possible."
        }
      ]
    },
    {
      "author": "Sterile Veneral",
      "rating": 3.0,
      "review": "I wasn't taken away with their customer service as me and my girlfriend are looking for a home and needed help. With verify identification online, and the lady was very rude basically indicated if your to stupid to do that then we don't wanna rent to you",
      "ownerResponse": [
        {
          "text": "So sorry you had a bad experience with customer service. If you were in contact with Real Property Management North Puget Sound you would not have had this type of conversation. We pride ourselves with great customer service and have the  More"
        }
      ]
    },
    {
      "author": "Matt Durst",
      "rating": 5.0,
      "review": "Joseph provided us with an excellent experience in resolving our situation with our in-home issue. Not only is very communicative and informative, but provides a directive as to what he will be doing to fix the issue",
      "ownerResponse": [
        {
          "text": "Matt, Thanks for the 5 star review! Glad Joseph could help with your in-home issue. If you need anything else, feel free to reach out."
        }
      ]
    },
    {
      "author": "Thomas Ramsell",
      "rating": 5.0,
      "review": "Had a great experience with Frank, Greg, and the team at Real Property management!  Looking forward to a long relationship.",
      "ownerResponse": [
        {
          "text": "Thank you, Thomas! We're grateful to have you as a valued client and look forward to a successful future together as well!"
        }
      ]
    },
    {
      "author": "Adam",
      "rating": 5.0,
      "review": "Rose and her crew were very helpful and made the process as easy and simple as possible. Their communication is second to none.",
      "ownerResponse": [
        {
          "text": "Thanks a bunch for the 5-star review! We're delighted to hear that Rose and the crew made things easy for you. We take pride in keeping our communication top-notch. If you need anything else, just give us a shout.\nBest Regards"
        }
      ]
    },
    {
      "author": "Seth Connell",
      "rating": 5.0,
      "review": "The team at RPM NPS provide outstanding service to not just their customers, but vendors too. Harrison and Gail are quick to respond, professional, and courteous. This regions best property managers Ive had the pleasure of working with!",
      "ownerResponse": [
        {
          "text": "Thank you so much, Seth! We really appreciate your kind words and are grateful for the opportunity to work with you."
        }
      ]
    },
    {
      "author": "Ollie Badmus",
      "rating": 4.0,
      "review": "We have been pleased with the handing of our application by RPM, and we look forward to doing business with RPM. I also stopped by the Marysville office and I was very pleased with the people I met there. Thank you so much.\nOllie Badmus",
      "ownerResponse": [
        {
          "text": "Thank you for choosing RPM! We appreciate your positive feedback and we're excited to have you as our customer."
        }
      ]
    },
    {
      "author": "Simon Jones",
      "rating": 5.0,
      "review": "Great experience with RPM! Rose and Cynthia worked with me and are very professional and knowledgeable. I really appreciated their prompt and kind responses to my questions. RPM provides the personal touch that is often missing in our overly automated world.",
      "ownerResponse": [
        {
          "text": "Thank you, Simon! We appreciate your kind words and are thrilled to hear that you had a great experience with us. Rose and Cynthia are fantastic team members and we are glad that their professionalism and knowledge made a positive impact on  More"
        }
      ]
    },
    {
      "author": "Alex V",
      "rating": 5.0,
      "review": "Working with them as one of their contractors is an ace! Their staff is very professional and knowledgeable. Getting a work order is very organized as they have their portal, which is easy to monitor and manage.",
      "ownerResponse": [
        {
          "text": "Thank you, Alex! We appreciate your kind words and are glad to hear that you have had a positive experience working with our team. Your feedback means a lot to us!"
        }
      ]
    },
    {
      "author": "Kassandra Taggart",
      "rating": 5.0,
      "review": "After I learned about how the owners of this RPM office is also investors and only does property management, I knew I needed to also attend their classes and consider this my next investment location. I'm even providing a picture to show ",
      "ownerResponse": [
        {
          "text": "Thank you Kassandra!"
        }
      ]
    },
    {
      "author": "Selyn Gozo",
      "rating": 5.0,
      "review": "Frank, Gail, Harrison, and Terri have all been very personable, responsive and provides nothing but excellent service. Would definitely recommend!",
      "ownerResponse": [
        {
          "text": "Thanks for the stellar 5-star review! We're delighted to hear that our property management team, including Frank, Gail, Harrison, and Terri, has provided you with personable, responsive, and excellent service. Your recommendation is greatly  More"
        }
      ]
    },
    {
      "author": "Tiffany Pacheco",
      "rating": 5.0,
      "review": "Everything has been a breeze w real property management!  from Terry the maintenance coordinator and Rose and Cynthia as well! Thank you! ",
      "ownerResponse": [
        {
          "text": "Thank you for the fantastic 5-star review! We're thrilled to hear that everything has been a breeze with Real Property Management North Puget Sound. Terry, our maintenance coordinator, along with Rose and Cynthia, is delighted to have made  More"
        }
      ]
    },
    {
      "author": "Bri Bri",
      "rating": 5.0,
      "review": "Terry was great, he communicated with me with every step, he never kept me out of the loop.",
      "ownerResponse": [
        {
          "text": "Dear Bri Bri,\n\nThank you for your wonderful 5-star review! We're thrilled to hear that Terry  More"
        }
      ]
    },
    {
      "author": "saqab husain",
      "rating": 5.0,
      "review": "They made the process simple and were easy to work with. Will be back for future property management needs.",
      "ownerResponse": [
        {
          "text": "Dear Saqab,\n\nThank you for the fantastic 5-star review! We're delighted to hear that you  More"
        }
      ]
    },
    {
      "author": "Aubree R",
      "rating": 5.0,
      "review": "Rose and Cynthia were both so helpful during the application and move in process. Very responsive and answered every question we had. This is our first time dealing with a property management company and we are so happy to be working with this team. 10/10 recommend",
      "ownerResponse": [
        {
          "text": " Aubree, Thank you for your kind words and 5 star review. Rose and Cynthia, on our leasing team, are awesome and are always trying to help people with the move-in process. They are a great asset to our \"A\" player team. We are glad to have you as one of our tenants."
        }
      ]
    },
    {
      "author": "JC h",
      "rating": 1.0,
      "review": "I would give no stars if I could. Hardly ever return phone calls. messages renters questions about the site because they never show up. When you do have maintenance request you have to wait several days just to get him to show up. if he ",
      "ownerResponse": [
        {
          "text": "Hey jeremy h, \nYour review is welcomed and we are sorry you did not have a good experience with us. We always follow Washington State Landlord/Tenant laws. You can always  More"
        }
      ]
    },
    {
      "author": "Ed Schaplow",
      "rating": 5.0,
      "review": "Frank and his people are hard working honest people who know their business well. I highly recommend them",
      "ownerResponse": [
        {
          "text": "Dear Ed,\n\nThank you for the stellar 5-star review! We appreciate your kind words about  More"
        }
      ]
    },
    {
      "author": "Saffira C",
      "rating": 5.0,
      "review": "Hey Mark! Sorry for the delay with the review, you are always on point with your emails and having a good sense of humor goes a long way. Your company RPM is lucky to have you! We always welcome your business with Old Republic!",
      "ownerResponse": [
        {
          "text": "Thank you so much, Saffira! Your kind words mean a lot to us and I appreciate you taking the time to leave a review. It's always a pleasure doing business with you and Old Republic."
        }
      ]
    },
    {
      "author": "Don Andrews",
      "rating": 5.0,
      "review": "We haves use Real Property Management to rent our home in Marysville for the lat 3+ years.  They removed all the worries about renting. The found great tenants for us, dealt with all the day-to-day headaches that go along with renting your ",
      "ownerResponse": [
        {
          "text": "Thank you so much Don, you have been a great client of ours.\nFrank Volkert\nPresident  More"
        }
      ]
    },
    {
      "author": "Bridgett Alonso",
      "rating": 5.0,
      "review": "John and his team have been wonderful to work with.  Rose and Cynthia were great at getting right back to me when I had questions.  John has been amazingly helpful and has guided me through the process and assisted me in getting in touch ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind review. We really try to do all we can to make your transition as smooth and easy as possible."
        }
      ]
    },
    {
      "author": "Jayson Hathaway",
      "rating": 5.0,
      "review": "Joseph at real property management was awesome with installing our new microwave. Great communication, very friendly, and an all around nice guy  ",
      "ownerResponse": [
        {
          "text": "We really appreciate your great review. We hope to be able to continue to have a great relationship with our Clients and Customers"
        }
      ]
    },
    {
      "author": "Jack Clark",
      "rating": 5.0,
      "review": "As owner of an Everett duplex I found that my experience with Real Property Management was excellent. I liked that the company provided options for lease only, or all the way up to full management services. The screening for financially ",
      "ownerResponse": [
        {
          "text": "Jack, Thank you for your business. It has been a pleasure to work with you and your tenants."
        }
      ]
    },
    {
      "author": "Megan Gates",
      "rating": 5.0,
      "review": "I can't say enough good things about Real Property Management. Everyone there is efficient, friendly and genuinely care about their clients needs. I have worked with them for almost a year now and I would absolutely recommend them to anyone looking for a rental or looking to have a rental managed.",
      "ownerResponse": [
        {
          "text": "Megan, thank you. We appreciate your review and being from the industry, you know what \"good things\" really looks like."
        }
      ]
    },
    {
      "author": "Victoria Isabella",
      "rating": 5.0,
      "review": "Rose and Cynthia were incredibly helpful and knowledgeable! As a newer renter, I had a lit of questions about the lease/unit and they were extremely organized and kind. I loved getting to finish the  paperwork in person because it allowed us to have peace of mind at the key hand over. Exceptional service and thoughtful people!",
      "ownerResponse": [
        {
          "text": "Victoria, thank you for your kind words, Real Property Management North Puget Sound try's hard to make our customer and client's experience the best they can be. Rose, Cynthia and the rest of our team really try hard.  More"
        }
      ]
    },
    {
      "author": "Charlene Emard",
      "rating": 5.0,
      "review": "Real Property Management made the repairs needed to get the house ready to rent hands off for us. We just gave them the keys and sat back and let them take care of it. They also found us a well qualified tenant in a short amount of time. If ",
      "ownerResponse": [
        {
          "text": "Charlene, thank you so much for your review. we try hard to make everyone's experience as easy and simple as possible.\nFrank Volkert  More"
        }
      ]
    },
    {
      "author": "Paola S",
      "rating": 5.0,
      "review": "It was my first time renting a home and I wasnt sure what to expect. Gail and the rest of the RPM team went above and beyond to help me through the rental process, answered all my questions and sprinted into action when my home required ",
      "ownerResponse": [
        {
          "text": "Paola,\nThank you so much for your kind words. Gail and the rest of the team appreciate your time to reach out. Contact us anytime."
        }
      ]
    },
    {
      "author": "Rochelle Fahlman",
      "rating": 5.0,
      "review": "This is a great family owned property management co. I am a real estate broker and refer clients that want to rent out their home. Frank, Danny and team always take excellent care of them. I highly recommend this company.",
      "ownerResponse": [
        {
          "text": "Thank you Rochelle! We have really enjoyed working with your clients and getting them quality tenants. Thank you so much for your business! We look forward to working with you, Todd, Megan, Nanci and the rest of your awesome team in the years to come!"
        }
      ]
    },
    {
      "author": "David Cook",
      "rating": 5.0,
      "review": "From an investor perspective real property management is ideal. First they tell me what property is worth the investment then they make sure nothing goes wrong. Its so easy. Thank you!",
      "ownerResponse": [
        {
          "text": "Thanks for choosing Real Property Management, David! We're thrilled to hear that you found our services easy and ideal for your investment needs."
        }
      ]
    },
    {
      "author": "Colton Davis",
      "rating": 5.0,
      "review": "RPM is amazing, and so is their leasing agent, Rose! Everyone we encountered was very friendly, professional, and handled things in a timely manner. The whole process was very seamless thanks to their attention to detail and exceptional customer service.",
      "ownerResponse": [
        {
          "text": "Thank you Colton! RPM takes pride on customer service which makes our company stand out compared to others. We look forward to you being a long term tenant with RPM."
        }
      ]
    },
    {
      "author": "Faris Talib",
      "rating": 5.0,
      "review": "Amazing support from the management , thanks again specifically for the main focal point person  making the follow up",
      "ownerResponse": [
        {
          "text": "Dear Faris,\n\nThank you for the fantastic 5-star review! We're thrilled to hear about the  More"
        }
      ]
    },
    {
      "author": "Ricardo Ocampo",
      "rating": 5.0,
      "review": "They are very friendly and help you from beginning to end.  and they are there all the time to help with any problem or question you may have.",
      "ownerResponse": [
        {
          "text": "Thank you for the fantastic 5-star review! At Real Property Management North Puget Sound, we're thrilled to hear that our friendly team has been there to assist you from beginning to end. We appreciate your positive feedback and are always  More"
        }
      ]
    },
    {
      "author": "Lisa Barthel",
      "rating": 5.0,
      "review": "I just wanted to share what a great choice my family made having RPM manage our Dads property.  it was such a difficult time in our lives.  To make the decision to place him in a nursing home.  RPM did an amazing job helping us with this ",
      "ownerResponse": [
        {
          "text": "Thanks Lisa!"
        }
      ]
    },
    {
      "author": "Suede",
      "rating": 5.0,
      "review": "I have been doing business with Real Property Management North Puget Sound for over 7 years.  In my experience they are professional, conscientious, and all-around good people.  COVID regulations presented a unique challenge.  They worked ",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words"
        }
      ]
    },
    {
      "author": "Josiah Minnix",
      "rating": 5.0,
      "review": "Great property management company. Easy to use website, good communication, quick response to any maintenance issues. Had a recent issue with some maintenance items and Mark was easy to reach and made sure everything was taken care of. Thank you!!",
      "ownerResponse": [
        {
          "text": "Josiah, thank you for your review. We are happy to have Mark and all of our team try very hard to take care of our Clients and Customers."
        }
      ]
    },
    {
      "author": "Lee Hudson",
      "rating": 5.0,
      "review": "When I decided to enter the real estate investment game about three years ago, my spouse said OK, but only if I promised to hire a property management company.  When I bought our first rehab project, I called 6+ local managers, interviewed ",
      "ownerResponse": [
        {
          "text": "Thank you Lee,\nWe appreciate you and all our clients and customers.  More"
        }
      ]
    },
    {
      "author": "Kristine C.",
      "rating": 5.0,
      "review": "We have worked with Real Property Management for a few years as a contractor for tree maintenance. They are true professionals, keeping their properties looking great, paying invoices quickly, and displaying excellent communication. As a ",
      "ownerResponse": [
        {
          "text": "Thank You Kristine"
        }
      ]
    },
    {
      "author": "E Smith",
      "rating": 5.0,
      "review": "After months of searching for a rental and dealing with numerous flaky landlords we happened upon Real Property Management North Puget Sound. Not only did we have a place to live within a few days but it's located in the perfect environment ",
      "ownerResponse": [
        {
          "text": "Thank you very much for the kind review!"
        }
      ]
    },
    {
      "author": "Christina Mitchell",
      "rating": 5.0,
      "review": "Working with Real Property Management for the last year has made finding tenants and maintaining my property a breeze. I wanted as much of a hands-off situation for myself as possible, and John and the rest of the team have really delivered! Thank you RPM!",
      "ownerResponse": [
        {
          "text": "Christina,\nThank you so much for your kind words. We do all we can to manage your property in the best way possible for you and your resident both."
        }
      ]
    },
    {
      "author": "jordan anderson",
      "rating": 5.0,
      "review": "Been renting from real properties management for 3 yrs now they are a nice group of people who care about people not cash. They just worked there butt off too get me into my very owe stuido. Rose thank you",
      "ownerResponse": [
        {
          "text": "Thank you, Jordan! We appreciate your kind words and are thrilled to have been able to help you find your own studio. It means a lot to us that you feel we genuinely care about people."
        }
      ]
    },
    {
      "author": "Todd Fahlman",
      "rating": 5.0,
      "review": "I highly recommend Real Property Management North Puget Sound. They have the best prices and offer the greatest service. They will take care of everything for you. Their tenant selection process is second to none. They have a program that ",
      "ownerResponse": [
        {
          "text": "Thank you Todd!! We have really enjoyed our time working with you and your team over the years! Our collaborations have allowed both our companies to better service the real estate needs of many people in the area at a much higher level."
        }
      ]
    },
    {
      "author": "Tim Dereg",
      "rating": 5.0,
      "review": "I have been a client of Real Property Management North Puget Sound for several years, and I can honestly say without hesitation that the people at RPM have always treated me more than fairly.  I cannot think of a single instance where they ",
      "ownerResponse": [
        {
          "text": "We know there is a lot to leasing your property. We are glad to help you through the property managing process."
        }
      ]
    },
    {
      "author": "Darcy Gedrose",
      "rating": 1.0,
      "review": "If you rent from this company be prepared to pay imagionary dump fees for items that aren't yours.  Oh when they sent photos of the items disposed of they were from the boarded up house next door where homeless sleep.  Not my stuff at all. ",
      "ownerResponse": [
        {
          "text": "We are sorry if we were wrong in this matter. Please reach out to us and we'll be happy to review the situation."
        }
      ]
    },
    {
      "author": "James Dunlap",
      "rating": 5.0,
      "review": "I have been very impressed with Real Property Management. I have worked with them for a while now, and it seems like Frank and his team are always searching for new ways to add value to their business. The landlord workshops are especially ",
      "ownerResponse": [
        {
          "text": "Thank You James for your kind words"
        }
      ]
    },
    {
      "author": "Michaela Ircink",
      "rating": 5.0,
      "review": "My first experience with Real Property Management, has been amazing! Crystal was so friendly. She answered all my questions, even the stupid ones, and explained everything so thoroughly. Doing nearly everything electronically, made the ",
      "ownerResponse": []
    },
    {
      "author": "Dale Bonilla",
      "rating": 5.0,
      "review": "We had a great experience working with Frank and Real Property Management. Frank was able to work and communicate with me effectively, especially with me being out of state. I really appreciate all of the informative data he provided me to ",
      "ownerResponse": [
        {
          "text": "Dale,Thanks for the 5-star review! We're glad you had a great experience with Frank and Real Property Management. If you have more needs or questions, feel free to reach out.  More"
        }
      ]
    },
    {
      "author": "Carolann Wheelis",
      "rating": 1.0,
      "review": "Absolutely do not rent from this company. At first they are communicative and responsive, but once you read the lease ALL red flags and gut feelings shouldnt be ignored. Once you move in its nearly impossible to get ahold of someone and ",
      "ownerResponse": [
        {
          "text": "RPM follows all Washington State Tenant/Landlord laws. In all leases that we draft, a tenant agrees to return the property in the same condition it was given to them, minus normal wear and tear. We document in writing and with pictures the  More"
        }
      ]
    },
    {
      "author": "Nanci Denney",
      "rating": 5.0,
      "review": "Real Property Mgmt is Amazing!  They care deeply about their property owners and their tenants.  You won't find a better Property management company to rent from or handle your properties.",
      "ownerResponse": [
        {
          "text": "Nanci, we so appreciate you. We aim to please and know that it is our Clients like you and Customers that really keep us in business"
        }
      ]
    },
    {
      "author": "Kathleen Walsh",
      "rating": 5.0,
      "review": "By far the best property management company we have worked with for many years. They are knowledgeable, professional and approach property management with the landlord as a member of the overall team. They are responsive to us as landlords ",
      "ownerResponse": [
        {
          "text": "Thank you James! We have enjoyed working with you, managing your real estate investment portfolio and look forward to the continued success the future will bring."
        }
      ]
    },
    {
      "author": "Krysten Drum",
      "rating": 5.0,
      "review": "Amy is awesome! My husband and I were in search of homes during the Christmas holiday, so we were finding it tough to get much response from other property management companies. After much searching, my husband and I finally found a ",
      "ownerResponse": []
    },
    {
      "author": "Matthew Terwilliger",
      "rating": 5.0,
      "review": "RPM, since day one has been very prompt, professional, with outstanding communication. Their dedicated customer service helps put my mind at ease & I couldn't imagine managing my rental property without them.",
      "ownerResponse": [
        {
          "text": "Matthew, we appreciate your input. Please reach out anytime.\nFrank Volkert\nPresident  More"
        }
      ]
    },
    {
      "author": "CD Music",
      "rating": 5.0,
      "review": "Real Property Management North Pudget Sound sets the bar high with their professionalism, client care, and positive attitude. Highly recommend using them whenever possible. We knew we were in good hands when we arrived to the home and Aaron ",
      "ownerResponse": [
        {
          "text": "Thank you Clint!"
        }
      ]
    },
    {
      "author": "Mark Mears",
      "rating": 5.0,
      "review": "I was very impressed with Frank and his team.  As my wife and I evaluated an investment property, Frank always answered our calls and emails.  He gave us constant updates to the changing rental market.  As an out of state investor, Frank is ",
      "ownerResponse": []
    },
    {
      "author": "Matthew",
      "rating": 5.0,
      "review": "Real Property Management is a first class business run by honest and competent people who care about their customers and their interests.  They have managed my apartment complex for the last two years now and I could not be happier with the ",
      "ownerResponse": []
    },
    {
      "author": "Daniel",
      "rating": 5.0,
      "review": "RPM has been managing my rental property for the past few years now and they've been doing great, no issues and no complaints from me. Total professionalism from the very beginning, they picked the perfect renters, and the best part is I haven't had to do much more than re-sign another contract with them. Thanks!",
      "ownerResponse": [
        {
          "text": "Thank you Daniel! We have enjoyed working hard to make rental property ownership stress free for you and look forward to working with you for many years to come."
        }
      ]
    },
    {
      "author": "Jennifer B.",
      "rating": 4.0,
      "review": "When looking for a rental home in Snohomish County, I was very careful to evaluate rental management companies. I have heard horror stories and experienced one with my last rental property manager. So, when I found a house managed by RPM, I ",
      "ownerResponse": []
    },
    {
      "author": "Casey Westerman",
      "rating": 1.0,
      "review": "I've been a landlord and a tenant.  If you're a landlord - this company is solid.  If you're a tenant - I'd stay away from properties managed by this company.  I'll try to keep this short, despite having a lot to say.  To be transparent, ",
      "ownerResponse": []
    },
    {
      "author": "Joni H",
      "rating": 5.0,
      "review": "This is a family run business that we used when we needed to rent our house and move to another state.  Anytime we had questions or were concerned about something, there was always an expert on the staff to ease our minds.  They always ",
      "ownerResponse": []
    },
    {
      "author": "Kelly Hundley",
      "rating": 5.0,
      "review": "Working with Rose at Real Property Management has been a real pleasure.  She was always available for questions and to find solutions to issues that arose during the rental process.  She possess a  professionalism and positive attitude that all owners and renters will find refreshing.",
      "ownerResponse": [
        {
          "text": "Thanks Kelly!"
        }
      ]
    },
    {
      "author": "Brian Pollack",
      "rating": 1.0,
      "review": "RENTERS BEAWARE!!!!! Your better off going with williams investment then these guys. Our landlord  sold  our town house with out warning and the new landlord  hired RPM. It was an absolute  nightmare  dealing with them. Their office manager ",
      "ownerResponse": [
        {
          "text": "Brian, we are sorry you feel this way. Utilities are the responsibilities of the tenant using the utilities."
        }
      ]
    },
    {
      "author": "Melanie Wegner",
      "rating": 5.0,
      "review": "This is a family run business with the efficiency of a large corporation!  Frank and team were personable and accessible with fabulous follow up.  They quickly found the perfect renter for our house and took care of everything while keeping ",
      "ownerResponse": []
    },
    {
      "author": "firsttimersluck",
      "rating": 5.0,
      "review": "My husband and I are a military couple, so we were concerned about moving and having to leave our home behind to strangers. It was suggested to us to use a property management company so that we wouldn't have to worry about not being able ",
      "ownerResponse": []
    },
    {
      "author": "Jason J",
      "rating": 5.0,
      "review": "Rose at RPM Puget Sound is amazing. She is thorough and constantly kept us up to date. She is kind, patient and very friendly. I high recommend Rose as she is a confident and compassionate professional!",
      "ownerResponse": [
        {
          "text": "Thanks so much for the review, Jason J!\nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we  More"
        }
      ]
    },
    {
      "author": "Ron Wilmot",
      "rating": 5.0,
      "review": "Ive been a rental property owner and manager for over 50 years having owned 85 rentals in Or Ca and Wa\nThese included a 23, a 16, 6 and 4 plex. I was looking in the Anacortes area for ",
      "ownerResponse": [
        {
          "text": "Ron, Thank you for your kind words. We try to treat all of our Clients properties here at Real Property Management North Puget Sound, as though we were managing our own. Please contact our office anytime.  More"
        }
      ]
    },
    {
      "author": "Kathleen Kelly",
      "rating": 5.0,
      "review": "I had numerous challenges and expenses getting my property ready for re-rent. I am so glad I enlisted the help of Aaron, Rose, Kelly, Crystal and their vendors to complete my tasks.  Rose in particular I am grateful to in finalizing the ",
      "ownerResponse": [
        {
          "text": "Thank you Kathleen!"
        }
      ]
    },
    {
      "author": "dee romano",
      "rating": 5.0,
      "review": "Daniel and his Team are excellent to work with.  I brought RPM on board when I was having major issues dealing with a rental property and the renter from hell.  It was not his job at that point to be helpful, but he went out of his way to ",
      "ownerResponse": []
    },
    {
      "author": "Liz Donadio",
      "rating": 1.0,
      "review": "The lack of responsiveness and professionalism demonstrated by this company, particularly Gail Volkert is unprecedented in my experience. At every opportunity to be of service to me as a property owner, they deferred to my tenant who ",
      "ownerResponse": [
        {
          "text": "I am sorry you feel this way. We don't have control what a tenant does under certain circumstances. Please contact us so we have a chance to look at all the facts. If we have wronged you, we want to make it right."
        }
      ]
    },
    {
      "author": "Ian H.",
      "rating": 5.0,
      "review": "I've been using the service of Real Property Management North Puget Sound for nearly 4 years now.   They are professional and always respond quickly to questions and inquiries",
      "ownerResponse": [
        {
          "text": "Thanks so much for the review, Ian H.! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we  More"
        }
      ]
    },
    {
      "author": "Office Manager",
      "rating": 5.0,
      "review": "As an employee of Morgan Maintenance Services, I work closely with Rose Morrison, the Maintenance Coordinator for RPM. Rose and her staff are professional, friendly and efficient. They respond to phone calls and emails quickly and work with ",
      "ownerResponse": []
    },
    {
      "author": "Greg Martz",
      "rating": 4.0,
      "review": "These folks have been great to work with.  Responsive and reliable, they are professional and worked hard to help me get my house rented.  Its a great service at a reasonable price.  I shopped around, they give the best value for the money! ",
      "ownerResponse": []
    },
    {
      "author": "Laura Larson",
      "rating": 1.0,
      "review": "They are by far and away the worst company I have ever dealt with.  Trying to get a hold of them - NEVER.  Once you do they don't want to help you with anything.  I tried to contact them about a move-out I was sent to 5 different people. ",
      "ownerResponse": [
        {
          "text": "We have never rented to this person. Besides inaccurate information have no record of her and don't know who her son is."
        }
      ]
    },
    {
      "author": "Evergreen Lock & Key",
      "rating": 5.0,
      "review": "The folks at Real Property Management are very professional, reliable, and honest. I've had the pleasure of working with them as a contractor for the past couple of years and they definitely know how to treat their clients and vendors. I would highly recommend them!",
      "ownerResponse": [
        {
          "text": "Evergreen Lock, Thank You for your kind words. We appreciate working with fair and reliable business partners like you.\nFrank Volkert  More"
        }
      ]
    },
    {
      "author": "Sydney Mae",
      "rating": 5.0,
      "review": "Easiest and simplest process. Rose and Cynthia were very responsive and on it to get us in a short time crunch. Can feel very good about being a tenant with this company.",
      "ownerResponse": [
        {
          "text": "Thanks so much for the review, Sydney Mae! As we shared we're happy to have you as one of our new tenants.\nRPM strives to give great service and and your feedback was much appreciated.\nBest regards, Real Property Management - North Puget Sound"
        }
      ]
    },
    {
      "author": "Katherine Voss",
      "rating": 5.0,
      "review": "We moved from out of state and wanted to get into a new home on a very short timeline. Rose helped us get through the approval process and into our new home very quickly. We love that we had one point of contact throughout the process and ",
      "ownerResponse": [
        {
          "text": "Katherine, you're very welcome!  :)"
        }
      ]
    },
    {
      "author": "Em and Mom",
      "rating": 5.0,
      "review": "From the initial application process to periodic questions and service requests, RPM has been a delight to work with. They are professional, friendly, and always punctual in getting back to us with regard to any requests that we might have.  I trust them as a renter and I would trust them with my property. I highly recommend them!",
      "ownerResponse": []
    },
    {
      "author": "Jennifer Beadles",
      "rating": 5.0,
      "review": "Real Property Management is the only property management company that I refer my clients to. They are quick to respond, and are always on top of things. They are competitive with their rents, and are always putting their clients first. ",
      "ownerResponse": []
    },
    {
      "author": "David Middleton",
      "rating": 1.0,
      "review": "This is the worst property management company I have ever dealt with. Upon moving in my wife and I noticed that the ice maker on the fridge did not work, put a request in to fix it, but was never fixed the entire time we lived at our ",
      "ownerResponse": [
        {
          "text": "Sorry about your bad experience. I hope we can improve and learn from this."
        }
      ]
    },
    {
      "author": "Pacific Legacy Investments",
      "rating": 5.0,
      "review": "Terry helped  us with timely maintenance issues and has a superb team! Thank you.",
      "ownerResponse": [
        {
          "text": "Thank You so much for your great review!!!! It helps us, our team, our Clients and Customers and helps us serve you better. Thanks Again"
        }
      ]
    },
    {
      "author": "travis orrino",
      "rating": 5.0,
      "review": "Hello this is Travis orrino. I had the pleasure of dealing with the nice lady rose. She was very friendly and very professional. I highly recommend this company.",
      "ownerResponse": [
        {
          "text": "Travis,\nRose is one of our team\"s \"A\" players. We are glad Rose is with us as we are with all our team of \"A\" players. If there is any way we can assist you, Please let us know."
        }
      ]
    },
    {
      "author": "Don Berry",
      "rating": 5.0,
      "review": "I have been working with Real Property Management for a while now and have found them to be very professional.\nThe staff is easy to work with and very responsive.",
      "ownerResponse": [
        {
          "text": "Don, thank you for your review. We work very hard to make everyone's experience with Real Property Management North Puget Sound a good one."
        }
      ]
    },
    {
      "author": "nelstheviking",
      "rating": 2.0,
      "review": "We used this company to manage our house, and had many bad experiences. They were always extremely difficult to get a hold of and wouldn't answer or return calls or get back to us with information we wanted. At times they charged us ",
      "ownerResponse": [
        {
          "text": "Nels, thank you for your feedback regarding the rental property we have been managing for you for over 3 years.  RPM takes this kind of feedback very seriously and will be reaching out to you to resolve your concerns. At RPM we always get  More"
        }
      ]
    },
    {
      "author": "Debbie Groothuis",
      "rating": 5.0,
      "review": "My company works on the maintenance side wtih Real Property Management North Puget Sound. I have had to call Kevin Moore several times to ask questions or to report problems found on rental properties we are cleaning. He is always quick, ",
      "ownerResponse": [
        {
          "text": "Thank you Debbie for your kind compliments"
        }
      ]
    },
    {
      "author": "Jerry A",
      "rating": 5.0,
      "review": "Great service provided by friendly people in a very timely manner.",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words! We appreciate your feedback and are glad we could assist you in a timely manner."
        }
      ]
    },
    {
      "author": "Zebb Seabrook",
      "rating": 5.0,
      "review": "From the moment I started conversations with Adam at RPM Everett, this has been the best experience I could have imagined when deciding to hire a property management company.  I have managed my own property for over 10 years and was very ",
      "ownerResponse": []
    },
    {
      "author": "Ernest Vigil",
      "rating": 5.0,
      "review": "Real Property Management North Puget Sound delivers a high quality and  excellent experience.  Everything from the administrative communications, Gail w/ office management,  Aaron w/business development,  Kelly w/ maintenance management, ",
      "ownerResponse": [
        {
          "text": "Thank you for the good review. We really do all we can to be honest, fair, have good communication to both our Owner's and Residents.\nSincerely  More"
        }
      ]
    },
    {
      "author": "Matt Hamilton",
      "rating": 4.0,
      "review": "Overall great experience, Eric has been super helpful in the 1.5 years I have lived here the only reason on I gave 4 starts is the other staff sometimes is not as helpful especially when we have issues they seem to do as little as they can ",
      "ownerResponse": [
        {
          "text": "This review is directed towards our Bellevue office. Real Property Management Eclipse"
        }
      ]
    },
    {
      "author": "Doug Mormann",
      "rating": 5.0,
      "review": "I found the staff at RPM of NPS  particularly helpful as a new renter in the Seattle area.  Gail helped us set up and use the autopay system and the interactive system to report and/or get quick help on routine rental items.  Kevin was able to provide clear guidance on the move out process and timing.",
      "ownerResponse": [
        {
          "text": "Thank you, We're glad to be of service.\n\nFrank Volkert"
        }
      ]
    },
    {
      "author": "W01278 MGR4",
      "rating": 5.0,
      "review": "My wife and I have worked with Aaron and Lisa at RPMNPS for a year.  It has been a seamless experience for a new property owner.  Their analysis was spot on, and look forward to working with them for years to come.\nThanks for everything. Adam",
      "ownerResponse": [
        {
          "text": "Adam, Thank you for your kind words. We appreciate you as a Client and will treat you as we would want to be treated."
        }
      ]
    },
    {
      "author": "Spencer Sare (Spencer Sare)",
      "rating": 5.0,
      "review": "So far these guys have been great! They answer all my questions as straightforward as possible and were very honest. Emily answered my questions for almost 30 minuets about a listing even before I committed to applying for it. I can't remember the last time I felt this good about a Property Management Company.",
      "ownerResponse": []
    },
    {
      "author": "Nathaniel White",
      "rating": 5.0,
      "review": "RPM has done an excellent job being prompt, accommodating, and getting the job done on multiple occasions, but I want to give a special shout out to Frank, who came out at an inconvenient time to solve a baffling problem. For about a week ",
      "ownerResponse": [
        {
          "text": "Thank you Nathan, I'm glad we found the chirping and you both can get some sleep now.\nFrank Volkert"
        }
      ]
    },
    {
      "author": "James Robison",
      "rating": 1.0,
      "review": "Be sure to read your lease this company is the worst property management company I have ever dealt with with moving in to moving out the required professional cleaning of a unit. They do nothing on their end, take care of nothing I don't ",
      "ownerResponse": [
        {
          "text": "Thank you for the feedback.  We are sorry our interaction was not a positive one.  In this case, we were not the active property manager over the past year as this was a Lease-only Agreement with the property owner.  Our role was limited to  More"
        }
      ]
    },
    {
      "author": "Wendy Bell",
      "rating": 5.0,
      "review": "The name and number for the person we needed to come evaluate a water leak issue was provided. He came quickly the same day and resolved the issue to our satisfaction.",
      "ownerResponse": [
        {
          "text": "Wendy, thank you for the review. We appreciate your review and will do all we can ton resolve issues as quickly and efficiently as possible"
        }
      ]
    },
    {
      "author": "Marshall Wake",
      "rating": 5.0,
      "review": "I'm a renter and Frank, Daniel and everyone at RPM have been amazing to work with. They don't just put a priority on the homeowner but also us. They are family run and I appreciate how that translates to their business.",
      "ownerResponse": []
    },
    {
      "author": "Stephen Bodoh",
      "rating": 5.0,
      "review": "RPM staff have been very helpful with all of the needs for the property. There have been a few things that have poped-up and the staff worked with the owner and got everything addressed in a timely matter. ",
      "ownerResponse": [
        {
          "text": "stephen,\n\nThank you for your kind words. We work very hard to help our customers for whatever they may need."
        }
      ]
    },
    {
      "author": "Square One Home Services",
      "rating": 5.0,
      "review": "Real Property Management is the most professional, understanding, and responsive property management company I have delt with in all my years in the market. They really know how business is supposed to be done. I would recommend them to everyone.",
      "ownerResponse": [
        {
          "text": "Square One\nThank you for your kind words. We try very hard to keep our standards at the highest in the industry."
        }
      ]
    },
    {
      "author": "Tabreez Govani",
      "rating": 4.0,
      "review": "Jose was professional in his delivery of the services that Real Property Management was offering. He was through and not rushing while dealing with potential client; ready to listen to the questions and concerns. The is my first time dealing with Real Property Mgmt.",
      "ownerResponse": []
    },
    {
      "author": "Kylie Acacio",
      "rating": 5.0,
      "review": "Crystal responds to any maintaince needs VERY quickly and professionally. She is always willing to help with any issues and has a true concern for her tenants. I would recommend her to everyone!",
      "ownerResponse": [
        {
          "text": "Thank you so much Kylie!"
        }
      ]
    },
    {
      "author": "hunter akau",
      "rating": 1.0,
      "review": "Communication skills are not strong. Been trying to get ahold of them and heard nothing back for 5 days. Was really excited to rent a house from them but they do not respond.",
      "ownerResponse": [
        {
          "text": "Hunter,\n  I am sorry you had a bad experience trying to rent. We have been swamped with inquiries for the properties we have on the market. It is impossible for us to  More"
        }
      ]
    },
    {
      "author": "Irem Erkan Cetin",
      "rating": 5.0,
      "review": "Real Property Management helped us get our dream house in such a short time. They value their customers and they do their job professionally!",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words. We do all we can to work with our Clients and Customers as regulations allow."
        }
      ]
    },
    {
      "author": "SuperEmueller",
      "rating": 5.0,
      "review": "I recently got in touch with RPM to handle some unruly tenants. They helped us with getting us in touch with a fantastic company called Property Doctors who fully remodeled my home to make it beyond rent ready. Much thanks!",
      "ownerResponse": [
        {
          "text": "You're very welcome!"
        }
      ]
    },
    {
      "author": "Jay Bennett",
      "rating": 1.0,
      "review": "This has been by far the worst experience my wife and I have ever had. I could call the office from the time they open till close and can never get anyone on the phone or return a call but I can get a email response in a urgent issue. Move ",
      "ownerResponse": [
        {
          "text": "Jay, we are sorry you feel that way. Signing a Lease is a legal agreement. Breaking a lease is always expensive to the Owner and the Tenant. Real Property Management tries our best to be fair to both parties as dictated by law. For our  More"
        }
      ]
    },
    {
      "author": "Ryan Erdmann",
      "rating": 5.0,
      "review": "They currently run my rental properties and are great with communication so far, their prices are very reasonable and they placed an awesome tenant in my unit. They even got me a slightly higher rent amount than I originally wanted to post it for. Thanks Jose !!",
      "ownerResponse": [
        {
          "text": "Thank you for your kind words and we will continue to do the best we can for you"
        }
      ]
    },
    {
      "author": "Joshua McKeown",
      "rating": 5.0,
      "review": "Kevin Moore of Real Property Management North Puget Sound has been great to work with. I always appreciate a person who cares not only about their profession but also cares about the people.",
      "ownerResponse": []
    },
    {
      "author": "Ryan Brancheau",
      "rating": 5.0,
      "review": "Relocating from Kentucky and the entire team removed the stress of house hunting. Lisa, Erin and Gail are amazing people who care truly care about others. Beyond thankful that we were fortunate to work with them.",
      "ownerResponse": [
        {
          "text": "Thank You for your kind words. We are happy to help.\n\nFrank Volkert"
        }
      ]
    },
    {
      "author": "Michelle Richie",
      "rating": 1.0,
      "review": "I wouldnt ever recommend this company! They have done nothing but cause issues, ignore issues with the rental property such as mouse droppings and ant infestation found when we moved it. Never give us the proper notice before they have to ",
      "ownerResponse": [
        {
          "text": "Dear Current Tenant,\nAs agents for the owner, we are to follow all Washington State landlord and tenant laws regarding the pest control issues you are experiencing at the  More"
        }
      ]
    },
    {
      "author": "Regina Rux",
      "rating": 1.0,
      "review": "This company is horrible.  I have family members that recently rented from them.  They had nothing but problems. They had to fight to get things fixed and upon move out they tried to keep their deposit claiming that they left it dirty and ",
      "ownerResponse": [
        {
          "text": "Regina, we are sorry you feel this way and assure you we resolve any and all disputes professionally and promptly with our valued customers. Please call us at our office 425-903-8500, so we can get more information from you regarding who  More"
        }
      ]
    },
    {
      "author": "A A",
      "rating": 1.0,
      "review": "We explained to them that we had poor credit. They said that if our combined credit was under 600, we would just have to pay an extra deposit. Then they denied us because we were 5.5pts below their minimum that they never mentioned. They ",
      "ownerResponse": []
    },
    {
      "author": "Nicolas Veldhorst",
      "rating": 5.0,
      "review": "Really flexible- understand that people have work and things going on in their lives. Great communicators and available for questions",
      "ownerResponse": [
        {
          "text": "Thank you Nicolas! We appreciate your understanding and value your feedback."
        }
      ]
    },
    {
      "author": "Colby Flowers",
      "rating": 5.0,
      "review": "Very professional and very helpful through the move in process",
      "ownerResponse": [
        {
          "text": "Thank you for the fantastic 5-star review! We're delighted to hear that you found our team at Real Property Management North Puget Sound to be professional and helpful during your move-in process. If you ever have any more feedback or if there's anything we can assist you with, feel free to reach out. We appreciate your trust in us!"
        }
      ]
    },
    {
      "author": "Ben Silvey",
      "rating": 5.0,
      "review": "Ulises in the maintenance department is quick and communicative. Thank you.",
      "ownerResponse": [
        {
          "text": "We appreciate your kind words about Ulises in maintenance! Thank you."
        }
      ]
    },
    {
      "author": "Mehedi Hussain Panna",
      "rating": 1.0,
      "review": "Emily scheduled an appointment to show a property. I was there and tried to get a hold of her. Calling number was turned off and was going to her voicemail. After 2 days i was checking again with her on email and figured out its already rented. What a waste of time! Terrible service.",
      "ownerResponse": []
    },
    {
      "author": "Joyce Kwan",
      "rating": 4.0,
      "review": "Having a good experience with them and all the staff.",
      "ownerResponse": [
        {
          "text": "Dear Joyce,\n\nThank you for the wonderful 5-star review! We're delighted to hear that you're  More"
        }
      ]
    },
    {
      "author": "Dymphna Wiley",
      "rating": 5.0,
      "review": "Chad is very helpful with any assistance I need. He keeps me updated and informed in a timely manner.",
      "ownerResponse": [
        {
          "text": "Dymphna, Thank you for your review."
        }
      ]
    },
    {
      "author": "Vanessa Quevedo",
      "rating": 5.0,
      "review": "Very professional and great service.  They answer back to your concerns very quickly! It was been very easy to work with them and would rent from them again in the future.",
      "ownerResponse": [
        {
          "text": "Thanks so much for the review, Vanessa Quevedo!\nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we  More"
        }
      ]
    },
    {
      "author": "Denise Keffeler",
      "rating": 1.0,
      "review": "We had been calling emailing to see a home listed by them for approximately 2 weeks  Finally we just applied for the house without actually seeing it, spend the $100 for fee and finally receive an email that the house was rented   Better get my money back.  :/",
      "ownerResponse": [
        {
          "text": "Denise, thank you for coming in to pick up your refund check for the application fee you paid. In this situation you applied just before we approved an applicant for the property. We apologize for your inconvenience and felt in this  More"
        }
      ]
    },
    {
      "author": "Bruce Wayne Davis",
      "rating": 5.0,
      "review": "Real Property Management North Puget Sound company is \"Real\" People \"Real\" Service and really an awesome experience.",
      "ownerResponse": [
        {
          "text": "Bruce, thank you for your review. Your comments mean a lot to us."
        }
      ]
    },
    {
      "author": "Alexis Sorby",
      "rating": 5.0,
      "review": "Mark is wonderful! So cheerful and great to talk to, love working with this company",
      "ownerResponse": [
        {
          "text": "Alexis, Mark and the team here at Real Property Management North Puget Sound aim to take care of our customers"
        }
      ]
    },
    {
      "author": "Mariam Tariri",
      "rating": 5.0,
      "review": "Daniel and his team are very honest and clear about what they do. They have great communication and services they provide are the best in their field. Thank you RPM",
      "ownerResponse": []
    },
    {
      "author": "Gerardo Corts",
      "rating": 5.0,
      "review": "Great full",
      "ownerResponse": [
        {
          "text": "Thank you so much, Gerardo! We appreciate your kind words."
        }
      ]
    },
    {
      "author": "Domenico Minotti",
      "rating": 5.0,
      "review": "Prompt response and good attention to details",
      "ownerResponse": [
        {
          "text": "Dear Domenico,\n\nThank you for the excellent 5-star review! We're delighted to hear that you  More"
        }
      ]
    },
    {
      "author": "Joshua Ossinger",
      "rating": 5.0,
      "review": "Responsible, dedicated, and on top of their property management. These guys really are perfect for taking away the headache for your investment property!",
      "ownerResponse": [
        {
          "text": "Thank you Josh! It has been great working with you and we look forward to a bright future together."
        }
      ]
    },
    {
      "author": "Brandie Ogden -walburn",
      "rating": 5.0,
      "review": "Very good. Polite professional people",
      "ownerResponse": [
        {
          "text": "Thank you, Brandie! We appreciate your kind words and are glad to hear that our team provided polite and professional service."
        }
      ]
    },
    {
      "author": "Tymon Johns",
      "rating": 5.0,
      "review": "These guys know the ins and outs of the business and really take care of their customers. Great property managers!",
      "ownerResponse": [
        {
          "text": "Thank you!"
        }
      ]
    },
    {
      "author": "Cary Gammon",
      "rating": 5.0,
      "review": "Very responsive. Rented my property within 30 days. Highly recommend.",
      "ownerResponse": [
        {
          "text": "Thank you for the 5 Star Review Cary! It has been our pleasure in doing business with you! We look forward to taking great care of your property, tenants and your investor friends and their properties you most recently referred to us to manage."
        }
      ]
    },
    {
      "author": "Sarah Blakeley",
      "rating": 5.0,
      "review": "Amy did an excellent job communicating information between the landlord and myself in a timely manner. Thank you so much for your help!",
      "ownerResponse": []
    },
    {
      "author": "Jaime Betancourt",
      "rating": 5.0,
      "review": "Best company I have work for as a sub. Great and Friendly People just like Family",
      "ownerResponse": [
        {
          "text": "Thank you Jaime! We have always appreciated your prompt communication, high level of customer service with our customers and quality workmanship when it comes to carpet/flooring installation and cleaning.  You are and will always be a part of our family here at Real Property Management North Puget Sound."
        }
      ]
    },
    {
      "author": "Levi Sutton",
      "rating": 5.0,
      "review": "Great people that take the stress out of property management.",
      "ownerResponse": [
        {
          "text": "Thank you Levi! It has been a real pleasure managing your rental property in Everett these last several years. You are an ideal client and we are grateful to be able to work with you and your property."
        }
      ]
    },
    {
      "author": "Destinee Moss",
      "rating": 5.0,
      "review": "Was very helpful and fast getting me through the leasing process!",
      "ownerResponse": [
        {
          "text": "Thank you Destinee for your review! Leasing department prides on making the process fast and easy. So happy your are another one of our great new tenants!"
        }
      ]
    },
    {
      "author": "Aliou Lo",
      "rating": 5.0,
      "review": "Great company\nVery good customer service",
      "ownerResponse": [
        {
          "text": "Thanks so much for the review, Aliou Lo! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we  More"
        }
      ]
    },
    {
      "author": "Mark Pollard",
      "rating": 1.0,
      "review": "I would never rent a place managed by them again! I can't even explain how wrong they have done my family an I.",
      "ownerResponse": [
        {
          "text": "We are sorry you feel that way. The Owner is doing a complete remodel on the property. We hope for you the best."
        }
      ]
    },
    {
      "author": "Debbie Benlien-Cotten",
      "rating": 5.0,
      "review": "I love working with Real Property Management they are great!",
      "ownerResponse": []
    },
    {
      "author": "Kelapatra Ghadikalaee",
      "rating": 5.0,
      "review": "This group are professional and support their customers.\nShabnam",
      "ownerResponse": [
        {
          "text": "Kelapatra, Thank you for recognizing our professionalism, Our companies number one core value is \"Always be Honest\". Our professionalism is a big part of that. Thank you for the 5 star review."
        }
      ]
    },
    {
      "author": "Michael Robertson",
      "rating": 5.0,
      "review": "Very good to work with. If there are issues they are quick to resolve.",
      "ownerResponse": [
        {
          "text": "Hi Michael, thank you for your kind words. We have enjoyed managing your property and reciprocate that you have been a very good to work with client. We look forward to a great business relationship with you for years to come."
        }
      ]
    },
    {
      "author": "Rena Heisler",
      "rating": 5.0,
      "review": "Tyson always goes above and beyond for me and my boys at our home, being a single mom, that means the world to me!!!!!!!",
      "ownerResponse": []
    },
    {
      "author": "David Kim",
      "rating": 5.0,
      "review": "Great rental management company. Highly recommended.",
      "ownerResponse": [
        {
          "text": "Thank You Kim\n\nFrank Volkert"
        }
      ]
    },
    {
      "author": "Alex Otness",
      "rating": 5.0,
      "review": "Friendly, Fast, helpful",
      "ownerResponse": [
        {
          "text": "Thank you, Alex! We appreciate your kind words and are glad to hear that you found our service friendly, fast, and helpful."
        }
      ]
    },
    {
      "author": "Christopher Thompson",
      "rating": 5.0,
      "review": "Rose is incredibly professional and helpful!",
      "ownerResponse": [
        {
          "text": "Thank you Chris!  Your review shares that RPM does take the time for questions and answers with applicants and tenants."
        }
      ]
    },
    {
      "author": "Robert Gracia",
      "rating": 5.0,
      "review": "I work here awesome team",
      "ownerResponse": [
        {
          "text": "Robert, it has been a pleasure working and growing with you this year! Looking forward to a 2023 of continued success! "
        }
      ]
    },
    {
      "author": "Jessica Hulett",
      "rating": 5.0,
      "review": "Mark was very helpful!",
      "ownerResponse": [
        {
          "text": "Jessica, thank you for the great review! You are right, Mark is a great member of our team. Pleas reach out to us for any needs you might need."
        }
      ]
    },
    {
      "author": "Aaron",
      "rating": 5.0,
      "review": "So far so good",
      "ownerResponse": [
        {
          "text": "Thanks so much for the review, Aaron! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we  More"
        }
      ]
    },
    {
      "author": "Saher Mozip",
      "rating": 5.0,
      "review": "They been great to work with.",
      "ownerResponse": []
    },
    {
      "author": "Emad Qaifa",
      "rating": 5.0,
      "review": "Thank u",
      "ownerResponse": [
        {
          "text": "Emad,\nI am sorry for the experience you had. We really try to be responsive to all our calls and requests. I will look into it. Hopefully we can use this to improve  More"
        }
      ]
    },
    {
      "author": "Justin Connell",
      "rating": 5.0,
      "review": "Very helpful and understanding",
      "ownerResponse": [
        {
          "text": "Justin,\nThank you for your review. There is a lot involved in this industry. We work hard to educate ourselves and take care of our customers."
        }
      ]
    },
    {
      "author": "Charles Brooks",
      "rating": 1.0,
      "review": "Extremely unprofessional and very misleading",
      "ownerResponse": [
        {
          "text": "We are sorry you feel this way. We do all we can to be honest and fair to both our owners and residents  More"
        }
      ]
    },
    {
      "author": "Nicholas Williams",
      "rating": 1.0,
      "review": "Thieves",
      "ownerResponse": []
    },
    {
      "author": "Zoi Encinas",
      "rating": 5.0,
      "review": "Their efficient",
      "ownerResponse": [
        {
          "text": "Thank you Zoi! Our team works hard everyday to provide the best customer service in the industry! We appreciate your business and look forward to working with you to get the greatest results out of your rental properties in the years to come!"
        }
      ]
    },
    {
      "author": "Puchita Mtz",
      "rating": 5.0,
      "review": "I highly recommend this company where they very kindly help you look for the house that you have in mind, I give them 100% confidence, they are kind, trustworthy and they always answer my questions 100%.",
      "ownerResponse": [
        {
          "text": "Puchita, Thank you for using us for your housing needs."
        }
      ]
    },
    {
      "author": "Susan Moy",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Susan,\nThank you for your 5 star review. we appreciate our Clients."
        }
      ]
    },
    {
      "author": "marci reichert",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Marci,\n\nThank you for the 5-star rating! Your positive feedback is appreciated. If you  More"
        }
      ]
    },
    {
      "author": "Braden Roseborough",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Braden,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you  More"
        }
      ]
    },
    {
      "author": "Chris Rey",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Chris,\nThank you for your review. We like to hear how we are doing so please contact us anytime."
        }
      ]
    },
    {
      "author": "ryan barlass",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Ryan,\nThank you for your 5 star review, feel free to reach out anytime."
        }
      ]
    },
    {
      "author": "kristina kovacs",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Kristina, we at RPM are sorry that you had a bad experience as a tenant. We follow all Washington State Landlord/Tenant laws. If you feel we have breached the lease agreement, we will be happy to sit with you and go over the lease that was signed and to clarify anything."
        }
      ]
    },
    {
      "author": "Al Hocy",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Al,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you  More"
        }
      ]
    },
    {
      "author": "Kyra Shantice James",
      "rating": 2.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We wish we could have served you more to your satisfaction"
        }
      ]
    },
    {
      "author": "Shauna Sullivan",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Shauna,\nThank you for the 5 star review. We are happy you chose Real Property Management. we'll do all we can to make your resident experience a good one."
        }
      ]
    },
    {
      "author": "Alex",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Alex, Thank you for your review."
        }
      ]
    },
    {
      "author": "Darth Corn",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Daniel,\n\nThank you for your 5 star review. We really appreciate hearing from our Owners!"
        }
      ]
    },
    {
      "author": "Ayman Al-Kahlil",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you so much for the 5-star rating! We appreciate your feedback and are delighted to know you had a positive experience with Real Property Management North Puget Sound. If you ever have any questions or need assistance in the future, feel free to reach out. We're here for you!"
        }
      ]
    },
    {
      "author": "Margaret Gall",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Margaret,\nThank you for your 5 star review. We would like to hear from you, if you have a minute, we like to know what we are doing right."
        }
      ]
    },
    {
      "author": "Eugene Butler",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank Eugene\n\nFrank Volkert  More"
        }
      ]
    },
    {
      "author": "Heloisa Callado",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Heloisa!"
        }
      ]
    },
    {
      "author": "Brody Bos",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Brody,\n\nThank you for the fantastic 5-star rating! Your positive feedback means a lot to  More"
        }
      ]
    },
    {
      "author": "Sarah Pettinger",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We appreciate your 5-star rating! If you have any specific feedback or suggestions to enhance your experience further, please feel free to share. We look forward to serving you."
        }
      ]
    },
    {
      "author": "Avni Mehrotra",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Anvi, Thank you for your fantastic 5-star review! We appreciate your support. If you ever have any questions or need assistance in the future, feel free to reach out. We're here for you!"
        }
      ]
    },
    {
      "author": "Elaina Hatch",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Sammy Hoff",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you so much for the 5-star rating, Sammy! We appreciate you supporting us!"
        }
      ]
    },
    {
      "author": "bruce willis",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Mack Jokray",
      "rating": 2.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We don't know this person. We have no record of this person. Mack, If there was a dis-service we would like to make it right."
        }
      ]
    },
    {
      "author": "Henok",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Henok,\n\nThank you for the fantastic 5-star rating! We appreciate your support of Real  More"
        }
      ]
    },
    {
      "author": "James Pace",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "James, Thank you for your rating. We are glad to have you as one of our associates."
        }
      ]
    },
    {
      "author": "Nafis Rassa",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the 5-star rating, Nafis! We appreciate your support."
        }
      ]
    },
    {
      "author": "Devin Luke",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you so much for the 5-star rating, Devin!"
        }
      ]
    },
    {
      "author": "Miguel Rivas Perez",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Miguel, We are sorry you had a bad experience with us. We pride ourselves on communication. We'd be happy to work with you again in the future. If you would like to share your issue with us, it would be helpful so we can better improve our customer service. Thank you :)"
        }
      ]
    },
    {
      "author": "tasuku thompson",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the 4 star review Tasuku! We really strive to provide 5 Star service and would appreciate if you would reach out to us and let us know what we can do better to make your experience a 5 star one next time. We look forward to hearing from you soon!"
        }
      ]
    },
    {
      "author": "james bahe",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We're thrilled to receive your 5-star rating! Thank you for choosing Real Property Management North Puget Sound. If you ever have any questions or if there's anything we can do for you, don't hesitate to reach out. Your satisfaction is our priority!"
        }
      ]
    },
    {
      "author": "jon brown",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for your 4-star rating! We appreciate your support."
        }
      ]
    },
    {
      "author": "Adam Bryant",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jill Swick",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Welcome again as a new tenant with RPM.  Thank you for your 5-star review!  "
        }
      ]
    },
    {
      "author": "Ardis Allyn",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Ardis, we checked our records and we don't have you as a tenant or owner"
        }
      ]
    },
    {
      "author": "Jacob Elenbaas",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the 5-star rating, Jacob! We appreciate your support."
        }
      ]
    },
    {
      "author": "Tiffany Mendonca",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Tiffany,\nThank you for your review. We appreciate you taking your time for it."
        }
      ]
    },
    {
      "author": "Sana Pervaiz",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We're sorry you have had a bad experience. We strive to provide a high level of customer service with all our customers."
        }
      ]
    },
    {
      "author": "Zach Port",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the 5-star rating, Zach! We appreciate your support."
        }
      ]
    },
    {
      "author": "Ian stoa",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Dear Ian,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you  More"
        }
      ]
    },
    {
      "author": "Britton Kinder",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Geno Oliva",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Geno for the 5 Star review!"
        }
      ]
    },
    {
      "author": "Ryan James",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Ryan,\nThank you for your review. We appreciate your support and confidence."
        }
      ]
    },
    {
      "author": "ashly Swearingen",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "We are sorry you had a not so ideal experience."
        }
      ]
    },
    {
      "author": "Hanjin Miao",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Hanjin for the great review! We have really enjoyed managing your two rentals over the last several years."
        }
      ]
    },
    {
      "author": "Jeff Chen",
      "rating": 4.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Jeff, thank you for your review. Please let us know what we can do to improve our company up to a 5 star. "
        }
      ]
    },
    {
      "author": "Rich Hart",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you Rich for your support of Real Property Management !"
        }
      ]
    },
    {
      "author": "Eric Mattson",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Eric, Will you contact us? We are unaware of any issues. We would like to address anything that would cause you concern. especially since we have been managing the property for less than a month. Please contact us."
        }
      ]
    },
    {
      "author": "Richard Duncan",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Richard,\nThank your for your kind review. Please reach out to us anytime."
        }
      ]
    },
    {
      "author": "Shawn and Trisha Daby",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank You for the 5 star review"
        }
      ]
    },
    {
      "author": "Ket Nik",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you so much for the 5-star rating! We appreciate your support."
        }
      ]
    }
  ],
  "adjusted_review_count": 190,
  "avg_rating": 4.4,
  "adjusted_avg_rating": 4.5,
  "summary": "# Real Property Management North Puget Sound: A Balanced Review\n\n## Good\n\nReal Property Management North Puget Sound (RPMNPS) appears to have established a solid reputation based on user reviews. Many tenants and landlords alike praise their professionalism, attentiveness, and ability to handle issues expediently. For example, several landlords commend RPMNPS for their efficient management, citing experiences where their properties were rented out quickly with impressive tenants. Furthermore, the company has been noted for offering valuable services like their Diamond Guarantee, which safeguards landlords' rental income even if tenants fail to pay.\n\nFrom a tenant’s perspective, RPMNPS has been lauded for their responsive and helpful staff. Many appreciate the seamless application process and the attentive maintenance team that addresses concerns promptly. Specific employees are often mentioned by name, showing a personal touch in their service delivery. Positive interactions and quick resolutions contribute to a high average user review score.\n\n## Great\n\nExceptional experiences with RPMNPS showcase their dedication to customer service. Several reviews mention staff members who go above and beyond in their roles, whether it be during the leasing process or when coordinating maintenance and repairs. This personal approach has fostered a sense of trust and satisfaction among clients.\n\nMoreover, RPMNPS has received recognition for their professional handling of property management duties, with landlords noting the company's proactive measures to maintain property aesthetics and ensure swift rent payments. The staff's communication skills have been commended, with users reporting clear and consistent updates throughout their engagements with the company. This exemplary service has earned the trust of both tenants and landlords, leading to repeat business and referrals.\n\n## Bad\n\nDespite many positive experiences, there are reviews that express dissatisfaction with RPMNPS. A common theme among the negative reviews is poor communication, with some tenants feeling their maintenance requests are inadequately addressed or delayed. In a few instances, tenants reported moving into properties that were unclean or poorly maintained, leading to a difficult start to their tenancy.\n\nAdditionally, security deposit disputes have been mentioned, with some tenants voicing frustration over charges they believe to be unfair. These negative experiences have left a few users feeling underappreciated and misinformed, tarnishing RPMNPS's overall image for them.\n\n## Ugly\n\nA minority of reviews expose more serious grievances about RPMNPS. There are rare accounts of gross negligence and unresponsiveness to significant concerns, such as pest infestations and vital utilities issues. Certain tenants report feeling dismissed when seeking assistance, contributing to a problematic living situation. Additionally, some reviews hinted at unprofessional interactions with staff, exacerbating the distress felt by the tenants involved.\n\nIn conclusion, while RPMNPS boasts a generally positive track record with its property management services, it is evident that there is room for improvement in certain areas, particularly in tenant relations and communication. It is important to note that this article is generated by ChatGPT and is intended to be a tool to aid individuals in finding a property management company or rental property. The sentiments expressed in user reviews reflect the experience of those individuals and may not represent the experience of all customers of RPMNPS."
}