{
  "name": "RPM Property Management Division",
  "address": "",
  "company_type": "Property management company",
  "review_count": 15,
  "avg_review": 2.7,
  "reviews": [
    {
      "author": "RPM Management",
      "rating": 5.0,
      "review": "RPM has been making significant changes in our office over the past few years to better service our tenants.  We pride ourselves on quick and clear customer service.  We also have a 24/7 tenant emergency line service to deal with unexpected ",
      "ownerResponse": []
    },
    {
      "author": "Ho Choe",
      "rating": 1.0,
      "review": "Awful management.  Just look at high numbers of 1 and 2 star reviews.  The concern I had was so poorly managed I wonder if the property owner know or care about the renters' dissatisfaction?  Or perhaps the same ownership.  If you manage ",
      "ownerResponse": [
        {
          "text": "(Reviewer is not a tenant with RPM) We take our tenants concerns very seriously and respond (typically in writing) as clearly and quickly as possible.   We have several available payment options and are looking in to adding ACH to our platform in the future."
        }
      ]
    },
    {
      "author": "Maleah Meinhold",
      "rating": 1.0,
      "review": "I lived here for the 2019-2020 school year and in that time our apartment flooded twice. My roommate and I had to hound them to take action, and never gave us a confirmation that there was no mold damage. The apartments themselves are look ",
      "ownerResponse": []
    },
    {
      "author": "Josie Rowe",
      "rating": 5.0,
      "review": "Best place Ive rented in Bellingham. Clean and spacious apartments, maintence is prompt and the staff in the office are very helpful. I recently broke my foot and they were quick to accommodate me with parking to make my life 10000% ",
      "ownerResponse": []
    },
    {
      "author": "Katie Knaub",
      "rating": 2.0,
      "review": "Been living in the New England Apartments for about 5 months, and I know we will not be returning next year. The apartments aren't bad, for factoring in price and proximity to campus (as I am a student). But there have been multiple ",
      "ownerResponse": []
    },
    {
      "author": "Brady Schmitt",
      "rating": 1.0,
      "review": "In my experience, RPM consistently missed any expectations or standards a realty company should be held to. The company knows they can charge asinine fees to unknowing college students and not suffer any consequences, outside of their ",
      "ownerResponse": []
    },
    {
      "author": "Katie Buechler",
      "rating": 2.0,
      "review": "Management is AWFUL. The apartments are not nice quality, which wouldn't be terrible if they weren't so expensive. The repair man, Gustavo, is the best part of this place, and everything else sucks. If you have literally any other choice, choose it over renting from this company.",
      "ownerResponse": []
    },
    {
      "author": "Tess Schornack",
      "rating": 1.0,
      "review": "Horrible hours and rude",
      "ownerResponse": []
    },
    {
      "author": "Ira Ch Lassen",
      "rating": 4.0,
      "review": "They've been good people so far.",
      "ownerResponse": []
    },
    {
      "author": "Jenna Kennedy",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Emmett Linklater",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Joe S.",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Brad S",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Cindy Ortiz",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Juliana Pope",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 9,
  "adjusted_review_average": 2.4,
  "summary": "# RPM Property Management Division: A Candid Review Based on User Feedback\n\nAs potential renters or property owners, choosing the right property management company is critical. Since the search can be daunting, this article aims to provide a candid analysis based on user reviews of RPM Property Management Division. These insights have been generated with the help of ChatGPT and are not from any personal experiences; rather, they are a summarized synthesis designed to assist in making more informed decisions. There will be no identifiable information, just an honest look at what people have said about RPM's services.\n\n## Good\n\nRPM Property Management has demonstrated commitment to improving tenant experiences, as evidenced by some user reviews. Initiatives such as streamlining office operations and enhancing customer service protocols have been recognized. Commendably, the company also offers a 24/7 tenant emergency line, marking their dedication to addressing urgent matters swiftly.\n\nSome tenants rave about the exemplary service they've received, like the highly responsive maintenance team and accommodating office staff. One user review highlighted an exceptional level of support after incurring a physical injury, illustrating RPM's willingness to go the extra mile in accommodating tenants' needs. The attention to tenant comfort and satisfaction in these instances does not go unnoticed.\n\n## Great\n\nPositions of greatness are occasionally achieved by RPM, particularly reflected by tenants who've had positive interfacing with the management. Personal testimonies underscore the cleanliness and spaciousness of apartments managed by RPM and point out the promptness of maintenance responses. These factors contribute significantly to a comfortable and hassle-free living environment.\n\nMoreover, some reviews express satisfaction with the management’s general demeanor and helpfulness, suggesting that RPM can provide a pleasant rental experience. A proactive attitude towards tenants and their needs is vital, and when RPM exhibits this, it garners appreciation and acknowledgment for their efforts to maintain a high level of service.\n\n## Bad\n\nHowever, not all user reviews paint a rosy picture. There are several negative remarks that revolve around RPM's management style, particularly in handling concerns. Multiple users have complained about their issues being inadequately managed, which leads to a sense of neglect and frustration among tenants. These incidents bring to question the efficacy of the property management's problem-solving protocols.\n\nThe lukewarm average rating of RPM is partly due to the number of complaints about not addressing maintenance concerns promptly or thoroughly. A report about an apartment flooding twice with no confirmation of mold damage resolution is deeply concerning and reflects an area where RPM appears to have faltered significantly in fulfilling its duties.\n\n## Ugly\n\nWorse yet, some user reviews delve into more severe criticisms. These instances include allegations of exploitation, especially towards college students, in the form of excessive fees and perceived neglect. Such criticisms suggest a deeper problem within the property management's operational ethics or practices that could potentially harm their reputation and tenant relationships.\n\nRepeated themes of poor communication and dissatisfaction with management decisions have also surfaced. This ranges from a perception of awful management practices to advice from one dissatisfied tenant suggesting people seek alternative options if available. RPM's often terse responses to negative reviews may not do enough to alleviate concerns and instead, might exacerbate the tension between management and tenants.\n\nIn conclusion, while RPM Property Management Division has its share of supporters, it's clear there's a significant divide in tenant experiences. This article's intent is to provide a balanced perspective, based on user reviews, for those considering RPM's services. As a final note, please remember that these reviews are synthesized by ChatGPT and are meant purely as a tool to aid in your property management company search."
}