{
  "name": "accessibility",
  "title": "Accessibility Statement",
  "aria_announcement": "Main content contains headings, paragraph text, and lists",
  "text": "<section id=\"accessibility-statement\"><h1>Accessibility Statement for Bellingham Rental Reviews</h1><p>I am committed to ensuring that this website is accessible to individuals with disabilities. I am continually working to evaluate and test all areas of this website to meet WCAG 2.0 AA guidelines</p></section><section id=\"technical-specifications\"><h1>Technical specifications</h1><p>Accessibility of Bellingham Rental Reviews relies on the following technologies to work with the particular combination of web browser and any assistive technologies or plugins installed on your computer:</p><ol><li>HTML</li><li>WAI-ARIA</li><li>CSS</li><li>JavaScript</li></ol><h2>Measures to support accessibility</h2><p>I have taken the following measures to ensure accessibility of Bellingham Rental Reviews:</p><ol><li> Include an accessibility statement</li><li>Evaluate the web pages with the following tools:</li><ol>\t*  Deque Labs aXe browser extension\t* WebAIM Color Contrast utility\t* ORCA screen reader software\t* NVDA screen reader software</ol></ol></section><section id=\"conformance-status\"><h1>Conformance status</h1><p>The <a href=\"https://www.w3.org/WAI/standards-guidelines/wcag/\">Web Content Accessibility Guidelines (WCAG)</a> defines requirements for designers and developers to improve accessibility for people with disabilities. It defines three levels of conformance: Level A, Level AA, and Level AAA. Citylights WebStore is partially conformant with WCAG 2.1 level AA. Partially conformant means that some parts of the content do not fully conform to the accessibility standard.</p></section><section id=\"feedback\"><h1>Feedback</h1><p>I welcome any feedback on the accessibility of Bellingham Rental Reviews. Please feel free to reach out  to me at <a href=\"mailto:hello@bhamrentalreviews.com\">hello@bhamrentalreviews.com</a>if you encounter accessibility barriers. I will try to respond to feedback within 5 business days, if not sooner. </p></section>"

}