{
  "name": "Canterbury Court Apts",
  "avg_rating": 3.2,
  "review_count": 6,
  "adjusted_review_count": 6,
  "reviews": [
    {
      "author": "Chantilly H.",
      "rating": 1.0,
      "review": "Amenities are not available due to what ever excuse they come up with month to month. I lived there a year and only got to use the pool/hot tube twice. Your heat bill will be $200.00 in winter, and the windows will condensate and freeze over and then mold. You will sweat to death in summer because you can not use a window AC. Washer and dryer is mini so power bill will also be high all year, due to having to do multiple loads and the appliances are outdated. If you are a lower unit you will hear everything from your neighbors upstairs. I mean everything and it will startle you out of bed at night as if they will fall through the ceiling. You will hear the neighbors toilet flush every single time. My neighbor used the toilet a lot! They won't properly clean the apartment before you move in, if you have a cat or dog on the lease , they will keep your entire deposit claiming the entire carpet in the unit needed to be replaced due to urine ,only proof of their false claim is a black light they apparently use after you move out but not when you move in.... You will be refused a walkthrough on exit and the the carpet cleaners are also, the same person who replaces carpet.. even though they never cleaned carpets before you moved in and will not show proof when you ask. To top it off you will be forced to pay an added amount to cover all the cost of replacing carpet after they already kept 1500.00 or be reported to collections. The time and cost of fighting them in court is costly and time consuming.",
      "ownerResponse": []
    },
    {
      "author": "Dan M.",
      "rating": 5.0,
      "review": "I've lived here for about ten months now, and while I wouldn't recommend moving across two states in the middle of February, Emileigh was amazing in helping an out-of-towner figure out how to get situated.  Everything from the screening process to the move-in to the pet approval was handled quickly and easily, and the facilities are really nice.\n\nNow, this is 2020, and some of the onsite amenities are sadly unavailable, but they're doing the responsible thing which I can respect.",
      "ownerResponse": []
    },
    {
      "author": "Kathy M.",
      "rating": 1.0,
      "review": "I gave a great review last month, then I received a lengthy explanation for why they were keeping my $600 deposit and charging me an additional $339.31 for replacing carpet that was disgusting when I first moved in!  I have NEVER been treated like this and I am so disappointed.  They claim there were traces of urine through most of the living room and dining room. They provided where this supposedly was and all of the areas were covered by my furniture and my cat would NOT have had access to them.  My cat NEVER peed on the carpet. She is a house cat and they are very picky.  She always uses her litter box.  Wish I could post without any stars!",
      "ownerResponse": []
    },
    {
      "author": "Kayla B.",
      "rating": 5.0,
      "review": "Wonderful neighborhood, quiet and private, maintenance does their job quickly and effectively, and the property manager Emily is wonderfully helpful and educated. Highly recommend this company.",
      "ownerResponse": []
    },
    {
      "author": "Naomi R.",
      "rating": 5.0,
      "review": "I loved living here! Emily, the woman at the office, was always professional, respectful, and remembered everyone's names. I thought the apartment complex seemed small enough to seem personable. Very quiet apartment and neighbors were great. Highly recommend living here. Will miss the great, convenient location.",
      "ownerResponse": []
    },
    {
      "author": "Lee R.",
      "rating": 2.0,
      "review": "My wife and I have lived at Canterbury Court on and off since 2001.  Our last move out was on December 29, 2013 just over a month ago after living there for eight years.  We expected to pay a reasonable cleaning fee as we have paid before in our other two move outs.  Unfortunately this did not happen this time.  We were charged an excessive cleaning fee which was very disappointing but we paid it and wrote a letter explaining our disappoint but no one has responded to our letter to see how we could improve this issue.  I know there are new owners which then caused a change in management at Canterbury Court which probably explains the reduction in customer care.  Before these changes took place we have written positive reviews in the past of the customer care that we received from the former owners and managers.  Obviously from our long stay at this site it has been a place that we have enjoyed living.  With the new direction owner/management has taken Canterbury Court  is not the great experience that we came to expect.",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "3790 Canterbury Ln Bellingham, WA 98225",
  "adjusted_avg_rating": 3.2,
  "summary": "# Canterbury Court Apartments: A Comprehensive Review\n\nCanterbury Court Apts is a property that has elicited diverse sentiments from its residents. This article is generated by ChatGPT using user reviews to provide a balanced overview and serve as a helpful tool for those seeking insights into living at this property. It is important to note that the company has had an average rating of 3.2 across 6 user reviews.\n\n## Good\n\nResidents have shared experiences that shine a positive light on Canterbury Court Apts. Specifically, some have described the community as quiet and private, praising the property management for their quick and effective maintenance responses. The property manager, referred to by name in the reviews, has been highlighted as being exceptionally helpful, well-informed, and personable. The personal touch in remembering residents' names and maintaining professionalism has generated recommendations from satisfied tenants who have enjoyed the friendly atmosphere and convenient location of the property.\n\nMoreover, despite the challenges posed by external factors like the state of amenities in 2020, users have expressed respect for the property management's responsible handling of the situation. The onboarding process—including move-in and pet approval—has been described as smooth and easy, strongly appreciated by residents moving from out of town. The responsiveness and willingness to assist newcomers have been noted as significant positives that contribute to the initial satisfaction of living at Canterbury Court Apts.\n\n## Great\n\nAmong the positive aspects of living at Canterbury Court Apts are the expressions of goodwill towards the neighborhood itself. Described as wonderful, the neighborhood setting has been an appealing factor for many. The privacy and tranquility offered are aspects that multiple residents highly regard. Maintenance efficacy has also received high praise, adding to the sense of a well-managed property where residents' practical concerns are met with prompt solutions.\n\nIn addition, current and former residents have attested to the quality of life experienced at Canterbury Court Apts. Several reviews commend the quiet environment and character of the apartments, signaling it as a suitable choice for those looking for a peaceful residential experience. The sentiment that the apartment complex retains a personal, intimate feel contributes significantly to its allure. Many residents have also enjoyed the prime location, emphasizing the convenience it brings to their daily lives.\n\n## Bad\n\nNot all experiences recounted in user reviews for Canterbury Court Apartments have been positive. Some residents have reported issues with the handling of security deposits and additional charges. These concerns frequently center around complaints regarding charges for carpet replacement, which residents feel are disproportionate or unjust. This has led to experiences of frustration and disappointment, as tenants feel their honest efforts to maintain the apartment's condition were unfairly met with hefty financial penalties.\n\nFurthermore, the lack of response to concerns raised has been a source of dissatisfaction for some. For instance, one reviewer reported writing a letter to express their disappointment with excessive cleaning fees but received no acknowledgement from the management. This lack of communication has contributed to a feeling of reduced customer care, particularly for long-term residents who have noticed a decline in their experience following the transition to new management.\n\n## Ugly\n\nThe most severe criticisms of Canterbury Court Apts concern allegations of neglect and mismanagement. Residents have recounted encountering mold due to poor insulation, high utility bills associated with outdated appliances, and inadequate pre-move-in cleaning efforts. Complaints include disturbing noise levels from neighbors and issues with amenities not being available. These experiences have raised serious questions about the living conditions within the complex.\n\nSome tenants have felt overlooked and wronged by the management practices related to deposit retention and move-out procedures. There are instances where residents claimed they were denied walk-through inspections upon departure, and disputes over alleged pet damage went unresolved to their satisfaction. Accounts of being forced to pay additional costs on top of lost deposits, without satisfactory evidence, paint a starkly negative picture of the financial transparency and fairness at Canterbury Court Apts.\n\nIn summary, while this article's intent is to distill and convey resident sentiments, it is crucial for potential residents to further investigate and consider all facets of living at Canterbury Court Apts. Despite a good number of positive reviews, it is imperative to weigh those against the bad and ugly experiences reported when making a decision about property management companies or rental properties."
}