{
  "name": "Edgemont Apartments",
  "address": "3420 W McLeod Rd, Bellingham, WA 98225",
  "company_type": "Apartment complex",
  "review_count": 21,
  "avg_review": 3.0,
  "reviews": [
    {
      "author": "Heather",
      "rating": 1.0,
      "review": "Apex is now PTLA and ever since they bought this property it has been grossly mismanaged. The beautiful trees that made living here bareable were butchered last year or cut down altogether. There is constantly barking dogs despite ",
      "ownerResponse": [
        {
          "text": "As of last week, the property is now managed by Gather Property Management, and we are really looking forward to addressing the things you mentioned, so that Edgemont is a place you are happy to call home. We have opened the on-site leasing  More"
        }
      ]
    },
    {
      "author": "Teasa B",
      "rating": 3.0,
      "review": "There's a lot of upgrading happening here at the moment. Sometimes it's noisy. The \"Club House\" has been unusable for about a year. They're working on it but no ETA. Pet friendly apartment. You will hear dogs! (I don't mind but someone ",
      "ownerResponse": []
    },
    {
      "author": "Z K C",
      "rating": 1.0,
      "review": "Dogs Barking at Night has gotten better. Trash is Everywhere. If you smoke here please try to pick up ur cigarette filters and garbage plz. Dogs do bark constantly during the day. If you have a dog please find a way to keep them entertained especially for puppies. Parking space is tight sometimes vehicles get bumped.",
      "ownerResponse": []
    },
    {
      "author": "Rose Carmen",
      "rating": 1.0,
      "review": "Don't rent here unless you want to live in a place that goes neglected.  PTLA took over mgmt of this property in Feb and they are running the place down. It is the middle of June and they have not sent anyone out to maintain the lawn. The ",
      "ownerResponse": []
    },
    {
      "author": "Erin Mccauley",
      "rating": 1.0,
      "review": "DO NOT RENT!!!!! First off, this company refuses to do any communication by email so they have no paper trail of any of their promises or issues. Red flag. Secondly, they will not tell you that half of the buildings back up to a large ",
      "ownerResponse": []
    },
    {
      "author": "Jessica",
      "rating": 5.0,
      "review": "Ive really enjoyed living here so far. This is the best apartment complex Ive ever lived in. The property is well maintained. Ra (the property manager) and Jordan (in charge of maintenance) are always very communicative and helpful. If I ",
      "ownerResponse": []
    },
    {
      "author": "Carter Fuehr-Bush",
      "rating": 5.0,
      "review": "The place changed ownership just before we signed our lease in September, and there haven't been any issues so far. Our unit was in great condition, the place is clean, laundry machines work, great location, friendly manager, etc.",
      "ownerResponse": []
    },
    {
      "author": "Jake Widener",
      "rating": 4.0,
      "review": "Some friends just moved here from Utah the place looks really nice but no guest parking and there is always someone else in his reserved parking space",
      "ownerResponse": []
    },
    {
      "author": "ed rod",
      "rating": 5.0,
      "review": "Little hidden community with great neighbors. Management really trying to improve things up.",
      "ownerResponse": []
    },
    {
      "author": "Alfred Fleming",
      "rating": 3.0,
      "review": "Older, quiet apartments.",
      "ownerResponse": []
    },
    {
      "author": "Joe Busch",
      "rating": 1.0,
      "review": "Edgy complex",
      "ownerResponse": []
    },
    {
      "author": "B. Nichole",
      "rating": 1.0,
      "review": "Hattee Hatie Hate ",
      "ownerResponse": []
    },
    {
      "author": "Blanca Ortega",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Melinda",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Kev",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Rozi Sandhu",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Tabitha Collmann",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Joy Richmond",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "johnny gaona",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Stefan Carlsen",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "cassie w",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 12,
  "adjusted_review_average": 2.6,
  "summary": "# A Balanced Take on Edgemont Apartments\n\nIn this article, we provide a balanced overview of Edgemont Apartments based on user reviews. This article's intent is to help potential renters gauge the apartment complex and the management's performance. These reviews are synthesized by ChatGPT to form a cohesive narrative, with no individual identifying information used.\n\n## The Good\n\nEdgemont Apartments have received commendation from several residents who relish in the experiences offered by the complex. Some renters have described the apartments as a \"little hidden community with great neighbors,\" emphasizing the friendly and communal atmosphere fostered amongst the residents. It appears that efforts to improve the property have not gone unnoticed, with users highlighting management's endeavors to enhance conditions.\n\nPositive reviews also frequently cite the cleaning standards and condition of the living spaces upon moving in. One recent and happy tenant noted, \"Our unit was in great condition, the place is clean, laundry machines work, great location, friendly manager, etc.\" Maintenance seems to be responsive, according to a few reviews, with the property manager and maintenance staff lauded for their communicativeness and helpfulness.\n\n## The Great\n\nA handful of user reviews glowingly depict Edgemont Apartments as a top living choice, with one resident declaring it \"the best apartment complex I've ever lived in.\" This sentiment is reinforced by observations of well-maintained grounds and efficiently addressed maintenance issues. The dedication of the property management to keep the apartments in pristine condition is evident.\n\nBesides the upkeep, several residents appreciate the upgrades and renovations that have either been completed or are underway. This initiative signals to the tenants that the complex is evolving and adapting to modern living standards. Moments of praise for specific staff members suggest that the management has hired competent and caring individuals who prioritize the well-being of their tenants.\n\n## The Bad\n\nUnfortunately, some reviews reveal a less favorable view of Edgemont Apartments. Issues such as noise disruption due to ongoing upgrades, and the long unavailability of amenities like the \"Club House\" have been sources of frustration. Furthermore, user reviews express discontent regarding the insufficient guest parking and residents finding others in their reserved spaces, indicating a lapse in control over parking regulations.\n\nThere also seems to be an inconsistency in management performance. While some tenants report satisfactory interactions and problem-solving, others are met with silence or inaction, particularly concerning residential complaints. Such variety in experiences suggest that the property management's efficiency may fluctuate.\n\n## The Ugly\n\nThe reviews convey a deeper set of concerns, with some users painting a dire picture of the apartment management. Accounts of mismanagement under previous ownership show a decline in the complex's overall appeal, such as the upkeep of green spaces and the handling of maintenance requests. One review specifically calls out the lack of response from the property management for much-needed lawn care.\n\nReports of constant barking dogs and littered common areas further contribute to an image of neglect and oversight. Even more troubling are the allegations of the property management avoiding email communication, leading to a lack of record for any correspondences—an issue many tenants find alarming. It appears that while some residents encounter a reasonable living situation, others face a litany of complications that mar their experience at Edgemont Apartments.\n\n---\n\nIn summary, Edgemont Apartments seem to be a mixed bag, with some tenants thoroughly enjoying their time while others face significant challenges. As potential renters weigh their options, it's crucial to consider this range of experiences. This article is a generative tool offered by ChatGPT, aiming to assist you in your search for a property management company or rental property, and the sentiments presented here reflect a compilation of user reviews."
}