{
  "name": "Foothills Apartments",
  "address": "1320 Lakeway Dr, Bellingham, WA 98229",
  "company_type": "Apartment complex",
  "review_count": 25,
  "avg_review": 3.0,
  "reviews": [
    {
      "author": "Paula",
      "rating": 1.0,
      "review": "I was a resident of the Foothills property for 3 years, during which I had many unfortunate interactions with the Royce Group management. I was targeted for a few dead plants at the end of season while allowing other properties to look ",
      "ownerResponse": []
    },
    {
      "author": "LCL Blonde",
      "rating": 1.0,
      "review": "I have a good friend who has lived at the Foothills for 10 years. She is nearly 70 years old and has a 34 year old mentally ill son she cares for 24 hours a day. He has schizophrenia and sometimes talks out loud to the voices in his head. ",
      "ownerResponse": []
    },
    {
      "author": "Monica Briones",
      "rating": 1.0,
      "review": "Theyre old. Really old. And they dont warn you about the horrible theft problem they have. My boyfriend has his vehicle stolen in broad daylight. Neighbors watched and everything. Apartment managers dont seem to concerned.",
      "ownerResponse": []
    },
    {
      "author": "Tia Vick-Teachman",
      "rating": 4.0,
      "review": "I have close friends who live there. The rent has been raised excessively every year and the only amenity is a coin operated washer and dryer, the walls are thin so you can hear the neighbors and the units are difficult to heat. (What he says). They seem nice to me.",
      "ownerResponse": []
    },
    {
      "author": "Monika Sami",
      "rating": 1.0,
      "review": "Ive had the worst experience with this property management. My car has be involved in two accidents! One was a hit and run and now someone keyed my car! There is no one who will contact you for months to any type of compliant to corporate. ",
      "ownerResponse": []
    },
    {
      "author": "Melissa Garcia",
      "rating": 1.0,
      "review": "Nestled behind a busted up 7/11, this complex is the brain child of a meth addict who saw the musical Cats one too many times. What's that in the woods, is that a friendly elf? Why no, it's a hobo holding a lawn gnome shouting racist slurs.",
      "ownerResponse": []
    },
    {
      "author": "Diva Azia",
      "rating": 1.0,
      "review": "The managment of this facility is racist and biased. They gave a combated veteran an eviction notice over a BLM sign which he had in his window for over 2 years but residents with #ImpeachTrumpNow stickers didnt receive a thing.",
      "ownerResponse": []
    },
    {
      "author": "Shaun S",
      "rating": 1.0,
      "review": "The owners are jerks that love to give tickets. Maintenance is great tho. What's up with the dirt filled pool?!",
      "ownerResponse": []
    },
    {
      "author": "Destinee Hardenbrook",
      "rating": 3.0,
      "review": "I've lived there not bad could be better but ya nice neighbors pets allowed dogs over one year though.",
      "ownerResponse": []
    },
    {
      "author": "Robert Gora",
      "rating": 4.0,
      "review": "Really quiet and very elegant believe it or not",
      "ownerResponse": []
    },
    {
      "author": "Zoe Cruz",
      "rating": 1.0,
      "review": "TERRIBLE PLACE TO LIVE!!!",
      "ownerResponse": []
    },
    {
      "author": "A Hues",
      "rating": 5.0,
      "review": "Cute",
      "ownerResponse": []
    },
    {
      "author": "David PJ Tye",
      "rating": 4.0,
      "review": "Decent",
      "ownerResponse": []
    },
    {
      "author": "matthew chapanar",
      "rating": 3.0,
      "review": "People are annoying",
      "ownerResponse": []
    },
    {
      "author": "David Tye",
      "rating": 5.0,
      "review": "Person bisimess",
      "ownerResponse": []
    },
    {
      "author": "Azhmaliyyih Teal",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Mary Giles",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Nathan Mattly",
      "rating": 2.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "C W (CeeDubs)",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Change Anderson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Elizabeth Liz Elsesser",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "D S",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Natalja Savicka",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Dykezilla Danimal",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Miranda Levine",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 15,
  "adjusted_review_average": 2.4,
  "summary": "# Foothills Apartments Review Article\n\nThis article aims to provide a balanced overview of the Foothills Apartments based on user reviews. We dig deep into what residents have to say, without revealing their identities, to help you understand the living experience you can expect from this apartment complex. Please note that all content in this article is generated by ChatGPT and serves as an insightful tool to aid in your search for a suitable property management company or rental property.\n\n## Good\n\nFoothills Apartments have been praised for their peaceful atmosphere, as echoed by a reviewer who highlighted the quietness and elegance of the property. Indeed, the tranquility offered is one of the attributes that can make living here an enjoyable experience for some residents. Another aspect worth mentioning is the allowance of pets, with a specific nod from one user review towards the welcoming of dogs over one year old, a policy which can be quite favorable for pet owners looking to find a furry-friendly home.\n\nA handful of residents expressed satisfaction with some of the staff, like the maintenance team, who were singled out as performing great work despite the overall dissatisfaction with management. Additionally, some long-term residents have found their stay to be decent enough, with a few remarking on having forged good relationships with their neighbors. While these positive experiences are limited compared to the critiques, they are an important part of the conversation around Foothills Apartments.\n\n## Great\n\nAmidst the variety of views, some user reviews shine with positivity towards Foothills Apartments. A few residents regarded their accommodations as 'cute' and even 'elegant, believe it or not', suggesting that for select tenants, their expectations were met or even exceeded. Moreover, comments about 'really quiet' environments indicate that for those seeking a calm living space, Foothills Apartments could potentially fit the bill.\n\nIt's not just living conditions but also the sense of community that has received favorable mention. Residents who report having nice neighbors provide a glimpse into the potential for a congenial social atmosphere. For prospective tenants looking for a complex with a strong sense of community, this could be reassuring. Despite the presence of negative reviews, these positive experiences suggest that experiences at Foothills Apartments can indeed vary widely.\n\n## Bad\n\nOn the downside, several residents have voiced concerns over significant issues during their stay. Multiple reviews express dissatisfaction with the property management, pointing out a lack of responsiveness to various types of complaints. Some tenants have reported feeling neglected, and one mentioned their vehicle being stolen from the complex with apparent indifference from the apartment managers. These instances reflect a common theme of potential insecurity and unaddressed concerns.\n\nAnother frequent gripe pertains to rent increases and a perceived scarcity of amenities — a sentiment that doesn't sit well with those who feel they aren't getting value for their money. The frustrations are compounded by comments about thin walls and difficulties in heating units, making for a less-than-ideal living experience for some residents. The distress associated with these issues is a key aspect of the user reviews, highlighting challenges some may face at Foothills Apartments.\n\n## Ugly\n\nRegrettably, there are more alarming issues highlighted in user reviews that describe the uglier side of Foothills Apartments. One resident recounted an experience wherein they perceived management practices as discriminatory, citing an eviction notice over a political sign while other residents with opposing political views were not reprimanded. Another review depicted the surrounding environment in a particularly grim light, mentioning unsightly neighboring areas and disturbances, which pose significant concerns for potential quality of life.\n\nMoreover, safety issues have been a paramount concern, with reviews mentioning theft problems, including vehicle theft and vandalism like a keyed car. Such incidents contribute to a troubled picture of the community's security measures. Alarmingly, descriptions of the property involving encounters with unwelcome outsiders are particularly distressing for those who prioritize their personal safety and peaceful living. These accounts serve as the most disconcerting points of feedback gathered from the user reviews on Foothills Apartments.\n\nAs this article illustrates, while Foothills Apartments may have its share of satisfied residents, many others express discontent with aspects ranging from apartment quality to management practices. This information should serve as a resource for individuals considering Foothills Apartments as their next home."
}