{
  "name": "South Hill Apartments",
  "avg_rating": 2.8,
  "review_count": 21,
  "adjusted_review_count": 15,
  "reviews": [
    {
      "author": "Yip E.",
      "rating": 1.0,
      "review": "They never showed up to our appt to view the apartment....we drove 4 hours to view, as we don't live in Bellingham & NO ONE WAS THERE!\n\nWaited and hour, left 2 more messages...it was a WHOLE DAY WASTED.",
      "ownerResponse": []
    },
    {
      "author": "Jennifer S.",
      "rating": 1.0,
      "review": "South Hill Apartments treated me and my roommate with disrespect in regard to health hazards, privacy, simple maintenance requests, and human decency over the year I lived there. We moved in July 2016 and stayed for the one year lease. I chose to move at the end of the year and my roommate took over the lease for one month. He then was given an unreasonable termination of housing. To begin, we complained about bad maintenance and mismanagement using every acceptable avenue and request. I never belligerently complained or harassed the on-site personnel but they gave me a wide berth the second I began to note odd things. First, it was an infestation of ants that then continued off and on for over six months.  Then, it was questions about seemingly unending maintenance in an adjacent unit, so loud it was distrusting our ability to work, sleep, and study. If you want a legal explanation, feel free to reach out to me, because I have a long list of recorded problems. But on a personal level, I never felt comfortable at South Hill. Once, I walked out of the bathroom to maintenance staff standing in the living room, not caring that I was given no notice. After I complained, the head of maintenance, Jeff, would suddenly glare and mumble when he saw me. Once, in the laundry room, he side-eyed me while talking to another tenant about football and how some people annoy the hell out of him and then he switched the subject to his guns that he owns. (Note the moment he looked at me). It was just weird. The two on-site managers were ignorant of their rights as middlemen and help for tenants, at best, but that might be giving them too much credit. As often as we had to wait for exterminators, or scream to order lunch over the sound of a jackhammer, or tip toe through piles of dead ants, it's insulting that we were shrugged off and treated like children. They have condemned our unit, which is the reason given to my roommate for terminating his tenancy. \"The problems you cannot live with will not change and this unit is not fit to inhabit, so you have until the end of the month.\" If you rent unit 107, we paid $895/month for that place and it is not considered fit for human habitation, so be sure to ask if they really remedied the place before you move in and adopt our issues. If you expect respect, don't live here. If you expect basic human decency, apply elsewhere.",
      "ownerResponse": []
    },
    {
      "author": "Sarah D.",
      "rating": 1.0,
      "review": "To start off, the Office Staff is incredibly unprofessional. The assistant manager has been quite difficult to work with. She never remembers who I am when I walk through the door. If I am living at the complex she works at, I feel as though it might be important to know who your tenants are and what they look like. Her emails and responses to issues I have had have been very out of line. She is very disorganized and unprofessional. \n\nOn another note, the maintenance staff could use a little work. They are constantly shutting off the water or doing renovations to the apartment. It is always one thing after another, and I do not feel at home.\n\nThe parking lot has been an ongoing issue for me for quite a while. Several months ago, I had to be rushed to the emergency room on a Sunday. I was there for several hours. My boyfriend was the one who took me. When we got back to my complex he parked in the parking lot to immediately get me inside. He was taking care of me the rest of the night, in the morning when he remembered he needed to move his car (roughly around 9AM) he found his car had been towed. After just getting out of the hospital I had to drive him to pick up his car. The first warning he received was on a weekend which, when I moved in, I was told specifically by the office staff that guests could park in the parking lot on weekends. To give perspective, the parking lot is huge and is rarely ever full. Now, because of this, my family members and friends do not feel comfortable coming to my apartment complex in fear their car will receive a warning sticker, or get towed.\n\nThe buildings (Manor and Terrace) are incredibly old and falling apart. The pipes are in pretty bad shape and there always seems to be something wrong. As I have said above, there is constant maintenance, so when they need to enter the apartments as much as they have been, I feel as though it becomes an invasion of privacy. In one instance there was a notice on the door saying they needed everyone to move the furniture away from the heaters so they could turn the heat on. So, I moved all the furniture out of the way and they never came in to the apartment. I called the office staff and all they said to me was \"yeah we didn't get to it, not sure when we will.\" It was already November here in Washington and that will make any room without heat almost unbearable.\n\nIf you want to feel at home, do not home here. I will never recommend this complex to anyone.",
      "ownerResponse": []
    },
    {
      "author": "Honestabe N.",
      "rating": 2.0,
      "review": "This place likes to try to come off as a small company, but it could not be farther from the truth, if you are one day late they give u 3 days to pay or vacate. I can understand that in some situations, but there has also been time when I prepaid rent months in advance so you think I would get a smidge of leeway. The maintenance people are nice, but I am not a fan of how this place is run (it doesn't help that every time I need to talk to the manage they are out during business hours), if this continues I will be looking for a new place when my lease ends, and I know I am not the only person here that is thinking that way.\nThis place isn't all bad, rent is reasonable, close to WWU, and downtown, and while I am not a fan of their policies the management is a little friendly.",
      "ownerResponse": []
    },
    {
      "author": "Aaron Sime",
      "rating": 5.0,
      "review": "This was our Bellingham home for nearly 4 years. It was an excellent place to call home for us. The location was perfect for us. The commute to work in Fairhaven was easy. To get to downtown was just a short drive or 10-15 minute walk. The ",
      "ownerResponse": []
    },
    {
      "author": "Kai Wittenberg",
      "rating": 5.0,
      "review": "Going on my second year here and could not be more impressed, particularly when comparing this site to other apartment rentals in Bellingham. I've never once had a problem with anyone here (neighbor or employee), in fact, the employees who ",
      "ownerResponse": []
    },
    {
      "author": "Brenda Baker",
      "rating": 4.0,
      "review": "The staff here try hard to accommodate everyone's request whether it is moving to another apartment, work orders or just general questions. Both office staff have at least 15 years experience in Property Management so Ms. Dumas needs to ",
      "ownerResponse": []
    },
    {
      "author": "Zach Bastian",
      "rating": 1.0,
      "review": "Here were my main issues with living at South Hill Apartments for just over a year: ",
      "ownerResponse": []
    },
    {
      "author": "Emily Hie",
      "rating": 5.0,
      "review": "I think this is one of the best places to live in Bellingham.  Affordable living with a view, clean and updated, full of light, and a friendly community.  The property managers are extremely friendly and reasonable, and go above and beyond ",
      "ownerResponse": []
    },
    {
      "author": "Ryan Darian",
      "rating": 1.0,
      "review": "We were told in November of 2016 that there would be construction occurring in a unit adjacent to our apartment. For the next five months, we lived next door to a automated concrete sledgehammer banging away next to our bedroom. That five ",
      "ownerResponse": []
    },
    {
      "author": "Jared Ross",
      "rating": 1.0,
      "review": "Make sure you read the fine print on the lease. When they mention the monthly rate, they say \"the rent is (X) amount per month untill adjusted by manager/landlord\", meaning they can raise your rent at anytime during your lease. This just ",
      "ownerResponse": []
    },
    {
      "author": "Adriana Guerrero",
      "rating": 4.0,
      "review": "I absolutely love everything, but the single paned windows. This is a future project of thiers, but otherwise it's an amazing place to live! It's especially nice when you have the hardwood floors and the view! Maintenance is very prompt on answering calls and management is very friendly.",
      "ownerResponse": []
    },
    {
      "author": "Julia Moss",
      "rating": 5.0,
      "review": "A wonderul location with a beautiful view. The staff are amazing and make this apartment complex feel like home.",
      "ownerResponse": []
    },
    {
      "author": "Morgan Strand",
      "rating": 1.0,
      "review": "Won't answer the damn phone and won't call me back about the 300 dollar deposit that is refundable to hold a unit and we weren't able to get the place. JUST ANSWER YOUR DAMN PHONE!!!!",
      "ownerResponse": []
    },
    {
      "author": "Bre Sanders",
      "rating": 4.0,
      "review": "We miss Dee very much! But great apartments overall.",
      "ownerResponse": []
    },
    {
      "author": "Sarah Dumas",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "A J",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Maxim Bryson",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Briana Mihelich",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Gavin Christensen",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Tad Beavers",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "company_type": "Apartments",
  "address": "255 N Forest St Apt 308 Bellingham, WA 98225",
  "adjusted_avg_rating": 2.7,
  "summary": "# South Hill Apartments - An Honest Overview\n\nThese reviews are generated by ChatGPT and serve as a guide to assist in the evaluation of South Hill Apartments. No identifiable information of reviewers is included, ensuring anonymity.\n\n## The Good\n\nSouth Hill Apartments boast some satisfied tenants who mention the convenient locality and the ease of commute to work and nearby attractions. Tenants who posted positive reviews appreciated the short drive to downtown and found the location ideal for their needs. The apartments themselves have been described as clean, updated, full of light, and offering a sense of community. Some users have particularly praised the friendly nature of the property managers, highlighting their willingness to go above and beyond in their responsibilities.\n\nFurthermore, there are mention of efficient maintenance teams being prompt to respond to requests. Some residents have emphasized that the office staff, with significant experience in property management, tries hard to fulfill various resident requests and queries. The rental rates have been deemed reasonable by a few, and the amenities, including hardwood floors and views, have received commendations from some of the apartment complex's tenants.\n\n## The Great\n\nIn cases where excellent service was observed, residents were notably impressed and grateful. A few reviews speak of going into a second year of tenancy without any issues, highly contrasting the negative feedback. These tenants regard South Hill Apartments highly, especially when compared to other options within Bellingham. It is also mentioned that long-term tenants have found the property management to be extremely reasonable, creating a homely and warm atmosphere which they have come to love.\n\nAnother aspect where South Hill Apartments seemingly shines is in the proactive approach of its maintenance staff, ensuring that the living space is comfortable for tenants. Positive reviewers have specifically noted promptness and friendliness as strong suits of the management team, adding to the overall appeal of the complex for potential residents seeking a tight-knit apartment community.\n\n## The Bad\n\nHowever, not all user reviews lean towards satisfaction. Several tenants have expressed serious concerns about the management's lack of professionalism. Instances of staff failing to recognize tenants, along with disorganized and disrespectful communication, have marred the reputation of South Hill Apartments. Complaints also extend to the topics of health hazards, privacy concerns, and some management practices deemed as unfair or uncompassionate.\n\nThe issue of continuous maintenance arises in multiple reviews, suggesting a frequent disruption of the tenants' home life and privacy. Reports of inadequate notice prior to maintenance staff entering apartments further fuel the discontent amongst some residents. The complaints reflect a pattern of mismanagement affecting the comfortable and secure atmosphere that one would expect in their living space.\n\n## The Ugly\n\nReviews contain unsettling anecdotes, including one about unannounced maintenance personnel in a tenant's living room, which raises security and privacy issues. A review documents an experience of disrespect from maintenance staff, constituting a hostile living environment. Some of these adverse experiences seem to culminate in units being deemed \"not fit to inhabit,\" coupled with tales of inexpedient management responses to critical living conditions.\n\nAnother recurrent complaint is about the apartment complex's parking policies. Instances of cars being towed without proper warnings, inconsistent enforcement of parking rules, and lack of empathy during emergencies appear as common themes. Such incidents contribute to a feeling of distress and a perception that the complex is unwelcoming to guests, undermining the semblance of a welcoming community that a home should offer.\n\nIn summary, while the article has presented some instances of South Hill Apartments excelling, a substantial number of user reviews point towards significant room for improvement with an emphasis on better communication, respect for residents, and maintenance of the properties. Potential tenants are encouraged to consider the array of experiences conveyed in this article to make informed decisions about their living arrangements."
}