{
  "name": "Stateside",
  "address": "929 N State St, Bellingham, WA 98225",
  "company_type": "property",
  "review_count": 48,
  "reviews": [
    {
      "author": "Carolyn Puppikerz",
      "rating": 3.0,
      "review": "I LIST BOTH POSITIVES AND NEGATIVES BELOW:\nI love this place HOWEVER it has some issues that all come down to staff. The staff is incredibly under trained and when you ask to talk to their boss they are ",
      "ownerResponse": [
        {
          "text": "We appreciate your feedback, Carolyn. We apologize for any inconvenience you experienced with our staff and their availability. We'll work on improving our response time and training to better assist our residents. We're glad to hear that  More"
        }
      ]
    },
    {
      "author": "Rem Mars Naughton",
      "rating": 1.0,
      "review": "This place takes advantage of students in every way it can. It charges unfair amounts upon moveout and while I've never once anywhere I've lived had an issue getting my full security deposit back I am currently being charged hundreds of ",
      "ownerResponse": [
        {
          "text": "We certainly appreciate you listing out all of the factors that have contributed to your negative experience, Rem - though we're unsure if our communications correspond exactly with the perspective you've outlined here. If you could, please  More"
        }
      ]
    },
    {
      "author": "Finch Guzman",
      "rating": 1.0,
      "review": "I cant believe this place has such good reviews. The entire time I lived at Stateside the management was very poorly run and response times were incredibly slow. I was also charged $160 in damages that I did not cause and that Stateside ",
      "ownerResponse": [
        {
          "text": "Finch - we appreciate you summarizing your experience of living with Stateside in the time you had, as well as prompting action from our team to revisit your circumstance in full to better reply to your review. As a sub-letter, you'd  More"
        }
      ]
    },
    {
      "author": "Manpreet Singh",
      "rating": 3.0,
      "review": "Really nice luxury apartments which I have never seen for students before. I stayed here in Summer as a sublet and really enjoyed the location. Good gym and internet amenities. ",
      "ownerResponse": [
        {
          "text": "We appreciate your feedback about the property in the time that you'd spent with us, Manpreet. We're happy to go over any aspects of the community's location and what we're adjacent to if folks have questions following your review!  More"
        }
      ]
    },
    {
      "author": "Ariel Reyes",
      "rating": 5.0,
      "review": "This place is honestly one of the nicest places Ive stayed, the staff is super friendly and very informative.  The rent is affordable,The furniture and appliances are nice and modern and the community get togethers they hold are super ",
      "ownerResponse": [
        {
          "text": "We truly appreciate every sentence you've written here, Ariel. Thank you for listing out all of the things that have really made your Stateside experience perfect. :) Here if you ever need us!"
        }
      ]
    },
    {
      "author": "Teagan Jones",
      "rating": 1.0,
      "review": "If I could put 0 stars, I would. Stateside is filthy, outrageously priced, and holds the most unprofessional leasing staff I have ever dealt with. Don't let the two year old photos fool you- the common areas in this place are filthy. Not ",
      "ownerResponse": [
        {
          "text": "Teagan - thank you for providing your feedback and detailing where you feel Stateside's operations and maintenance could improve. We understand that we're currently in the midst of another conversation regarding your move-out so we will  More"
        }
      ]
    },
    {
      "author": "Draegon Moss",
      "rating": 2.0,
      "review": "Great if you have mommys/daddys money. The rent is pretty steep, they charge an outrageous amount for parking in the garage, currently going for $350 each month on top of rent. Street parking is awful and there are times I have to drive ",
      "ownerResponse": [
        {
          "text": "Draegon, thank you for taking the time to thoroughly review Stateside and your time with us. We apologize for the negative experiences you have had during your time here, particularly with the parking and cleanliness. We take all feedback  More"
        }
      ]
    },
    {
      "author": "Laura Lott",
      "rating": 1.0,
      "review": "Really disappointed with this place!!! How are you going to tell your residents to leave up their LED lights because your maintenance crew will take them down safely but still charge for the damage that your maintenance crew caused? We have ",
      "ownerResponse": [
        {
          "text": "Hi, Laura. We apologize about your daughters experience concerning the lights, and invite you to please contact us if you have any further questions. Wed be happy to explain our maintenance process at Stateside in more detail."
        }
      ]
    },
    {
      "author": "Jared Dirks",
      "rating": 1.0,
      "review": "I can only speak to my experience at Stateside, but from what I have heard from others who I met while living there I can say there is generally some things I can comment on confidently. ",
      "ownerResponse": [
        {
          "text": "Jared - thank you for organizing your thoughts and experience in a review for us and others to evaluate. We want to apologize for the frustrating elements surrounding your experience, namely the closing of amenities while assessing the  More"
        }
      ]
    },
    {
      "author": "Shayn Sath",
      "rating": 5.0,
      "review": "When I first heard about stateside I knew the name had a meaning behind it. A beautiful big 2 building structure with AMAZING views of the bay and the city. Had the opportunity to take a tour in January and walking into the very first unit ",
      "ownerResponse": []
    },
    {
      "author": "Mason Woolbright",
      "rating": 1.0,
      "review": "If you have a car DO NOT MOVER HERE you will spend 30 minutes or MORE looking for a parking spot. If you dont want to pay the $400 a month for gated parking. The people who work here are rellly nice tho",
      "ownerResponse": [
        {
          "text": "Mason - thank you for your review and perspective. We're sorry to hear that you've had a negative experience with parking at Stateside. We understand that parking can be challenging in urban areas, and that's birthed the offer of gated  More"
        }
      ]
    },
    {
      "author": "Kashmere Carr",
      "rating": 5.0,
      "review": "Super excited to move in next month!! Everyone is so sweet and helpful, especially the leasing manager Lindsay Fulford. I did a virtual tour of the building with her, and just WOW. Ive lived in my fair share of homes and apartments, and ",
      "ownerResponse": []
    },
    {
      "author": "Kristofferson Family",
      "rating": 5.0,
      "review": "From a parent's perspective so far so good.  Everything we have needed to do with Kasee and Lindsay as been so smooth.  Quick response to ALL of my many questions and very professional.  I hope this is an indicator of how our son's ",
      "ownerResponse": []
    },
    {
      "author": "Lindsay Fulford",
      "rating": 5.0,
      "review": "It can be difficult to find student housing that checks off all the boxes like Stateside does. You are right where you need to be with all the popular shops and restaurants, WWU, and the South Bay Trail only minutes away on foot. As part of ",
      "ownerResponse": []
    },
    {
      "author": "ellie",
      "rating": 5.0,
      "review": "absolutely love the environment and the people! such a great place to live. everyone is loving and accepting and the staff does everything they can to help at any point!",
      "ownerResponse": [
        {
          "text": "We really appreciate this day-making insight, Ellie - thank you for your joy and positivity! We will always do what we can for our community. :)"
        }
      ]
    },
    {
      "author": "Dylan Wilding",
      "rating": 1.0,
      "review": "Now that they have residents living here, they are beginning to price gouge. Parking prices are going up 300%-600% in a single year, and I'm assuming apartment prices will go up as well too. What a shame, because the apartments themselves ",
      "ownerResponse": []
    },
    {
      "author": "Ruby Donaldson",
      "rating": 5.0,
      "review": "I toured stateside and it was amazing. I have already signed my lease but I wanted to see the buildings in person, everyone was so helpful and answered all my questions! They have free laundry and a community kitchen that is so spacious. I can't wait to move in.",
      "ownerResponse": []
    },
    {
      "author": "Shelby Felthoven",
      "rating": 5.0,
      "review": "I recently signed my lease with stateside and I am ecstatic to move in. Everyone at stateside has been extremely helpful and made the process fast and easy. The apartments are beautiful with great views and a great staff and I cant wait to move in when they open up!",
      "ownerResponse": []
    },
    {
      "author": "Emerson Sullivan",
      "rating": 5.0,
      "review": "Lindsay was very helpful and friendly working with her and the building looks beautiful! The fact that there is a bagel shop and fitness center on site is a huge plus. By far the greatest deal I could find in Bellingham for the  amenities and building.",
      "ownerResponse": []
    },
    {
      "author": "Carly Spradlin",
      "rating": 5.0,
      "review": "Hey there! I'm a CA at Stateside Bellingham, started here a couple of months ago. ",
      "ownerResponse": []
    },
    {
      "author": "Taylor",
      "rating": 4.0,
      "review": "Great apartment! Love it so much, but the rent and parking is increasing to an unrealistic amount. My roomates and I cant afford the new prices.",
      "ownerResponse": [
        {
          "text": "Thank you for the great and honest feedback, Taylor. Always happy to facilitate any discussion related to pricing and leasing if you'd like to chat about it this week or after the holidays! Thanks again for your review."
        }
      ]
    },
    {
      "author": "Lillie Adamson",
      "rating": 5.0,
      "review": "I love stateside! Everyone is so friendly and the rent is reasonable. Some of the apartments have funny layouts, but they are all furnished and pretty high quality.",
      "ownerResponse": []
    },
    {
      "author": "Sophia Collins",
      "rating": 5.0,
      "review": "Stateside is a brand new & absolutely beautiful student housing community in Bellingham. If youre on the housing hunt, give us a call- we are here to help make this process super fun and easy for yall!",
      "ownerResponse": []
    },
    {
      "author": "anna manry",
      "rating": 1.0,
      "review": "they left all the elevators down for hours, i am on crutches and could not leave my house. thank you stateside",
      "ownerResponse": [
        {
          "text": "Anna - thank you for leaving us a review regarding this instance. A member of our team is reaching out today to discuss this further, as we'd love for you to know the available resources in the event this ever occurs again. The elevators in  More"
        }
      ]
    },
    {
      "author": "Kasee Castro",
      "rating": 5.0,
      "review": "Ownership and management come from experienced backgrounds and exceptional customer service. Excited to see this community come to the Bellingham market for students looking to elevate their housing experience!",
      "ownerResponse": []
    },
    {
      "author": "Gabriel Grant",
      "rating": 5.0,
      "review": "There has been a lot of care and attention put into creating a great environment for residents, both in terms of great spaces and amenities as well as excellent management.",
      "ownerResponse": []
    },
    {
      "author": "Dennis Alexandrow",
      "rating": 5.0,
      "review": "I love it here at stateside! The building is beautiful inside and out and the perfect distance from campus, making it very convenient for students!",
      "ownerResponse": []
    },
    {
      "author": "Charlie Schmid",
      "rating": 5.0,
      "review": "So clean and crazy modern. Best student housing for Western HANDS DOWN. 2 minute drive and 12 minute walk to campus.",
      "ownerResponse": []
    },
    {
      "author": "Nathan Shamseldin",
      "rating": 5.0,
      "review": "This place looks absolutely amazing! From the views to the culture Id give it a solid 10/10. Shout out to Sophia for the awesome tour!",
      "ownerResponse": []
    },
    {
      "author": "Karla Hernandez",
      "rating": 5.0,
      "review": "The Stateside team was extremely helpful when I was applying. The units look gorgeous and I cant wait to move in!",
      "ownerResponse": []
    },
    {
      "author": "eduardo castro",
      "rating": 5.0,
      "review": "Just moved in, loving my new apartment awesome views ;) and great location.. Staff made moving in a breeze. I think I made the right choice!",
      "ownerResponse": []
    },
    {
      "author": "Irena Kolbert",
      "rating": 5.0,
      "review": "Very beautiful rooms and great location. The views are nice, and its super close to WWU.",
      "ownerResponse": [
        {
          "text": "Thank you for this beautiful sentiment Irena. We are so glad you're enjoying Stateside for its location and views!"
        }
      ]
    },
    {
      "author": "Ava Martin",
      "rating": 5.0,
      "review": "Stateside Apartments make me feel right at home! I love the amenities and I love how close it is to down town.",
      "ownerResponse": [
        {
          "text": "Thank you for the love and great review, Ava!"
        }
      ]
    },
    {
      "author": "Mackenzie Mast",
      "rating": 5.0,
      "review": "Our team is super excited to bring great new student-focused apartments and retail to Bellingham!",
      "ownerResponse": []
    },
    {
      "author": "P D S",
      "rating": 1.0,
      "review": "I am being charged continuously for electricity even when I am not living there anymore.",
      "ownerResponse": [
        {
          "text": "Hey there - we're sorry that you're experiencing some trouble with the financial aspect of things. We're fairly certain the charges you're seeing are from the last two months, but in the event they're not, give us a call at (360) 946-0820 and we can sort it out together. Thanks for reaching out!"
        }
      ]
    },
    {
      "author": "Cooper Bronson",
      "rating": 5.0,
      "review": "Been living here for a bit now and the staff are great, super helpful and always friendly!",
      "ownerResponse": []
    },
    {
      "author": "Fernando Gonzalez",
      "rating": 5.0,
      "review": "Great Future student and local housing, great view of the Bay Area!",
      "ownerResponse": []
    },
    {
      "author": "Daniel Ivanov",
      "rating": 5.0,
      "review": "Fixed issues I had quickly and without hassle.",
      "ownerResponse": []
    },
    {
      "author": "Jillian Marie",
      "rating": 1.0,
      "review": "would rate lower if i could.",
      "ownerResponse": [
        {
          "text": "Jillian, we are so sorry for the frustrations you've encountered with getting your rent paid. We understand that you spoke with our GM Laura yesterday about this situation and the late fee reversal, and we will update you at any point if  More"
        }
      ]
    },
    {
      "author": "Moki Gadbois",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Abby Gaffney",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you so much for the great rating, Abby! Let our team know if there's anything we can do for you. :)"
        }
      ]
    },
    {
      "author": "Jordan selemani",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Alex Hurley",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Genevieve Boushey",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for the all star rating, Genevieve! Anything we can do to continue this sentiment for you, just let our team know. :)"
        }
      ]
    },
    {
      "author": "Jeff Baran",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Emilia Galant",
      "rating": 1.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Emilia - once again we would like to apologize for the after-hours situation and hope that we can avoid any discrepancies moving forward. Referencing Lindsay's email from yesterday, if you need to stop by for anything related to your keys, lock or otherwise let us know today. Thank you. "
        }
      ]
    },
    {
      "author": "lilli marie",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Gavin Green",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "A beautiful picture to accompany a beautiful rating... made our day, Gavin. Thank you so much!"
        }
      ]
    }
  ],
  "adjusted_review_count": 39,
  "avg_rating": 3.9,
  "adjusted_avg_rating": 3.8,
  "summary": "# Stateside Property Management: A Mixed Bag of Experiences\n\nStateside, located at 929 N State St, Bellingham, WA 98225, is an apartment building known for student housing. This article is intended to be a tool to help potential renters in finding suitable property management or rental properties, and it includes summaries of user reviews of Stateside. The sentiment presented is a collection of both positive and negative aspects, aiming to provide a balanced overview.\n\n## Good\nResidents have praised Stateside for its luxury apartments aimed at students, citing the modern furniture and appliances, as well as the excellent location, which affords easy access to nearby shops, restaurants, and the WWU campus. The internet and gym amenities have satisfied some tenants, contributing positively to their living experience. Certain reviews also mention that the leasing staff is very informative and friendly, creating a welcoming initial interaction for prospective and current residents.\n\nAnother aspect that has received appreciation is the community atmosphere fostered by Stateside, with some residents enjoying the provided social gatherings. The responsive and professional conduct of the property management in dealing with inquiries was highlighted as a reassuring sign of quality service. This is further exemplified by the instances where maintenance concerns were resolved quickly and satisfactorily, enhancing the living experience.\n\n## Great\nThe architecture and design of Stateside have received high commendations, with some tenants enamored by the amazing views of the bay and the city from the buildings. The contemporary and clean design of the apartments seems to be a hit among the student demographic. Furthermore, amenities like free laundry services and a spacious community kitchen have been particularly well-received, as these features significantly contribute to the convenience of day-to-day living.\n\nEnthusiasm about moving in is another common theme among the reviews. Some residents have expressed their excitement, particularly praising the help and assistance provided by the leasing team. Positive experiences during tours and responsive communication with leasing managers suggest that customer service is an area where Stateside shines. This promising pre-move-in engagement paints a promising picture for future tenants.\n\n## Bad\nDespite the aforementioned praise, Stateside has not been immune to criticism, particularly concerning its parking situation. Residents have voiced frustration over the steep parking fees, with charges deemed outrageous by some, especially for those not willing or able to pay for gated parking options. Street parking is described as inadequate, adding a layer of inconvenience to daily life. Another concern raised by tenants is the return of security deposits, with some reviews stating unfair charges upon move-out, an issue that appears to be recurring.\n\nNegative remarks also extend to the cleanliness of the apartment complex; reports of unkempt common areas clash with the image of luxury living that Stateside aims to provide. The professionalism of the leasing staff has been questioned, too, with accusations of unprofessional behavior during the leasing process. These issues have contributed to a sense of dissatisfaction among a section of the residents.\n\n## Ugly\nA more troubling set of issues emerges from certain user reviews, pointing towards potentially deep-rooted management problems. Residents have complained about long response times and under-trained staff, which lead to further frustration and sometimes unresolved issues. The issue of elevators being out of service for hours has posed significant difficulties, especially for residents with accessibility needs, reflecting a lack of preparedness for emergency situations.\n\nFinancial grievances are another sore point. Some former tenants claim to have been continuously charged for utilities like electricity even after vacating the property. Additionally, there are accounts of Stateside engaging in price gouging practices, with sudden and steep increases in parking and, presumably, rental costs, affecting affordability and tenant satisfaction. Aspects such as these contribute to creating a tumultuous living environment for some of the residents at Stateside.\n\nThis article utilizes the broad spectrum of user reviews to provide a nuanced view of Stateside property management. These insights come from user reviews generated by ChatGPT and reflect a varied range of tenant experiences. The article's intent is to equip prospective tenants with a comprehensive assessment to inform their decision-making regarding rental options at Stateside."
}