{
  "name": "DCI Property Management",
  "slug": "dci-property-management",
  "company_type": "company",
  "address": "1280 D St, Bellingham, WA 98225",
  "review_count": 14,
  "average_rating": 4.93,
  "reviews": {
    "google_reviews": [
      {
        "author": "Britt",
        "rating": 5.0,
        "review": "Well cared for properties by caring staff. We lived in DCIs Cedar Grove complex for several years. Best rental management company Ive ever had in Whatcom County.",
        "ownerResponse": null
      },
      {
        "author": "Mason Lether",
        "rating": 5.0,
        "review": "I have absolutely loved my time as a tenant under DCI Properties! Kristen is great and easy to work with, a truly kind person, and she does an awesome job of remaining in communication with all of her tenants. The apartment I rented was outstanding, at a very reasonable price! In addition, her father (who does maintenance at the properties) is a really friendly guy and responds quickly to any issues that may arise. No negatives that I can think, and I highly recommend!",
        "ownerResponse": {
          "text": "Mason, thank you for leaving such an outstanding review! We really appreciate the feedback, and we are committed to continuing this same excellence for years to come. If you ever find yourself back in Bellingham, please don't hesitate to give us a call!"
        }
      },
      {
        "author": "R",
        "rating": 5.0,
        "review": "DCI is hands down the BEST property management company in Whatcom county.  Kristen has had amazing and quick responses to any and every question I've ever had. When our dishwasher went out they acted immediately, professionally , and  in a very polite manner. I would highly recommend them to absolutely everyone. You seriously will not find a better property management company around. My wife and I both consider ourselves to be very fortunate and that we found this amazing home with a wonderful yard to rent through them. You absolutely will not be disappointed with their service.",
        "ownerResponse": {
          "text": "Thank you for your kind words, Robert! It has been a pleasure getting to know you and Jessie over these past few years and we so appreciate your tenancy. I'd like to think that our service and compassion set us apart from the rest, and I think your review is a testament to our efforts. We hope that you remain our tenants for many, many years to come!"
        }
      },
      {
        "author": "Ron Ridl",
        "rating": 5.0,
        "review": "DCI is extremely easy to work with. We've known Kristen for many years and find her to be an excellent property manager. She is quick to respond to tenant requests. She takes care of her properties. We couldn't be happier.",
        "ownerResponse": null
      },
      {
        "author": "Neil Sharkey",
        "rating": 5.0,
        "review": "I have rented from DCI for 6 months.  All my interactions with Kristen Murdock have been have been pleasant and professional.  In particular, a situation with a delayed rent payment was resolved to my complete satisfaction.  I heartily recommend DCI and Kristen.",
        "ownerResponse": null
      },
      {
        "author": "Rebecca Heathcock",
        "rating": 5.0,
        "review": "Working with Kristen Murdock on a real estate project was a great experience. She is extremely hard-working, competent, and accountable to her tenants and professional partners. That made working with DCI a pleasure in every way. It's no surprise this company is so well-respected in our community - they work hard and smart, and make great hires.",
        "ownerResponse": {
          "text": "Thank you for your feedback, Rebecca! It was a pleasure working with you as well."
        }
      },
      {
        "author": "Steph P",
        "rating": 5.0,
        "review": "I've been a renter in various cities for almost 20 years, and at a DCI property for the past 2 years.  Kristen, Ron, and Gary at DCI are the absolute best.  Kristen is the most communicative and responsive Property Manager Ive ever had.  It is a pleasure to be a renter here!",
        "ownerResponse": {
          "text": "Thank you for your positive review, Stephanie! It has been fantastic working with you and Stan as well. I hope you are our tenant for many years to come."
        }
      },
      {
        "author": "Jeanne Sorensen",
        "rating": 5.0,
        "review": "DCI Properties have taken good care of Conveyor Dynamics, Inc. offices for the last 4 years.\nMaintenance issues are always taken care of in a timely and friendly manner.\nWe highly recommend them for your rental needs.",
        "ownerResponse": null
      },
      {
        "author": "Thomas and Kimber Holkenbrink",
        "rating": 5.0,
        "review": "DCI Properties is the property management company for our business location.  It's wonderful to work with Kristen, Gary, and the gang.  Excellent customer service!  Excellent response time.  These guys have heart!",
        "ownerResponse": {
          "text": "Kimber, it has been such a joy working with you and Conveyor Dynamics over this past year. We couldn't have asked for better tenants in our office building. Thank you for your review, and I guarantee that we will provide the same outstanding service throughout the duration of your tenancy!"
        }
      },
      {
        "author": "Kris Tuttle",
        "rating": 5.0,
        "review": "Like many people who are new to Bellingham and need to rent an apartment, I went to searching online for available apartments and seeing what reviews there were. Across the board most the apartments had a plethora of unsolicited 5-star reviews, lots of 1-stars, with averages running about 3. This made it really frustrating and hard to apply to, or even consider renting there (5-star ratings w/no comments, which turned out to be some properties giving $100 off rent or something similar to those who leave 5-star review). Eventually I came across Cedar Grove by DCI Prop. Management. Their reviews were/are in the 4-star range and the comments were solid ,so that was promising.\nAny who, I decided to give them a try and got some information very promptly from Ta. Return emails were quick, informative, and helpful. I asked a lot of questions and she was patient with me during this. Ultimately I decided to sign with them!\nEverything was done online, which was great considering I was 6-hours away and limited time to go up during the week. On move-in day I got. called from them to see when I'd be coming by to get my keys which was nice.\nTLDR; Responsive, nice, patient, and easy process. 5/5 would recommend.\n\nApartment itself was brand new an",
        "ownerResponse": null
      },
      {
        "author": "Robert",
        "rating": 5.0,
        "review": "First rate in a very hard job.",
        "ownerResponse": {
          "text": "Robert, thank you for our very first review. It has been great working with you and using your plumbing services over the past few years."
        }
      },
      {
        "author": "Nicky Gosen",
        "rating": 5.0,
        "review": "Painless, friendly and reliable!",
        "ownerResponse": {
          "text": "Nicky, thank you for your review. We strive to be as painless, friendly and reliable as possible. Property management isn't always easy, but you have definitely helped make it so. Please don't hesitate to contact us should you need anything."
        }
      },
      {
        "author": "Kevin Lynch",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Zac Christopherson",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 12,
  "adjusted_average_rating": 5.0
}