{
  "name": "Woodrose Senior Affordable Apartments",
  "slug": "woodrose-senior-affordable-apartments",
  "company_type": "property",
  "address": "3353 Racine St Bellingham, WA 98226",
  "review_count": 80,
  "average_rating": 4.1,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Lucia C.",
        "rating": 3,
        "review": "I'll say immediately that I'm not familiar with Woodrose. (I rated 'average' because I had to choose something.) I'm looking at reviews of apartments for older people. The reviews here are all negative, but I have also noticed that they all seem to have been written by the same person. Same syntax, vocabulary, and complaints. I hope that Yelp can look into this.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Sherri Ransom",
        "rating": 5.0,
        "review": "Ive lived at WoodRose apartments for nearly eight years. I enjoy my apartment as well as the community of my neighbors. Many activities are offered to the residents and the maintenance crew is excellent!",
        "ownerResponse": {
          "text": "Hello Sherri,\n Sherri Ransom, thank you for your kind review; we are happy to pass along your comments to the team here at Woodrose Senior Affordable Apartments! \n\nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Jann E",
        "rating": 5.0,
        "review": "When i first toured this place i felt at home ,i knew right from the start this was where i wanted to live ,and i have been so right the ladies in the office  ,Kelsi And Karen  was always ready to answer any questions i may have  asked.   I called many other places and toured a few never had that welcome home feeling i get here ..   if your thinking of moving here  ,you wont be unhappy with your choice.  Janne",
        "ownerResponse": {
          "text": "Hello Janne,\nThank you for such a wonderful review! We're glad to hear we delivered such a great experience! If there's anything further we can do for you, we are happy to help!\nRegards,\n\nThe \nWoodrose Team :)"
        }
      },
      {
        "author": "Feathered Moth",
        "rating": 4.0,
        "review": "I've been working as a caregiver for different individuals in this building for three years now. There's a lot of good to be said about the place! It's a beautiful building with great gardens and landscaping. There's a large courtyard in both buildings that are wonderful social spaces, especially during the summer. There's a lovely sense of community among the residents.\nHOWEVER. I don't understand how this could be senior apartments for so long without the front doors being automatic. As you get older, you become more disabled. It is inevitable. The doors are heavy and difficult to open and even more so for people with walkers and wheelchairs. I've been told by the ladies in the office that they'll get new doors soon! Well, it's been three years, and I'm certainly not the only person who feels strongly on this matter. It damages walkers and wheelchairs. Pieces of extremely expensive and necessary mobility devices that are difficult to sometimes impossible to replace. It's appalling. It doesn't seem to matter how often the issue comes up. It just never gets changed. It is the only senior/disability apartment complex in the county that I'm aware of that has this problem.\n\nEDIT: as the response says, they did install a new automated door! It took them a few weeks longer than stated to get the doors installed and for all the residents to finally get their key fob. I personally think the doors could still be more accessible, but at least this is better than before! I also have a suspicion that nothing would have happened if I hadn't posted this review, but I suppose the why doesn't matter so long as it's done.",
        "ownerResponse": {
          "text": "Hello,\nI wanted to thank you for taking the time to comment on a couple of your concerns here at Woodrose. I wanted to let you know how excited we are that the installation of the new ADA doors for both buildings has begun this week. The new ADA doors, as well as new entry call boxes at the front and back door of each lobby should be completed very soon.\n\nI also wanted to comment on your statement regarding Fairfield giving multiple yearly rent increases to residents. This is incorrect information. Fairfield increases the rents only one time a year. If a resident has more than one increase in a given year, then it is due to the fact that they had a yearly review with the housing authority. The housing authority does reviews with clients on the program. If a resident gets a rent increase from housing, then housing notifies us. \nIn the future, feel free to call us with any questions or concerns and we would be happy to address them.\nRegards,\nWoodrose Management"
        }
      },
      {
        "author": "Karen Price",
        "rating": 5.0,
        "review": "Great maintenance & property managers.\nFriendly & Professional.\nNo matter how busy they are or what day or time it is, even in emergency situations...",
        "ownerResponse": {
          "text": "Hi, thank so much for rating us! Our team takes pride in providing an excellent experience!"
        }
      },
      {
        "author": "Lucy T",
        "rating": 4.0,
        "review": "Overall, its a good place to live. Its well maintained, nice library, clean, friendly and caring staff, safe, pet friendly community. Monthly potlucks, birthday celebrations, games, all held in the community rooms. Woodrose provides ample parking, nice courtyard, different size apartments, elevators, and friendly neighbors. I just wish, we had our own laundry units, within the apartments and a small balcony.",
        "ownerResponse": {
          "text": "Hello Lucy,\nthank you for taking the time to leave a nice review for us at Woodrose Senior Affordable Apartments. If there's anything we can do for you, we are happy to help!\nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Teresa Gomez",
        "rating": 5.0,
        "review": "Woodrose is a wonderful place to live. Kelsey the office manager is Awesome, she is patient and kind with all her residents .",
        "ownerResponse": {
          "text": "Hi Teresa, thank you for your review! Our team strives to deliver an excellent experience, and are glad you found this to be the case during your visit. If you have further needs or questions, please reach out!"
        }
      },
      {
        "author": "Lucy C",
        "rating": 4.0,
        "review": "Well maintained, clean, safe, pet friendly, plenty of parking, and beautiful courtyard. A nice community for independent seniors.\n\nThe staff is wonderful, courteous, caring, and promptly attend to maintenance issues. We have monthly scheduled events, such as potlucks, birthday celebrations, and variety of fun activities.\n\nPersonally, I would love to see newer appliances, instead of the outdated ones. Doing away with the existing carpet, which some of the units still have (including mine). Adding a washer and dryer in the apartments. Otherwise, I like living here.",
        "ownerResponse": {
          "text": "Hello Lucy, thank you for your kind review; we are happy to pass along your comments to the team here at Woodrose Senior Affordable Apartments and we're happy we could meet your expectations! \nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Laurie Lusk",
        "rating": 5.0,
        "review": "I'm a caregiver for a client here. The apartments are nicely laid out. Easy access. But not enough handicapped parking available for residents or visitors.",
        "ownerResponse": {
          "text": "Hi Laurie, \nthank you for taking the time to leave a nice review for us at Woodrose Senior Affordable Apartments. \nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Joan Rayborn",
        "rating": 1.0,
        "review": "Came within 2 hours for  a non-emergency problem. My kitchen  sink was not draining. Ole fixed it immediately, and cleaned up the mess. He was so polite and friendly. It is great to have him as our caretaker. So glad he is back!",
        "ownerResponse": null
      },
      {
        "author": "Lee Gayle",
        "rating": 5.0,
        "review": "I have been in Woodrose now for 3 years plus and it has been a very comfortable experience. The staff whether it be office or maintenance are wonderful and do a very good job and are professional in their work ethic. ",
        "ownerResponse": {
          "text": "We would like to have a better understanding about your experience. Please reach out to us at your earliest convenience and we will do our best to resolve this with you.\nRegards,\nWoodrose Management"
        }
      },
      {
        "author": "American Classic",
        "rating": 4.0,
        "review": "Tv rooms close during prime time shows 9 pm on, so unless you pay $160-$200 a month in cable/I internet you miss a lot by media rooms closing so early. They could leave the library open all night for night owls and prime time tv. Tho, Community is pretty dang good, and people here are really special.\nManagement/ handyman are good people and hard workers. They go above and beyond. There's fun bday parties, monthly meal, Bingo, and games but we wish they had games 4 pm to 6 or GAME NIGHTS 7-9 because many of us  have caregivers and can't do the parties, crafts, and games during the early or midday hour's. So some of us get left out of activities for that reason. Otherwise it's pretty great! But, they have to consider it makes people with disabilities that much more isolated and lonely, when activities should be open to all.All in all, tho it's a nice place and friendly place to live!",
        "ownerResponse": {
          "text": "Hello, we are happy to see that your experience has been a positive one! The team here at Woodrose Senior Affordable Apartments is always available for any assistance that you may need. Thank you for taking the time to leave us your rating!"
        }
      },
      {
        "author": "Steven Perry",
        "rating": 5.0,
        "review": "UPDATE: Contacted the main office and they were able to work with my grandma to get her down from the top floor. Very kind and worked with us to quickly remedy the situation. Thank you very much Woodrose Apartments.\n\nGrandma lives here on the top floor it is so hot up there its unbearable! They said it will cost her to move to lower levels crazy!",
        "ownerResponse": {
          "text": "Hi Steven,\rThank you for the review! We absolutely agree that the top floors can get very warm during the Summer months in our communities without A/C. I can assure you it wasn't much better on the lower levels during this recent heat wave. There are some things we can do to assist. Please contact the office so that we can help remedy the situation. Thank you again!"
        }
      },
      {
        "author": "Leon Charbonneau",
        "rating": 5.0,
        "review": "The workers were quick, clean,. thorough and courteous.",
        "ownerResponse": {
          "text": "Hello Leon,\nWe're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help!\nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Natalia Dunaevscaia",
        "rating": 5.0,
        "review": "Thank you so much to the staff at Woodrose! They always do a good job! I am so happy here.",
        "ownerResponse": {
          "text": "Hi Natalia,\n thank you for taking the time to leave a review for us at Woodrose Senior Affordable Apartments. We're happy we could meet your expectations!  If you have further needs or questions, please reach out!\n\nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Melissa Loomis",
        "rating": 1.0,
        "review": "New (owners?) made my grandma's last days very stressful and miserable; not what she needed with a heart condition for sure. She loved her friends in the building, some of the sweetest neighbors. She wasn't allowed to enjoy the small things in life after being there for years. \"No flower beds, no figurines, just beauty bark\" = remove everything you find joy in. Not the right thing to do to anyone, besides those who only have fewer moments to live them.",
        "ownerResponse": null
      },
      {
        "author": "Susan Haase",
        "rating": 2.0,
        "review": "The buildings are dingy inside.  No amenities of any kind.  The website is inaccurate--there is no fitness room.  We feel threatened by the homeless that come onto the property to steal and can smell the exhaust from Sunset during the evening commute.  Not a pleasant place to live.",
        "ownerResponse": {
          "text": "Thank you for reaching out regarding your concerns. Please direct any concerns regarding mask mandates to the office. We appreciate you taking the time to review!"
        }
      },
      {
        "author": "Mary Houdyshell",
        "rating": 5.0,
        "review": "After 65 years I know what it's like to have people care about you.\nI absolutely love this place and the people that run it.",
        "ownerResponse": {
          "text": "Hello Mary, thank you for your kind review; we are happy to pass along your comments to the team here at Woodrose Senior Affordable Apartments!\nRegards,\nThe Woodrose Team"
        }
      },
      {
        "author": "Hal McFarland",
        "rating": 5.0,
        "review": "2 years in and Im still happy with my choice. Fair Field management is very responsive to all maintenance issues, residents are like a very caring family, and its nice to live in a quiet community   ",
        "ownerResponse": null
      },
      {
        "author": "Cheryl Giles",
        "rating": 4.0,
        "review": "The apartments are nice, clean and generally well maintained. The staff are pleasant and professional.  I feel safe.  Enjoy the central location to local community and excellent bus access.",
        "ownerResponse": {
          "text": "Thank you for the wonderful review, Cheryl!"
        }
      },
      {
        "author": "Toni Johnson",
        "rating": 4.0,
        "review": "Senior living with rent controlled private individual units and plenty of parking. Secured entry that is easy to use. Most people there are friendly and the place is well kept.",
        "ownerResponse": null
      },
      {
        "author": "Suzanne Magnuson",
        "rating": 4.0,
        "review": "Not happy with losing Internet & TV. The cost will be so much higher for the same service. And do we get anything in return for removing this service? And the mention of the 'Senior' option, that's only for people on MEDICAID.",
        "ownerResponse": {
          "text": "Thank you for reviewing our community! Our residents are able to be set up services in their own name so that they can better manage their packages and pricing. Please contact the office if you have any questions or we can better serve your needs!"
        }
      },
      {
        "author": "Alice King",
        "rating": 5.0,
        "review": "Prompt, fast, friendly service.  Repairs always done to satisfaction.  Thank you for such a good maintenance man.",
        "ownerResponse": null
      },
      {
        "author": "Richard Morgan",
        "rating": 5.0,
        "review": "Excellent response to refrigerator failure.  Could not ask for better service.",
        "ownerResponse": {
          "text": "Hi Richard, thank you for taking the time to leave a review for us at Woodrose Senior Affordable Apartments. We're happy we could meet your expectations!\nThe Woodrose Team."
        }
      },
      {
        "author": "Ev Morin",
        "rating": 3.0,
        "review": "Update:  The bathroom sink in 206 has been replaced.  It was worth the wait.",
        "ownerResponse": null
      },
      {
        "author": "Abraham Kang",
        "rating": 5.0,
        "review": "Haven't  been there but liked the photo descriptions of the apartment  complex;\nopen spaces and nearby shopping look good.",
        "ownerResponse": null
      },
      {
        "author": "Betty Altieri",
        "rating": 5.0,
        "review": "This was my first choice due to location and I have been here for 10 years this November.",
        "ownerResponse": {
          "text": "Betty Altieri, \nthank you for your kind review; we are happy to pass along your comments to the team here at Woodrose Senior Affordable Apartments!"
        }
      },
      {
        "author": "Lee Clyde",
        "rating": 5.0,
        "review": "Everything went very smoothly and was done very quickly. Maintenance person seemed very competent.",
        "ownerResponse": null
      },
      {
        "author": "Jeremiah Engels Ramsey",
        "rating": 5.0,
        "review": "very kind staff and residence, great location, plenty of parking",
        "ownerResponse": null
      },
      {
        "author": "Jackson Bold",
        "rating": 4.0,
        "review": "Ok place\nJust not for me\nThank you\nJackson Bold  ",
        "ownerResponse": {
          "text": "Our team strives to deliver an excellent experience, and are glad you found this to be the case during your visit. If you have further needs or questions, please reach out! We're glad to hear we delivered such a great experience. If there's anything further we can do for you, we are happy to help! Thank you for letting our team know how we did! We look forward to helping again in the future."
        }
      },
      {
        "author": "Alan Krum",
        "rating": 3.0,
        "review": "It is a SHAG property (Seattle centric corp mindset) I have lived here 3 years and want to move. Enough said.",
        "ownerResponse": null
      },
      {
        "author": "Barbara LaMonica",
        "rating": 3.0,
        "review": "I cannot get anyone to answer their telephone I live in Bellingham several years ago and wanted more information",
        "ownerResponse": {
          "text": "Hello Barbara,\r\rMy apologies for not reaching out to you sooner! Our wonderful Leasing Consultant no longer works at Woodrose as of 2 weeks ago. We have 2 buildings here and she worked out of building 2. We have a new Leasing Consultant starting next week so we will have someone in the office full time shortly. I have forwarded the office phones from building 2 to my office in building 1. You can reach out to me at 360-738-8051. Please call and I can go over the questions you have.\r\rThank you!\r\rRegards,\rKaren :)"
        }
      },
      {
        "author": "Patrick Endsley",
        "rating": 5.0,
        "review": "I just investigated about possibly retiring here in the near future. Looks great at a reasonable rent.",
        "ownerResponse": null
      },
      {
        "author": "Claire Simard",
        "rating": 1.0,
        "review": "Full of smokers they sent with, \" I don't smell anything.\"",
        "ownerResponse": null
      },
      {
        "author": "Jack Boysen",
        "rating": 5.0,
        "review": "Takes very good care of my grandmother",
        "ownerResponse": null
      },
      {
        "author": "Cher Martin",
        "rating": 4.0,
        "review": "Nice place and staff are friendly and helpful",
        "ownerResponse": null
      },
      {
        "author": "Mandi Wheeler",
        "rating": 4.0,
        "review": "Very clean and friendly tenants",
        "ownerResponse": null
      },
      {
        "author": "Lofrenda Pallister",
        "rating": 4.0,
        "review": "Affordable housing apartments and nice.",
        "ownerResponse": null
      },
      {
        "author": "Fred Mowery",
        "rating": 4.0,
        "review": "Clean tiddy",
        "ownerResponse": null
      },
      {
        "author": "Judi Johnson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Judi,\nThank you for your review. We would like to have a better understanding about your experience here at Woodrose.\nIf you have anything you would like to discuss, we would love to hear from you!\nRegards,\n\nThe \nWoodrose Team"
        }
      },
      {
        "author": "ms operator",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave us this review. Our staff takes pride in maintaining excellent business relations. If you'd like, please reach out to us at (833) 281-0491 so that we may restore your good faith in Woodrose Senior Affordable Apartments. We hope to hear from you."
        }
      },
      {
        "author": "Cher Martin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi, thank you for your review! Please don't hesitate to let us know if there's anything additional that we can do for you!"
        }
      },
      {
        "author": "Brittany Evans",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello, thank you for rating us so highly! It is fantastic to see a rating like this!"
        }
      },
      {
        "author": "Mary Hall",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello, thank you for your awesome review! We love our residents, and we love seeing so many stars!"
        }
      },
      {
        "author": "Ady Bono",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello, thanks for leaving us a great review! And, thanks again for choosing Woodrose Senior Affordable Apartments! Best regards!"
        }
      },
      {
        "author": "Ginger Walters",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "At Woodrose Senior Affordable Apartments, we sincerely value our residents and your review! Thanks for such a positive rating!"
        }
      },
      {
        "author": "Judith Owens-Lancaster",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi, thanks for the all of the stars! Please don't hesitate to reach out to us if you need any further assistance."
        }
      },
      {
        "author": "Patricia Patzer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you! We hope to be of service to you again!"
        }
      },
      {
        "author": "Denise Dunlap",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Denise,\n\nThank you for taking the time to give us a review. Unfortunately I am unable to see what the review is regarding so I will reach out to you.\nRegards,\nKaren"
        }
      },
      {
        "author": "Jennifer McDougall",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello, thank you so much for the positive review! We will continue to do our best to earn it! Please don't hesitate to reach out to us if there's anything additional we can do for you!"
        }
      },
      {
        "author": "Judy Miller",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "David L. Leggate",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "David Scattum",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for your 5-star review, David!"
        }
      },
      {
        "author": "Judy Miller",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the amazing 4-star review! If there is anything we can improve on, please let us know."
        }
      },
      {
        "author": "Dana Schauer",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 4-star review! If there is anything we can do better in the future, please let us know."
        }
      },
      {
        "author": "Joel Hernandez",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Danny Lewis",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Lance E Vanderyacht",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Andrea Osborne",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "ShadowGammaDraco YinYang",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Daniel Lewis",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sunshine and Meatloaf",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Nathan Mattly",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Chakras United",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Gerent G",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ernest Hinds",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shaun Dickison",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Dolores Kozera",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Julia Parcels",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jean Soran Ryan",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Carolyn M. Gnyp",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tonya Jackson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kevin Lang",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brooke Lootens",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Stephen Adenau",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sherry Zeilstra",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "bunna nuth",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kylek",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Rhiannon Townley",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "paulthkoo",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 39,
  "adjusted_average_rating": 4.1
}