{
  "name": "Briarwood Terrace Apartments",
  "address": "4101 Consolidation Ave, Bellingham, WA 98229",
  "company_type": "property",
  "review_count": 9,
  "reviews": [
    {
      "author": "Z Dumas",
      "rating": 2.0,
      "review": "Im terms of maintenance requests being dealt with and property management, both are pretty good. I have been pretty bothered with their weird communication from Sabrina, I almost never interact or talk with Lesley anymore since the first ",
      "ownerResponse": [
        {
          "text": "Dear Adam Dumas,\n\nWe would like to address the relevant issues in your review.  More"
        }
      ]
    },
    {
      "author": "Chris Mallery",
      "rating": 3.0,
      "review": "The living experience at Briarwood Terrace was great, spacious apartments, awesome location (close to grocery stores, gas and Starbucks ), and overall a quiet, peaceful complex. ",
      "ownerResponse": []
    },
    {
      "author": "Matt Welch",
      "rating": 5.0,
      "review": "I moved to Briarwood Apartments in Bellingham in March of 2020. Moving across the country to a new city, amidst a global pandemic wasnt the easiest thing, but Sabrina & Lesley at Briarwood made it easier. From day one, I felt supported. ",
      "ownerResponse": []
    },
    {
      "author": "Libby Donaldson",
      "rating": 5.0,
      "review": "April and Amy have treated me like family in my experiences renting with them. From locking myself out of the apartment to dropping a sock down my lint trap, they have always responded to me in minutes with help. I absolutely love living here and knowing such a great management team. Renting for a second year now :).",
      "ownerResponse": []
    },
    {
      "author": "Alyssa Zapien",
      "rating": 1.0,
      "review": "My roommates and I went to their office with our applications and money ready to apply. She told us we would be put on the waitlist but would most likely get an apartment and gladly took all of our money. She said she would be in contact ",
      "ownerResponse": []
    },
    {
      "author": "Tom Hutchison",
      "rating": 5.0,
      "review": "Quality apartments with kind and proactive management",
      "ownerResponse": []
    },
    {
      "author": "Last Dimstar09",
      "rating": 5.0,
      "review": "Ok cool  ",
      "ownerResponse": []
    },
    {
      "author": "Kel Videll",
      "rating": 4.0,
      "review": "Clean grounds and spacious homes.",
      "ownerResponse": []
    },
    {
      "author": "Jordan Swenson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 8,
  "avg_rating": 3.9,
  "adjusted_avg_rating": 3.8
}