{
  "name": "Hideaway Apartments",
  "address": "1213 Whatcom St #96, Bellingham, WA 98229",
  "company_type": "property",
  "review_count": 7,
  "reviews": [
    {
      "author": "Katya",
      "rating": 4.0,
      "review": "They cleaned out apartment so well before moving in. Everything was spotless and new carpet. The office workers are really nice. We can hardly ever hear neighbors or upstairs, there's a nice big grassy area to walk a dog and the price is ",
      "ownerResponse": []
    },
    {
      "author": "Kate Ortiz",
      "rating": 4.0,
      "review": "Affordable, close to town, bus route, and other services. Month to month so good for students. I moved here because it was one of the few affordable places i could have my cats and have easy bus access to school. I've been here for two and ",
      "ownerResponse": []
    },
    {
      "author": "Tiona",
      "rating": 1.0,
      "review": "DO NOT MOVE HERE! I lived here for years and there is black mold in every wall(they clean the exterior when you do inspection of unit so it doesn't show up until a few weeks after move in). The often \"misplace\" packages. There are drug ",
      "ownerResponse": []
    },
    {
      "author": "Aj ang",
      "rating": 1.0,
      "review": "I had to move when I saw someone in the parking lot using with the car door open, they didn't even live there. No response to problems, condoms and even needles found around the property. They have a security camera which one of the workers ",
      "ownerResponse": []
    },
    {
      "author": "Kat Man",
      "rating": 2.0,
      "review": "It was a nice apartment when I first moved in it was clean and nice but got silver fish and in summer we got black ants and I talked to neighbors and they get them too and I hate the laundry room they never sanitize the washing machines and ",
      "ownerResponse": []
    },
    {
      "author": "Cori Robinson",
      "rating": 1.0,
      "review": "100% not worth the rent they charge.",
      "ownerResponse": []
    },
    {
      "author": "Benjamin Allen",
      "rating": 4.0,
      "review": "Reminds me of the 90s.",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 7,
  "avg_rating": 2.4,
  "adjusted_avg_rating": 2.4
}