{
  "name": "Inglewood Apartments",
  "address": "3025 Ferry Ave, Bellingham, WA 98225",
  "company_type": "property",
  "review_count": 20,
  "reviews": [
    {
      "author": "Lea S",
      "rating": 3.0,
      "review": "At first this place seemed super great. Everyone was super nice and welcoming, the neighbors are also very sweet. However, after 3 months of living here I see a lot of issues. The parking lots are situated very weirdly, tandem parking spots ",
      "ownerResponse": []
    },
    {
      "author": "z zims",
      "rating": 2.0,
      "review": "They just increased the price of laundry by almost a dollar per load without notifying tenants in any way. The landlady and her assistant do not answer your calls or respond to maintenance requests in a timely manner, if they even bother. Overall not the worst place to live, but clearly poorly managed.",
      "ownerResponse": []
    },
    {
      "author": "madie bernardo",
      "rating": 2.0,
      "review": "The parking situation isn't great or even good. It's difficult to visit people who live there because of the lack of visitor parking and the small amount of 15 min parking almost always being full. The resident parking isn't great or even ",
      "ownerResponse": []
    },
    {
      "author": "Luna",
      "rating": 4.0,
      "review": "This is most certainly a college apartment building, so I am going in to this review with that first. It's not going to be magical, nor does it have all of the amenities you might want from a high quality apartment building. No in-unit ",
      "ownerResponse": []
    },
    {
      "author": "Graham Manson",
      "rating": 4.0,
      "review": "EDIT: this review is based on experience with the previous landlord. It's since been taken over by Apex/PTLA, so YMMV. ",
      "ownerResponse": []
    },
    {
      "author": "Brook Castellan",
      "rating": 1.0,
      "review": "BIG OOF Oh this was just lovely. The landlords are name Dee and Rob because they will try to rob you and at best they would get a D grade in customer service. We had agreed on a move in date (this was done two months before said date) which ",
      "ownerResponse": []
    },
    {
      "author": "Bianca Ciccotelli",
      "rating": 3.0,
      "review": "The parking is the worst but it's a typical college apartment complex",
      "ownerResponse": []
    },
    {
      "author": "Phillip Chen",
      "rating": 5.0,
      "review": "Dee and Rob are the best on-site managers ever! They are very friendly and treat you basically like their own kid. You can have a small gathering, but NO loud parties. You will get shut down within a hour.",
      "ownerResponse": []
    },
    {
      "author": "Katie Lund",
      "rating": 5.0,
      "review": "Rob and Dee are great managers. They always help when something goes wrong. It's a quiet building within walking distance of Western. Lived here for 2 years and it was great!",
      "ownerResponse": []
    },
    {
      "author": "Jameson Knopp",
      "rating": 4.0,
      "review": "Cheap rent for boring apartments. Responsive and quick with repairs, but the landlady is weird and invasive. But you get what you pay for.",
      "ownerResponse": []
    },
    {
      "author": "Joker 119",
      "rating": 3.0,
      "review": "Hot water only lasts about 5mins in the showers, aside from that everything else is fine",
      "ownerResponse": []
    },
    {
      "author": "Carl Graber",
      "rating": 2.0,
      "review": "has bed bugs",
      "ownerResponse": []
    },
    {
      "author": "Kerringar",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Elizabeth Liz Elsesser",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jonathan Hyry",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Milangela Diaz",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Christa Pitsch",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Julio",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "E Marie",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Mary Giles",
      "rating": 1.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 12,
  "avg_rating": 3.6,
  "adjusted_avg_rating": 3.2
}