{
  "name": "Old Mill Village",
  "address": "2100 Electric Ave, Bellingham, WA 98229",
  "company_type": "property",
  "review_count": 15,
  "reviews": [
    {
      "author": "Maya Buhler",
      "rating": 2.0,
      "review": "Ive lived here 2.5 years now. This place is a great location and there  are tons of amenities nearby in terms of parks and nature. Great apartment to have a dog in. ",
      "ownerResponse": [
        {
          "text": "Thank you for sharing your experience living at Old Mill Village. We appreciate your positive comments about the great location and the abundance of nearby amenities, especially for dog owners. We understand that rent increase can be  More"
        }
      ]
    },
    {
      "author": "Darlene R. Baumann",
      "rating": 5.0,
      "review": "Beautiful place to live. Feels like in country setting with grounds to walk,feels like a preserve  with geese,deer,squirrels  and rabbits. I noticed 2 resident herons earlier this summer. People friendly.  Good access to two roads into town and freeways. Great donut shp,coffee and philly cheese sandwiches closeby.",
      "ownerResponse": []
    },
    {
      "author": "Lauren Baker",
      "rating": 5.0,
      "review": "Jourdan and her husband are extremely helpful and truly care about your experience! They helped to make our day more beautiful than I could have imagined.",
      "ownerResponse": []
    },
    {
      "author": "Kyle Chapman",
      "rating": 4.0,
      "review": "Amazing apartments that are slightly off the beaten path. Sandwiched between two beautiful parks with a amazing lakeside views and beach access. Good pricing, good people, and beautiful grounds for an affordable lease.",
      "ownerResponse": []
    },
    {
      "author": "Uno Mundo",
      "rating": 4.0,
      "review": "The only issue is my upstairs neighbor\nmakes noise during quiet time 10pm to 8am.",
      "ownerResponse": [
        {
          "text": "We're very sorry to learn that you're experiencing frustrations due to noise transfer. That's never the type of feedback we want to hear from our guests. Please be assured that our residents' satisfaction is among our top priorities. Should  More"
        }
      ]
    },
    {
      "author": "Vincent Regimbal",
      "rating": 5.0,
      "review": "Beautiful place to live right on lake whatcom",
      "ownerResponse": []
    },
    {
      "author": "Jay",
      "rating": 5.0,
      "review": "Beautiful,  Wonderful,  clean, picturesque!!!",
      "ownerResponse": [
        {
          "text": "Dear Jay, thank you so much for adding this 5-star rating of Old Mill Village. We work hard to provide a quality, enjoyable living experience for our residents, and we truly appreciate seeing that effort recognized. \n"
        }
      ]
    },
    {
      "author": "Super mario fan",
      "rating": 5.0,
      "review": "My family lives there",
      "ownerResponse": []
    },
    {
      "author": "kelsey cartwright",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you very much for this 5-star review of Old Mill Village! We try our best to provide a fantastic living experience, and we love to hear that our efforts are paying off.\n"
        }
      ]
    },
    {
      "author": "Wilson Bui",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Jim Carlson",
      "rating": 4.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Maya McFadden",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Thank you for awarding Old Mill Village a five-star rating, Maya. We're thrilled that we exceeded your expectations! If you ever need anything, don't hesitate to get in touch."
        }
      ]
    },
    {
      "author": "Matt McC",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Sarah Davidson",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Were happy to see that you had a 5-Star experience at Old Mill Village!\n"
        }
      ]
    },
    {
      "author": "Arvid Lindstrum",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 8,
  "avg_rating": 4.6,
  "adjusted_avg_rating": 4.4
}