{
  "name": "Park View Village Apartments",
  "address": "425 Stuart Rd, Bellingham, WA 98226",
  "company_type": "Apartment complex",
  "review_count": 13,
  "reviews": [
    {
      "author": "Katelyn",
      "rating": 5.0,
      "review": "We moved into the Park View Village Apartments sight unseen and Cheryl the property manager was so helpful and easy to communicate with.  She sent us videos of multiple units for us to choose between to best suit our needs prior to making ",
      "ownerResponse": []
    },
    {
      "author": "Maddy Guilbaud",
      "rating": 5.0,
      "review": "I really love this place! Cheryl the property manager is such a sweetheart who is the cherry on top of everything else great about living here. Alex is super quick and friendly when we put in work orders. The whole complex is quiet and ",
      "ownerResponse": []
    },
    {
      "author": "Esther Kukhahn",
      "rating": 5.0,
      "review": "Very pretty place. It's has sucurd front doors ( you have to be buzzed in by someone that lives there or have your own key to unlock the doors)  once inside you come to find yourself in a upscale lobbie with very pleasant decorations and different seating options and arraignments.",
      "ownerResponse": []
    },
    {
      "author": "Erik Bracht",
      "rating": 5.0,
      "review": "The grounds are beautiful. The staff,  friendly and helpful. The move-in carts made available were priceless and the move-in condition of the apartment was excellent.",
      "ownerResponse": []
    },
    {
      "author": "Doug Munger",
      "rating": 5.0,
      "review": "Well maintained building and property manager stayed on top of everything while we lived there. We had no issues that weren't taken care of quickly and done right first time.",
      "ownerResponse": []
    },
    {
      "author": "Xavier Van Diest",
      "rating": 5.0,
      "review": "Apartment is lovely, and the process of getting into it was easy and stress free!",
      "ownerResponse": []
    },
    {
      "author": "Daniel Fernandez",
      "rating": 5.0,
      "review": "My friend lives here. Great neighborhood.",
      "ownerResponse": []
    },
    {
      "author": "Payton Skoglund",
      "rating": 5.0,
      "review": "Loved living here and was so thankful for the amazing management!",
      "ownerResponse": [
        {
          "text": "Payton, Thank you so much for your kind words. We are glad you had a positive experience at Park View Village!"
        }
      ]
    },
    {
      "author": "Carl Graber",
      "rating": 5.0,
      "review": "nice place to live",
      "ownerResponse": [
        {
          "text": "Thank you so much for your kind words, Carl. We really appreciate you taking the time out to share your experience with us.  More"
        }
      ]
    },
    {
      "author": "Judge Smith",
      "rating": 3.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Fernando Perez",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Milangela Diaz",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "A Google User",
      "rating": 5.0,
      "review": "",
      "ownerResponse": [
        {
          "text": "Aubrey, Thank you so much for your kind words. We are glad you had a positive experience at Park View Village!"
        }
      ]
    }
  ],
  "adjusted_review_count": 9,
  "avg_rating": 4.8,
  "adjusted_avg_rating": 5.0
}