{
  "name": "The Edge Apartments",
  "address": "960 Lincoln St, Bellingham, WA 98229",
  "company_type": "Apartment complex",
  "review_count": 8,
  "reviews": [
    {
      "author": "Diana D",
      "rating": 2.0,
      "review": "Take pictures and videos of your unit when you move out, because they will absolutely nickel and dime you. The cost to \"paint\" and \"clean\" (i.e., the things they don't have to itemize because it's labor) will be expensive. I lived there for ",
      "ownerResponse": []
    },
    {
      "author": "Julie Miller",
      "rating": 5.0,
      "review": "Been living here for a bit and its been the nicest place I've lived in Bellingham (been here for 5 years). The apartments and appliances are well taken care of, there is little parking, but it hasn't been a problem for me. There is available parking 1 block away. The staff and manager are always friendly and helpful.",
      "ownerResponse": []
    },
    {
      "author": "Michael Gill",
      "rating": 5.0,
      "review": "Lived here for 3 years and love it. John the property manager is fantastic and if any problems with the unit arise he fixes them immediately. He has also been very helpful in a number of other aspects and I highly recommend living here.",
      "ownerResponse": []
    },
    {
      "author": "Kate Thiele",
      "rating": 1.0,
      "review": "If I could give this place 0 stars, I would. Ive lived here for about 6 months and the landlord can be very hard to deal with. Youd think for how much they charge on rent it wouldnt be an issue for maintenance fixes but thats clearly ",
      "ownerResponse": []
    },
    {
      "author": "J. Fedele",
      "rating": 2.0,
      "review": "Not a fan, mostly because of very poor parking. There are NO guests spots. Even if you so evade the tow trucks, get ready to cram into these unbelievably narrow spaces. Neighbor's intimate moments could easily be heard through walls. It is fancy, I'll give them that.",
      "ownerResponse": []
    },
    {
      "author": "Ele Nichols",
      "rating": 2.0,
      "review": "Thin walls, no screens, no bedroom lights, and don't expect to get much of your deposit back!",
      "ownerResponse": []
    },
    {
      "author": "Anastasia Pizarro",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    },
    {
      "author": "Taylor Fievez",
      "rating": 5.0,
      "review": "",
      "ownerResponse": []
    }
  ],
  "adjusted_review_count": 6,
  "avg_rating": 3.4,
  "adjusted_avg_rating": 2.8
}