{
  "name": "500 Square Apartments",
  "slug": "500-square-apartments",
  "company_type": "property",
  "address": "500 32nd St, Bellingham, WA 98225",
  "review_count": 17,
  "average_rating": 3.47,
  "reviews": {
    "google_reviews": [
      {
        "author": "Kendra Morgen",
        "rating": 4.0,
        "review": "500 square is a nice place to live and is in a great location. I have a slight problem with that when me and my roommates moved in, there was a lot of damages to the apartment that wasnt taken care of prior to our move in. One of the biggest damages was a dent on one of the bathroom doors. We could also see that someone tried to do a paint match but it didnt work out so great and there is multiple dents and scratched to the walls. Another issue is that its hard to get contact with the onsite manager during their said business hours. Besides that, 500 square is an ideal place to live.",
        "ownerResponse": {
          "text": "Hi Kendra,\nGlad you are enjoying the apartment overall. We apologize for any maintenance that was not completed before move in. Any reported concerns should have been addressed by now. If anything has not been taken care of, please notify our office so we we can make sure it is addressed. I can also be reached by email or phone if i happen to not be in the office at the moment, so do not hesitate to reach out those ways as well. "
        }
      },
      {
        "author": "Bella Peregrino",
        "rating": 3.0,
        "review": "The parking lot is very crowded and not very safe. The apartment is on a steep hill and the property management decided to block off the safest and most convenient exit/entrance for the parking lot. To the best of my knowledge it was only to block non-residents from driving in the parking lot. I never noticed a problem with that before, this is my second year living at 500 Square. It has only made the access to parking more difficult and dangerous.",
        "ownerResponse": {
          "text": "Thank you for the feedback, Bella. Im sorry to hear that you have had difficulty with the parking lot here. Our goal is to always provide as much parking as possible for our residents in our reserved parking lot and make sure that only residents are utilizing their parking spaces. If you have specific concerns we are more than happy to address them with you when you get a chance to call or talk in our onsite office. "
        }
      },
      {
        "author": "Sonja Hinshaw",
        "rating": 2.0,
        "review": "I really wanted to like this place but unfortunately its just not what it claims to be. The building itself is pretty nice, you can tell it was made to look good but not actually be of good quality but I can get over that. My main issue I have here is the lack of management presence and the lack of security/safety. There is almost never a manager on sight, even during 11am-2pm when they are said to be here. There is an entrance/exit that anyone can use to get into the building by sliding your hand through the bars, making it super easy for anyone to enter the apartment building without being a tenant or a guest. I messaged the manager about this 5 days ago and never got a response. I also sent a follow up message yesterday and still no response. I have friends living in this apartment, and when they moved in they didnt even have a functioning dish washer because it was missing key pieces. They didnt have any mirrors in the bathroom either. Yet, they were still paying full price of the rent regardless of not having a fully equipped apartment. When I moved into my unit, there weee already scuffs and dings - specifically around the kitchen. Not to mention there was sawdust in the cupboards. The apartment units themselves are beautiful in my opinion but lack functionality. For example, there is only one drawer in the kitchen in my unit (which is a 2-bed 1.5-bath) - and the drawer cant even be opened because the fridge blocks it from opening fully. Similar issue in the bathroom, if the door is open you cannot open the drawers. I think this apartment could be really great with some improvements but it definitely has a way to go.",
        "ownerResponse": {
          "text": "Hi Sonja,\nThanks for taking the time to give some feed back. I am sorry to hear you are not satisfied with the property. Regarding management, we have an onsite manager who is in the office from 9-1 every day, you are welcome to drop in and discuss any issues you have when you are available. We have not received any message from you about the door, through there are plans to address that issue right away. In the future please send messages to manager@500square.com or call the office at 360-209-5313 so we can address any concerns you may have. We try to address any work orders as fast as possible and we apologize if anything was missed before you moved in. Rent credit and gift cards were given to tenants who brought up any issues to management and any tenants who didn't have mirrors right away. Please let us know if the future if you have further issues so they can be addressed by management."
        }
      },
      {
        "author": "Jane Bekker",
        "rating": 1.0,
        "review": "Disappointed in the management and overall experience living here. There have been many issues with this place from the beginning. To name a few, the move in date was pushed back two days and we were given less than a days notice, the apartment was still covered in sawdust once we were able to move in, the toilets werent working, the dishwasher wasnt fully installed, mirrors werent installed until weeks after moving in, and now we are dealing with not having electricity for the past 72 hours.",
        "ownerResponse": {
          "text": "Hi Jane, \nI'm sorry to hear about your disappointment with some issues since you moved in. There were some tight construction deadlines, so we apologize if anything was missed by the builders before move in. Your issue with the electricity being out in part of your unit is being scheduled with the electrician and will be addressed right away, as was confirmed earlier today. That you for your patience as we get the electrician out to address the issue. Thank you for your feedback, and please feel free to voice any further concerns to us and we'll do our best to address any remaining issues."
        }
      },
      {
        "author": "Wala Saadeh",
        "rating": 5.0,
        "review": "New and spacious apartments with excellent finishes. The entry to building is secured which is very safe and relaxing. Balcony view is amazing and I personally love it so much. The property manager is very responsive to questions and concerns. Highly recommended!",
        "ownerResponse": {
          "text": "Thanks for the review!"
        }
      },
      {
        "author": "Lauren Wright",
        "rating": 1.0,
        "review": "Nice apartments but poor management as far as wait times, parking, and construction goes. This place was supposed to be finished in May 2022 and is still not finished. Its a sunny afternoon and I have my window shut because of all the noise they make all the time. My friends in this building didnt have MIRRORS in their bathrooms until this week. They moved into this place in the first week of September. Also the prison gate door is so deafening that some people just dont close it, which is a security issue.",
        "ownerResponse": {
          "text": "We're sorry to hear this about your experience here. We strive to make our residents happy, and we apologize for the disruptions and noise caused by construction at the property. Our management team has addressed these noise issues with the construction company, and we anticipate less noise from them going forward, especially as the construction on the property is nearing completion.\n\nIn regards to parking, we are aware of the issues you mentioned in your review and are working to improve these issues. In the meantime, if someone is parked in your spot, please contact management with a description of the vehicle, and the license plate number, so we can have the car removed immediately. We thank you for your understanding in regards to this issue as we sort out this issue on the property.\n\nThank you for letting us know about the noise being caused by the closing of the metal gate, and the safety issue its causing. Weve fixed this since being alerted to the issue. If youre still experiencing this issue, or see the gate left open, please contact us as soon as possible, as safety is of the utmost important at our property.\n\nThat is correct about the missing mirrors for some of our tenants, but we have fixed that issue and those tenants all should have mirrors at this point. We issued a rent credit to compensate those tenants for the inconvenience.\n\nThank you for your feedback, and please feel free to voice any further concerns to us and we'll do our best to address any remaining issues."
        }
      },
      {
        "author": "Richard Dickson",
        "rating": 1.0,
        "review": "When I moved in I was warned by other residents that this building is not safe, I didn't believe them but i should have. I have lived here for just over 3 weeks and I have already heard of 2 of my neighbors being robbed because the doors do not use real locks, instead opting for keypads that malfunction half the time you use them.",
        "ownerResponse": {
          "text": "We are sorry to hear that there have been crime issues here. We are always working towards creating a safer place to live for our tenants. Thank you for your patience as we worked through any issues that came up in our opening days with the controlled access. Please let us know if there are any further issues with our controlled access system."
        }
      },
      {
        "author": "Kimberly Fine",
        "rating": 5.0,
        "review": "Beautiful apartments with modern finishes. The property manager is very responsive to questions and concerns. Having secure entry to the building makes it feel super safe and the package parcels are a great bonus!",
        "ownerResponse": {
          "text": "Thank you for your feedback!"
        }
      },
      {
        "author": "Muhammad Awais Bin Altaf",
        "rating": 5.0,
        "review": "Great place and nice location. Living here with my family and absolutely enjoying it. Highly recommended. Maintenance just an email away from you. Management is Highly responsive and accommodating.",
        "ownerResponse": {
          "text": "Glad you enjoy the apartment! Thanks for the feedback."
        }
      },
      {
        "author": "Alex",
        "rating": 1.0,
        "review": "0 stars. I would like this apartment but the horrible management is unacceptable, feel free to park in any spot though, as they do not fine you unless you live here.",
        "ownerResponse": {
          "text": "We apologize for the tight parking situation. We understand it is frustrating when your parking space is parked in by another person. We are working to create a working parking situation for all tenants. Please let us know if you have further parking issues so we can have the vehicle removed."
        }
      },
      {
        "author": "Stillo",
        "rating": 5.0,
        "review": "i like it ",
        "ownerResponse": {
          "text": "Hello Stillo!  Thank you for your review!  We're glad you like it here!"
        }
      },
      {
        "author": "Kennedy Hogan",
        "rating": 5.0,
        "review": "Super nice and communicative repair man! Got it fixed with no problem. Even gave me a heads up when he was on his way",
        "ownerResponse": null
      },
      {
        "author": "Evan Heald (Evan Nelson)",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Evan - thanks for the positive review!  We will work hard to ensure that others have a positive experience here too!"
        }
      },
      {
        "author": "Andrew Smith-Moreland",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Andrew!  Thank you for the review!"
        }
      },
      {
        "author": "Marcus",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Marcus, thanks for taking the time to review us.  It sounds like we could have done something to better accommodate you.  Please reach out to us to tell us how we can improve our service.  Thank you!"
        }
      },
      {
        "author": "Isabelle Sheadel",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Isabelle!  Thank you for your review! "
        }
      },
      {
        "author": "Jo Mosgrove",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you, Jo, for your review! "
        }
      }
    ]
  },
  "adjusted_review_count": 12,
  "adjusted_average_rating": 3.17,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the positive light, 500 Square Apartments have earned favorable remarks for their high-quality apartment features. One user review highlighted the spacious apartments with modern finishes and excellent security measures. Users seem pleased with the entry system that adds a layer of security, while also mentioning the appeal of the balcony views and overall aesthetics of the units. Another aspect that residents appreciate is the proactive and responsive property manager, who has shown attentiveness to questions and concerns. This creates a sense of reliability and helps in building a trusted relationship between the residents and the property management.</p></section><section><h2>Great</h2><p>Several user reviews praised the property for its location and the quality of living spaces offered at 500 Square Apartments. The newness and design of the apartments have been noted as factors that enhance the living experience. Additionally, the responsiveness of the maintenance team, which is just an email away, reflects the management's commitment to accommodating residents' needs promptly. Furthermore, the sense of community and safety emphasized by secure entry and the added convenience of package parcels have been underscored as notable benefits of living at 500 Square Apartments, contributing to recommendations by current residents.</p></section><section><h2>Bad</h2><p>However, not all experiences at 500 Square Apartments have been favorable. User reviews document several instances where the apartments were not entirely ready for move-in, citing issues such as sawdust residue, non-functioning dishwashers, and missing mirrors. Furthermore, some residents encountered inconveniences with parking lot arrangements and found the management to be less available than expected during business hours. These discrepancies between expectation and reality have led to some dissatisfaction among tenants, despite the apparent potential of the property.</p></section><section><h2>Ugly</h2><p>The major concerns for residents at 500 Square Apartments focus on security and management. User reviews reveal instances of theft, which are attributed to malfunctioning keypad locks and easy access to the building by non-residents. Delays in response from the property management, coupled with unresolved concerns about safety, amplify these issues. Additionally, the completion of apartment construction faced significant delays, creating noise disturbances and affecting quality of life for the current residents. Such negative experiences have unfortunately overshadowed the otherwise aesthetically pleasing and well-located apartment complex for some tenants.</p></section>"
  }
}