{
  "name": "Access Real Estate Services",
  "slug": "access-real-estate-services",
  "company_type": "Company",
  "address": "Bellingham, WA 98225",
  "review_count": 23,
  "average_rating": 2.61,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Margaret E.",
        "rating": 1,
        "review": "Wish I could give zero stars. Never had an issue with a property management company before this one (call me lucky I suppose). However, this company finds sneaky ways to charge you fees (not small ones), and their customer service team will deflect and ignore any concerns you have regarding the clarity or legitimacy of said fees. Reaching out to the owner, Rachel, was also not helpful as she never answered any emails and the rest of her team would not ever put me in touch with her. Above all, Access's customer service was the worst I've ever dealt with. Customer service is hard work but they were consistently beyond rude any time we called, acting like it was a massive inconvenience to deal with anything.",
        "owner_response": null
      },
      {
        "author": "Jaspreet T.",
        "rating": 1,
        "review": "Access has good people that seem to mean well but some are incompetent at their job. If you decide to move forward with them, expect poor service on weekends, independently check on your property after the tenant moves out, and most importantly, check their math! \n\nDuring my experience, I had rude customer service when I called on a Saturday, my property smelled of wet dog after the tenant moved out, and I was overcharged on multiple occasions. Access was quick to correct their accounting mistakes when I pointed them out so I would highly encourage anyone who uses their services to double check their invoices and challenge them as necessary - I was overcharged multiple times during my ~6 months with access.\n\nThe aforementioned inconveniences make the overall experience unpleasant. To the access team, I recommend double checking invoices before sending them out and maintaining an open line of communication with owners.",
        "owner_response": null
      },
      {
        "author": "Rusty S.",
        "rating": 1,
        "review": "ATTENTION BELLINGHAM STUDENTS,\nACCESS IS ESSENTIALLY THE COMCAST OF RENTAL AGENCIES\n\nThis is the first business that has ever been so thoroughly unethical, that I felt compelled to warn the public about them.\n\nThese people are scam artists through and through; preying on the young and financially challenged. Their business seems to generate a significant portion of its income from fines, fees and extravagant move out charges. \n\nThey are very good at making it abundantly clear that their only goal is to generate profit and any expense. \n\nAdditionally, it seems that their business is very disorganized. They can not seem to keep track of any maintenance requests or documentation. After several written requests for repairs to features that were damaged upon move-in, we eventually gave up and just accepted that we were going to have to live with the pre-existing damage. Little did we know they would attempt to hold us financially responsible for said damage upon move-out.  \n\nThese people are not to be trusted and will take any action necessary to exert their power over the young and under privileged. If you attempt to dispute any of their actions or charges they will NOT hesitate to block youfrom contacting them, or even go as far as to take preemptive legal action against you.\n\n\nYou have been warned.",
        "owner_response": null
      },
      {
        "author": "Sammy K.",
        "rating": 1,
        "review": "Access Unlimited Real Estate, Inc\n1135 Washington Ave, Brooklyn, NY 1122\n\nCritical:This place is a scam they list apts at a very low price and when you call they say its rented and then you you ask them to find something similar they say they can't find anything that cheap so they lure you and then try to take advantage of you i will never deal with companies like this .....",
        "owner_response": null
      },
      {
        "author": "Ludi C.",
        "rating": 1,
        "review": "This company is badly managed and will do what it takes to get your money so feel free to sue them if they wrong you, they deserve it. \n\nI informed them I couldn't pay rent for one month due to Covid. State law forbids eviction and late fees currently. They went ahead and took my rent portion out of my roommates account. These people are criminals. Beware!",
        "owner_response": null
      },
      {
        "author": "LaVerne S.",
        "rating": 5,
        "review": "We're new to Washington and found Access to be very helpful in finding a new home in the Bellingham area.  The staff was welcoming and helpful - every detail, both small and large, was anticipated and well managed.  Thanks for making such a great first impression for our new home town.",
        "owner_response": null
      },
      {
        "author": "Donna W.",
        "rating": 2,
        "review": "Rudest owner around in property management,...  AND SHE WAS WORKING FOR ME!  ...   Procrastinates everything by saying she is working on it.  Closed minded, unwilling to consider any suggestions. Forgets who she is working for.  She is going to do what benefits her and at her convienence only, and that is that!\n\nI gave this service 2 stars because she has some very nice, intelligent and personable employees.  Otherwise, she personally, gets zero stars from me.",
        "owner_response": null
      },
      {
        "author": "Donald B.",
        "rating": 1,
        "review": "My particular experience with this company was far from positive.  They cancelled a showing 30 minutes prior and then as a consolation said that I could show up at a group showing to get involved with a circus.  I am inclined to never do business with them.  I hate the fact that it is a landlords market where they can treat everyone like they are in the hunger games.",
        "owner_response": null
      },
      {
        "author": "Beth M.",
        "rating": 1,
        "review": "Drove over 6 hours only for one of our scheduled showings to have been forgotten about so we waited 20 minutes in a parking lot for nothing. Another house we looked at had rotting beams under the raised parking and overall disrepair and uncleanliness, exposed pipes, garbage under the home, etc. One prospective tenant described the beams as \"rickety\" and was immediately snapped at by an employee who insisted that the overhanging platform was a part of the road (it wasn't).",
        "owner_response": null
      },
      {
        "author": "Kyle A.",
        "rating": 5,
        "review": "The owners truly care about their customers and have very agreeable in assisting me as a renter.",
        "owner_response": null
      },
      {
        "author": "Dana B.",
        "rating": 5,
        "review": "Access is a great place to rent with! Their staff is courteous and professional, far beyon any other rental agency located in Bellingham. I recommend them to anyone looking for an excellent rental experience.",
        "owner_response": null
      },
      {
        "author": "Meghan M.",
        "rating": 1,
        "review": "I scheduled a showing that was confirmed by text multiple times. When I showed up for my scheduled showing, there were four others waiting as well. Nobody showed up. We later found out the house was already occupied. Very poorly managed.",
        "owner_response": null
      },
      {
        "author": "Alyssa T.",
        "rating": 1,
        "review": "STAY AWAY! Access just wants your money, is horrible at getting back to you about SERIOUS issues (until you threaten to sue them), and does not include everything they advertise! I will never rent through them again and I suggest everyone and anyone stay away if at all possible.",
        "owner_response": null
      },
      {
        "author": "Kristen R.",
        "rating": 1,
        "review": "COLLEGE STUDENTS BEWARE!!!!\nThis company uses deceptive and dishonest business practices. Please be sure and READ everything before you sign. This business is in the habit of taking advantage of college students who trust them. After working with Alex on a matter pertaining to my son's lease, I requested to speak with his supervisor. FIVE times. I was never given the information. I feel like the supervisor was aware of the situation and chose not to speak with me.\nDECEPTIVE. DISHONEST. SNEAKY.  SHAMEFUL.\nIf I could give less stars I would.",
        "owner_response": null
      },
      {
        "author": "Alicia P.",
        "rating": 1,
        "review": "If you enjoy renting from a company that actively steals from you, tries to upcharge without checking info, and doesn't care about their tenants than access is right for you! While renting from them for one year we experienced water coming up from the floor boards and were told this was a normal and ongoing issue and they would \"look into it\", they did not. We experienced plumbing issues, including waste leaking in from the upstairs unit, and Access was unhelpful and unconcerned. After an attempted break in we had to threaten them, as they kept hanging up, in order to have basic security measures enforced such as nailing the windows so no one could sneak in again. Additionally we were repeatedly \"charged\" for utilities and bills that were not in our name but in the last tenants information. This billing issue took over three months to fix and because of their speedy turnover in personnel we never talked to the same person twice. This company will take full advantage of anyone and especially college renters who may not be familiar with renters rights, an issue I now know by heart. I would give them negative stars if I could. Please avoid this godawful agency at all costs. I wish I had seen a review like this before I had signed a lease.",
        "owner_response": null
      },
      {
        "author": "Scott M.",
        "rating": 5,
        "review": "Access has been excellent from day one!  Have worked with several local Property Management firms over the last 8+ years, and they're the best around.  Highly Recommend!!",
        "owner_response": {
          "text": "Thanks Scott, It's great working with you too!"
        }
      },
      {
        "author": "Cheryll K.",
        "rating": 5,
        "review": "We have been very pleased with the services of Access Real Estate during the almost four years we've worked with them. We can't imagine a more responsive, courteous, and capable group of people.",
        "owner_response": null
      },
      {
        "author": "Cheryll K.",
        "rating": 5,
        "review": "As 2017 draws to a close, we want to thank Access for another year free of rental-home worry! The Access team takes good care of us and our tenants. Prompt, courteous, absolutely dependable and completely professional, the folks at Access problem-solve 24/7 so we don't have to. Nothing ever falls through the cracks, and their reports and accounting are impeccably done. Thanks, Access! You're the best.",
        "owner_response": {
          "text": "Thank you Cheryll, You are an absolute pleasure to work for!"
        }
      },
      {
        "author": "Dave M.",
        "rating": 1,
        "review": "Worst service I have received by a real estate company in Bellingham. This town is notorious for having its shady real estate services that exploits the students in the community. Access is a perfect example of this. Very unprofessional and rude",
        "owner_response": null
      },
      {
        "author": "Andrea S.",
        "rating": 5,
        "review": "Thank you to Janine, Lori and Rachel for making me feel so welcome into my new home and for making the transition as smooth and comfortable as possible. Kind staff and prompt response on all questions and requests. Thank you, Access!",
        "owner_response": null
      },
      {
        "author": "Susanne S.",
        "rating": 4,
        "review": "Access manages our condominium complex extremely competently with only a few relatively minor glitches.  Phone calls are returned and emails responded to in a timely manner.  I can't imagine anyone better to work with than Access.  Personnel are cheerful and accommodating.",
        "owner_response": null
      },
      {
        "author": "Jaya V.",
        "rating": 4,
        "review": "We've been using Access for property management for a few years now and have been very pleased with them. They have notified us of any problems with our rental property and given us the choice of fixing it or having them hire someone to do it. They find new tenants, collect rents and pay us, all without a hitch. Personnel have changed over the time we've been usuing them, but we've always been treated politely.",
        "owner_response": null
      },
      {
        "author": "Mark E.",
        "rating": 3,
        "review": "Access Real Estate has been a reliable manager of our portfolio of properties for some years now. They are affordable and responsive. Their financial statements are almost always error free and all of our questions over the years have been promptly answered. We have recommended Access to several of our colleagues and will continue to do so. Mark & Chris, Rental Property Owners",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 23,
  "adjusted_average_rating": 2.61,
  "distribution": {
    "1": 12,
    "2": 1,
    "3": 1,
    "4": 2,
    "5": 7
  },
  "summary": {
    "created_timestamp": 1739094988,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite a number of negative user reviews regarding Access Real Estate Services, there are also commendable experiences shared by some tenants. Several users have praised the company for their helpfulness and courteous interaction, particularly highlighting the staff's willingness to assist in finding suitable rental accommodations. For instance, one user noted that they felt welcomed and supported during their move to the Bellingham area, which provided a great first impression of their new hometown.</p><p>In addition to positive experiences with staff, a few users have expressed satisfaction with the management services provided by Access. They mentioned prompt responses to queries and efficient handling of rental processes, indicating a level of professionalism that some have found lacking in other property management companies. These users feel confident recommending Access for those seeking reliable services in the local real estate market.</p></section><section id=\"great\"><h2>Great</h2><p>While the overall rating for Access Real Estate Services is low, the company has accumulated several high scores from satisfied clients. Users have noted that their interactions with management have been positive, emphasizing the helpfulness of the staff in resolving issues. These testimonials often highlight prompt responses to inquiries and a general feeling of being valued as clients, which stands in stark contrast to many negative experiences.</p><pAdditionally, a user mentioned that Access has been instrumental in maintaining their rental properties efficiently over the years. They appreciated the proactive communication about potential issues and their options for resolving them. This suggests that while the company faces criticism, there is a segment of clients who are pleased with the level of service they receive, contributing to a somewhat balanced view of their capabilities.</p></section><section id=\"bad\"><h2>Bad</h2><p>A significant portion of user reviews reflects dissatisfaction with Access Real Estate Services, particularly regarding customer service. Complaints about rude and unhelpful representatives are common, with multiple users describing their experiences of being dismissed or frustrated when attempting to address their concerns. One user noted they felt ignored when they reached out for clarification on unexpected fees, leading to an overall negative experience with the company.</p><pMoreover, several reviews highlight issues with property management after tenant move-outs, including unsatisfactory cleanliness and unresolved maintenance concerns. Users reported that they had to independently check their properties, as Access seemed to neglect their responsibilities. Such recurring themes indicate that while some tenants have had positive experiences, numerous others have faced serious communication issues and management oversights that have left them feeling dissatisfied.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most troubling aspects of Access Real Estate Services emerge from conservative patterned complaints of unacceptable practices. Users express frustration about unexpected fees and alleged unethical business behaviors, indicating a familiarity with deceptive tactics aimed at financially exploiting tenants. One user described how the company seemed to charge extensively for cleaning or repairs when they were not the ones responsible, reflecting a severe lack of accountability and transparency.</p><pAdditionally, a number of complaints focus on the handling of maintenance requests, as many users felt their concerns were either ignored or inadequately addressed. Some mentioned having to live with unresolved damage and subsequently being charged for pre-existing issues during move-out inspections. This pattern of neglect leads to a consensus that Access Real Estate Services may lack the ethical commitment to tenant rights, representing a serious drawback in their overall service delivery.</p></section>"
  }
}