{
  "name": "ACP Property Management",
  "slug": "acp-property-management",
  "company_type": "Company",
  "address": "",
  "review_count": 52,
  "average_rating": 3.35,
  "reviews": {
    "google_reviews": [
      {
        "author": "Liz S",
        "rating": 1.0,
        "review": "Giving ACP one star is being generous. If I had the option to do ZERO I would. My husband and I have had an unfortunate last year financially due to the increase in mortgage rates, as he was a loan officer for sixteen years. Our credit has been negatively affected. We sold our home, and we are now trying to start over with our little family of three, myself, my husband, and our 3 year old daughter. When we applied to a rental with this company, we were very upfront in the fact that we have damaged credit but have settled all of our financial obligations. That our credit had not yet organically repaired in the short time since we had settled our debt. Bethany contacted us to let us know we were denied. Now let me just say, the way in which she relayed this information to us, she had a very condescending and aggressive tone. Her exact words were, Oh YOU know why youre being denied. Speaking over me, and speaking to us as if we were hiding something, like we were criminals! I was understandably upset. She told me that getting excited with her would only ruin my chance of her helping me. Which is a power hungry, manipulative thing to say. Disgusting that she works with the public, and talks like that. I was in TEARS!  Her cold, dismissive demeanor was extremely off putting, and honestly felt discriminatory. She advised me to explain myself in a letter to which she would forward to the owner. I never received a response from her. Never picked up my calls, passed me off to the leasing agent multiple times. After the letter I sent, I called and the phone rang and rang. So I had my husband call, and what do you know, the phone was picked up. I have worked in a leasing office for over two years, and I know when someone tells me that the property manager had been in meetings all day, is a way to pass off an upset resident or applicant to the leasing agent in the office. The leasing agent Niko was very sweet.l, however she did tell me more than once that I would be contacted by the end of the day, and I never was contacted. After providing all the documentation Bethany asked for, the letter, a co-signer, it was all a pointless effort on our part. I felt as though I was begging to simply get a response. I sent an email saying that I was told I would be contacted by the end of the day, that was the expectation that was given to me by their office. Bethany then said that my demand for a timeline was resulting in them no longer being willing to work with us. Extremely unprofessional to gaslight an applicant who was simply asking them to follow through with their promise to contact them back. Why not just tell us from the get go, that no co-signer or letter or anything is going to help us, rather than waste our time and outright avoid us, and then gaslight us for having an expectation that THEY set?! After reading the other negative reviews it is clear to see that Bethany is an aggressive, condescending, bitter person that I am GLAD we did not end up working with. I hope no one else has the unfortunate experience that we had with her. We are just a little family who had struggles like most of us have in the last year due to so much economic stress, we were forthright and honest. And treated like garbage. I am disgusted. I feel sorry for anyone stuck in a rental contract with his company. Please do NOT waste your time!!!! Just look at all of the negative reviews. That many negative reviews with one thing in common, is not a coincidence. These are not compassionate or professional people. Even their responses to these reviews are dismissive and condescending.",
        "ownerResponse": null
      },
      {
        "author": "Dylane Borgen",
        "rating": 3.0,
        "review": "The communication from this property management company to potential tenants needs improvement. When I could get a hold of them the staff members were decently friendly but most could not help or give an update. They would say someone would call me, but no one would call. I held out on my search for another rental and I was told the move in date was pushed to May 15th. That date came and went with no communication. Eventually I got a hold of someone of Friday May 17th when they told.me the rental was not available due to the property owner leaving? I wasn't exactly sure what happened. I understand things could have been out of their control and do not fault them for that, I just wish it was easier to get a hold of them and get information. Obtaining housing is very stressful and in a competitive market especially when families need to secure a house by a specific date.",
        "ownerResponse": null
      },
      {
        "author": "Maria G",
        "rating": 4.0,
        "review": "My husband and I rented a studio apartment on Barkley blvd and we were pleased with how easy it was to move in and out. The office people were friendly at the time we rented from them. (2018)",
        "ownerResponse": null
      },
      {
        "author": "Tony Magestro",
        "rating": 5.0,
        "review": "I've been a tenant of ACP for the past six years of the eight I've lived in Bellingham and they are, by far, one of the best property management companies in the area. With cost of living and rental prices skyrocketing over the past few years, ACP has a portfolio of high-quality apartments, townhomes, and single-family houses that are much more affordable than their local competitors. For instance, where some property management companies have increased rent year over year by staggering amounts, our rent over that lease's six years increased only once and only by about 10-15% post-COVID.\n\nIn addition to the affordable, quality housing options they provide, the real value with ACP comes from their personal attention and care when working with you as a tenant. I've always believed that the tenant-property management relationship is a partnership that requires communication, compassion, and understanding.\n\nWhile I briefly rented from a much larger company in town, I could never build a relationship with them as our property manager changed five times in two years; it was apparent to me that I was just another means to make money, not a human being in need of a home or wanting to do right by the property owners.\n\nACP, on the other hand, has been nothing but helpful; repairs are fixed quickly by friendly staff, they're responsive to phone calls and emails (and when they're busy during the summer season, they don't mind the gentle reminders), and they bring a level of humanity to business that seems to be missing in a lot of places nowadays.\n\nCase in point, as our lease at the four-bedroom house I was renting at ended (my roommates were all going their separate ways), I was struggling to find a place to live on my own, especially in Bellingham's cutthroat housing market. Bethany and her team helped me find a wonderful studio apartment to now call home for the foreseeable future. As far as move-out goes, they even lent us some cleaning supplies like a swiffer duster so we could prep better -- perhaps a small gesture but it's a combination of little things like this that add up into a great experience over the years.\n\nI recommend ACP frequently to friends looking for places to live in Bellingham and Whatcom County, though since this marked the end of my old lease and the beginning of a new one with them, I wanted to take the time to share my experience so far. ACP is one of those businesses that cares deeply for the people they serve and I'll continue to recommend them.",
        "ownerResponse": null
      },
      {
        "author": "jack cooke",
        "rating": 2.0,
        "review": "Rented for two years with ACP. Although it was easy to submit maintenance requests, pay rent, and communicate, parking was always a pain, dumpsters were always overflowing even after being told there would be extra pick ups scheduled, our pipes froze and blew two years in a row and after the second year the basement parking was in shambles for repair and still is. If you have a cat you better be ready to lose your security deposit because theyll charge you for new carpets even if your cat never peed on it. They do uv testing but my own uv light and my own nose couldnt find a single trace of cat urine. Outdoor common spaces were unkempt (stairs, hallways) and should have had someone come by every once in awhile to sweep/pressure wash. Overall go with private landlords if you can.",
        "ownerResponse": null
      },
      {
        "author": "Kate Ainsworth",
        "rating": 5.0,
        "review": "I've only rented from ACP Property Management for less than a year, they are a stellar group of individuals to work with and I have been renting for twelve years in Washington. ACP prioritize their renters' needs when issues arise, they are easy to work with, and genuinely friendly staff with that family feel. Highly recommend finding your next home with ACP Property Management.",
        "ownerResponse": null
      },
      {
        "author": "Jessica Ibes",
        "rating": 5.0,
        "review": "I rented with ACP for 2 years. I had a horrible roommate at some point that Bethany helped deal with, was overall supportive and understanding, and did her best to improve the situation for everyone. Since then they have been super kind, communicative of all changes, and flexible with most situations. They know their tenants, the units are nice, any maintenance that needs to be done is quick, they do not charge you randomly for things, and again they treat you like individuals. Thanks Kyler & Bethany!",
        "ownerResponse": null
      },
      {
        "author": "Bailey Hill",
        "rating": 5.0,
        "review": "We rent a place out in Lynden and we have been so happy with ACP! We met Bethany for our walk through and she was so kind and helpful, helped answer all my silly questions and I felt went above and beyond. After about a month of living here we noticed a leak in the closet and got a hold of them (its a brand new build) and the next day I was talking to the plumbing company to get it fixed.  The company is very responsive and eager to help when needed we are very pleased with them!",
        "ownerResponse": null
      },
      {
        "author": "Helena Handbasket",
        "rating": 1.0,
        "review": "Claimed to have a company working on fixing a faulty hot water heater. After two weeks of dealing with cold water and having to use friends and family for showering I followed up with the 3rd party plumber to find out they had closed the order per ACP.\nBethany would stop by unannounced and asked for details on the other residents that shared the property with my unit, which I found to be unprofessional.\nBethany was aggressive in all communications. She was aggressive and unrelenting in her pursuit to get me to sign off on a new lease effectively nullifying rights established by my current and legally binding lease when her company took over the property with new ownership. I fully suspected (as did anyone familiar with my situation) that they were \"soft evicting\" me for not signing a new lease with new terms before my current lease had expired, and did so by purposely not repairing the hot water tank. The realtor was said o have been wanting to move in as the tenant into my unit after the sale... And if it wasn't as nefarious as that, then they simply failed to honor repairs and my lease.\nThere are other issues I had regarding this company in the brief experience I had with them concerning 3rd parties: the plumbing company, the realtor working with ACP during the buyout, and the property owner himself all disregarding my rights that give credence to the reasons behind the soft eviction since I was a great tenant with great references.\nI am grateful for the foresight of the previous landlady that I signed the lease under making it so easy to vacate after the sale once the new owners & ACP began acting shady.\nWorst rental experience ever.",
        "ownerResponse": {
          "text": "Its illegal to allow 2 weeks without hot water let alone anything over 24 hours.  Additionally we are not sure who you are or what a soft eviction is.  I suggest you contact legal aide if this truly transpired.  I think you have an issue with another party as we truly have no idea this ever occurred nor would we ever let an issue of that matter get to that point. If you have any further questions or concerns please contact our office as we would love to help get to the bottom of this. Thank you"
        }
      },
      {
        "author": "Cisco Medina",
        "rating": 5.0,
        "review": "We live behind a property managed by ACP Property Management. There was an issue recently with a portion of our fence being backed into and knocked over. We contacted ACP and spoke with Bethany. She was very polite  and had someone come out to look at the issue right away. Within a few days, they had someone out there to fix the fence and did a great job. I would recommend them to people looking for a property management company.",
        "ownerResponse": {
          "text": "Thank you for the review.  We appreciate it.  We strive to do our best in maintaining our properties and doing our best for our tenants!  Again, thank you!"
        }
      },
      {
        "author": "Kyle Lee",
        "rating": 1.0,
        "review": "After hearing my neighbors got a month to month before leaving ACP properties, we requested the same type of lease after a year. However, Bethany did not authorize the same type of lease for us. Since our neighbors complained about Bethany before leaving, we werent surprised.\n\nIn addition, when we reported issues to Bethany, she either ignored us or didnt follow through with repairs. For example, my heater in the master bedroom didnt work for a year. Also, the heater in my bathroom wouldnt shut off, so I was left with no heat in the master bedroom for a year. There are also wiring issues. When using the oven, kitchen lights turn off. For separate lighting issues, Bethany claimed to set an appointment, but no one ever showed up to take a look.\n\nAs far as a your security despoit, I sincerely wish you luck. As Bellingham grows, I hope you find a better property management company than ACP properties.",
        "ownerResponse": {
          "text": "Kyle, thank you for your review.  You bring up so many great talking points for tenants especially when a lease is coming to an end. We all know Bellingham is a VERY tight rental market that is why we ask a minimum of 90 days prior to your lease ending if you would like to renew.  I totally get that it seems so far out but remember our job is to have the units rented not vacant.  From there 2 things happen:\n\n1) If you say your not renewing we send you an Intent To Vacate (ITV) form and have you fill out your dates & acknowledge we will be showing and re-renting your unit along with a detailed checklist of what is required by lease end date or agreed move out date.\n\n2) If we do not hear back from a tenant after 3 requests we do send a termination of tenancy with the lease end date and start advertising.\n\nNow, to be more detailed on your issues:\nMove Out Notice:  You chose the Intent to Vacate and had a move out date of 1/31/2018.  You returned on this on 12/23/2017) Unfortunately,  asking for an extension after you turned this in we weren't able to accomidiate since we had an application on the unit.\nNo Heat Claim:  If you or ANY tenant has been living without heat-that is illegal as per the Landlord Tenant Act.  You should seek legal assistance to your reports of no heat not being met.  No one should live without heat.  If this was an exaggeration, you only take away from valid complaints of those people that have an unresponsive landlord.\n\nLastly, I will see you NEXT week at your move out inspection and we can discuss your Deposit.  To help I will send you another copy of your Intent To Vacate with the move out requirements so you can ensure your deposit."
        }
      },
      {
        "author": "Nick",
        "rating": 5.0,
        "review": "Been renting with them for over 4 years now. They always treat everyone fairly, take all tenant concerns seriously, and resolve any issue promptly. Pay your bills on time, treat the place as you would treat your own properly, and respect your neighbors, and you will never have a problem!",
        "ownerResponse": null
      },
      {
        "author": "Matthew Smiley",
        "rating": 3.0,
        "review": "I appreciated ACP while I rented from them, but, as is always the case with literally every rental company in Bham, I was charged unnecessarily for cleaning upon moving out.\n\nRenters in Bellingham: just stop cleaning anything when you move out. You will be charged for it regardless.  Other than that they were a fine rental company.",
        "ownerResponse": null
      },
      {
        "author": "Cheri Beri",
        "rating": 1.0,
        "review": "I would give ACP property management less than one star based on my experience with them. I can only speak for myself and my situation, but  im guessing their protocol doesnt stray far when someone is really in need .  I was in a home managed by 2 diff prop management companies  for 10 years and never paid rent late and Maintained the half acre yard immaculately. When I moved  into the home, I did my checklist and didnt include on the checklist that there were Christmas lights up and bird houses on the garage of the house built-in, which were very beautiful by the way .  The previous renters or previous owner had left tons of cans of paint and an old dishwasher and an old suitcases and other things in the rafters of the garage, which I failed to mark on my checklist .   So when  The owner who handled the property passed away, and his wife took over and hired ACP property management to take over and kick us out,  we were in shock .   There was so much that was needed to be done on the property before then and we never really said anything because we thought we were so lucky to be able to rent a home And not an apartment.   I even asked them to tell us what the new going rate would be and they declined to tell us and would not give us a chance to stay in the home .  This was at the same time my father passed away and I was having to go down to Arlington Washington and move his stuff out of his home since July 2018:    It was all happening at the same time, and what I can say for sure is Bethany was the most unprofessional rude person Ive ever dealt with in any dealings with property management companies .  Not only were we being kicked out, but they gave us 30 days to do so, while I was still trying to move two homes, and grieve over a family loss,  and when all was said and done they were charging us to move to clean out things that were already existing in the home when we moved in.  Bethany was rude and insulting and Ended up sending me to collections because I couldnt pay them what they felt I owed him to move things out within 30 days.  Who does that? I was happy for her to send it to collections, because even the collection agency was nicer to me than ACP properties and Bethany .   Guess they didnt want the new renters to find out about the lead in the paint and the bugs in the cupboards and all the things that werent being done while the rent was raised $650 a month   Its a very sad situation being that the new renters have a young child in the home .   Puff out your chest ACP properties, and make your place now, because your place isnt going to remain stable for long in the town of Bellingham .   Especially when you bully people who are rock solid tenants . With children.   I would never recommend ACP properties.  Bethany, dont bother with a reply, because Ive been in this town for over 40 years.  I am an honest person and very involved in the community. I am not a bittet past resident who did something wrong and trying to grab retribution.  I am a human being who was a great renter for 10 years and had thw reality of loss and life happen all at the same time, and ACP property management was not having any of it .   What I am sharing is the absolute truth, and the way you handled things is how I remember bullies acting when I was in school.   Ive barely moved my dead fathers stuff out of his home and then had to have my own stuff out of the home here in Bellingham and you wouldnt give me a couple extra days before you started  calling me saying thal the place was left a complete mess and disaster, and that i was filthy. I never had a chance to breathe, let alone, clean. . I hope you never have to go through the same thing that I went through and then have someone in your face telling you what a pig you are :  Best of luck to you and your property management company. you failed on this one.",
        "ownerResponse": {
          "text": "Cheri, It is silly to think we would just move great tenants without a reason.  You were served by the owner months ago, actually by their attorney...  You know why the owner terminated your month to month.  We just do not have time to chase tenants for past due balances."
        }
      },
      {
        "author": "Erika Yrizarris",
        "rating": 1.0,
        "review": "They don't even deserve the star. Bethany was hired to manage my mom's apartments in April. Right away she gave an eviction notice to my mom who is a Hispanic U.S. citizen and to the only black tenant. The people above my mom are white drug dealers but they get to stay.\nWhen my mom tried to ask her why she is kicking her out Bethany replied \"no one wants you here, go back to where you're from\". She threatened my mother and behaved erratically.  She then served my mom with a 3 day notice on Thursday saying she had until Sunday to be out so she obviously does not know the law. My momnu is not behind on rent or anything else and by her own words she pretty much showed she is racist.\nThen she tried inventing that her daughter and boyfriend are living there. WTH??? My sister is 17 and is on the lease and my mom would never let my sister bring a so-called boyfriend into the house. Bethany said she was videotaping the house and saw the guy over 18, who is the guy with the BMW. My mom tried telling her the guy is her grandson and is not 18. That is my son and I bought him the BMW and I didn't know it was illegal for a 17 year old grandson to stay a night at his grandmother's.\nThis woman is crazy and I wouldn't recommend them to my worst enemies.",
        "ownerResponse": {
          "text": "There is nothing easy about an eviction.  Its a loss for all involved."
        }
      },
      {
        "author": "Minnieannie",
        "rating": 5.0,
        "review": "Bethany is the best manager we have ever had. She is fair to the owners and the renters, that is why we have had long term tenants. She takes care of things quickly and professionally.",
        "ownerResponse": null
      },
      {
        "author": "Xtoxina",
        "rating": 1.0,
        "review": "Reading the \"positive\" reviews sure seems pretty fake to me. I'd say any of the 1-3 star reviews are real. This company is terrible. Got bad ratings on BBB and on google. Numerous complaints, from people who complain about the same things. Just goes to show how terrible this company is. Found out one of the 5 star reviews was from someone who WORKED in their building trying to make their company look good. Don't believe any of the good reviews. The owner also comments to negative reviews with some generic excuses to make herself and her company look better.(Yikes) As for renting, stay far away! Don't be fooled.(Response to owner's response) I don't need to discuss about the application denial, we already did that. I just want to let other's be wary of you and your company.  The pets that were required to be listed was ONLY for cats and dogs. It was your mistake that cost us our application fees because you failed to include all pets that the owner didn't want in the home.",
        "ownerResponse": {
          "text": "Sheena, we're sorry your application along with Andrews & Jordons resulted in a denial last September.  Again, owner does have last say in regards to pets.  We hope you can move on from this.\nWe strive to to do the best we can and treat others as we would want to be treated.  As explained in our sit down September 2017.  Anyone can look at our BBB rating and we welcome them to do so and verify your claim.  We wish you the best, we are sorry you are still upset over the denial from last year.  You can always reach out and we would be happy to meet with you over your application denial."
        }
      },
      {
        "author": "D B",
        "rating": 1.0,
        "review": "Bethany is unpleasant and unprofessional, in my opinion. She hides her lack of integrity behind \"legalese.\"  We were excellent renters, so don't let any new reviews obscure Bethany's rudeness and surprisingly unprofessional behavior.  She was rude and presumptious  and didn't apologize to us for anything. She deserves the poor reviews she gets.  It's sad that she has to have people that haven't rented from her give her positive reviews.  My advice to her is to act with ingetrity and kindness.",
        "ownerResponse": null
      },
      {
        "author": "Nichelle Kelley Sorenson",
        "rating": 1.0,
        "review": "I agree that CAP doesn't deserve a star at all. I called on Sunday and left a message with the receptionist about a newly posted rental. Got no call back by midday Monday so I called again and repeated the process.  Tuesday again I called but when she said again that the rental agent wasn't available and asked me to leave a message I told her I already had called several times with no call backs. She apologized and assured the agent would get back to me promptly. Well, when I finally did speak to the agent, who was also the owner, she began chastising me and said and I quote\" Sunday was my son's graduation party and you just weren't getting a call back from me. We do have lives and families!\" I said I didn't expect a call back Sunday but she continued to chastise me for expecting a call back at all. She was very rude and insulting so I hung up. If this is how they treat people I think we dodged a bullet avoiding renting from them!",
        "ownerResponse": null
      },
      {
        "author": "A.",
        "rating": 4.0,
        "review": "Probably the best rental management company I've ever dealt with! They always fixed any maintenance issues quickly, and aside from some miscommunications and some steep fees attached to the sublet we had to do for a sudden move, we were happy that we got our deposit back pretty much right away.",
        "ownerResponse": null
      },
      {
        "author": "Nathan",
        "rating": 1.0,
        "review": "Not worth the hassle of trying to communicate with them, unprofessional and dont care about your time. My business will be going elsewhere.\n\nresponse to the owner:\nIf your staff gets offended after I call  bullsh*t for your lack of communication and general disregard for my time then I really do not know what to tell you . Maybe instead ignoring calls or not returning them you could actually get back to your customer? The reviews don't lie, if your company was worth working with the reviews for it would not be so low. I appreciate you coming on here to explain your extremely biased side of how things were handled but I really cannot understand what you think you'll gain from it. All of your responses make the business look even worse. Good luck with your endeavors.",
        "ownerResponse": {
          "text": "First, we reserve the right to refuse to work with people.  The language and disrespect that was displayed by you was uncalled for and very unprofessional. I support my staff for the tough choice they made today regarding working with you in the future.  Everyone should be treated with respect including my staff.  I am glad you found this platform to get your voice heard.  Bellingham is a competitive rental market and frustrating for sure.  But it all comes down to how we handle ourselves.  Wish you the best."
        }
      },
      {
        "author": "Erin Dorchak",
        "rating": 5.0,
        "review": "ACP is a small family run business.  Their app makes it easy to pay rent and make matenance requests.  ACP has a personal quality you can't find with larger rental company.  5 stars :-)",
        "ownerResponse": null
      },
      {
        "author": "Eleanor Shellstrop",
        "rating": 1.0,
        "review": "Typical slumlords - they overcharge, will keep your deposit for fake reasons, plus the owner is an anti-masker Karen. Terrible place overall, can't even describe what liars and cheaters they are",
        "ownerResponse": null
      },
      {
        "author": "Daniel Libertini",
        "rating": 1.0,
        "review": "Very rude service, the ladies in the office ignored us when we came in. Quickly turned us away without even taking any of our information. Was a very discouraging experience. I will never rent from them. Son-rise and Chuckanut are much better!",
        "ownerResponse": null
      },
      {
        "author": "Alexander Bullock",
        "rating": 5.0,
        "review": "Very nice family run local business. I can always call them or text if I need anything. Little bit disorganized due to small number of staff but if you are willing to wait and few minutes and start on stuff a bit early they are very easy to work with.",
        "ownerResponse": null
      },
      {
        "author": "Tom Butler",
        "rating": 5.0,
        "review": "GreT management company to work with. Bethany is the best",
        "ownerResponse": null
      },
      {
        "author": "Wendy Williams",
        "rating": 5.0,
        "review": "It's easy to use their portal for service requests and to pay rent. I've been a renter for three years and always receive a quick response.",
        "ownerResponse": null
      },
      {
        "author": "Jordan Neuhauser",
        "rating": 1.0,
        "review": "The other reviews say it all. Extremely hard to work with, very little respect or communication and not professional in the slightest. Nice properties made worthless by the property managers.",
        "ownerResponse": {
          "text": "Jordan we understand how difficult it is to have an application turned down, it is unfortunately the guidelines set forth with our owners. It wasn't you it was the 2 cats and bird the owner didn't want. We wish you the best of luck"
        }
      },
      {
        "author": "Paxton Westergard",
        "rating": 5.0,
        "review": "Extremely kind and helpful staff. Apartments are nice, modern, and seem to be well maintained.",
        "ownerResponse": null
      },
      {
        "author": "Tamara Gonzalez",
        "rating": 5.0,
        "review": "I have been renting from them for 4 years always excellent service",
        "ownerResponse": null
      },
      {
        "author": "Jose Aguilar",
        "rating": 5.0,
        "review": "Excellent service  very good people ",
        "ownerResponse": null
      },
      {
        "author": "Bryson Lamb",
        "rating": 5.0,
        "review": "My mom works her tail off to succeed and I feel bad when I'm at her office, and there are rude and very mean people yell at her",
        "ownerResponse": null
      },
      {
        "author": "Jason Cook",
        "rating": 5.0,
        "review": "Made a lease takeover process very fast and simple!",
        "ownerResponse": null
      },
      {
        "author": "Andrew Bethman",
        "rating": 1.0,
        "review": "Just don't bother with them. Finding a place to live is already stressful enough, don't add dealing with them into it.",
        "ownerResponse": null
      },
      {
        "author": "joanna dernbach",
        "rating": 5.0,
        "review": "Very professional. Very responsive.",
        "ownerResponse": null
      },
      {
        "author": "Martha Silvas",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "stephanie Beardslee",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Garrett Kirschman",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Desiree Powell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Johnny Bloxom",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "doug swanson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Carmelo Sanchez Jr",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sam Bernhart",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Unfortunately, In order for our company to perform any sort processing, applications are to be complete with required information and supporting documents. This is why we moved to the next applicants that had a completed applications and you were refunded your application fees.  We can not make exceptions to the rules of required documents as per our management agreement with owners."
        }
      },
      {
        "author": "Emily Robinson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Hannah St. John",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sgttomas",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tahsis Claus",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Nneka London-Browne (NLB)",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brandon Dupont",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Big D Hogan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Michell Remley",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sky Captain",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 35,
  "adjusted_average_rating": 3.26,
  "summary": {
    "text": "<section><h2>Good</h2><p>ACP Property Management has garnered positive feedback from some tenants who appreciate the company's affordable housing options amidst skyrocketing rental prices. One tenant speaks highly of ACP's portfolio, stating that their rent increased only once over a six-year period, which is commendable given the economic climate. Tenants have also commended specific staff members for their friendliness and readiness to help, highlighting an easy move-in and move-out process.</p><p>Customer service appears to be an area where ACP has made a positive impact, as some renters have noted that the staff is generally responsive and maintain a personal touch that larger companies may lack. Some have specifically mentioned quick responses to maintenance issues and a user-friendly portal for paying rent and making requests, which contributes to a satisfactory renting experience.</p></section><section><h2>Great</h2><p>In moments of excellent service, ACP Property Management seems to excel in personal attention and compassion. Illustrating this, a long-term tenant detailed how the company helped them transition smoothly to a new home within their portfolio at the end of a lease. The company has been cited as going above and'repair beyond, such as lending cleaning supplies for move-out or swiftly addressing an external property issue for a non-tenant. A family-oriented approach has led to high recommendations from current tenants.</p><p>ACP's attentiveness extends to maintaining properties as well, with testimonials about them promptly addressing even the unexpected issues like a leak in a closet. This rapid response to problems ensures that tenants feel heard and taken care of, which is a critical determinant for a tenant's peace of mind and comfort in their homes. These instances of going the extra mile are what make ACP stand out to some renters.</p></section><section><h2>Bad</h2><p>Some tenants have experienced less than satisfactory encounters with ACP Property Management. Issues with communication crop up in user reviews, with potential renters feeling confused about move-in dates and availability due to a lack of updates. In a competitive rental market, prompt and clear communication is essential, and when it falls short, it can cause significant stress and inconvenience for those looking to secure housing.</p><p>Maintenance issues have been a source of frustration for some residents. While submitting requests may be straightforward, there are reports of important systems like heating not being repaired promptly, leaving tenants in discomfort. Additionally, a common concern is over maintenance follow-ups, where tenants were promised a service visit that never materialized, contributing to a sense of neglect and mismanagement.</p></section><section><h2>Ugly</h2><p>Several user reviews paint an unflattering picture of ACP Property Management, particularly spotlighting instances of what some tenants describe as unprofessional conduct. Tenants have complained of aggressive and condescending communication from ACP staff, with one detailed account of a tenant being spoken to in a dismissive and insulting manner while dealing with stressful personal and financial circumstances. Such experiences have understandably left certain renters feeling disrespected and unwelcomed during their interactions with the company.</p><p>Furthermore, allegations of discriminatory practices have been made, with one reviewer claiming they experienced racist comments from a staff member. Accusations also include unfair treatment during the application process and evictions that some tenants allege were handled insensitively or without just cause. The gravity of such claims suggests a pressing need for ACP Property Management to address these concerns to prevent any further damage to their reputation and restore trust among their clients and the local community.</p></section>"
  },
  "timestamp": "September 7 2024"
}