{
  "name": "Adams Property Management",
  "slug": "adams-property-management",
  "company_type": "company",
  "address": "1344 King St #201, Bellingham, WA 98229",
  "review_count": 10,
  "average_rating": 3.3,
  "reviews": {
    "google_reviews": [
      {
        "author": "Ethan Kendall",
        "rating": 1.0,
        "review": "Pipes froze went without running water for 10 days no restitution for equipment I bought to unthaw pipes slow to respond. Owners selling property gave me till end of lease to figure out new place to live found place a month early moving out still holding me to lease to pay April rent which is a scummy move been a good renter no problems or drama I crawled under unit checking for leaks they are going to take me to court just plain greedy people",
        "ownerResponse": null
      },
      {
        "author": "Graham Armstrong",
        "rating": 5.0,
        "review": "We rented from Howard and Caroline for 5 years, and while their management style might not work for everyone, it was perfect for us. We were comfortable handling the majority of maintenance and repairs on our own,  and they were comfortable being \"hands-off\" landlords. We paid a very reasonable price the entire time that we rented from them.\n\nThey are also good people. I will miss having small chats with Caroline once a month while turning in rent.",
        "ownerResponse": null
      },
      {
        "author": "Nick Hatch",
        "rating": 4.0,
        "review": "I've been a tenant with Adams for over three years, and have been pleased with the no-nonsense approach they take with property management. Problems generally get fixed quickly, and they'll be a respectful and attentive landlord as long as you're an attentive tenant.\n\nThey have a reputation for being strict, but I've always been a respectful tenant, and am treated with the same respect.\n\nThey've never played games with nickel-and-diming security deposits, something many other landlords in Bellingham seem to love to do.",
        "ownerResponse": null
      },
      {
        "author": "Sarah Ross-Morgan",
        "rating": 1.0,
        "review": "I've lived in Whatcom county most of my life and I've rented from many property management groups, most are pretty fair. Truthfully Adams is the second worst (Lakeway wins first by a landslide- oi vey). This guy...I've never been so abused by a property management company. Know your renters rights, people! DO NOT let Howard Adams bully you!",
        "ownerResponse": null
      },
      {
        "author": "Steven Shimko",
        "rating": 5.0,
        "review": "Awesome landlords, always punctual when there are issues",
        "ownerResponse": null
      },
      {
        "author": "Nick Farrell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Pamela C.",
        "rating": 5,
        "review": "Howard and Caroline are great! They have been taking care of our properties for about 5 years and we can count on them for everything.  Honesty, and integrity.  He screens our tenant's well and we have never had any problems because of their thoroughness.  \nHoward and Caroline are wonderful communicators and they follow through with all request.  \nWe are so glad to have found them!",
        "ownerResponse": null
      },
      {
        "author": "Graham A.",
        "rating": 5,
        "review": "We rented from Howard and Caroline for 5 years, and while their management style might not work for everyone, it was perfect for us. We were comfortable handling the majority of maintenance and repairs on our own,  and they were comfortable being \"hands-off\" landlords. We paid a very reasonable price the entire time that we rented from them.\n\nThey are also good people. I will miss having small chats with Caroline once a month while turning in rent.",
        "ownerResponse": null
      },
      {
        "author": "Nick F.",
        "rating": 1,
        "review": "Absolutely disgusting and disgraceful excuse for a Property Management company.\n\nMy roommates and I were in love with our duplex we were renting from Adams, until we noticed a few of the appliances (along with the already-damaged carpets and floors that needed maintenance in terms of cleaning) needed attention. Since Adams is... SHOCKER... supposed to facilitate maintenance on up-keeping the house, we have made arrangements for some of these things to be fixed on numerous occasions (and arrangements were NOT made easily by any measure - we always had to be the ones calling the repair people [which i'm pretty sure is not standard procedure]). Finally, one day when my roommate decided to take the rent check in, she inquired about the possibility of having the carpets taken care of, since we had been ignore several times on this request. Without hesitation, the owner (Howard) flipped out on my roommate and spewed the most distasteful sexist garbage onto her, claiming she was a \"bitch\" and threatened eviction on us for no good reason whatsoever, other than the fact that we were \"annoying\" and he \"hated our unit\". (All VERBATIM from what was said) Long story short, APM will not be going down without a fight. Absolutely the worst rental company experience ever.",
        "ownerResponse": null
      },
      {
        "author": "Monica J.",
        "rating": 1,
        "review": "Renting with Adam's for six years was one of the worst decisions of my life. The homes are not clean -- we moved into a house filled with garbage, food that was YEARS old, and damage -- and ended up having to pay for the previous tenants damage. Howard and the other woman in charge do not have any idea of how to run a business. They are aggressive, disorganized, unprofessional and downright ridiculous. Howard will come to your house unannounced and be rude. Yes, he will just walk in. I wish I was kidding. Don't expect to ever get a call back unless  they didn't get their money. Howard is incredibly aggressive towards women and will cuss at you over the phone or in person. The office is dirty and covered with papers. I have no idea how they get anything done because when they arent being incredibly rude they are so out of it it's comical. Without a doubt the worst experience i've ever had.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 9,
  "adjusted_average_rating": 3.11,
  "summary": "<article>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT and is purely a summary of user reviews on Adams Property Management designed as a tool to assist individuals in finding a property management company or rental property. No personal review identifiers are included, and this article's intent is to offer a balanced overview encompassing both positive and negative aspects extracted from user reviews.</p>  </section>    <section>    <heading><h2>Good</h2></heading>    <p>Adams Property Management has garnered praise from certain users for their hands-off management approach, which has been well-received by tenants preferring autonomy in maintenance and repairs. These users have expressed satisfaction with this style, highlighting the fair pricing and ease of dealings as high points of their residential experience over extended periods.</p>    <p>Moreover, positive encounters emphasize the effective communication and thoroughness offered by Howard and Caroline, the faces of the company. Several users commend their honesty, integrity, and diligent tenant screening process, which appears to contribute to a stable and contented tenancy for many of their clients.</p>  </section>    <section>    <heading><h2>Great</h2></heading>    <p>From the perspective of property owners, Adams Property Management is lauded for its commendable service in managing rental properties. Owners have placed trust in the company over several years, finding solace in its reliability and communication skills, which consistently meet the owners' expectations and needs. These strengths are key contributors to long-term satisfaction and loyalty.</p>    <p>The company has also shown proficiency in addressing issues punctually when they arise, as evidenced by a user review stating their problems were fixed quickly. Such responsiveness is an indicator of commitment to maintaining good relations with tenants and upholding property standards.</p>  </sequence>    <section>    <heading><h2>Bad</h2></heading>    <p>However, a fraction of user reviews cast Adam Property Management in a less favorable light, lamenting over slow responses to pressing maintenance issues. There are instances quoted by tenants, such as going without running water for extended periods, which indicate a neglect of urgent repairs, leading to tenant dissatisfaction and accusations of the management being unconcerned with renters' hardships.</p>    <p>Frustration is also expressed by some tenants who feel mistreated or bullied by the company. These users report aggressive encounters, highlighting poor communication not just in everyday interactions but also when attempting to resolve issues such as appliance repairs, which can exacerbate resident dissatisfaction and paint the company as inattentive and unprofessional.</p>  </section>    <section>    <heading><h2>Ugly</h2></heading>    <p>The ugliest aspects highlighted in the reviews reference a lack of professionalism and disrespect towards tenants, especially concerning maintenance and financial disagreements. A user recounted being on the receiving end of verbal aggression and threats of eviction, an experience that left them with an extremely poor impression of the company and its ethics.</p>    <p>Additionally, there are complaints related to rental conditions upon move-in, with tenants finding properties not cleaned up to standards and even alleging that they were unjustly charged for former occupants' damages. Such experiences contribute to an adverse image, fostering an atmosphere of mistrust and potential legal disputes between renters and management.</p>  </section></article>"
}