{
  "name": "Affinity at Bellingham",
  "slug": "affinity-at-bellingham",
  "company_type": "Property",
  "address": "3930 Affinity Ln, Bellingham, WA 98226",
  "review_count": 14,
  "average_rating": 4.43,
  "reviews": {
    "google_reviews": [
      {
        "author": "julia",
        "rating": 5,
        "review": "This place is huge, and feels like a like a exuberant resort! Its amenities are available to residents 24/7 and they include an indoor pool and spa, a 5-hole putt-putt golf green, gas grills, a pool table, a poker table and a game room, an internet caf with a free cappuccino & hot chocolate machine, a movie theater (two movies shown every week (candy and popcorn provided), plus educational resources  and football games!), a pub called Dilly Dallys with Happy Hour every Friday (free beer, wine, and soft drinks  friends welcome), a huge crafts room, a family dining room with complete kitchen across from the pub (so many fantastic pot lucks!), a gym, a really nice wood shop, and huge dog park. Every space can be rented out for get-togethers. I might just have forgotten about something because there is so much here.\n\nThe facility and grounds are beautiful and well-managed by a great team of staff who are kind and generous, and I feel safe and secure here with the required key fob for every building entry, a call box at the front entrance for guests, and roving security at night.\n\nThis place isnt just a building, residents go on outings all of the time, locally and internationally. Alaska cruises, Africa, Ireland, and the Caribbean, if Im not mistaken. Locally, theres always signups to go out to Mt Baker Theater, dinners, lunches, local events, and in-house fun. I cant imagine anyone being able to do all of it. Others choose to keep to themselves, and thats ok, too.\n\nWhats been a wonderful, unexpected extra for me is that I have a garage now! (They have garages, storage units, carports, and reserved parking options, along with general parking.) My twenty-year-old car has never been inside a garage before. It still hasn't. But I was able to close-out my storage unit that was the same size but over $50 more and way out of town.\n\nI'm never leaving this place. And I'm the youngest one here. Id waited for over a year to turn 55, which I finally did, and then got my keys the very next day. I absolutely love it here, I love my apartment, my new friends, and my new life. And everyone loves my pup, so Ive got that going for me.\n\nCome take a look. Youll soon see that every other place youve checked out is blah, while Affinity here in Bellingham is like living in a resort. But it wont be your last resort, it will be your first choice.\n\nCheers.\n\nPS  I forgot about the lava rock fire pit, although pit doesnt describe it, as its a lovely setting with couches all around; Im looking forward to chilly weather.\n\nI also forgot about the community (residents) gardens, right here on the premises. They are raised allotments about four feet squared and people are growing everything from giant sunflowers to root veggies. When its time to harvest, they often leave a bounty of wonderful goods. I brought home potatoes and zucchini on my way in from the swimming pool. When I first moved in, my neighbor said she has a chive plant that she said I could pinch from whenever I wanted. Its a beautiful sight to see and lovely people with which to share time, even if your thumb tends to be not-so-green. I think thats everything now. I told you that this was a great place! Cheers.",
        "owner_response": null
      },
      {
        "author": "Elizabeth Snyder",
        "rating": 5,
        "review": "I am quite impressed by affinity of Bellingham.  The fact that the maintenance and cleaning staff have  had the same personnel for many years tells you that management is doing its job and doing it well.   Their commitment to  residents is equally impressive. Opportunities are varied and plentiful. Their response to requests is rapid and done with the expertise necessary to keep residents happy.  I have recommended it to several friends and old neighbors and have had four people come to visit my living arrangements and again ...all positive.  My family is very happy with my decision.  5 stars for sure !!!",
        "owner_response": {
          "text": "Thank you for sharing your positive experience with us, your kind words mean the world! We are elated to hear how content and happy you are with living here at Affinity. It takes 5-star residents like you to help us maintain a 5-star community. Thank you for being you, Elizabeth. Your presence here is truly appreciated! \n\nSincerely,\nYour Affinity Team"
        }
      },
      {
        "author": "Rose Seholm",
        "rating": 5,
        "review": "I was invited to teach fitness classes at Affinity over 8 years ago. The staff at this facility have welcomed me with open arms to provide this health benefit to residents who live here. The classes are well-attended and the energy and dedication of those who participate make teaching here a wonderful experience! We laugh, we listen to music while we exercise, and we encourage each other live our best lives as healthily as we can! Who wouldn't want to be a part of this?! I feel as though I am the one who is privileged to teach at this facility with these amazing people!",
        "owner_response": {
          "text": "Thank you, Rose! We really appreciate your taking the time to write this review. Silver sneakers is such a great asset for our residents, and we really appreciate you coming in and teaching it. I know that our residents really look forward to it each week. You can hear the music and laughter throughout the building on silver sneakers days.\nSincerely,\nThe Affinity team"
        }
      },
      {
        "author": "Shirley Mondin",
        "rating": 5,
        "review": "My stay here at affinity at Bellingham was not for a long duration ( medical reason necessitated my move) but during my stay here I was amazed at all the social events and choices available to each of us, if we so chose. The list includes any type of card game, space for sewing or woodworking activities, book clubs, fitness classes, coffee clutches , sports gatherings. happy hour every Friday or lovely open space to gather with friends. The best part for me however, was the friendliness of everyone I met that lives here. The amenities are very inclusive even including a salt water pool and hot tub, theater with a big screen TV featuring movies twice a week, library and internet room for personal use. The family dining area is lovely for family visits and fun times spent together playing pool or other games. Ive probably forgotten to mention several things but I cant forget to mention the friendly and competent staff including both management and maintenance who create such a positive living community.",
        "owner_response": null
      },
      {
        "author": "Karen Allen",
        "rating": 5,
        "review": "I enjoyed my time at Affinity Bellingham very much. The entire team is courteous, caring and always willing to assist with maintenance requests or general  concerns and kept us well informed. I left to purchase a home. Thank you team!!",
        "owner_response": {
          "text": "Thank you for the positive review, Karen. It was a pleasure to have you as a part in our community. We wish you the best of luck in all your future endeavors!\n\nSincerely,\nYour Affinity Team"
        }
      },
      {
        "author": "Diana Campbell",
        "rating": 5,
        "review": "My mother lived here for 3 1/2 years starting at 89 and it was the best decision she made. It is an incredible place with so many amenities. There is something for everyone. Swimming pool, happy hours, family visiting areas, grow your own garden, a woodshop, movie theater and much more. This place truly expanded her world here. It made her feel more vibrant and she kept so busy. The staff is great, always organizing different events for the residents to choose from. I would highly recommend this as a place to live!",
        "owner_response": {
          "text": "Thank you for this lovely review. We loved having your mom as a resident here. And it makes us so happy to hear that she was so happy living here. Truly, it is the residents that make Affinity such a special place to live, and your mom was proof of that."
        }
      },
      {
        "author": "Jackie Kendall",
        "rating": 5,
        "review": "I have family members who are long time residents of Affinity in Bellingham.  My husband and I live in Eastern Washington, so when we come to visit, we are so grateful to be able to take advantage of the guest suite that we are able to reserve and enjoy.  The price is so affordable,  and being so close to our family while visiting is wonderful.\nThe suite is fully furnished, and is always clean and ready to enjoy.\nWe have also been able to have some large family gatherings in the activity rooms that can be reserved in advance.\nThe availability of the guest suite and the gathering rooms are wonderful opportunities provided to families of Affinity's residents.\nMy experience with Affinity's staff has always been very positive and helpful.\nWe are grateful that our family members are living in a place that is also so welcoming to their visiting family.",
        "owner_response": {
          "text": "Thank you for this lovely review! We always love having you as a guest. We are glad to hear that you take advantage of our amenities when you visit. Hope to see you soon."
        }
      },
      {
        "author": "Ginny Kreindl",
        "rating": 5,
        "review": "I've lived at Affinity in Bellingham, WA for over four years, and I frequently tell myself that it was the best decision I could have made for this time of my life. This is such a vibrant, active community, and you can do as much or as little as you like. The variety of activities available would make a long list, and include all levels of physical participation. There is a wonderful Silver Sneakers exercise class taught by a certified instructor twice a week, or if you prefer calmer activities, afternoon movies are offered twice a week in our theater that has comfortable easy chair type seats. We have game nights, pot lucks, holiday celebrations, and so much more! Our heated indoor salt water pool is open 24/7, and in the warmer months, we have putting contests on our putting green. And always, there is your own comfortable and private apartment to watch TV, or read and just chill. And best of all, I've made so many new friends. I love my Affinity life!",
        "owner_response": {
          "text": "Thank you for your positive review.  We are so happy to have you as a resident. It is great residents like you that help make Affinity a great place to live!"
        }
      },
      {
        "author": "Monique Patricia (Moe)",
        "rating": 5,
        "review": "My husband and I recently moved to Affinity when we decided it was time to size down. We love this location of Affinity in Bellingham. It is close to all the amenities you may need. Close to the downtown, close to the mall, close to many restaurants, pharmacies, health services and much more.\nAffinity is a fun place to live. There is a long list of different activities soothed for every person. Residents organize activities for the residents on site or days out. The staff is always there ready,  and happy to assist you if you need help. Its just a great place to live!",
        "owner_response": {
          "text": "Thank you for this great review. We are happy to hear that you are enjoying your time at Affinity. We are very happy to have you here!"
        }
      },
      {
        "author": "Debbie Sage",
        "rating": 5,
        "review": "We love living here at Affinity in Bellingham! The staff are simply lovely and if we need anything at all they're quick to help.  The community of residents are friendly and there are many ways to be involved and stay connected if you want to. The amenities have something for everyone from the pool, library, theater room (amazing!) wood shop, craft room, game room, billiards,  large outdoor fire pit, large BBQ patio space.. We have dogs and there is a wonderful dog park on site along with beautiful open areas to walk.\n\nThe location is prime with nearby shopping, Starbucks, Costco, and quick access to I-5. The rooms are comfortable with everything you need (including AC, which was a must have). The windows and slider to the deck are very insulated making outside noise unnoticeable. As you can tell, we're huge fans and highly recommend living here!",
        "owner_response": {
          "text": "Thank you so much for the wonderful review Debbie!  We are so happy to have you as a resident!"
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Julie M. B.",
        "rating": 5,
        "review": "This place is huge, and feels like a like a exuberant resort! Its amenities are available to residents 24/7 and they include an indoor pool and spa, a 5-hole putt-putt golf green, gas grills, a pool table, a poker table and a game room, an internet caf with a free cappuccino & hot chocolate machine, a movie theater (two movies shown every week (candy and popcorn provided), plus educational resources - and football games!), a pub called Dilly Dallys with Happy Hour every Friday (free beer, wine, and soft drinks - friends welcome), a huge crafts room, a family dining room with complete kitchen across from the pub (so many fantastic pot lucks!), a gym, a really nice wood shop, and huge dog park. Every space can be rented out for get-togethers. I might just have forgotten about something because there is so much here. \n\nThe facility and grounds are beautiful and well-managed by a great team of staff who are kind and generous, and I feel safe and secure here with the required key fob for every building entry, a call box at the front entrance for guests, and roving security at night.\n\nThis place isn't just a building, residents go on outings all of the time, locally and internationally. Alaska cruises, Africa, Ireland, and the Caribbean, if I'm not mistaken. Locally, there's always signups to go out to Mt Baker Theater, dinners, lunches, local events, and in-house fun. I can't imagine anyone being able to do all of it. Others choose to keep to themselves, and that's ok, too.\n\nWhat's been a wonderful, unexpected extra for me is that I have a garage now! (They have garages, storage units, carports, and reserved parking options, along with general parking.) My twenty-year-old car has never been inside a garage before. It still hasn't. But I was able to close-out my storage unit that was the same size but over $50 more and way out of town. \n\nI'm never leaving this place. And I'm the youngest one here. I'd waited for over a year to turn 55, which I finally did, and then got my keys the very next day. I absolutely love it here, I love my apartment, my new friends, and my new life. And everyone loves my pup, so I've got that going for me.\n\nCome take a look. You'll soon see that every other place you've checked out is blah, while Affinity here in Bellingham is like living in a resort. But it won't be your last resort, it will be your first choice. \n\nCheers.\n\nPS - I forgot about the lava rock fire pit, although \"pit\" doesn't describe it, as it's a lovely setting with couches all around; I'm looking forward to chilly weather. \n\nI also forgot about the community (resident's) gardens, right here on the premises. They are raised allotments about four feet squared and people are growing everything from giant sunflowers to root veggies. When it's time to harvest, they often leave a bounty of wonderful goods (see photo). I brought home potatoes and zucchini on my way in from the swimming pool. When I first moved in, my neighbor had a chive plant that she said I could pinch from whenever I wanted. It's a beautiful sight to see and lovely people with which to share time, even if your thumb tends to be not-so-green. I think that's everything now. I told you that this was a great place! Cheers.",
        "owner_response": null
      },
      {
        "author": "Alicia F.",
        "rating": 1,
        "review": "Awful company! Management will say they don't want to price anyone out but just wait until the new year comes and your rent increases by 6-7% . Don't trust management!!! Don't move there...",
        "owner_response": null
      },
      {
        "author": "Marianne B.",
        "rating": 5,
        "review": "Beautiful center for 55 plus. All amenities plus utilities paid. Very impressive as well as very friendly staff",
        "owner_response": null
      },
      {
        "author": "K F.",
        "rating": 1,
        "review": "Bed bugs were found crawling from a wall in my 90-year-old parent's apartment. Called management and their response was blame my parents   One week after infestation was found, a terminator is coming. So for one week these people who don't leave their home are living in a bed bug ridden apartment. Neighbors were NOT notified. Bed bugs can multiply from a few to 13,000 in six months. It was a sickening sight and then Affinity's response was appalling!",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 14,
  "adjusted_average_rating": 4.43,
  "distribution": {
    "1": 2,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 12
  },
  "summary": {
    "created_timestamp": 1739094987,
    "text": "<section id=\"good\"><h2>Good</h2><p>Affinity at Bellingham is recognized for its impressive amenities and community spirit, making it an attractive choice for residents. The property boasts a variety of facilities, including a saltwater pool, fitness classes, gardens, and organized outings, contributing to a vibrant lifestyle. Tenants appreciate the sense of security provided by on-site management and consistent staff who have been with the community for years, suggesting effective management practices. Many users express happiness with their living space, highlighting aspects like engaged social activities and supportive neighbors.</p><p>Residents frequently commend the friendly and helpful staff who contribute to a positive living environment. For instance, one user noted how the team efficiently handles maintenance concerns, ensuring resident comfort. This consistent support creates a reliable atmosphere where residents feel valued and cared for, as evidenced by the numerous positive interactions highlighted in user reviews. Overall, the warmth of the community and the attentiveness of the staff significantly enhance the living experience at Affinity.</p></section><section id=\"great\"><h2>Great</h2><p>The reviews indicate that Affinity at Bellingham stands out not just for its amenities but also for the strong bond among residents. Many users emphasized the communal activities, such as potlucks, movie nights, and fitness classes, which foster connections and improve tenant engagement. One resident elaborated on their enjoyment of organized excursions, illustrating that there are consistent opportunities for residents to socialize and bond over shared interests. Such activities help create an enriching community, making it feel much more like a home.</p><p>Moreover, many users are delighted by the range of options available to residents, facilitating a fulfilling lifestyle. With diverse activities to cater to different interests and physical abilities, residents appreciate the flexibility afforded by the community. The facility's management often acknowledges positive reviews, which only reinforces the commitment to maintaining a solid connection with residents. This interaction contributes positively to the overall ambiance of Affinity, giving it a personable touch that many residents cherish.</p></section><section id=\"bad\"><h2>Bad</h2><p>While many residents appreciate their time at Affinity, some user reviews highlight concerning issues regarding management practices. A few users expressed dissatisfaction over inconsistent handling of maintenance requests and responses to complaints. For instance, one user recalled experiencing a lack of immediate action regarding pest control issues, leading to discomfort and frustration about living conditions. Such instances underscore the necessity for the property management to improve communication and responsiveness to residents' needs.</p><p>Additionally, there are reports of significant rent increases that catch residents off guard, which can lead to distrust in the management's commitment to affordability. Despite claims by the management to avoid pricing residents out, some tenants felt displeased when they faced sudden price hikes. This can create a sense of apprehension amongst residents, which could impact their overall living experience at Affinity.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThere are severe criticisms present in the user reviews regarding management's responsiveness and the handling of serious concerns. A particularly alarming incident involved a tenant discovering a bedbug infestation in the apartment of their elderly parents. This troubling experience was exacerbated by allegations that management was dismissive and failed to promptly address the issue, leading to discomfort for the affected residents. Such negligence raises serious alarms about the management's operational practices, specifically regarding tenant health and safety.</p><p>Furthermore, the lack of communication regarding pest issues raised concerns among residents who felt left in the dark. Affected tenants were not informed of the situation, which could lead to a spreading of infestation throughout the building. Experiences like these not only put residents at risk but can also contribute negatively to the community's reputation. Such instances suggest that while Affinity promotes a friendly environment, there are grave deficiencies that need immediate addressing to ensure resident safety and satisfaction.</p></section>"
  }
}