{
  "name": "Anacortes Property Management",
  "slug": "anacortes-property-management",
  "company_type": "Company",
  "address": "3005 Commercial Ave, Anacortes, WA 98221",
  "review_count": 37,
  "average_rating": 2.11,
  "reviews": {
    "google_reviews": [
      {
        "author": "Alexander Rasmussen",
        "rating": 1,
        "review": "Said my property needed painting when it didn't. Saved my self 1000's of dollars by going to look at the property myself to realize it didn't need to be painted. In other words.. I was lied too... Find someone else to manage your properties cause Peggy aint it.",
        "owner_response": null
      },
      {
        "author": "Joseph Taylor",
        "rating": 1,
        "review": "The rental itself is nice, one star because anacortes property managements Peggy is a insufferably unreliable human being.\n\nIf you need anything done outside of paying rent expect nothing because thats what youll get from this woman. No idea how shes allowed to work here when so many other reviews seem to have the same experience with this blob of a human.",
        "owner_response": null
      },
      {
        "author": "Mattie Powers",
        "rating": 3,
        "review": "Wish they were more responsive and attentive. Also wish that rent was able to be paid online. Checks are extremely inconvenient. This is 2024, nobody uses checke anymore.",
        "owner_response": null
      },
      {
        "author": "Kristie Wagner",
        "rating": 1,
        "review": "Unless you have perfect credit this woman(Peggy) wont even give you the time of day she is very rude and hard to get ahold of the office is hardly ever open . The one time I found the office open I went in and was asking questions and once it got to my credit  and she found out it wasnt perfect her demeanor completely changed to what I felt was disgust as if I was bothering her  so I left the office  would not recommend going to anacortes property unless someone new takes over management",
        "owner_response": null
      },
      {
        "author": "TINA C",
        "rating": 5,
        "review": "If you are looking for someone to keep up on your property, making sure it is maintained and screening renters for the best possible tenants, Peggy is the best one to do it. She is always making sure the homes she manages are in top notch condition. She is very Professional and communicates well with her tenants, customers and maintenance teams. I highly recommend APM.",
        "owner_response": null
      },
      {
        "author": "SANFRAN FAN",
        "rating": 1,
        "review": "Where do i start. This lady's unprofessionalism is the worst ive delt with ever. I have tried to call her multiple times with multiple left messages and refuses to call back. I have emailed her and doesnt return emails until 2-3 days later. Gives you an ultimatum on when she can meet you on her time not yours. I have on multiple occasions asked her to communicate with me on phone but you are not worth her time. Unless you have property you want her to manage she is at your beck and call if you are a renter in need of a rental good luck. I feel sorry for the property owners who are nieve or just dont care she is making them loose money because of her lack of compassion. I will look else where.",
        "owner_response": null
      },
      {
        "author": "Cesar Guzman",
        "rating": 1,
        "review": "Peggy is by far the worst. Takes her a few days to respond to emails, calls are not an option with these people and you have to work off of their schedule which is unfortunate if you work the same hours. I'd suggest she take a little more initiative maybe I wouldn't feel like giving a lower score than what I gave. If it wasn't already apparent I highly don't recommend you do business with them.",
        "owner_response": null
      },
      {
        "author": "Damon Anderson",
        "rating": 5,
        "review": "Seriously, by far the best property management Ive ever rented from. Quick response from property manager, issues that need dealt with or handled are promptly addressed and handled. Peggy is very nice and has been nothing but a pleasure to deal with.\n\nPlus, the place Im renting is the bees knees!",
        "owner_response": null
      },
      {
        "author": "Noirceuil LeSombre",
        "rating": 3,
        "review": "Good response time. Viewing unit was smooth and application process is quick. Overall - pleasant experience! Peggy is topnotch",
        "owner_response": null
      },
      {
        "author": "Jamezen DaVinci",
        "rating": 1,
        "review": "Believe the 2.2 Rating which seems too high for the 'Snooty' Can't be Bothered to give a potential client the time & respect that anyone should expect when engaging a Business of Serving Customers & Clients! Her Clients should know that their properties sit vacant while potential renters are continuously dismissed & ignored!",
        "owner_response": null
      },
      {
        "author": "Riot Ward",
        "rating": 1,
        "review": "Anacortes property management is a horrible company to go through. The worst person to deal with is Peggy... trust me you'll know when you see her she is the most untrustworthy person, and once you sign up to rent a place through her place of business you will most likely end up regretting it. She uses the fact that you dont want to ruin your credit as a tool to boss you around. Take my warning. DO NOT RENT THROUGH Anacortes Property Management unless you want to be treated as less than dirt.",
        "owner_response": null
      },
      {
        "author": "Pat N",
        "rating": 1,
        "review": "APM had by far the worst service I've ever experienced with any property management company. Calls and emails typically go unanswered, and it took weeks at a time for broken appliances to be replaced. They will happily cash your rent checks the day after you turn them in, however. I have told every friend moving to Anacortes to avoid doing business with them.",
        "owner_response": null
      },
      {
        "author": "Bradley Chappel",
        "rating": 1,
        "review": "She wouldn't let me have my DEAD Fathers  (Rod Chappel) things from his aptmt. She never returned my calls. It's been 1&1/2 years. I'm am the Only Living Son left. She told me she was going to put his, .MY. , possessions in the garbage. There where SUPER Important Documents there. I don't live there. I lost my entire inheritance because of her lack of communication.",
        "owner_response": null
      },
      {
        "author": "Jimmy Buday",
        "rating": 5,
        "review": "Best landlord ever. I needed something fixed it would be fixed.if I have the chance to rent from Peggy again  I would in a hart beat.I recommend Anacortes property management if your looking to rent.ive rented from Peggy for 5 years. And i would do it agin",
        "owner_response": null
      },
      {
        "author": "cole paddock",
        "rating": 1,
        "review": "peggy is the absolute worst ive called and called and called and she never answered i left multiple messages and she never called back except one time looking for someone else and when i said it was me she immediately hung up the phone..ive been trying to get ahold of her for probably 3 weeks cause im moving for a job and need a place to live and instead of calling me or answering the phone to tell me i wasnt approved she mails me a letter10/10 dont recommend going through her",
        "owner_response": null
      },
      {
        "author": "Hexah Hex",
        "rating": 1,
        "review": "Good luck getting that property you want. Doesn't call back and rarely responds to emails. The property you've been wanting to see or apply for will be gone before you can apply or arrange anything.",
        "owner_response": null
      },
      {
        "author": "Katie Montigue",
        "rating": 1,
        "review": "She basically never actually helped me with anything. Would not answer calls, and did not call me back. I usually had to contact the landlord for any issues. Would not recommend.",
        "owner_response": null
      },
      {
        "author": "Kristine Stultz",
        "rating": 5,
        "review": "Peggy is a wonderful, trusted property manager!  Highly recommend.",
        "owner_response": null
      },
      {
        "author": "Mary Jones",
        "rating": 2,
        "review": "They never answer their phones when tenants need them, no where to be found",
        "owner_response": null
      },
      {
        "author": "Araseli Bermudez",
        "rating": 1,
        "review": "Never picks up the phone, been out of a washer for a month its getting really annoying",
        "owner_response": null
      },
      {
        "author": "Kyndra Simmons",
        "rating": 5,
        "review": "Peggy has been very good to our family!",
        "owner_response": null
      },
      {
        "author": "Daniel brown",
        "rating": 5,
        "review": "We have  been very pleased with APM.",
        "owner_response": null
      },
      {
        "author": "Teresa Santos",
        "rating": 1,
        "review": "Damm, never pick up the phone!!!",
        "owner_response": null
      },
      {
        "author": "Chuck Boyd",
        "rating": 5,
        "review": "Very professional.",
        "owner_response": null
      },
      {
        "author": "Wellness Lady",
        "rating": 1,
        "review": "Not impressed.",
        "owner_response": null
      },
      {
        "author": "Peter Haggerty",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Norleen Koponen",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Ron Lindsay",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Wendy Sevieri",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Zack l",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Daniel Boyd",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Patrick Spear",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Padraic Nichols",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kathryn Shiohira",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Courtney Dodge",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "linda thomas",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kayla Darst",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 25,
  "adjusted_average_rating": 2.32,
  "distribution": {
    "1": 24,
    "2": 2,
    "3": 2,
    "4": 1,
    "5": 8
  },
  "summary": {
    "created_timestamp": 1739205393,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite some of the unfavorable reviews, there are a few positive aspects of Anacortes Property Management highlighted by users. A significant number of satisfied customers mention the effective management and maintenance of the properties, with Peggy often being commended for ensuring that homes are kept in top-notch condition. This is coupled with praise for her professionalism and effective communication with tenants, owners, and maintenance teams. Some tenants have shared their experience of quick issue resolution, making their rental experience comfortable. Examples include rapid responses from the property manager and immediate handling of any concerns or maintenance requests.</p><p>While positive reviews are fewer in number compared to negative ones, they emphasize that for some clients, their experience with Anacortes Property Management has been stellar. For instance, one reviewer mentioned experiencing a smooth application process with a quick response time, while another found Peggy to be a very nice and pleasant individual to work with. These highlights indicate that while issues persist, there are successful interactions and positive experiences with the company as well.</p></section><section id=\"great\"><h2>Great</h2><p>The 'great' reviews for Anacortes Property Management, though sparse, shine through with glowing commendations for the quality of service provided by Peggy. One user review celebrates her as \"the best property manager\" they've ever rented from, citing her promptness and effectiveness in addressing concerns. The reviewer describes their place as worthy-of-praise, delighting in Peggy’s attentiveness, which they claimed significantly enhances their living experience.</p><p>Another satisfied tenant echoed similar sentiments, acknowledging Peggy's reliability in maintaining property standards and delivering excellent service over a period of five years. This loyalty and continued preference for her management style underline the positive impacts she has had on certain tenants. These reviews illustrate the capacity for excellence held by Anacortes Property Management, as experienced by those who encountered timely and effective service.</p></section><section id=\"bad\"><h2>Bad</h2><p>Many user reviews highlight communication issues as a significant downfall of Anacortes Property Management, with frequent mentions of unreturned calls and delayed emails. For instance, several users expressed their frustration with the management’s lack of promptness in responding to inquiries and addressing maintenance requests, leading to unnecessary delays and inconveniences. One specific case involved a tenant needing urgent repairs, which took weeks to initiate, showcasing a gap in service delivery for urgent maintenance issues.</p><p>Beyond communication, other aspects of concern include the perceived rigidity in scheduling and the challenges renters face in coordinating viewings or applications. There are reports of properties not being shown on time and essential information not being communicated effectively, leading to missed opportunities for potential renters. Some users mentioned their experience of dealing with a closed or inaccessible office, which compounded their difficulties in reaching the management team and resolving pertinent issues efficiently.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The reviews within this section paint a particularly negative picture, with some renters expressing severe dissatisfaction and distrust towards the management. One reviewer recounted their experience where they felt neglected over critical personal matters, involving delayed communication that resulted in significant personal losses. This sentiment is further echoed by others who felt dismissed or ignored by Peggy and the management team, leading to a perception of unprofessionalism and disrespect from the company.</p><p>Adding to these concerns is the allegation of dishonesty, as highlighted by one user who felt misled regarding property maintenance needs. There are repeated mentions of experiencing rude behavior and a lack of empathy from the management, which further alienates tenants and potential clients. This behavior, coupled with unmet basic expectations such as maintenance handling and communication transparency, contributes to the strong negative sentiments expressed in these reviews. These accumulated negative experiences significantly tarnish the image of Anacortes Property Management among dissatisfied clients.</p></section>"
  }
}