{
  "name": "Andrea Ridge",
  "slug": "andrea-ridge",
  "company_type": "Property",
  "address": "939 20th St, Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 3.5,
  "reviews": {
    "google_reviews": [
      {
        "author": "Danny Ngo",
        "rating": 2,
        "review": "Awful parking. Units look nice but are very cheaply made. Heat does not contain in the unit during cold winters. Walk ways on stairs usually pools resulting in ice and slippery conditions. Only 2 washers and dryers for tenants that they charge for.",
        "owner_response": null
      },
      {
        "author": "Rachel Rothberg",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 2.0,
  "distribution": {
    "1": 0,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739094988,
    "text": "<section id=\"good\"><h2>Good</h2><p>While there are limited reviews available, one tenant has indicated a positive experience at Andrea Ridge, noting a satisfactory overall impression of the property. This suggests that some residents may have found aspects of their living experience enjoyable, encouraging others to consider it as a potential rental option. Positive experiences related to amenities or community aspects, although not detailed, could contribute to the property's appeal.</p></section><section id=\"great\"><h2>Great</h2><p>Unfortunately, the reviews for Andrea Ridge do not provide significant detail that would reflect a \"great\" category. There is one five-star rating, but it lacks any accompanying text or context that would explain what made the experience so pleasing. Without specific praise in the user reviews, it’s challenging to highlight aspects that could be categorized as extraordinary or exemplary.</p></section><section id=\"bad\"><h2>Bad</h2><p>The sentiment among the user reviews shows a notable concern regarding the infrastructure and maintenance of the property. One user expressed dissatisfaction with the parking situation and highlighted that the units appear appealing but are poorly constructed, leading to issues such as inadequate heating during cold weather. Additionally, concerns regarding the limited availability of washers and dryers for tenants further illustrate management's neglect in addressing the basic needs of residents.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Significant safety concerns were voiced by a tenant who pointed out that walkways tended to pool water, which created hazardous icy conditions. Such neglect of maintenance can not only affect tenant satisfaction but also poses risks to safety. Moreover, with management not responding to any reviews, it raises worries about their engagement and accountability towards tenant issues and concerns at Andrea Ridge.</p></section>"
  }
}