{
  "name": "Apex Property Management",
  "slug": "apex-property-management",
  "company_type": "Company",
  "address": "2020 Pacific St Bellingham, WA 98225",
  "review_count": 52,
  "average_rating": 1.52,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Maggie A.",
        "rating": 4,
        "review": "I recently moved out of my apartment after renting through Apex for 3 years. We never had a single problem! Our maintenance requests were met promptly, and we received kind emails about storm/weather warnings. I loved being able to manage my account online including electronic payments, being able to split payments with my roommate, and filing requests online as well. Every time I called, I received a call back promptly. The property itself was maintained well, with regular lawn care and pleasant gardening. My parking pass fell off of my mirror, and I received a polite call to confirm that there wasn't an unauthorized vehicle in my parking spot. I appreciated them checking and not being blamed for my pass falling off!\n\nAfter hearing stories of apartments ripping tenants off and charging for every little thing, we didn't expect to get a penny back of the damage deposit.\nHaving taken over a lease, we were responsible for any damage since the previous tenants took over, who had been there a few years themselves. We were not over charged for anything! Apex was very fair in assessing the damage to the apartment, and we actually received back much more than we thought.\n\nAfter moving out, I had a USPS package delivered to our old address. Apex staff were extremely kind and helpful with allowing me to check out a mail key to retrieve my mail.\n\nI would have no problem renting from them again, and am really surprised about the negative reviews that were left.",
        "ownerResponse": null
      },
      {
        "author": "Eliza G.",
        "rating": 1,
        "review": "They only hire idiots. They will not pick up the phone. They will let mold grow in your apartment and do nothing. They will do everything they can to scam more money out of you. Most predatory company I've ever dealt with. Horrible business, horrible people with no integrity working there. Do not rent ever",
        "ownerResponse": null
      },
      {
        "author": "Leah T.",
        "rating": 1,
        "review": "Literally the worst company I've ever rented from. Blatantly ignore maintenance requests. My ceiling has leaked on and off since I moved in. There was a BAT in my apartment and they never came to patch the spot where it got in. And now on top of all that, they are showing my apartment in the middle of a pandemic. \n\nAlso, their apartments are really overpriced for the quality. I'm in an old building and nothing has been updated. My shower is a trickle of water.\n\nAvoid Apex at all costs!!",
        "ownerResponse": {
          "text": "Hi Leah,\n\nWe are sorry to hear you have experienced difficulty with maintenance requests. We encourage you to reach out to our office directly to discuss these issues, as providing a safe, clean, well-managed home to our residents is our number one priority.\n\nThank you,\n\nApex"
        }
      },
      {
        "author": "Zackary F.",
        "rating": 1,
        "review": "If you can avoid renting from them you should. Lived in one of their apartments for a little over a year. The first red flag should have been the flyer they send after signing the lease saying to ignore bad online reviews. The apartment was ready three weeks after the prospected move in date causing me to have to foot a hotel bill. They offered to rent a storage locker, I asked if that could be instead compensated toward the hotel stay. It was only $130 which covered maybe one night. After moving in they argued they never agreed to that and I had to forward them their own emails to prove it. \n\nIf you ran the heat and the dryer or washer you could expect to have to flip the switch as shorts were common. No visitor parking what so ever. \n\nUpon leaving they give you an estimate of their cleaning fees which is obviously set up so that they can deny your deposit. They included cleaning the blinds and estimate that at $100 + for example. Meanwhile when we moved in there was still saw dust from the construction in all the cabinets and our apartment number written on the counters. Along with faceplates missing on electrical outlets and missing screens on the windows. The electronic pass to get into the building rarely ever worked and the doors would be constantly jammed shut. \n\nWould give zero stars if possible.",
        "ownerResponse": null
      },
      {
        "author": "Ali L.",
        "rating": 1,
        "review": "They charged us for way too many hours of cleaning. We left our apartment way cleaner than most people do. They also want to charge ridiculous amounts for pets and are not very helpful if anything breaks. They basically blame you for anything that breaks even if its not your fault. I understand that some tenants are bad, but they treat everyone like theyre a bad tenant.",
        "ownerResponse": null
      },
      {
        "author": "Jim S.",
        "rating": 1,
        "review": "It's been two months since I wrote Apex the first time (with a second letter one month ago) and still no reply.  All I want is to understand how they prorate rent on a partial month since I believe they overcharge by an extra day.  \n\nIn addition, the lease does not state that the charge to clean the apartment after moving out is automatic.  Even though I had the place thoroughly cleaned to a condition better than when I moved in, they still sent in a cleaning crew without any review by the management team.  \n\nAll and all, they are the worst property management group I've ever known.  Unless you like being overcharged and don't mind a total lack of response to your questions and concerns, avoid this property manager.  As mentioned by other reviewers, I'd give them zero stars if I could.",
        "ownerResponse": {
          "text": "Hi Jeff,\n\nWe are sorry to hear you had an unpleasant experience renting with us. Your concerns have been communicated to management, and we would love to address issues pertaining to move out charges and prorated rent with you. Please feel free to call our office any time before 5:00pm and we can discuss further. \n\nThank you,\nApex"
        }
      },
      {
        "author": "Nate H.",
        "rating": 1,
        "review": "Just had my keys locked in laundry room (locks behind you). And there solution is to pay them $75 to come out and unlock... they are less then 10 miles away haha",
        "ownerResponse": null
      },
      {
        "author": "Elisabeth S.",
        "rating": 1,
        "review": "I found it quite interesting that after we moved out, only living there for 4 months because the condo owner sold the place, that they charged us pretty much our whole 900 dollar deposit. Mind you, I filled out a move in checklist with the damages already there, and they still charged us for it. When I called to handle it, they said they would refund us those mistakes. 3 months later, I am unable to reach them, nor have got the refund for charging us for things we didn't do. I have called at least 15 times. Apparently the manager is never there. I'm pretty upset. \n\nI have my attorney on board, and luckily I was smart enough to make copies of all the documents along with pictures. Once this pandemic blows over, they'll be hearing from me for the 20th time.",
        "ownerResponse": null
      },
      {
        "author": "Eliana D.",
        "rating": 1,
        "review": "DO NOT RENT FROM THIS COMPANY. Honestly the worst experience of my life and my roommate and I have gotten screwed over by them so many times. On top of everything, even if you want to end your lease early and you find new tenants to take over your apartment, they still charge you $250 per person to move out early... even though they're not missing out on any rent or anything.\n\nAll in all, they will find ways to take every penny you have. Definitely would not recommend this place to ANYONE.",
        "ownerResponse": null
      },
      {
        "author": "Marcia L.",
        "rating": 2,
        "review": "Students,\nTake a video of your apartment before you turn in your keys!!!!!  They will charge you for cleaning the entire apartment if one crumb is left on the counter.  Plus document how clean it was before you move in.  Do not use pictures use video and voice describing every speck of dirt you see.  They will do it to you on move out.  We spent hours cleaning the apartment and left it in excellent condition.  We cleaned the window tracks and everything but all of a sudden there was a lot of dirt in the windows in their move out video.  Something fishy here.",
        "ownerResponse": null
      },
      {
        "author": "Erika F.",
        "rating": 1,
        "review": "Every single week, our dumpster overflows. Every single week I complain to Apex. After 5 weeks, no action has been take to resolve the issue. They did recently have someone clean up the trash after collection, but every Monday this is the state of our parking lot and trash area.",
        "ownerResponse": null
      },
      {
        "author": "Bruce R.",
        "rating": 1,
        "review": "I have to second the poor reviews citing communication.  We had expressed strong interest in renting a location and asked about seeing the inside. Was promised that they would check with the existing tenant and call us on a certain morning to confirm so that we could drive from Seattle to Bellingham to look at the home. Nope, no call. Just left us in the lurch. Not even the courtesy of a response. After I called the office I was told the person who was supposed to be connecting with us that day wasn't even in the office and didn't answer their cell phone. They've never voluntarily reached out; you have to contact them every time. So, I would not take the chance of renting a property managed by Apex; just don't trust them.",
        "ownerResponse": {
          "text": "Hey Bruce, \n\nI'm sorry you had a difficult time coordinating with one of our agents for a showing! We try to avoid these situations, and would love to discuss details of this incident further in order to better serve you in the future!\n\nThank you,\nApex"
        }
      },
      {
        "author": "Stacy B.",
        "rating": 1,
        "review": "I received a letter in my email today advising me that they found a plastic bag in the cardboard recycle with my \"information in it.\" In this email they are threatening to give me a 10 day notice to vacate if it happens again which \"has fees associated with it.\" This is just one of a long string of passive aggressive notices I've received in the year and a half living in one of their units. None of the previous notices were precisely directed at me - but rather, any time any of the tenants commits even the slightest perceived transgression, everyone in the complex gets a letter about it.\n\nSo what you have here is a company that will GO THROUGH YOUR TRASH, find in the cardboard recycle a \"plastic bag,\" probably which was attached to a cardboard box that contained a shipping receipt, and then THREATEN TO EVICT YOU OVER IT.\n\nThis is by far not the first time I've heard of them rifling through people's garbage. It's merely the first time I've experienced it first hand.\n\nDo not rent from these people.",
        "ownerResponse": {
          "text": "We do not go through trash unless it is NOT properly placed in the garbage area.  The \"threat\" of a fine is merely a statement stating we will fine if the tenant continues to improperly throw away their trash.  In this case, sounds like we weren't fining but would if the problem continued.  As for the blanket letters, there are times we do not know who is causing the problem or there are enough people contributing to the problem that we want to send out a reminder of the rules.  Violation of this rule will cost the owner of a building more money to upkeep and maintain the premises.  Since rents keep rising, we are trying to keep costs low so the rents do not need to increase beyond what they already are."
        }
      },
      {
        "author": "Jim S.",
        "rating": 1,
        "review": "Dealing with this firm has been difficult.  Simple requests are never answered and the response time when they do answer a question is very long.  It is not uncommon to wait several days just to get a simple piece of information about utilities.  Given all the negative reviews I've read, I don't expect my rental for the coming year to be a pleasant experience.  If they prove me wrong, I'll certainly update this first impression review.",
        "ownerResponse": null
      },
      {
        "author": "Patrick W.",
        "rating": 1,
        "review": "If you need maintenance on anything in a property rented from Apex, then you are pretty much out of luck.  In almost every maintenance issue I've had with them so far, they either send someone out who will tell you the problem doesn't exist until you've called them out for it two or three times, or they will tell you it isn't their problem because they're just there to take your money and you should talk with the property's owner.  This last time, I called them a week before about a broken cable socket that kept me from hooking up my internet connection.  They marked the maintenance request as solved even though it wasn't, and I never heard back from them.  My wife had to order the parts and fix the problem herself.  When they finally did get back to me, they just blamed it on the owner of the property.  This happened when my garbage disposal was leaking, my toilet was broken and the washing machine flooded our entire apartment.  This is not a one time fluke event, and you too will experience this at some point when renting from them.",
        "ownerResponse": null
      },
      {
        "author": "Courtney C.",
        "rating": 1,
        "review": "If I could put negative stars then I would, and I don't even live in their buildings. My boyfriend, however, does. This is the complete and utter most useless company I've ever experienced. They give zeros care in the world for their properties and even less for there tenants. There are legitimate squatters in my boyfriend's building, and we tried for weeks just to reach someone at apex, now that we have been able to talk to someone they refuse to do anything about it. These squatters have taken up four parking spots at times ( the lot itself is tiny), they flick lot cigarettes off of the balcony, and they have even threatened the tenants who pay to live there. We had a neighbor move out because these people were too loud and the blast music all hours of the night. Does apex care? No. Another reason that they are probably the all time worst property management to live under is that they either refuse, or drag they're feet for so long when you have a maintenance issue. My boyfriend's microwave and garbage disposal both stopped working and it took apex almost a month to send someone over. I would avoid this company like the plague. Absolutely do not recommend.",
        "ownerResponse": null
      },
      {
        "author": "Conner J.",
        "rating": 1,
        "review": "This lease with them is ridiculous. Apparently if you decide to get a pet, you better make the decision before you sign the lease because otherwise you have to wait until it is time to renew in order to get pet approval. This is not smart on their part because it is asking for people to go behind their backs with pets and not pay a deposit at all. If someone wants to get a pet part way through their lease, and decides to be a good tenant and follow their stupid 1 indoor cat per apartment policy, and get approval from them before getting the pet (meaning paying a $300 fee), they should be allowed to do this at any point during the lease. Furthermore, might I point out, that the tenant will likely stay longer if they pay this fee because otherwise they have to pay the fee again at their new apartment. Also, if the tenant decides to move out anyways, they would be giving Apex a $300 fee while having the pet for less than a year.\n\nThis is such a stupid policy, and if Apex decides to change it I will improve my review of them, but I am very disappointed. There are so many cats and dogs without homes and if people are willing to treat their new cat or dog lovingly enough to pay such a high fee and allow them to live with them without being worried about them going over to the windows and risk being seen, Apex should respect that.\n\nI am not even saying that they should make all of their apartments accepting of pets. I completely understand that the owner of the apartment complex has a say in this as well and that is why the policy depends on the complex. I am simply saying that they should allow tenants to pay them $300 to have one indoor cat in their complexes that are accepting of cats, without having to wait for when they are about to renew their lease.",
        "ownerResponse": null
      },
      {
        "author": "CR F.",
        "rating": 1,
        "review": "Run as far away as you possibly can. If I could, I would give zero stars. This management is absolutely ridiculous. I received a voicemail today stating that I am going to be fined because I have a small hummingbird feeder suction cupped to my window. I've heard of countless other stories about people being fined for other insane things. They have no regard for the bigger picture. Spread the word, boycott Apex.",
        "ownerResponse": {
          "text": "It certainly may seem that we have an excessive amount of rules, but all rules are there for the benefit of the community as a whole. What may create enjoyment for one may cause a nuisance for another. The fines are there if someone refuses to comply. We manage many properties, and in the past we have had issues with the problems bird feeders cause. Not only do they attract birds, they can attract other unwanted animals and insects. These birds and animals leave behind feces on patios, decks, sides of buildings/windows, and roofs. The bigger picture here is this: These issues cause it to be more expensive to keep the communities our tenants live in clean, which increases overhead costs and inadvertently increase rents. With this is mind, we decided to not allow bird feeders at our properties and made this a policy in our lease. In this instance, we never said we were going to fine them, and they were not fined. We gave this person a verbal warning so that they could comply with the terms of their lease to avoid a fine. To reiterate, this policy isn't to hassle tenants. It is to create a respectable living environment, keep premises clean, and keep costs low for everyone. However, if any of our tenants want to have a conversation about our policies, we are open to revisiting our policies and seeing how we can better serve our tenants. But at the end of the day, we must be consistent with enforcing our policies with every tenant."
        }
      },
      {
        "author": "Katie F.",
        "rating": 1,
        "review": "At first, I tried to give Apex the benefit of the doubt.\n\nNow, I have completely changed my mind.\n\nI received my security deposit back today, which was originally $1,050. My roommate and I deep cleaned the apartment prior to vacating (allow me to preface this by saying I received about $450 on a $725 deposit for my last tenancy with them, and I didn't clean at all when I left). \n\nWe received $200 back. Yes, $200. Apex states that it cost $350 to patch tack holes in the wall, $240 for eight hours of cleaning, and $175 for carpet cleaning.\n\nThe second two listed above MIGHT be justifiable, but $350 for patching tack holes throughout our apartment is nothing short of absurd. \n\nStay far, far away from this corrupted company, unless you want to get charged ridiculously exorbitant amounts at move-out.",
        "ownerResponse": {
          "text": "It would be helpful for this person to let us know the unit.  We take videos of the move outs and I would be willing to post the move out video.  We do not charge $350 for just patching holes.  That charge probably included painting as well and that charge tells me there was excessive nail holes or other damage on the walls.  Again, without the exact unit so we can defend these claims, seems unreasonable.  It is very easy for people to say how unreasonable we are yet give no specifics.  In addition, if we made an error, we would appreciate a chance to correct it."
        }
      },
      {
        "author": "Maggie R.",
        "rating": 5,
        "review": "I lived in Apex's Gateway apartments for 2 years and had nothing but positive experiences. While other Bellingham rental agencies fail to answer the phone or get back to correspondence, I always spoke to a representative immediately who was able to help me and Apex promptly responded to my maintenance requests or emails.\n \nI loved that I could pay my rent online rather than mailing a check every month, and I also appreciated that each unit was allotted 2 parking passes, while some other facilities only allowed one per unit. \n\nMy apartment was sizable with a reasonable rent amount. When I moved out, I used the provided checklist and was awarded almost all of my deposit - an extremely rare occurrence with college rental agencies. I was shocked by how honest their billing was and felt that their mandatory cleaning fees were fair.\n\nApex also went above and beyond with the outdoor maintenance and landscaping at my apartment complex. They had a staff out at least once per week to maintain the grounds and they even took the time to salt all of the walkways and stairs when it snowed. I appreciated that.\n\nMy only complaint about living at Gateway was the tight parking situation and complete lack of guest parking. Friends were forced to park across the street or take the bus from campus if they wanted to visit.",
        "ownerResponse": null
      },
      {
        "author": "Taylor H.",
        "rating": 1,
        "review": "I did not have any issues with Apex until about two-thirds of the way through my lease at \"The Meadows at June Road\", but the issue I have encountered recently is substantial enough that it warranted an extremely negative review. When I signed my lease at this property there were at least 30 spaces for guest parking, which is VERY important considering there is no public places to park within a mile of the property.  Beginning today (June 1st, 2018) Apex decided to remove EVERY SINGLE guest parking spot on the property, leaving no place for guests to park at all in the area. This wouldn't be a huge issue if the property had any remotely close parking for guests, but that is not the case.  It is unrealistic to expect anyone to be able to handle having no place for anyone to park in the area.  UNLESS YOU HAVE NO FRIENDS, FAMILY, or any visitor EVER do not live at the June road property.  I would also not recommend renting from apex in general because you never know when they might screw you over like they have for hundreds of tenets currently at the Meadows",
        "ownerResponse": {
          "text": "We completely understand the frustration with parking.  This is often the case at many of our buildings.  We do NOT OWN any of the properties we manage.  We do NOT make any decisions regarding construction or development of these properties.  In this case, the property was starting phase 2 of the project and we were told by the owners / contractors of the project we would be losing 8 parking spaces.  As such, we had to eliminate guest parking.  HOWEVER, we did go through each and every lease to make sure each unit had a space for each bedroom they had in the unit up to the number of actual cars they had. This ensured each had a parking space.  Unfortunately, to do this, all guest's spaces had to be eliminated.  In about 3 months, we should get back many of the spaces once the initial infrastructure of phase 2 is complete.  Tracy Maxwell, Broker"
        }
      },
      {
        "author": "Rebecca H.",
        "rating": 1,
        "review": "This company charges renters $45 for the app, $25 for the co-app, then adds $100 to the lease as some bullshit fee, makes them jump through hoops like a circus monkey, and has bullshit policies that could require you to rent apartment withouse seeing it beforehand and then stated I could lose the apartment if I didn't get them a holding deposit within 12 hours of being approved. I loved the apartment I applied for, but extracting $170 from a renter just to have to deal with this company is bullshit and doesn't put the needs of a renter first. Moving is one of the three biggest stressers and can be expensive, and this company doesn't seem to have much compassion. Total shame, the apartment was rad.",
        "ownerResponse": {
          "text": "When applying for a unit, we state do NOT apply unless you have seen the unit. In addition, we state, once approved, you will be required to pay the holding deposit within 12 hours.  These policies are not new. If you did not follow the policies, I am sorry.  Many people have seen units already and do not want to wait in line.  This time of year our appointment calendars fill up weeks in advance. It is not fair to someone who has applied for a unit that has followed the rules to see it to make them wait 2 weeks to allow a person who applied without seeing it time to schedule an appointment.\n\nAs for the application fees, we get charged to run credit / background reports.  In addition, I pay employees to run these reports as well as gather rental and employment information.  If you applied for something that is NOT available, we refund everything.  However, these fees are used to reimburse our costs."
        }
      },
      {
        "author": "Cecelia C.",
        "rating": 1,
        "review": "Property Owners beware when hiring this company to manage your home.\n\nEthics and morals are not of any concern only what is in the contract.\n\nMake sure you cross out this line on your property management contract. Page 3 section B item 1. Owner agrees to pay to agent this monthly commission for the duration of any leases procured by Agent whether or not this agreement is still in effect. \n\nApex provided notice that they were canceling the contract and then charged the remaining of the balance of the lease. This happened to a friend of mine. Watch out!!! \n\nThey can and will cancel your contract at anytime and still take their money.",
        "ownerResponse": null
      },
      {
        "author": "jana h.",
        "rating": 1,
        "review": "Unfortunately I will need to add my negative review to the throng of negative posts from post renters for this company. They do not send a legal ledger detailing what was charged to you after you vacate your apartment and they charge extraneous fees for everything little thing. I knew this going in but I had no choice but to take the first thing because I flew in from New York and only had a limited time to find a place. Also Julia, who handles the finances will hang up on you if you disagree with her on the charges. I took 8 hours to thoroughly clean my unit And I am a very clean and neat person generally speaking. I took pictures of all the walls and apex is saying there are holes on the walls. Not sure how this is possible if we never hung anything on the walls and I have pictures from vacate date that shows no holes. Has anyone taken them to small claims court yet?",
        "ownerResponse": {
          "text": "Our move out ledgers detail each item.  In addition, we do take a move out video of the condition of the unit in case there are issues we need to revisit.  If this person would like to contact me and provide her rental address, I can revisit the issue for her.  The person she refers to in this post has not been with our company since June 2016"
        }
      },
      {
        "author": "Molly H.",
        "rating": 1,
        "review": "Found their staff to be unfriendly and their website information unreliable. Wouldn't recommend them at all, Bellingham has many more rental places to go through.",
        "ownerResponse": {
          "text": "If there are instances we could improve, we would welcome constructive comments that are more specific to actual situations."
        }
      },
      {
        "author": "Bryan D.",
        "rating": 1,
        "review": "Immature company that's doesn't know how to handle people, pretty much will tell you to take a flying leap if there is any sort of problem. Tried to resolve a simple parking situation, very limited Parking in the tremont neighborhood, they danced around the whole thing like a clown performing infront of the president. People skills, need to train companies on people skills and common sense. A simple courtesy note, you would be surprised on what that does, just saying.",
        "ownerResponse": null
      },
      {
        "author": "Luke S.",
        "rating": 1,
        "review": "I wish I could give this place zero stars, from their website to their employees everything is very misleading. I was very unhappy and would not recommend this unfriendly place to anyone.",
        "ownerResponse": {
          "text": "Without much to go on, hard to comment or solve a problem.  However, based on the post date, we get many apps per day and units go quickly in May.  What may be on the website one day is not available the next and we cannot update the website in real time as quickly as we process these things.  This process often upsets people when the unit is no longer available even if there application fee is refunded if the unit is no longer available.  In addition, sometimes people do not read all the application criteria carefully and get denied to rent.  This again will upset people and in these cases, the fee is not refundable.  We try hard to keep things current and make sure people know all the criteria for applying."
        }
      },
      {
        "author": "Charlie C.",
        "rating": 5,
        "review": "UPDATE: About a week after I posted this review, they went through the common areas of my complex and cleaned, painted, and patched holes. I now have nothing to complain about. Thanks!!",
        "ownerResponse": null
      },
      {
        "author": "Emma B.",
        "rating": 1,
        "review": "Trying to get a hold of my property management company and I can't leave a voicemail because the girl who did the message literally said \"...and I don't remember what I'm going say for the rest of this voicemail and I can't go through my notes fast enough\" with no beep or tone so I don't know if it would have recorded any messages, either way VERY unprofessional. Also been closing their office early every day due to weather which honestly would be fine if they had after hours things set up, like yesterday I was in dire need of a tow truck (it was 3:30, Apex would have been open under normal circumstances) because a non-tenant (permit only) was parked in my RESERVED parking spot. This inconvenience had me parking on the street (got stuck in the snow in an illegal no parking zone just outside my apartment) while the illegal non-resident parked in my spot right out front. I tried to call ASAP towing but was unable to get the illegal car towed because I wasn't an authorized tower from the property management company. Try setting up some after hours calls that could deal with this type of situation! And fix your voicemail!",
        "ownerResponse": {
          "text": "This tenant also sent an email regarding the voicemail.  When my employee tried to set it up, she didn't think it was recording and it wouldn't let her change the message.  When we found our error, we immediately changed.  We are sorry for the issue."
        }
      },
      {
        "author": "Jodie P.",
        "rating": 1,
        "review": "PARENTS OF WWU STUDENTS! PLEASE be aware that about a month ago my daughter came home to a note saying that they would be entering her apartment within a few hours. I believe there is a standard 24 hour notice that should be given. (And a note on the door is quite questionable - in fact dangerous) We will be referring all our friends and associates other properties.",
        "ownerResponse": null
      },
      {
        "author": "G T.",
        "rating": 1,
        "review": "Unimpressed and pretty disappointed to be honest. Been living here for less than a week and have already had numerous problems. We moved into a brand new apartment complex and they've already changed our address around on us 3 times. Also couldn't get my electric service started for the past 2 weeks because of it. The complex itself is nice with the exception that guests apparently aren't welcome. There's no guest parking, only permits allowed. You really can't park anywhere without the possibility of getting towed. Too bad we signed a 12 month lease...",
        "ownerResponse": null
      },
      {
        "author": "John T.",
        "rating": 1,
        "review": "If you're a college student looking for an apartment in Bellingham I highly suggest you look elsewhere. The landlord is not very understanding and staff can be a pain to work with as stated elsewhere. Not to mention many of the units have outdated appliances which are in constant need of repair and who knows you may even be knocked some random contractual fee if your lucky.\n\nMy main beef with Apex is there seemingly shady means of finding ways to charge tenants. Recently a friend visited with his extremely well cared for and friendly boxer. As a tenant I was perfectly aware animals were not allowed to live on the premises of the apartment however, the landlord himself was standing in the parking lot and said not a word as my friend decided to let his dog come up for a second instead of sitting in the car so we could eat quick. This subsequent 3-4 minute visit turns into a 300$ fine which as a college student is back breaking. The landlord did not even sympathize with the fact that it was a friend visiting or the fact that he watched the dog climb three flights of stairs before entering my apartment so he could knock and issue the fine. With prior property management companies i've worked with they've shown legitimate people skills and actually will want to work with you. Keep looking you've been warned",
        "ownerResponse": {
          "text": "An unleashed dog was seen going into this unit.  This person was not stopped before going into the unit because the manager was not sure what unit they were going into.  There are some people that have legitimate service pets and we need to determine the unit involved.  Once the unit was determined, the manager did knock on the door and explained the violation.  Per our lease, it states \"no pets of any kind, even temporarily...no guest pets.\"  This language is clear.  The fines are hefty because when we have simply asked \"please do not do something or make the fine really small, some people tend not to follow the rules (we know because the fine used to be much smaller).  We have a large fine because we have a responsibility to the owner of the building to limit the pets or any other issues that may cause damage to units.  In addition, we state no pets even temporarily because we are not in the business of determining who is telling the truth about the temporarily visit or if the pet was in fact a frequent visitor.  Pets can cause significant damage to units.  There is a liability involved with a dog on the premises if he bites someone.  We also try to maintain certain units as being completely free from pets because a future tenant may be allergic.  If we are unaware of what pets are in the units, this causes problems for another.\nAt the time the pet was found, the manager did state the fine but if the tenant wished to write a letter or discuss the circumstances further regarding the pet, the manager would be open to further discuss of the fine.  This letter was never received and a call was not made.\nTo maintain integrity of the Lease, rules must be followed.  We also have to keep rules the same for everyone.  We cannot allow one to break them without any penalty but someone else is charged a penalty.  Our staff is not in a position to determine validity of stories (we hear them all).  Our fines do not mean we do not understand and do not care.  \nOur lease is on our website and anyone can read it before applying.  If someone feels rules / fines are too strict or do not want to comply, they certainly do not need to apply.  We do NOT own any of these buildings.  Owners entrust that we will keep the units in good shape and maintain a peaceful environment for all tenants. These are NOT random contractual fees.\nAs for our staff being difficult to work with, we have received more compliments than I can count regarding how friendly we are.  At times, if we seem difficult, it could be the person initiating the conversation is making things difficult.  Are we perfect all the time - NO.  During certain times of the year when we have a lot of people going in and out of the office, we are not always at our best.  We are human.  But overall, we do try very hard and try to be as helpful as possible...we just ask you follow the rules."
        }
      },
      {
        "author": "Kristin Z.",
        "rating": 1,
        "review": "Careful if you choose to rent from this  company.....rented from them for only one year.....the move out charges were excessive and unreasonable. It says  \"less normal wear and tear\" yet they made up stuff to charge as much as they could in order to not return the deposit....we left the unit spotless (I know all about cleaning a unit since I managed apartments for several years).....they put stuff on there totally uncalled for. They even charged for light bulbs yet I left more light bulbs than were needed, not to mention I had to replace an expensive specialty light out front upon move-in. They charged to clean the dishwasher that was never used....it was like they just checked off things they thought they could get away with. They even charged for rent a day, but keys were turned in on time (early even)....I don't get it......Just beware....if you rent through them, expect to be ripped-off upon move-out!",
        "ownerResponse": null
      },
      {
        "author": "Jodi B.",
        "rating": 4,
        "review": "Our son signed a lease with Apex, intending to move into a lovely apartment several months later (he is a college student). Unfortunately, a very short time after signing  there was an unexpected glitch and arrangements needed to be reconsidered. \n\nThrough-out my conversations with the staff at Apex, I encountered pleasant, friendly and professional individuals -- calls were returned promptly, requested information was provided, and if not immediately known, was researched and quickly relayed to me, and follow-through was always complete and done without prompting. And while I knew we had signed a lease and it was necessary that Apex hold us to it in order to be fair and equal to all tenants, I greatly appreciate their willingness to discuss the matter and help us find a solution to alleviate our concerns.",
        "ownerResponse": null
      },
      {
        "author": "David J.",
        "rating": 4,
        "review": "I've read a lot of reviews from Apex across the internet, and I'm fortunate to say that my experience has been far from what one would expect. My apartment complex is very well maintained and whenever there has been an issue and I brought it up to them, they are as quick to resolve the issue.\n\nMy current lease ends in about 3 months and if I were staying in town, I would stay with Apex again.",
        "ownerResponse": null
      },
      {
        "author": "Caitlin H.",
        "rating": 5,
        "review": "I recently moved out of one of the 330 32nd St studios that I'd been renting for the last two years, and I had a great experience! The area the apartment is in was quiet, and even though I regularly came home after dark I never once felt unsafe. The property was well maintained, and the garden and trees were beautiful. All the appliances worked great, and when I did have issues maintenance resolved them promptly and never gave me any charges I felt were unfair. The online portal for tenants was so convenient for making payments and worked great. The building was extremely soundproof - I almost never heard my neighbors even when I knew they were home. I had heard that it might be difficult to get my deposit back, but I followed the cleaning checklist they provided and I got almost all of it back. If you're looking for a place to stay in Bellingham I highly recommend going with Apex.",
        "ownerResponse": null
      },
      {
        "author": "Megan B.",
        "rating": 1,
        "review": "This company is the most unprofessional property management company I've ever encountered. They take advantage of young renters and use bully tactics to unlawfully keep deposits.",
        "ownerResponse": null
      },
      {
        "author": "Kristen A.",
        "rating": 5,
        "review": "I lived in a studio apartment downtown owned by Apex for two years. They were a very professional and friendly company to rent from. In addition they were very good about giving plenty of time to inform tenants of any upcoming changes and how they directly effect me. The building was very clean, I always felt safe, and all lights were promptly replaced in the hallways. If I lived in Bellingham, I would definitely rent from them again.",
        "ownerResponse": null
      },
      {
        "author": "Sheridan S.",
        "rating": 1,
        "review": "I couldn't even schedule an apartment viewing with Apex due to the incompetency of their receptionist. She kept making excuses instead of apologizing even though the issues were her fault (forgot to post notice, screwed up her calendars, etc.) and when I tried to call her on making us reschedule 3 times she tried to tell me she hadn't. \nEven after I read bad reviews I decided to give them the benefit of the doubt, but no, they were just as terrible as everyone has said. Don't bother even calling.",
        "ownerResponse": {
          "text": "I am very sorry this person had issues with our scheduling.  We try to do our best and the front receptionist works very hard and has to multitask lots of things in her position.  We schedule over 1000 appointments during a 3 month period and yes, due to volume, we make mistakes.  We constantly re-evaluate our procedures to try to keep mistakes at a minimum.  Since this comment is fairly old, I am not sure of the exact circumstances but we will work hard to improve."
        }
      },
      {
        "author": "Sheri A.",
        "rating": 1,
        "review": "Look elsewhere!!  Look at all the negative responses about the terrible customer service!!  If you are a parent and have college kids looking at renting from APEX- DON'T!  The APEX owner is horrible, the manager is the worst. Or anyone don't rent from them....\n\nOur kids rented a place as they are attending WWU, they put on the application 3-cars, but when they got the rental agreement back and keys, APEX wrote on there only 2-parking passes.  The girls talked them and they said they could work it out, otherwise they would have rented another place closer to campus that had parking for 3-cars, some have spots for 4!. Knowing that the girls listed 3-cars you would think APEX would have taken the time and had a conversation to tell them there is no parking for the 3rd car, (they are 18) but their response is, they signed the lease it's not our problem!!   Yes they signed the lease, but as a business you know this will be an issue wouldn't you want to handle it up front instead of fining college students and making this more stressful than it should be??\n\nThey talked to the property owner and he gave them permission to park in the gravel lot (at the end of the parking lot), Now APEX is saying they make the rules and they can't park in the gravel lot and fined them $45.  The surrounding area is very dark with trees and shrubs, so as a parent I do not want my girls walking down the road in the dark...Again APEX does not care.  We talked to another renter and they had to hire an attorney to deal with APEX.\n\nThey say in their rental agreement:  \"Where parking is limited or by permit only, guest and/or visitors are required to use off-site parking)...funny there is no off-site parking??  \n\nAgain Look elsewhere!!",
        "ownerResponse": null
      },
      {
        "author": "Hannah L.",
        "rating": 1,
        "review": "There have been 4 car break ins during the last 2 weeks at one of Apex's properties and they have done nothing about it besides email to remind people not to keep valuables in their car. That was great after the first break in but now that there is a pattern, it's clearly not sufficient on their part. Very disappointed with the company and I strongly advise against renting from them unless they start valuing their security more.",
        "ownerResponse": {
          "text": "We understand the frustration regarding burglaries.  Maybe our office has not done an effective job in communication with residents the steps that we are taking to try to combat this problem.  Not only have several tenants been broken into, one of our employees was also broken into while on site in broad daylight and the owner of the building also had work tools stolen from his vehicle.  We are all very frustrated and upset but I assure you we have taken this issue very serious and have done the following: \n\n1) We have sent staff on site to check doors to the building and verify they are working and locking properly.\n2) We are in the process of getting the common door locks replaced. \n3) We have checked all lighting to ensure that no bulbs are out and place is well lit.\n4) We have immediately informed all tenants to be extra vigilant and not to leave valuables in their car.\n5) We have contacted the Bellingham Police Department and requested extra patrols and asked if there is anything else we could be doing.\n6) We've provided extra staff to patrol the premises at varying hours to discourage thefts.\n7) We have been working with the owner who is currently working on getting security cameras for the premises.\n\nWe hope we have demonstrated our efforts in trying to resolve this problem.  We are certainly open to any solutions anyone else could provide.  Please understand, some solutions take time to coordinate. Even after all of this action, the problem could still persist.  We wish we could solve the problem with crime and not have this ever be an issue at any of our buildings. Hopefully, all current residents will keep an eye out for people who do not belong at the building and make sure doors completely close when entering or exiting the building."
        }
      },
      {
        "author": "Robin S.",
        "rating": 2,
        "review": "We rented for one year through Apex, and didn't have too terrible of an experience. They gave notice before doing any work on our apartment, and we were able to pay rent electronically. The main issue we had was that other people were always parked in our parking spot, and Apex never did a thing about it. We often had to park and walk several blocks.\n\nUpon moving out, we scrubbed the apartment top to bottom, left no damage, and got $400 of random cleaning fees taken off our deposit. They even charged us for damage that was preexisting and documented before we moved in. They also tried to charge us for getting the locks changed without their permission, even though we got them changed THROUGH Apex. I was not impressed with their move-out process compared to other property management companies I have rented from.",
        "ownerResponse": null
      },
      {
        "author": "Abigail L.",
        "rating": 1,
        "review": "I tell all my friends to stay away from Apex if at all possible. They were incredibly unreasonable and difficult to work with, gave us conflicting instructions regarding move-out, and charged us for their own mistakes. The staff we worked with were extremely rude. We rented from them for about a year and would never go back.",
        "ownerResponse": null
      },
      {
        "author": "Lisa G.",
        "rating": 1,
        "review": "I've never had any problems renting with any other property management company. However this Apex is terrible. I had personal property damaged by another tenant, filed a police report, informed Apex and they did nothing! Not even a call/email response from them! I had mold all along the carpet and walks of my bedroom, yet I was fined for a cleaning fee.Their staff is uninformative and Chris Freas makes moving in a terrible experience. I will use the phrase picked on and bullied but in all honesty it's harassment. I did everything by the book to avoid him at all costs in my new place and he scrutinized my every day living. (There were cameras on the property) I was fined for my mom staying the night, fined for my boyfriend staying the night. He made me feel as if I couldn't leave my own house or else I'd be written up. This property management company deserves zero stars. So glad I never have to rent through them again.",
        "ownerResponse": null
      },
      {
        "author": "A R.",
        "rating": 1,
        "review": "I would not recommend this property management to even my worst enemy. Let this be a warning to steer clear. While on my search for an apartment with them I was shown a unit and told it was available. I went and paid my 40 dollar application fee, filled out all the paper work, gave them a 200 dollar holding fee and then was told that the unit I was shown was unavailable and that someone else had actually applied for it first and they were unaware of it. I was told that they had another unit available but that it was a corner unit and it was more expensive. When I agreed to that one. Once again, it was unavailable. This should have been my first clue to run far, far away. This should have been my first sign that all these people care about is their money. When I asked to be refunded for my 40 dollar application fee and 200 dollar fee they told me I needed to wait for a check to be made out and that it would be a couple weeks until they could get it to me. Anyway something happened and the people that had applied for the first unit before me were not accepted and I got the apartment. Since moving in I have been slammed with 200 dollar fines one after another for \"excessive noise\" or \"unauthorized tenants,\" \"unauthorized pets\" or whatever else they feel like charging me for that month. First off let me say I work 10 hours a day and commute an hour too and from work. That leaves me getting up and leaving my apartment at 6am and returning at 7pm. I go to bed each night at 10pm. On most weekends I visit with friends or family that live out of town so the time I spend in the unit is very limited. I am not a college student throwing parties or playing loud music. The first time I received a noise violation, I asked what it was for and was told it was for running appliances like my dishwasher or dryer. Most of my laundry is done at work seeing as I work in the medical field and our laundry stays at work and I eat out most of the time so its not like I was running these appliances at all times of the day and night. The next 200 dollar fine I received was that garbage was being thrown over my balcony. I would never! I own a garbage can and I have more respect than that. The next 200 dollars I was fined was for an unauthorized tenant that I supposedly have living in my unit. When I contacted Apex they told me there was evidence that was found in my apartment while showing it to a perspective renter that someone besides myself lived here. I tip toe up and down the stairs, I turn door handles before opening and closing them, I question if I should even flush the toilet in the middle of the night if I should happen to wake up and have to use the rest room in fear that I will receive some other 200 dollar fine. Every day I come home I am scared I will come home to a notice on my door asking me to move out or pay fines. I pay almost 800 dollars a month to live in a place that I should feel at home in, but I feel more like an unwanted guest in someone else's home. I feel constantly harassed by management and can not wait to move. I haven't even started on maintenance here. I flip a switch and lights short out, spark and sizzle. When I contacted management they told me to make sure I checked it all out because they wouldn't want to have to charge me a 35 dollar maintenance fee for sending someone out to my unit to check it out or fix it if they didn't have too. Really? They would charge me for a situation that could be potentially dangerous for not only myself but everyone else that lives here as well. The majority of reviews on this place are the same. The only good ones are from people who are employed by apex. I would recommend Landmark. Never had any issues with them.",
        "ownerResponse": null
      },
      {
        "author": "Carey A.",
        "rating": 1,
        "review": "I found working with Apex difficult.  The staff has been intermittently unfriendly and unhelpful.  There are many rules and fees.  My daughter is afraid to go to the office because the staff is not nice.  She is new at renting as I suppose many of the kids living in Bellingham are and I think the  Apex philosophy is less about service and all about fees.  We would never suggest them.  I completely agree with Amber.  My daughter is well spoken and conscientious.  When she was having difficulty after losing her job with covering the entire rent by the due date and made arrangements on more than one occasion to pay in portions she was met  with rudeness and on top of everything else, they changed the locks over 4th of July without informing the kids and they were locked out all weekend! They had just moved in.  Welcome home.  Btw not a word of apology. Most recently, the kids received a Dear John letter to let them know they would not be invited back.  No problem.  They are ready to move now but are so many fees ,they can't.",
        "ownerResponse": null
      },
      {
        "author": "Brett F.",
        "rating": 1,
        "review": "Terrible management company. Very slow to get things fixed, said they wouldn't change anything when they became the new property managers of my building and did. Very unprofessional when talking to some of them, I've had people laugh at me and be very rude.",
        "ownerResponse": {
          "text": "When reviews are so vague and the people writing them are not willing to give any information about the facts and circumstances about why they are so frustrated, the reviews should be taken with caution.    As for getting things fixed slowly, very hard to comment without more information.  But I will say there are circumstances when a fix cannot be made quickly.  If the issue is a type of leak or excessive mildew, there may be a process in determining the cause before we can make the correction.  Many people think every fix should be done with 24 hours of their call and in most cases that is what happens.  But some repairs require a more experienced vendor that is not always readily available.  Or it may be the cause of the problem is not easily determined.  In any case, our company works diligently in trying to get all repairs fixed quickly and responsibly."
        }
      },
      {
        "author": "Bailey L.",
        "rating": 1,
        "review": "We appreciated that Apex was going to give us a showing of a house that we were very interested in. While we were the first to call and schedule an appointment we were told we would be the first to see it. However in the end we were called the day before were they told us it was being changed into an open house. Leading to many (more than 20 people) showing up at the open house. We felt jilted and did not enjoy the way their business was handled. I'm sure it was a fluke, but unappreciated all the same. We will not be doing business with this company.",
        "ownerResponse": null
      },
      {
        "author": "Freya R.",
        "rating": 1,
        "review": "Apex is by far the worst property management company I have ever experienced or even heard about. The house i rented for a year was falling apart when we moved in, the backyard was filled with trash and broken bottles, trash was left all over the house on move in day and the problems only got worse from then on. We wrote letters and asked for changes and they had nothing but harassment for us. When we went in there one time to talk to them (because our requests were being ignored) we were chased out of their office by Phil. He actually threw a temper-tantrum like a small child. He followed us out the door and yelled at us as we were going to our vehicle. It was scary. He has a huge anger problem and is overall just an embarrassment to the company. No professionalism here. They was they manage houses and they way they treat their tenants should be illegal. DO NOT RENT FROM THEM, you will regret it. Just like everyone else that left a review it seems.",
        "ownerResponse": null
      },
      {
        "author": "Tom J.",
        "rating": 1,
        "review": "Terrible service, terrible people. Asked them to fix a few things when we moved in, still broken when we left and then they tried to charge us for it. Big headache for no reason.",
        "ownerResponse": {
          "text": "It is hard to defend comments that are so general.  We manage many units and we also perform many move outs.  In this case, if these tenants were charged for something that was documented at move in, they should call our office.  In July and August alone, we do over 400 move outs each year.  We WILL make mistakes.  I am sure there are also times we miss something a tenant did that they should have been charged. At times,  it is hard to read someone's handwriting on forms and so something may get overlooked.  If any tenant has an issue with a charge, they are always more than welcome to contact our office for us to re-examine the information.  We state this fact in the move out letters we send.  We also ask everyone to be at the inspections with us so we can avoid these issues.  Many people choose not to be there."
        }
      },
      {
        "author": "T E.",
        "rating": 1,
        "review": "Don't rent there in Bellingham at least. Before signing a lease with them, I had two separate groups of friends tell us not to because they were charged more than their deposit. While I trust these people, I thought maybe they didn't take as good care of their apartment as they should have. After it happened to me, I definitely believe them. They tried to charge for things not legally allowed. Don't rent with them.",
        "ownerResponse": null
      },
      {
        "author": "Christyna V.",
        "rating": 1,
        "review": "Absolutely terrible property management company that makes their living by taking advantage of poor college kids who have no experience or knowledge of workers rights. Rented with them and was lied to about the subletting process by multiple people. They basically told me that it would be much simpler than it was, then I got close to moving out and was blindsided with hoops to jump through and ended up having to pay insane fines. Moved and signed with another company in Bellingham to get away from Apex and they took that property over within a week of me signing my lease. During that process they lost all the lease information for one of my roommates and tried making her pay the security deposit again. When I called to complain about this I was transferred from Chris (who is actually a decent guy) to Phil Maxwell, the owner. Phil took it upon himself to verbally assault me. He called me a bad person multiple times, told me I needed to get the hell out of his property and many other awful things. I was in tears by the end of the \"conversation\". I had never been treated like that before. But there is no accountability because it is his business. I just hope that enough people read these awful reviews and STAY AWAY from Apex.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 52,
  "adjusted_average_rating": 1.52,
  "summary": {
    "text": "<section><h2>Good</h2><p>In this article, we look at Apex Property Management from multiple angles, starting with the positive aspects. Some user reviews highlight satisfactory experiences, with tenants reporting prompt maintenance responses and an appreciation for proactive communication regarding weather advisories. One long-term resident stated they never encountered any significant issues during their tenancy, and praised the option for electronic management of their account, including payments and maintenance requests. Additionally, the online portal aided in resolving rental-related tasks efficiently and contributed to a convenient living experience.</p></section><section><h2>Great</h2><p>Tenants have also expressed their satisfaction with the physical upkeep of the properties. Regular maintenance, like lawn care and gardening, received compliments. A previous tenant recounted their positive move-out experience, expecting to not receive much of their damage deposit back, but to their surprise, the company assessed the damages fairly and refunded a generous portion. Another shared a situation where they were able to retrieve a delayed mail package with the help of the staff, showcasing a certain level of customer care that went beyond their expectations.</p></section><section><h2>Bad</h2><p>However, some user experiences have leaned towards the negative spectrum, with reviews citing a range of persistent issues such as neglecting maintenance requests, including serious concerns like leaking ceilings and unattended-to mold growth. Instances of perceived mismanagement, such as delayed move-in dates and misunderstandings regarding renewal and move-out procedures, have also been highlighted. Additionally, communication breakdowns between the tenants and the management have been pointed out, as some users reported experiencing difficulties getting in touch with the Apex team regarding their concerns.</p></section><section><h2>Ugly</h2><p>The ugliest aspects, as per user reviews, relate to aggressive fee policies and deposit withholding practices. Several tenants voiced strong dissatisfaction with being charged for pre-existing damages or for claims they deemed unwarranted. Claims of being charged for routine repairs and cleaning services, which tenants felt were unnecessary or overly expensive, also surfaced. Some reviews mentioned fine policies for guests, pets, and minor infractions, which added to tenants' frustration, suggesting a pattern of punitive measures seemingly focused on maximizing income from fines and fees rather than fostering a positive landlord-tenant relationship.</p></section>",
    "disclaimer": "Apex Property Management was acquired by the San Francisco-based PTLA in early 2020. Apex's Yelp page indicates that they are officially closed, and their website redirects to PTLA's website. It is unclear whether Apex simply rebranded under PTLA or if they cleaned house after the acquisition."
  },
  "timestamp": "September 7 2024"
}