{
  "name": "Barkley Apartments Bellingham",
  "slug": "barkley-apartments-bellingham",
  "company_type": "Property",
  "address": "3126 Racine St, Bellingham, WA 98226",
  "review_count": 10,
  "average_rating": 3.6,
  "reviews": {
    "google_reviews": [
      {
        "author": "Amy Lykke",
        "rating": 4,
        "review": "I am in my third lease term. For the most part, it has been a positive experience. Management is friendly and maintenance needs are usually taken care of quickly.\nMy only real dislikes of living here are how incredibly small the kitchens are, how low end the appliances are, not being allowed to have bird feeders or any hanging flowers, and how ridiculously narrow the parking spots are.",
        "owner_response": {
          "text": "Thank you for sharing your feedback, Amy. We're pleased to hear that you've had a positive experience overall at Barkley and that you've found our management and maintenance teams helpful. We understand your concerns as well. We always strive to provide a comfortable living environment for all our residents. Your feedback is valuable to us as we continue to improve our community."
        }
      },
      {
        "author": "Katelyn Schneider",
        "rating": 5,
        "review": "We lived at Barkley for two years, and it was the best apartment experience weve had. Maintenance was always taken care of promptly, the property management team is friendly and helpful, and the neighbors are decent.\n\nBeing able to move in with an alternative to a traditional deposit was very helpful at that time, and upon move out they didnt nickel and dime us for things and were helpful/understanding throughout the move out process. While we were tenants, we were also able to utilize Flex payments and pay rent in two payments, which was very helpful.\n\nThe apartments themselves are nice, and a far cry from the college apartments on the other side of town. Our unit overlooked a green belt on our back side, which was our favorite part. It made it feel like we werent smack in the middle of town, with all of the convenience of being right smack in the middle of town.\n\nIf we ever have to move back into an apartment, I would absolutely want it to be Barkley.",
        "owner_response": {
          "text": "Thank you, Katelyn, for taking the time to share your experience. We're thrilled to hear that you found our maintenance prompt and our team friendly and helpful. Your kind words are appreciated, and we hope to have the opportunity to welcome you back to Barkley in the future.\n"
        }
      },
      {
        "author": "Hannah Kononen",
        "rating": 4,
        "review": "I have been living at Barkley Apartments for going on 4 years! To start the property is absolutely beautiful and well maintained (lawns cut, flower beds rebarked, enough dumpsters to accommodate the number of units). Its really wonderful to step out in the spring and summer to see the azaleas and rhododendrons in bloom.\n\nThe Barkley staff is fantastic as well. Anne and Jessica are so quick to respond via email and they are super approachable if you have to pop in for a quick question. They have been so kind and helpful every time Ive needed to submit a maintenance request. Ive had the craziest last year with a water heater overflow tank springing a leak, my front door handle snapping off, my toilet overflowing and the sink developing a leak but the Barkley team has been there to help me as quickly as possible. They are also so communicative when it comes to community updates like power washing, parking lot repaving, and informing us of third party companies on the property doing other forms of maintenance. If anyone says otherwise, they arent checking their email frequently enough.\n\nAppliances are not super updated but everything works well! Only had to replace toilet water pump, kitchen sink head, and the water tank overflow, but that seemed to be due to general wear and tear from what I could tell. Washer and dryer in unit and still working well! Im happy with my apartment size because its just me but I hope to one day be able to afford a unit with two bedrooms. I love being able to look out my sliding glass door and see green foliage!\n\nIt may be harder to afford rent if you do not have a career and do not have a strict budget, but I do not feel as though they are price gouging, everywhere is expensive, Bellingham is expensive. Such is life.\n\nI also want to comment on the safety of the complex  as some who lives solo just with my companion animals Ive never been afraid in this community and have felt very safe. I love that the complex is pet friendly and very accommodating with waste stations. Being so close to the Barkley Trail system is a dream honestly and my boys and I walk it every single day. I love how close we are to Regal and Haggen and the rest of the Village shops and businesses.\n\nI do wish that my unit didn't have carpet but from what I can tell when residents move out they do renovating and it looks like they are replacing carpets with vinyl flooring, which makes sense.\n\nAll in all if you are looking for a clean, well-kept community with kind and responsive staff, pet friendly and located in one of the best neighborhoods in Bellingham, Id check out Barkley Apartments. I feel very lucky to call this place home.",
        "owner_response": {
          "text": "Thank you, Hannah, for sharing your experience at Barkley. We're delighted to hear that you're happy with our maintenance and communication efforts, as well as the overall condition of your apartment. We always strive to maintain our property to a high standard and to respond promptly and effectively to any issues that arise. It's wonderful to hear you're enjoying our location and the amenities we offer, including the pet-friendly environment and proximity to local attractions. We appreciate your feedback about the flooring and we're always looking for ways to improve. Thanks again for your kind words, and we're glad to have you as a resident.\n"
        }
      },
      {
        "author": "Beck W",
        "rating": 1,
        "review": "This place is a total ripoff with management that has no respect for it's tenants. Looking at the lease renewal, if I don't commit to 12 months they charge me 3-4x rent. Extremely predatory and greedy.",
        "owner_response": {
          "text": "We're regret to hear that you're not satisfied with your experience, Beck. Our flexible lease terms allow residents to customize their lease length to fit their needs, unlike a traditional lease where you're locked into a fixed period, allowing you to move out sooner if needed or extend your stay depending on your circumstances. Rates for shorter terms are often higher simply because they are less desirable for us but please reach out to us at 360-647-2818 to discuss any concerns you may have as we are always open to discuss how we can tailor a lease term to your situation. We appreciate your feedback and look forward to the opportunity to talk about this further.\n"
        }
      },
      {
        "author": "Karl Hyde",
        "rating": 5,
        "review": "They do a good job with maintaining the property and apartments if something is needed . I love all the giveaways and how it encourages us to review any apartment notifications and emails.",
        "owner_response": {
          "text": "Thank you, Karl, for your kind words about Barkley. We're glad to hear that our maintenance team and resident communication efforts have been beneficial for you. We aim to create a welcoming and engaging community for all our residents."
        }
      },
      {
        "author": "Crystal Yarlott",
        "rating": 5,
        "review": "I love living here.  My dog loves it here. The staff is very friendly and helpful.",
        "owner_response": {
          "text": "Thank you for the positive feedback, Crystal. It's great to hear that you and your furry friend are enjoying your time at Barkley. We're also glad to know that our staff has been able to assist you iso well. We appreciate your kind words."
        }
      },
      {
        "author": "Alexandra Galan",
        "rating": 1,
        "review": "They use to have really good managers in the office but now they got this awful manager with such a big attitude, i dont know why shes working in the office if shes having such a bad life. Doesnt help at all. Recommend not going to the managers for any help or not rent here at all. We should be the ones getting good service not being threatened like if we dont pay rent and pay them basically.",
        "owner_response": {
          "text": " Dear Alexandra, We are sorry to hear that your experience has been less than pleasant. Upon our research, we are not finding any record of your residency at Barkley Apartments. If you would like to contact us and provide us with more information, we would like the opportunity to understand what we can improve on. Thank you, The Barkley Team"
        }
      },
      {
        "author": "N O",
        "rating": 5,
        "review": "I was a long term resident at Barkley Apartments and it was the only place I've rented in Bellingham before I could afford to buy something. The apartments are in a really nice location: near two shopping centers and restaurants on either end of Barkley, an Imax theater across the street, and it's in close proximity to Railroad Trail, which takes you to Bloedel Donovan Park and Whatcom Falls. I felt like my yearly rent increases were fair and reasonable. Maintenance had always been on top of my service requests and was constantly making improvements to the buildings (new roofing, landscaping, dryer vent cleaning, yearly alarm testing, energy-efficient upgrades for lighting, water and thermostats, fixing up and reopening the pool). I feel like management has put a lot of effort into making Barkley Apartments pleasant and welcoming. They have frequent gift giveaways (like free plants and snacks) and host small events for holidays and other things (like a recent celebration of the reopening of the pool and hot tub).",
        "owner_response": {
          "text": "Thank you for your comprehensive review. We're delighted to hear that you enjoyed your time at Barkley. It's wonderful to know that you appreciated our efforts in maintaining the community, upgrading our facilities, and hosting events. We're also glad you found the location advantageous and the rent increases reasonable. We hope your new home brings you just as much happiness as Barkley did!"
        }
      },
      {
        "author": "Sonya Johnson",
        "rating": 5,
        "review": "The property grounds are well maintained.  Staff is helpful and responsive.  On-site management are helpful and responsive.  I enjoy views of the green belt.  The back door accessing a patio which opens onto the green space is a real luxury.",
        "owner_response": {
          "text": "Thank you for your review, Sonya! We're thrilled to hear that you're enjoying your experience at Barkley, from our attentive staff to the beautiful views of the green belt. We agree that the patio access to the green space is indeed a bonus. Your feedback is valuable to us, and we're pleased to know we're meeting your expectations."
        }
      },
      {
        "author": "Shane Lizard",
        "rating": 1,
        "review": "Ive lived here in my rotting apartment for almost 2 years now and have seen no improvement to the complex besides a brand new entryway. Ive had my vehicles broken into/ stolen at least 4 times. Homeless people taking over the dumpsters and office staff that only cares about their own image. The communication between residents is also completely controlled and censored by office staff. Be careful renting here",
        "owner_response": {
          "text": "We're sorry that you havent had an enjoyable stay with us at Barkley. Our team strives on a daily basis to cultivate a welcoming, comfortable living experience for our residents, and we apologize that you havent seen our efforts reflected in your stay. We hope that you'll contact us directly at 360-647-2818 to discuss your experiences further and how you feel we might improve. Thank you.\n"
        }
      }
    ]
  },
  "adjusted_review_count": 10,
  "adjusted_average_rating": 3.6,
  "distribution": {
    "1": 3,
    "2": 0,
    "3": 0,
    "4": 2,
    "5": 5
  },
  "summary": {
    "created_timestamp": 1739094992,
    "text": "<section id=\"good\"><h2>Good</h2><p>Barkley Apartments has received several favorable reviews, with tenants appreciating the friendly and helpful nature of the management staff. Many users have noted that maintenance requests are handled promptly, which contributes positively to their overall experience. One tenant, for example, highlighted their long-term residency, noting that the grounds are well-kept, with well-maintained landscaping and a great location close to shops and restaurants, making it convenient for daily needs.</p><p>Residents also express satisfaction with community engagement initiatives, such as gift giveaways and seasonal events, fostering a strong sense of community. The property’s aesthetic appeal is frequently mentioned, with tenants enjoying beautiful views of the green belt and blooming flowers. It’s clear that for many, living at Barkley Apartments feels like home, characterized by a clean environment and supportive management.</p></section><section id=\"great\"><h2>Great</h2><p>The apartment complex is praised for its overall quality of living, with tenants remarking on the spacious layouts and the pleasant ambiance of their surroundings. One user specifically celebrated the apartment's peaceful vibe despite being centrally located, benefiting from green views and access to outdoor trails. They appreciated the option of flexible payment plans, which eased financial stress during their stay.</p><p>Moreover, frequent positive interactions with the staff were emphasized, with customers describing management as approachable and eager to assist with any inquiries or issues. Quick responses to maintenance requests further cement the positive reputation of Barkley Apartments, implying that the management is genuinely interested in maintaining tenant satisfaction. Overall, many residents feel they have gained not just a rental, but a supportive community.</p></section><section id=\"bad\"><h2>Bad</h2><pDespite many positive reviews, some tenants have shared their frustrations regarding the management of Barkley Apartments. A few users have critiqued the property for its lease renewal policies, describing them as predatory and suggesting that management is not accommodating to tenants’ needs. They mentioned feeling cornered into long-term leases with exorbitant fees for shorter terms, which has made some residents feel trapped and exploited in their housing situation.</p><pAdditionally, a lack of effective communication from management during certain processes was reported. While many praise prompt maintenance responses, others have stated that issues like theft and past instances of poor management responsiveness during critical situations detract from their living experience. These mixed sentiments show that while the community is loved by many, there are areas for improvement that need to be addressed.</p></section><section id=\"ugly\"><h2>Ugly</h2><pSeveral reviews depict alarming experiences that give insight into significant issues at Barkley Apartments. A former tenant reported frequent vehicle break-ins and general safety concerns, feeling that the environment was not secure enough. This dissatisfaction was further exacerbated by what they perceived as a lack of meaningful action taken by office staff in response to these incidents, suggesting that resident safety is not prioritized.</p><pMoreover, some tenants have expressed dissatisfaction with individual staff attitudes, claiming that interactions become combative rather than constructive. Reports of feeling threatened or dismissed when voicing concerns indicate a serious need for management to reevaluate their customer service strategies. Such negative experiences not only affect the quality of life of current residents but also raise substantial concerns for prospective tenants looking for a safe and welcoming community.</p></section>"
  }
}