{
  "name": "Bellingham Partners",
  "slug": "bellingham-partners",
  "company_type": "Company",
  "address": "1318 12th St, Bellingham, WA 98225",
  "review_count": 25,
  "average_rating": 4.8,
  "reviews": {
    "google_reviews": [
      {
        "author": "Lars Anderson",
        "rating": 5,
        "review": "Galen and Rom were truly incredible partners in my wife and Is home search this year. They are both experienced and well-versed in all aspects of what you will encounter in your transaction and the unique challenges that await buyers in this market. We started out working with Rom, but ended up working more with Galen for our offers. Being from out of town, we relied on their recommendations on neighborhoods and houses to look at  and they were never wrong. They helped us craft an offer that competed and won over some other very competitive offers while mitigating some risks that were associated with competitive offers, and leveraged their relationships and local knowledge to get us into a home that we very well may end up living in for decades. My wife and I cant recommend Galen and Rom enough and truly thank them for impacting our lives in the way that they have. This entire process wouldnt have been possible for us without them.",
        "owner_response": {
          "text": "Lars, thanks for the glowing review. We are so happy to have you and Anna as part of the Bellingham community. \nSo glad you found a great home in a great neighborhood and honored we could help in that process. \nWelcome to Bellingham"
        }
      },
      {
        "author": "Jonathan Strahl",
        "rating": 5,
        "review": "Galen and Rom are legitimately the best people to work with! Both times I have worked with them I felt that I was receiving real value from having an agent. They know the market well, and they go the extra mile to understand client needs, and advise clients and meet their goals. Not only do they have the intellect and fast-talking negotiation strategy down, I was even more impressed when they came over with the weed whacker and lawn mower and dump trailer to help us with the yard makeover. I highly recommend them!",
        "owner_response": null
      },
      {
        "author": "Leah O'Bryant",
        "rating": 5,
        "review": "I had an amazing experience working with Rom and Galen! They were so available and know so much about the Bellingham area real estate. They were able to help us navigate a really tricky market and get into a home that we love and that we can afford. Now I come home everyday and feel thankful for my home and thankful for the help these two gave us! I can not recommend them enough!",
        "owner_response": {
          "text": "Thanks Leah! Youre the best:)"
        }
      },
      {
        "author": "Tamira Vojnar",
        "rating": 5,
        "review": "Rom helped us buy our first home and was awesome to work with. He made our house search a fun process, had great insights about the market and each of the houses we saw, and was always had a super thorough answer to our questions. Rom helped us navigate a multiple offer situation, and his expert negotiating skills got our offer accepted. We were ready to have our house search take months, but Rom helped us get our first offer accepted. Buying a house is such an overwhelming experience in this market, and we were glad to have someone so experienced, reliable and trustworthy in our corner.",
        "owner_response": null
      },
      {
        "author": "Holli Kaplan",
        "rating": 5,
        "review": "Can't say enough great things about Rom and Galen who helped us with more than one Bellingham home purchase over the years. Excellent responsiveness and availability, thoughtful attention to our needs, direct and honest opinions, superior industry knowledge, well-connected to the other key players in the local area, and all-around nice guys. If needed, will  definitely work with Rom and Galen again.",
        "owner_response": null
      },
      {
        "author": "Mary Kratovil",
        "rating": 5,
        "review": "Galen was an awesome real estate agent. He was very good at finding houses that were both in our price range (300k) and what we were looking for in a house. He is also well connected with other agents and people in the community and can learn about new houses that are going to be listed soon. After he helped us find the right house we took his recommendation for an inspector and mortgage lender and we were very impressed with both (we even saved money). I highly recommend Galen.",
        "owner_response": null
      },
      {
        "author": "Ryan Maskewitz",
        "rating": 5,
        "review": "Previously having worked with a number of real estate professionals, Rom and Galen set a new high bar for what great customer service and care look like. I have been consistently impressed with their honest and kind demeanor, knowledge of the local market and desire to go above and beyond to make our real estate transaction go as smoothly as possible. I felt that I was their most important customer through every interaction and this has certainly NOT been the case with other brokers over the years. Truly exceptional individuals and real estate professionals! I can't recommend them highly enough.",
        "owner_response": {
          "text": "Ryan! Thank you for the kind words Glad you and the fam are already enjoying what and why you moved to Bellingham for! "
        }
      },
      {
        "author": "Jordan Gaphni",
        "rating": 5,
        "review": "I had Galen as my agent when I bought my first home. He did a great job navigating me through the process of buying a home. We looked at a few different houses and when we found the one that I was going to make an offer on he was great. We agreed with the seller on a price below market rate. He is well connected and when going through the inspection process that came very handy, we had an issue with the gutters in the inspection report and the next day got a price quote. He is well connected and knows the negotiation game very well, I would recommend him to anyone.",
        "owner_response": null
      },
      {
        "author": "D Webb",
        "rating": 5,
        "review": "Rom at Bellingham Partners has helped us tremendously with finding just the right place to live. Weve relied on his expertise and creativity to purchase homes to live in as well as rental homes. He knows the area very well and is able to really tailor each contract according to our specific needs. We always recommend Bellingham Partners to our friends looking to buy and I know well work with Rom again in the future.",
        "owner_response": {
          "text": "Thanks Dawn! We love working with you and your fam. Cheers"
        }
      },
      {
        "author": "Jimmy Balch",
        "rating": 5,
        "review": "Galen was such a great agent to work with. His honest and realistic point of view was appreciated especially because it was backed by historical industry knowledge. He was good about listening to our wants, needs and nice-to-haves and was able to find us a property that fit us perfectly. Id definitely highly recommend Galen to those looking to find their first or next home.",
        "owner_response": {
          "text": "Thank you Jim! So glad we could find you and Lisa such a great house:)"
        }
      },
      {
        "author": "in293yew",
        "rating": 5,
        "review": "In my past experiences with buying and selling a home, I felt that my realtors held all the cards and I was simply a pawn being manipulated through the unfamiliar process.  So I was grateful that Rom Hirss was  respectful, patient, and sincere throughout.  I would recommend him to friends and family without any reservation.",
        "owner_response": {
          "text": "Hey Raymond,\nThanks for the high praises and Im glad we were able to help in a way that made you the most comfortable. \nCheers,\nRom Hirss and Galen Hirss"
        }
      },
      {
        "author": "Anna McElroy",
        "rating": 5,
        "review": "Rom and Galen were an absolute pleasure to work with during my homebuying process. They were patient and incredibly helpful in navigating a crazy market as a first time homebuyer. Their expertise in realty and personal experience of being homeowners in the area made them a trusted advisor throughout the process.",
        "owner_response": null
      },
      {
        "author": "Kris Volpenhein",
        "rating": 5,
        "review": "Rom and Galen offer an excellent combination of market knowledge, advice without pressure, alternative perspectives to consider and knowing when its time to act. They are willing to take the long and patient route but also supportive if an opportunity is right. They are effective with the details of the transaction and stay on top of those smaller things to help assure nothing gets missed. Highly recommended if you are looking to buy or sell!",
        "owner_response": null
      },
      {
        "author": "Becky G",
        "rating": 5,
        "review": "We just made a move from Colorado to Bellingham. In the process we worked with 2 realtors in Colorado and Rom and Galen in Bellingham. Rom and Galen were by far the most responsive, patient and knowledgeable! They heard our needs (from a distance) and were willing to go check out homes for us to see via FaceTime etc. They also helped us negotiate a price on a house we fell in love with in Edgemoor. We will absolutely use them on future transactions!",
        "owner_response": {
          "text": "Thanks Becky! So glad you and the fam love Bellingham and your new home:) It was our pleasure to help you guys."
        }
      },
      {
        "author": "Rosalie Stephens",
        "rating": 5,
        "review": "Rom was fantastic to work with. Being new to the area, he was invaluable in helping us figure out where we would like to settle. He responded quickly to our emails and texts, was readily available to show properties when needed, and was always professional and knowledgeable about the showings. He helped us navigate all of the paperwork, signings, and deadlines smoothly.  Despite the challenges of viewing properties during a pandemic, Rom always met us with a smile (under that mask) and a positive outlook. We would absolutely recommend Rom to anyone needing realtor services.",
        "owner_response": null
      },
      {
        "author": "Leslie Siebring",
        "rating": 5,
        "review": "This was my first home buying experience and Rom made sure I understood what was happening every step of the way. He was really prompt, knowledgeable, and helpful answering my questions. I appreciated that he kept my goals in mind when suggesting properties to look at and he was always patient and pleasant. I would highly recommend Rom to anyone in the market as a talented, hardworking team player, he really made sure I was taken care of through the whole process.",
        "owner_response": null
      },
      {
        "author": "Zack Garza",
        "rating": 5,
        "review": "Galen assisted me in buying my first home. I was very impressed by his professionalism and enthusiasm during the process. My home search lasted over two years. Galen met with me at my convince at all days and times of the week. About 6 months after the purchase I had a tree fall on my house. Galen was the first to notify me and recommend contractors. I would not hesitate to recommend Galen Hirss to the fullest extent.",
        "owner_response": null
      },
      {
        "author": "Jonathan Cicotti",
        "rating": 5,
        "review": "I recommend working with Rom 100%! Whether you are looking for your dream home or investment property he will walk you through the process to help you make the best decision that works for you.\nI never felt rushed or pressured and he always got back to me promptly. Bonus is that he works with his twin brother, Galen, so you get two Realtors for the price of one! Hands down best realtors in Bellingham.",
        "owner_response": null
      },
      {
        "author": "Luke Kaemingk",
        "rating": 5,
        "review": "Rom was awesome. He found me a great investment property and walked me through everything. I am very happy and would recommend him (in fact, I have)! Very easy to work with, knowledgeable about the process and construction in general, and a great guy.",
        "owner_response": null
      },
      {
        "author": "Riley Myers",
        "rating": 5,
        "review": "Rom was amazing to work with! It was super easy to communicate and keep up to date with him (call/text/email). He always answered my questions and in the end he helped me get the best deal possible. An awesome guy, highly recommended.",
        "owner_response": null
      },
      {
        "author": "Devin Calhoun",
        "rating": 5,
        "review": "Galen is personable, professional, and knowledgeable.  Great to work with and knows this area and market very well.  Perfect balance of hands on supportive guidance, and proactive footwork to ease the whole process.",
        "owner_response": null
      },
      {
        "author": "Charles Brinson",
        "rating": 5,
        "review": "The highest praise for Galen! From our first communications to after closing, Galen is personable and professional. I would highly recommend him to anyone. Charles",
        "owner_response": null
      },
      {
        "author": "Brooks Friedland",
        "rating": 5,
        "review": "Exceptional realtors.",
        "owner_response": null
      },
      {
        "author": "Pradip Bhunia",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "King A",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 23,
  "adjusted_average_rating": 5.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 1,
    "5": 23
  },
  "summary": {
    "created_timestamp": 1739205401,
    "text": "<section id=\"good\"><h2>Good</h2><p>User reviews reveal that Bellingham Partners have been adept at assisting clients through the complexities of the real estate market. One highlighted example involves Rom, who worked diligently to help a user buy their first home, ensuring that the whole process was transparent and engaging. Clients often mention how knowledgeable Rom is about the market and local area, enhancing their home-buying experiences through his reliability and genuine support.</p><p>Another client appreciated Galen’s approach, who helped navigate the intricacies of purchasing a home at a price below market rate, easing the inspection processes with his connections. Prospective buyers often commend Galen’s ability to listen to their needs and incorporate them into their property searches. These reviews emphasize the company's strong customer focus, which leaves clients feeling heard and supported.</p></section><section id=\"great\"><h2>Great</h2><p>Bellingham Partners is praised for their exceptional dedication and effort, as reflected in numerous user reviews. Galen and Rom are often described as going above and beyond, with instances of them helping with yard makeovers for properties being prepared for sale. Such initiatives illustrate their commitment to client satisfaction.</p><p>Many clients express glowing gratitude, particularly when faced with highly competitive market conditions. Rom and Galen are credited for their strategic offer placements, often helping clients secure homes against stiff competition. This level of service has left a lasting impression on users, highlighting a distinctive capability to exceed client expectations through personalized, hands-on support.</p></section><section id=\"bad\"><h2>Bad</h2><p>While reviews for Bellingham Partners are overwhelmingly positive, not all experiences have been flawless. There was a minimal number of negative reviews, but they provide some insight into areas for potential improvement. One reviewer rated their experience poorly without detailing specific grievances, pointing perhaps to issues that remain unaddressed. This suggests that in some rare cases, clients might feel underserved or that certain aspects of their interactions might not have met their expectations.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The distribution of reviews includes a single, notably negative one-star rating, although the review itself lacks specific details. This outlier indicates at least one unsatisfied client, hinting at possible lapses in service or unmet expectations. Without accompanying details, however, the rationale remains unclear, but it serves as a caution for the company to remain vigilant about maintaining their customer service standards.</p></section>"
  }
}