{
  "name": "Bellingham Real Estate Co.",
  "slug": "bellingham-real-estate-co",
  "company_type": null,
  "address": "2900 Meridian St Suite 101, Bellingham, WA 98225",
  "review_count": 111,
  "average_rating": 4.96,
  "reviews": {
    "google_reviews": [
      {
        "author": "Megan O'Patry",
        "rating": 5,
        "review": "Leo and Christopher were exceptional from start to finish during the selling of our home and we would recommend them without hesitation! We felt super supported and they made, what I'm sure can be a very grueling process for some, incredibly smooth. They worked as a cohesive team and by extension, they made us feel a part of a team. They were always quick to respond to any questions and took extra time to make sure we felt heard and understood. We were very impressed with their knowledge, expertise, and efficiency - and they're also just great people!",
        "owner_response": null
      },
      {
        "author": "G & D",
        "rating": 5,
        "review": "Chris at Bellingham Real Estate Co. = the best around! He has so much local knowledge, he takes the time to understand what you are looking for in a home, sets realistic expectations, and is an honest realtor. When the sellers agent of the home we got was completely non-responsive to us in the high stakes moment, he handled it very professionally and leveraged other resources in order to get our deal locked in and secured us the home. These situations can be very stressful and he surprised us with the awesome news that made our lives entirely better. Even post-sale, his organization and attention to detail helping us setup utilities etc. everything was wonderful! Chris rocks and we will definitely work with him for any real estate needs in our future!",
        "owner_response": null
      },
      {
        "author": "Max Harger",
        "rating": 5,
        "review": "Fantastic team that made our process a breeze. Thorough market research and logistical expertise made our transaction the most pain-free its ever been. Their commitment to their fiduciary duty resulted in us netting way more than we were expecting and their flexibility and professionalism made this the most stress free real estate transaction Ive ever had. This team is a well oiled machine that earns their commission and I could not recommend them enough.",
        "owner_response": null
      },
      {
        "author": "Nate Aplin",
        "rating": 5,
        "review": "Leo Cohen with Cohen Group NW has the skills we needed to get our dream home. My wife and I were first time home buyers with a tight budget and no knowledge of how real estate purchases work. Leo was very insightful and provided a lot of guidance and tips on what to look for when buying a home and how the process works. Leo and his team helped us feel comfortable and confident every step of the way. Once we found something we loved, he helped us negotiate to beat other offers, all without increasing our offer price! A great thing about working with Leo is he has awesome connections including contractors, home inspectors, and lenders that were all super great to work with, and could get something done in a time crunch. I highly recommend working with Leo to buy your next home!",
        "owner_response": null
      },
      {
        "author": "Paul Rains",
        "rating": 5,
        "review": "Fantastic people and a great help along the way for looking for and buying a house.  We just bought our first home with Bellingham Real Estate Co. And Leo Cohen as our agent helping us through the whole process.  Both he and Bellingham Real Estate Co. as a whole have been and continue to be very helpful in the home buying process.",
        "owner_response": null
      },
      {
        "author": "Cristina Gonzalez",
        "rating": 5,
        "review": "Max Burrage was an absolute gem to work with! From day one until closing, he went above and beyond to ensure I had a smooth and stress-free home buying experience. His quick response times, flexibility, and willingness to accommodate my schedule were greatly appreciated, especially with our countless home viewings and three offers. His guidance and communication were top-notch, and I felt informed and reassured throughout the entire process even as a first-time home buyer. In the 10 months we worked together, I never felt rushed or pressured into making any quick decisions.\n\nMax's genuine personality and positivity made what could have been an extremely stressful experience enjoyable. I can't recommend him enough to anyone in need of a reliable, trustworthy, and hard-working realtor. Thank you Max for making my dreams of finally owning my own place a reality!",
        "owner_response": null
      },
      {
        "author": "Marina Sanchez",
        "rating": 5,
        "review": "We love The Bellingham Real Estate Co.\nLeo is a great all around guy and has a great team. We bought a house this month and wouldn't have known anything without him and his awesome team. I recommend them for all you buying and selling of real estate.",
        "owner_response": null
      },
      {
        "author": "Amanda C.",
        "rating": 1,
        "review": "Perhaps would've been a different experience with buying a home, but I bought some land and Leo acted as the listing and selling agent, which was probably a mistake on our end, as he clearly acted in the best interest of the seller. I get it, more money to be made, but they used cheap sales tactics on us because they knew we wanted the land (i.e., someone already made an offer). Also, false advertising in the listing itself, as the HOA was recorded as being $70, when in fact it was almost twice the amount. Biggest disappointed was the lack of communication - twice I had to clarify something in the contract, which he and his team finally amended right before closing, but this was after calling out parts of the contract that contradicted what he had been telling us + huge gaps in response time. When I finally closed, he and his team never notified me, which is probably the biggest red flag, as it is best practice for a selling agent to notify their clients when the sale is officially recorded. Again, we were a small fry in comparison to a house sale, but knowing that we overpaid for this land (and I'm sure they knew that too), a congrats email or something would've been nice. So I cannot recommend this company, as it seems good customer service comes with a price tag!",
        "owner_response": {
          "text": "Hey Amanda, After how smoothly we felt this transaction went, prompt communication within business hours (and even later evening calls when necessary), going above and beyond when there had been a question or concern etc., I honestly am pretty surprised to read this feedback. We take a lot of pride in how we operate, communicate and take care of our clients.\n\nI provided the various disclosures so that all parties were fully aware of all options, information and next steps upfront and in writing. I am more than happy to address any specific concerns via phone or in person vs a public forum. I genuinely wish you the best with your new property.\n\n- Leo \n\n"
        }
      },
      {
        "author": "Justin Singh",
        "rating": 5,
        "review": "Leo and the team at Cohen Group NW are to be highly recognized for their unique and extremely effective manner of caring for the client.\n\nThrough the interview process in finding an agent to help us sell our home, Leo stood out against the best in the area. He immediately showed excitement and Joy in wanting to be part of our process of selling our home.\n\nThrough the process of selling our home, Leo and the team could not have done a better job in communicating and being deeply involved in every aspect of the sale. The level of professionalism and character would be very hard to match.\n\nWe wish the best for our new friends at the Cohen groups. We know that you will do well if you go with the Cohen group.",
        "owner_response": {
          "text": "Justin, Thank you so much for choosing us to join you on the journey of making a move up north! Glad our paths crossed. You and Michelle (and Kiddos) were awesome to work with and reminded my of why we do what we do. So glad to see that ya'll are living it up! Cheers!"
        }
      },
      {
        "author": "Rachel Hale",
        "rating": 5,
        "review": "Max and his team were amazing to work with. They helped us to buy our first home!\nWe knew nothing about buying a house, and Max helped to get us setup with a local lender and walked us through the process every step of the way. He was so responsive and made sure that if he couldn't be in town to show us a place, we were set up with another agent at Cohen Group.\nMax brought so much positivity and joy into the buying process, and it went so smoothly once we found the perfect house. I absolutely loved working with Max and all of the other folks that helped us along our journey.",
        "owner_response": null
      },
      {
        "author": "Gila Macdonald",
        "rating": 5,
        "review": "Leo and his team were very professional in everything they did. They answered every question we had in a fast and timely manner. Leo's team took excellent pictures and helped to make everything look great. we had never sold a house before and were nervous, but Leo and his team kept us up to date on everything that was going to happen and it all went very well. The house was listed and sold very fast from listing to closing. I would recommend Leo and his team to anyone looking to buy or sell a home.\nCraig M.",
        "owner_response": null
      },
      {
        "author": "Jason Smith",
        "rating": 5,
        "review": "Leo Cohen and the Cohen Group NW are singularly responsible for getting my wife and I our dream home.  It all started in 2018 when Leo helped me purchase my house in Bellingham.  Leo adeptly navigated the entire process, kept me fully informed and was astoundingly responsive.  That house increased almost exponentially in value.\n\nCut to 2022, I had gotten married and welcomed my wife and her 4 children into my home.  When my biological son was born we needed a bigger house.  Once again, Leo and the Cohen group sold my house for a massive profit to me which allowed me to get my wife our dream home.\n\nI couldn't be happier with Leo as a real estate agent and friend.  Leo and his team are absolutely spectacular.  If you're looking to sell and/or buy a home Leo and the Cohen Group NW should be your first and only call.",
        "owner_response": null
      },
      {
        "author": "Marielle Face",
        "rating": 5,
        "review": "Jed Holmes was friendly, helpful, and great at communication. As a first-time home buyer, the process seemed very scary to me at first. Working with Jed helped me feel like no question was too silly. He did a great job explaining everything which put me at ease. He responded quickly via email or text and was happy to show me as many houses as I wanted. I've already recommended him to my best friend and would use him again!",
        "owner_response": null
      },
      {
        "author": "Clare Schmidt",
        "rating": 5,
        "review": "Working with Leo was great from the start. As first time home buyers, we were very uncertain about how to go about the process. Leo took us under his wing and made sure not a single question was left unanswered. We felt like we could trust him to give us honest and practical feedback, and his fun-loving and down-to-earth personality made authentic communication feel very accessible. In this very challenging market, our home buying dreams came to fruition in large part due to Leo's patience and perseverance, with the help of his incredibly friendly and efficient team. To top it all off, Cohen Group supports small businesses and make charitable donations with every home sale. We are already recommending Cohen Group to everyone we know looking to buy a house!",
        "owner_response": {
          "text": "Clare! I am so glad that our paths crossed when they did. From meeting Kevin back in the day, to reconnecting, to getting the property search going, to finding the one!\n\nThank you for trusting in me and our team to get you guys from A-Z! It has been great working with you both and getting to know you both better through the proccess. Em and I look forward to spending some more time together once the sun comes out and things get a bit less weird with COVID. Welcome home!"
        }
      },
      {
        "author": "Barbara",
        "rating": 5,
        "review": "House sold in ONE WEEK! Excellent team of very talented people.  Leo was always accessible and very knowledgeable about resources,  and all things real estate The photography was exceptional. Paperwork was easily managed remotely and very well organized by Chris. I highly recommend this group.",
        "owner_response": null
      },
      {
        "author": "Schantell Porter",
        "rating": 5,
        "review": "My husband and I bought our first home with the Cohen Group in February. Max Burrage was our realtor. He was extremely communicative, positive, and overall so great to work with. The Cohen Group team kept us in the loop and guided us through the home buying process with ease. Thanks, Max! We absolutely love our new home.",
        "owner_response": null
      },
      {
        "author": "Amy D",
        "rating": 5,
        "review": "My husband and I worked with Christopher Lee. He helped us understand the process of first time home buying, navigating a crazy housing market, and all while my husband was deployed. So thankful for all the time and effort Chris and his team went through to ensure we were able to successfully get a house. We never felt like we were being pushed to put in an offer that was over our comfort zone, and Christopher was always available to give direction and advice whenever we needed it. Communication was always 10/10. Even when we had to lower our price point, we were always treated with the same great, kind, and fast service! Very thankful for Christopher and the whole Cohen Group NW!",
        "owner_response": {
          "text": "Amy, thank you for your very kind words. I'm incredibly thankful to have been part of your journey to finding the perfect home. Who would have thought that the 4th time is actually the charm?! Thank you for the perseverance and positive attitude you brought the process. I can't wait to see Dayton's face when he comes home! (you MUST catch this on video)"
        }
      },
      {
        "author": "Megan McClelland",
        "rating": 5,
        "review": "Buying our first home in a highly competitive market was daunting! Leo made the process less so. Here is what we loved about Leo:\n\n* Leo connected with us personally. He quickly identified locations and house attributes that fit our needs, wants and budget.\n* Leo was informative. He explained every step of the process patiently and thoroughly. He was swift to point out the positives and negatives of each house that we visited. We really appreciated all of his feedback.\n* Leo was straightforward and efficient when we decided to submit an offer. He analyzed neighborhood sales records and provided data-driven recommendations to ensure that we put forward the strongest offer possible. Our final offer was accepted mainly due to Leo's guidance and structure.\n* Leo has good, strong relationships with other agents in the community. He worked very well with the selling agents of the houses we were interested in.\n* Leo has worked and lived in the market for a long time. He also went through the process very recently for his family home. There's no one better to trust!",
        "owner_response": null
      },
      {
        "author": "Peter Hegman",
        "rating": 5,
        "review": "We worked with Leo for around 5 months trying to buy a house and he was great the whole time! In the end we bought a house that was pretty much exactly what we were looking for and I am sure that would not have been possible without Leo's help.\n\nAs first time homebuyers we didn't know much about the process of buying a house. Combine that with the crazy market and it can be pretty overwhelming. From day 1 Leo took the time to explain the process and understand what we were looking for. He never pushed us into something we weren't excited about but took the time to see a lot of houses with us so we could get a better sense of what we wanted. When it came time to put an offer on the house he did a good job of explaining the process and how we could make our offer stronger.\n\nLeo also has a good relationship with Ground Up Inspections and would help us setup pre-inspections on houses we wanted to put an offer on. In a market where you may have a couple days between seeing the house and putting in an offer this was incredibly helpful because it allowed us to feel confident that we were making the right decision.",
        "owner_response": null
      },
      {
        "author": "Lewis Jensen",
        "rating": 5,
        "review": "Purchased my second property through Leo and the Cohen group because they made it so easy the first time! Leo is super personable, and is always quick to answer questions through text or email, which shows his professionalism and investment to make sure your buying or selling experience goes smoothly. Cannot thank him enough.",
        "owner_response": null
      },
      {
        "author": "Kristen Hawks",
        "rating": 5,
        "review": "Words cannot begin to describe the proficiency, professionalism, and passion of the Cohen Group -NW Keller Williams Realty. My time-frame for purchase was unexpectedly and drastically reduced during the process, leaving only 10 days under the loan option. With only 10 days to find a home, my agent, Leo Cohen, worked around the clock, traveled to multiple counties, worked every angle, he even went to houses on my behalf when I was unavailable due to work. In the face of a highly competitive market and a narrow timeline, Leo made it happen. I just closed on my first home.\n\nAt this time, Christopher Lee, Director of Operations, came into the picture and he brought nothing but sunshine. Very few people are capable of bringing enthusiasm into the financial intricacies of a home purchase, and Chris is one of those people. Leo and Chris quickly became like family to me and I am eternally grateful for all that they have done. No matter the length of this review, I will never be able to fully express how incredible the Cohen Group is.",
        "owner_response": {
          "text": "Kristen, this is by far the best feedback on our group that we have ever gotten. Your kind words are truly appreciated. We know that the process of buying a home is 1. not easy 2. not always fun 3. (can be) very stressful at times. Our goal is never to sugar coat it but to truly take as much of those little things (that add up) off of your plate so you can focus on the handful of things that your decision while still maintaining a professional and personal life.\n\nFor us, we work with all types of people and having the luxury of working with people like you that value what we do, means the world. For that, thank YOU! We are all so excited for your new journey here in the PNW and most importantly to throw your taco house warming party.\n\nCheers to your new adventure my friend!"
        }
      },
      {
        "author": "Anthony Gass",
        "rating": 5,
        "review": "Max Burrage and Cohen Group NW were the absolute dream team as I purchased my first house. I felt supported, not rushed, and totally prepared for the process. It went incredibly smoothly and I'm so happy with the spot I got. I'm so grateful to have worked with Max, Leo, and the team!",
        "owner_response": null
      },
      {
        "author": "Robbie Carrasco",
        "rating": 5,
        "review": "Working with Leo made our first home buying experience so much less intimidating. Leo walked us through the entire process from start to finish. He toured dozens of homes with us, helped us submit multiple offers, and when we finally found the one, he was there every step of the way from the inspection to the final walk through.\n\nLeo is professional, friendly, and enthusiastic. His attitude keeps the home buying process upbeat even when its in a challenging market. Leos work ethic and ability to squeeze in showings at a moments notice does not go unnoticed. He was always willing to make appointments and show us houses the day they hit the market.\n\nWe are so grateful for Leos and his teams knowledge and experience in realty in Whatcom county and we cant thank the Cohen Group NW enough for helping us with a successful first home buying experience!",
        "owner_response": {
          "text": "Robbie! The market that you guys jumped in on (as you found out) was very competitive but thank you for sticking with it and having patience/diligence. I'm super stoked that you both are in Bellingham now and am excited to kick back with you guys on that back porch and enjoy a cold one. Cheers to you guys. We're neighbors! Cue taco party..."
        }
      },
      {
        "author": "Danielle Evans",
        "rating": 5,
        "review": "Leo & his team did an excellent job in helping us sell our home. They communicated very well - especially since we lived out of state. I would highly recommend them to everyone. Leo was very knowledgeable in the market and helped sell our house quickly. He was VERY responsive and helped negotiate and close quickly.\nBest. Decision.\n\nI will always be appreciative of their assistance!",
        "owner_response": {
          "text": "Danielle, we are all grateful that we had the opportunity to work with awesome people like you and Levi! Thank you for your kind words!"
        }
      },
      {
        "author": "Cameron Dunn",
        "rating": 5,
        "review": "Leo and his partner Chris were always available whenever I wanted to look at a house, and were immediately on top of any offers. They were great with communicating with other agents to help us stay on top, and ultimately helped me find a great house.",
        "owner_response": null
      },
      {
        "author": "Jason Smith",
        "rating": 5,
        "review": "Leo has been a spectacular realtor.  Ive been wanting to move into Bellingham for a couple years now but with my very demanding job I wasnt able to make the time to get through the process.  Until I connected with Leo.  He met me at his office, on the weekend, and we went through at least 30 houses.  He was honest, straightforward and did a great job pointing me towards the right house.\n\nAfter we found the house for me Leo put together a great team that answered all my questions, worked around my schedule and made me feel very well taken care of.  The entire process from offer to closing was smooth and stress free.\n\nI cannot recommend Leo highly enough.  He was always available, he answered my questions quickly, completely and professionally.  Leo genuinely cares about his clients having a good experience, not just with him, but with the entire home buying process.  He is a great resource to have and a strong advocate for your positions.\n\nIf youre looking for a realtor truly committed to personal and professional service, go with Leo.",
        "owner_response": {
          "text": "Jason,\n\nThank you for the kind words! It has been a pleasure working with you. I really couldn't create this experience without Chris, Emelie and Cooper!\n\nWe are all so glad that everything moved a long as smooth as it did. It was a pleasure getting to know you throughout the process. People like you remind us of why we all got into the real estate business. Thank you for choosing us :)\n\nWe are all here if you need anything going forward!"
        }
      },
      {
        "author": "Lindsey Sawtell",
        "rating": 5,
        "review": "Working with this team was such a breath of fresh air compared to past experiences. Leo got things started for us and was swiftly responsive and very helpful in getting us connected with Christopher. My husband and I were absolutely blown away by Christopher's knowledge, kindness, sense of humor, and dedication to finding the right house for us. Conversations with him were always fun and productive. During every step of the way, Christopher went above and beyond for us. We are very happy with our new home and are so appreciative for the guidance and kindness we had along the way!",
        "owner_response": null
      },
      {
        "author": "Louis Johnson",
        "rating": 5,
        "review": "Leo and his associates were the smartest thing my wife and I did during our moving process. We had a very unique property but Leo was able to market it to the kinds of people who were within that niche'. Out property sold quickly and for more than we thought we would get. He kept us up-to-date the entire way through and was easy to reach whenever we had questions. We have other properties and when we need a broker, we call Leo and \"The Cohen Group\"",
        "owner_response": {
          "text": "Lou, Thank you so much for the kind words. You're right it was definitely a unique property but our partnership to get that sold made all the difference! Honored that you chose us my friend!"
        }
      },
      {
        "author": "Mike Falette",
        "rating": 5,
        "review": "Buying a house during times of COVID certainly made for an interesting first time home buying experience but, Leo and his team made it as painless as possible during these interesting times.\n\nLeo was able to provide us with valuable guidance during a multiple offer situation and not only helped us to secure a wonderful first home but also helped us avoid bidding more then was necessary to close the deal.\n\nI would highly recommend Leo and the Cohen Group NW for any of your real estate needs.",
        "owner_response": {
          "text": "Mike, Thank you for the kind words and for trusting our team to help you and Arianna to purchase your FIRST HOME! Congrats again to you both."
        }
      },
      {
        "author": "Madison Emry",
        "rating": 5,
        "review": "Max and the team are amazing! We were intimidated to shop for our first home in a wild market, but Max was so supportive and his help relieved a lot of the stress of the process. He was always just a phone call or text away when we had questions, and he gave great advice and insight throughout every step of buying our home. He was a great listener and communicator, and in the end helped us find a perfect fit for our first home. We would highly recommend Max and his team!",
        "owner_response": null
      },
      {
        "author": "Miranda Brewer",
        "rating": 5,
        "review": "We were referred to Leo from a trusted agent in a different region. From the moment we were introduced, Leo got to work helping us find the house that \"checked all the boxes\" without putting any pressure on us. He used his experience and expertise in the Bellingham area to help us write a competitive offer and get our offer accepted within hours. Once we were under contract, we received regular communication and check-ins, and he made himself available if we had questions. If you are in the market to buy or sell a home, the Cohen Group NW is who you need by your side. They treat their clients with honesty and respect. We would definitely use the Cohen Group NW again. Thanks Leo and team!",
        "owner_response": {
          "text": "Miranda! It has been a pleasure getting to know you and Dustin throughout the process of making the move up to Bellingham. Thank you for trusting in the team and I to get the job done! We all appreciate your patience and diligence to get the job done. We could not have done it as smoothly without you both.\n\nMost importantly, WELCOME to Bellingham and to the neighborhood!"
        }
      },
      {
        "author": "Keith Robert",
        "rating": 5,
        "review": "Working with Leo and team was the definition of a seamless experience! I had a plethora of questions as a first-time home buyer and found Leo to be extremely responsive, knowledgeable, and personable. There were so many unknowns heading into this and the fact that I was kept informed every step of the way did wonders for my mental health  I cant imagine working with any other group, the Cohen group absolutely nailed it. Highly recommended!!",
        "owner_response": {
          "text": "Keith, It was a blast getting to know you throughout the process of finding you a home. We definitely had some challenges and lost a few (given the crazy market) but we ultimately landed on the best one. I am so stoked for you, the setting (all of the mountain biking) and that it went so smoothly. Thank you again for trusting us to guide you!"
        }
      },
      {
        "author": "Jane Mauk",
        "rating": 5,
        "review": "We had the best experience working with Leo and Chris at Cohen Group NW. From market analysis to presale advice Leo's expertise is spot on. Chris's help throught the sale and closing process made the transaction seamless. I highly recommend their team.",
        "owner_response": null
      },
      {
        "author": "Floyd Jones",
        "rating": 5,
        "review": "A friend recommended Leo and the Cohen Group when we were planning our home sale in another state. We're so grateful to have found Leo as our buyer's agent. We knew only a little about Bellingham from previous visits, and we hadn't even listed our previous home yet, so there were a lot of unknowns, and we were feeling pretty stressed. This was at the height of the bidding-war craziness, right before the Fed started raising rates, and the market was anyone's guess. From day one, Leo had our trust. He was a calming, realistic, and knowledgeable guide. As a long-time Bellingham-ian himself, he knew neighborhoods and builders, had a clear idea of price-to-value for a given home, and he had a lot of experience with purchasing strategies. We never felt rushed, and we always felt like he just wanted us to find the right home. Leo took the time to figure out what WE wanted and steered us in productive directions. He and his team were timely and proactive communicators at every step of the process (even out of state, well before we could start looking for a place in person), and he patiently handled every question and concern we threw at him. He also helped us find a short-term rental that didn't cost a fortune. That saved our bacon! Really helped us be here and look around without feeling rushed. We couldn't be more pleased with Leo and his team, and we'll recommend them to anyone who's considering a move to the Bham area.",
        "owner_response": null
      },
      {
        "author": "Deborah Wu",
        "rating": 5,
        "review": "My husband and I are new homeowners and we've had the privilege of working with Leo throughout the entire process. Leo has been great. He has been patient with us and has not been pushy at all. He has been very considerate of our needs and has been very quick with his responses to any of our questions at any time of the day or night. Leo is very personable and is excellent at what he does. We highly recommend Leo!!",
        "owner_response": {
          "text": "Deb, Working with both you and Mark was not only easy (because you guys are awesome) but was fun. People like you guys are the reason I enjoy my job so much! Congratulations on the new home and most importantly I am glad that through the process we have become friends. Cheers to your new home!"
        }
      },
      {
        "author": "Rhonda Girard",
        "rating": 5,
        "review": "Leo Cohen was great to work because he is honest, sincere, knowledgeable  and sincerely wants to find a home that fits your needs.  He worked with our family to find a place for us and patiently explored every neighborhood in Bellingham - sometimes seemingly street by street!  His team of Chris Lee and Tiffany Holden were great to work with too.  I would recommend using him!",
        "owner_response": {
          "text": "Rhonda! It was most definitely was a journey but at the end of the day it led you to the ONE! Thank you for your patience and diligence to make this happen. It truly takes a village and I am honored that you chose us to make the move finally happen. Cheers many years in Bellingham!"
        }
      },
      {
        "author": "Erin Willis",
        "rating": 5,
        "review": "Leo and team were attentive, courteous, and knowledgeable about our local real estate market. His photographer took excellent photos of the property, and their team professionally handled all open houses and interactions with the buyer on our behalf. We felt very well taken care of and if we find ourselves in a position to buy or sell again in Whatcom County we will contact the Cohen Group for repeat business. Thanks Leo!",
        "owner_response": {
          "text": "Erin, It has been an absolute pleasure working with you and Geoff! Jamie is an awesome photographer isn't she? We are so happy that we were able to help you guys accurately price, market and navigate the real estate market here in Bellingham. From all of us here at the Cohen Group, we wish you guys the best in your adventures overseas!"
        }
      },
      {
        "author": "Allyson Rosman",
        "rating": 5,
        "review": "Leo Cohen is an absolute joy to work with. He manages to make the daunting task of finding a property in this competitive area seem easy. He is reassuring, composed, and confident in his abilities as a realtor - as he should be, given the work he produces! He takes the time to get to know his clients and caters the experience he provides to their specific needs. Cohen Group NW is changing the game in Whatcom County. From their charitable contributions to their full-service concierge service, the experience I have had is truly unlike any other I have had before.\n\nI can't end this review without also thanking Christopher Lee for bringing his positive attitude to every single interaction we had. Negotiating deals on an investment property isn't a walk in the park, but he sure made it feel that way!\n\nThanks again for all of your hard work, and we can't wait to buy another property from you soon (once we finish this darn renovation)!",
        "owner_response": {
          "text": "Allyson, Thank you so much for the kind words and the opportunity to work with you and Tyler. Not only were you guys a blast to work with but thank you for making my job fun as well. We are all excited for you guys to get the ball rolling on your investment portfolio and help you continue to build wealth. Again, we are excited to continue to work together in the future!"
        }
      },
      {
        "author": "Grimm Northwest",
        "rating": 5,
        "review": "I couldn't be more ecstatic about the experience my fiance and I have had with the Cohen Group. Layla and Margaret have been with us every step of the way going above and beyond to make sure we are comfortable. This is our first time buying a home and I know we will continue to use the Cohen group for any future housing needs. We LOVE this group of individuals and would highly recommend anyone to use them. Thank you so very much. Our appreciation for your company knows no bounds.",
        "owner_response": null
      },
      {
        "author": "jessica rose",
        "rating": 5,
        "review": "Working with Christopher Lee and the Cohen group NW has been wonderful. They are detail oriented and timely with deadlines. Christopher Lee and the Cohen Group NW made sure to to keep us updated throughout the entire process of buying our first home from start to finish and answered questions as they arose. Over all, they made the experience of purchasing our first home smooth, pleasant, and less stressful. I would recommend Cohen group NW to anyone who is looking for a professional, knowledgeable, reliable, and friendly team that will find your potential forever home.",
        "owner_response": {
          "text": "Jessica, thank you so much for the kind words! I was so happy to find you and your partner the perfect home. I look forward to supporting you through the move and beyond!"
        }
      },
      {
        "author": "Tatiana Stone",
        "rating": 5,
        "review": "Working with the Cohen Group NW has been nothing short of a god send. It was our first time buying a house and Leo made the process so simple. He shared as much information as we asked for (which is hard to find!) yet kept the burdens of negotiation and other stressors off of us so we could focus on our move. It genuinely felt like the team wanted us to make informed decisions and to be happy with them. Buying a house and moving are some of the most stressful things that a person can do but this team worked so hard to make it as easy as possible. If you're looking for a realty team that treats you like a person, doesn't oversell you, and supports you throughout the entire process, look no further than the Cohen Group NW.",
        "owner_response": {
          "text": "Tatiana, It was an absolute pleasure working with you, Lynn and Will! We all appreciate the kind words and are so happy that it was a smooth transition. You guys made our job fun and remind us as to why we got into the business! Congrats on your new home and WELCOME to Washington!"
        }
      },
      {
        "author": "Semere Woldetatios",
        "rating": 5,
        "review": "Worked with Leo and his team and was a great experience from initial consult through the closing process. Worked with the team from out of town, but always received quick updates and attention. Waited for the home we wanted and won a very competitive offer through Leos negotiations with the selling agent. Definitely recommend use of Leo to friends and family.",
        "owner_response": null
      },
      {
        "author": "Rhiana Breedlove",
        "rating": 5,
        "review": "We decided to use The Cohen Group NW to help us find our very first home. My fianc and I love everything this company stands for and how they care so deeply for this community. Our Real Estate agent was Christopher Lee who was outstanding! He understands this business very well, which took so much stress off our hands. Being first time home buyers is a very scary thing, but Christopher made it so much easier. He was put up to the very difficult task of helping us buy a home during a world wide pandemic, but he worked tirelessly to accommodate for such. Also, my fianc and I work night shift, and Christopher was extremely flexible working around our hours. If you want to be cared for while making such a fun and exciting step towards purchasing a home, I encourage you to work with the Cohen Group NW!",
        "owner_response": {
          "text": "Ray, thank you both for trusting me to guide you this this huge milestone in your life. The journey was full of laughs, protective gear and plenty of adventure. I can't wait to see how you change this home to make it your own. And it will be just in time for us to throw you a house warming party!"
        }
      },
      {
        "author": "Laura Hamilton",
        "rating": 5,
        "review": "Leo Cohen and everyone at Cohen Group NW were so helpful in helping us find our new home! From the beginning, Leo was very professional and personable and listened to what was important to us, in order to ensure we found the perfect place. His many connections throughout the Bellingham community helped us find a place that checked all of our boxes, and the whole process has been smooth sailing. All of our questions were answered in a very timely manner, and we could always count on Leo to get us any information we were looking for. We would recommend Cohen Group NW to anyone who is looking to buy or sell a house in Whatcom County!",
        "owner_response": {
          "text": "Laura, Thank you so much for the kind words! I know it can be difficult searching for a home from far away but Im honored that you trusted in me to find you the right home and get it done during these crazy times. Ive enjoyed working with you and Sarah! Definitely excited for you to see your new home and to throw your taco and margarita party! Welcome back to Bellingham!"
        }
      },
      {
        "author": "Colin Edwards",
        "rating": 5,
        "review": "We worked with Max Burrage to buy a house in Bellingham this Summer. Max was recommended to us and was a great realtor for my partner and I. Max was super knowledgeable of the areas that we were looking into. We were in the process of selling a house in another state and Max was able to help guide us through the contingency process when buying our house in Bellingham. I would 110% work with Max again and would recommend him to anyone looking for a house in the greater Bellingham area.",
        "owner_response": null
      },
      {
        "author": "Howard Jacobs",
        "rating": 5,
        "review": "We are grateful for the hard working and focused efforts of Leo, Chris and the team @ Cohen Group. They represented us as the sellers with a collaborative approach, creativity and expertise that allowed for a smooth sale of our property. I highly recommend Leo, Chris and the Cohen Group !",
        "owner_response": {
          "text": "Howard, thank you so much for the kind words! We couldn't have asked for a better client to partner with on this sale and look forward to providing more great service in the future!"
        }
      },
      {
        "author": "Nate Brown",
        "rating": 5,
        "review": "This company has 5 stars and you can see why. Their whole crew is so genuine, so caring and clearly passionate of what they do. I think real estate is obvious a huge part of it, but more so it's them connecting with and helping people. If it's your first home or your 10th, they are their to help you at any pace. Thank you for everything you guys do from helping me find a home, giving Bellingham more unique of a personality and showcasing local businesses on your podcast. This is seriously the absolute coolest business with an incredible and wholesome crew running it. 10/5 stars",
        "owner_response": null
      },
      {
        "author": "N T",
        "rating": 5,
        "review": "So you are looking at this review because you are trying to find a solid person to help you buy or sell one of the most expensive things you will ever purchase or sell...no stress, right?!?!\n\nBecause internet reviews are strange, you don't know me from anyone: I moved to the area from upstate NY and owned four homes over 20 years working with some fantastic people - one sold my home for asking in 2009; talk about witchcraft. Of course, some were not-so-fantastic, but let's not dwell on them!\n\nI cyberstalked Leo online and liked the \"vibe\" I saw on social media and other publications. I liked that his group liked working together, and instead of talking about community, these people had actual events around town to build community.\n\nWhat a fantastic surprise to find out they are all EXACTLY like they seem online. Leo and his gang of happy agents, marketers, researchers, and all-around helpful types came through for me. The most important part is their honesty and directness - you need that when making such big decisions.\n\nPlus, they are all just lovely people. I hope this doesn't get me in trouble, but Chris notarized things for me along the way, and Leo helped me with my move. That's way more than service, that is neighborliness. What else can you ask for?\n\nIf it isn't clear, I think you'd be crazy not to hire these folks for your next big move!",
        "owner_response": null
      },
      {
        "author": "Andrea LaPlant",
        "rating": 5,
        "review": "My husband and I worked with Max Burrage at the Cohen Group and had the most amazing experience! We are not local to Bellingham but were looking for an investment property in the area. Initially we didn't have a realtor so we showed up at a listing I found on Zillow hoping to scope out the neighborhood and peak through the windows. Max happened to be showing another client the listing and welcomed us into the home to have a peak around. He gave us his card and the rest is history.\n\nSince we are not local, Max would do Facetime showings with us and record detailed videos of the homes that we were interested in. He also did a lot of research to ensure that the CC&Rs for the communities we were interested in would allow for our investment property. He was so patient with us - we met him in October and didn't find the perfect property until March. He has stayed in touch with us since closing and we truly feel like we made a friend during the process. I can't recommend him and the Cohen Group enough.",
        "owner_response": null
      },
      {
        "author": "Robert Bortner",
        "rating": 5,
        "review": "Although we had a bit of a rough ride in the sale of our house due in part to market weirdness related to Covid, and part due to an inexperienced team from the buyers, Leo and his team stood with us all along the way. They provided well-based advice, compassion and empathy, and strong leadership. I believe that had we gone with a less-experienced team, the deal might have fallen through. We really felt they were in our corner with our best interests all along the way.",
        "owner_response": {
          "text": "Bob! Thank you for the kind words. I agree that this was a wild ride from start to finish but I appreciate your trust and patience in us to get this done either way. It's been great getting to know both you and Larry over the course of the move and we are thrilled that you are able to move to a warmer and sunnier place! We are all grateful that our paths crossed. Cheers!"
        }
      },
      {
        "author": "Veronica Gonzalez",
        "rating": 5,
        "review": "Max from Cohen Group NW is not only a great realtor, but a great person! Buying a first home is a big process and he helped me through every part. Max is patient, friendly, and knows his stuff. Any questions I had, he knew the answer and got back to me so quickly. I can't recommend Max enough. He is the guy to go to! Max helped me find my perfect home.",
        "owner_response": null
      },
      {
        "author": "B Pearl",
        "rating": 5,
        "review": "Mike and Leo were amazing! When i listed my house i was working with a different realtor. My house was on the market for a year and still not sold. Thats when i decided to go with mike and Leo. They took new (better) pictures and revamped the listing. They had the house sold in just a few months! I would highly recommend them to anyone looking to sell or buy a house! You couldn't hope for a better team to handle such a huge decision.",
        "owner_response": {
          "text": "Thank you so much for the kind review! it was a pleasure working for you and Clint, you are 5 star clients and I hope we have the chance to do business with you again!\n\nMike, Leo and Chris"
        }
      },
      {
        "author": "Diane B.",
        "rating": 5,
        "review": "Leo is affable, extremely knowledgeable, efficient, caring, considerate, full of integrity, energetic, persistent, and just plain a joy to work with! I was extremely pleased with the outcome of my sale. I would--and will--highly recommend him to anyone needing a realtor.\nI met Chris Lee, his associate, at the closing end of the sale, and I found him to be equally professional and efficient.\nWhat an awesome team!",
        "owner_response": {
          "text": "Diane! Thank you so much for the kind words. It has been a pleasure getting to know you and working with you! Couldnt have done it without Christopher and your persistence to get this done."
        }
      },
      {
        "author": "Kelsey Klevenberg",
        "rating": 5,
        "review": "We purchased our 1st home through Leo and the Cohen Group NW. They were professional and super easy to work with. We were 1st time homebuyers, buyers coming from out of town, and during the pandemic. That could've been a recipe for disaster, but these folks made it easy. We had our ups and downs but came out of the process really happy with the home we purchased, and we even picked up a few new friends. Highly recommend.",
        "owner_response": {
          "text": "KK! Thank you for the kind words man and for yours (and Monica's) patience throughout the adventure of today's wild market. I agree that there were some ups and some downs but we are all super excited to have you both in Bellingham. Most importantly, It has been so great getting to know you both. As I have said many times, it feels like we've all known each other a lot longer than we have. Welcome to the upper, upper left! You guys are homeowners... How do you like them apples?"
        }
      },
      {
        "author": "Jordyn Kehle",
        "rating": 5,
        "review": "Leo and Chris were extremely calm and patient with us when buying a new home and selling our home all happened on, what felt like, a tight timeline. We appreciated their communication (using a variety of mediums) and always assuring us throughout the process. They are very professional!",
        "owner_response": {
          "text": "Jordyn, Thank you very much for the kind words! It was great getting to know you and Kevin! I agree, the timelines were tight and it takes a village... including you! We couldn't have made this happen without you both. Cheers to you and your new chapter!"
        }
      },
      {
        "author": "Daniel Romero",
        "rating": 5,
        "review": "Leo is by far the best and most attentive Real Estate agent that I have ever had the pleasure to work with. He is personable, helpful, and extremely down to earth. He made the homebuying process as painless as possible and I'd recommend him to anyone buying real estate in the Pacific Northwest.",
        "owner_response": {
          "text": "Daniel! Thank you for the kind words my friend. It's been great getting to know you and Ally throughout the adventure of buying your FIRST home! We are all so excited for your new chapter. Thank you for trusting us to guide you through the process!"
        }
      },
      {
        "author": "Kevin",
        "rating": 5,
        "review": "Worked with Max Burrage who was fantastic! He was able to get us into our first home smoothly and we really enjoyed the home buying process with him and the cohen group team. Everything was organized and the whole team was very knowledgeable regarding the local real estate market. Highly recommend!",
        "owner_response": null
      },
      {
        "author": "Whatcom Dental Lab",
        "rating": 5,
        "review": "Cheers to the Cohen Group! Leo, Chris and Cooper did an amazing job leasing out our commercial unit. We previously had it listed with another agent for a lengthy period of time, once Leo took it over we had multiple showings and before we knew it a perfect qualified renter. Buy, Sell or Rent Residential or Commercial we highly recommend the Cohen Group!",
        "owner_response": {
          "text": "Nate and Mike, Thank you for your continued support and kind words! We are grateful to be in business with you"
        }
      },
      {
        "author": "Grace Stauffer",
        "rating": 5,
        "review": "The Cohen Group made our out of state purchase of a Bellingham home smooth and painless.  Our realtor Layla Pollack was perfect - informative about everything in buying a home in this area, and also patient and an excellent communicator - I would highly recommend her. Chris Lee in the Cohen Group also cheerfully made our purchase - the signing of documents, etc. - pleasant and easy.",
        "owner_response": {
          "text": "Grace, your family was an absolute pleasure to work with, and it has been an honor to help you. Please know that our relationship doesn't end after your home buying experience. I am still here for you!  - Layla"
        }
      },
      {
        "author": "Stephen Winters",
        "rating": 5,
        "review": "Leo, Chris and Tiffany are a professional team that made the sale of our house in Burlington and the purchase of a buildable lot in Semiahmoo as smooth as possible.   They communicated clearly and responded to our requests for information in a timely manner.  I would not hesitate to recommend the Cohen Group.  Integrity, core values, innovation, laser focused on customer service.  This is how successful companies operate and grow.",
        "owner_response": {
          "text": "Steve! It has been such a pleasure getting to know you and Becky throughout the last 4 months. Thank you for being awesome to work with! We are all so happy that you have found your place at Sea Smoke and are able to downsize (no more creeping elegance). We are honored that you chose our team to help you both transition up north! We look forward to continuing to get to know you and sharing more bottles of wine!"
        }
      },
      {
        "author": "Howard Valentine",
        "rating": 5,
        "review": "John Angier helped us buy and sell our townhome.  John is a knowledgeable, personable, experienced realtor with outstanding communication skills.  He was with us every step of the way. He was instrumental in selling our townhome when there was issues with the buyers appraisal and their VA loan. We would highly recommend John as your next realtor to either buy or sell your property.  Thanks again John for your outstanding work.  A true professional.",
        "owner_response": null
      },
      {
        "author": "Alec Burke",
        "rating": 5,
        "review": "Well its been a few months since closing on my adorable new home and I can safely say that buying my first house in the middle of the pandemic home-buying crush was a uniquely intense experience Luckily I found Chris! I was connected with Chris through the RedFin app after requesting a viewing in a neighborhood I wanted to check out. He was early, friendly but direct and had answers to all my questions before I asked. While that house did not turn out to be the one, and neither did the first property I made an offer on, Chris was always happy to travel to various listings or locales I thought were promising as well as make recommendations for ones I missed. The best part of working with Chris was how helpful he was in guiding me through all the paperwork and how knowledgeable he was while explaining some of those details. He made himself regularly available if I had questions or concerns, and updated me at every turn. I would definitely work with him again in the future. Thank you, Chris!",
        "owner_response": null
      },
      {
        "author": "Symone Maruyama",
        "rating": 5,
        "review": "Leo and his team were easy to work, helpful and made the process very easy in buying our first house. so happy we ended up working with the Cohen Group!",
        "owner_response": {
          "text": "Symone! It was a pleasure working with both you and Reo. We are so glad that we were able to find your first home so quickly. We are all so happy for you both on taking a step in the direction of homeownership :)"
        }
      },
      {
        "author": "Paul Cohen",
        "rating": 5,
        "review": "Leo patiently stayed with me as I changed my mind over the course of the year looking for investment property.  He is quite responsive and inventive trying connecting the Bellingham real estate market and my expectations! Generally, buying a house isn't a lot of fun but Leo made it  go smoothly.  I highly recommend him!",
        "owner_response": {
          "text": "Paul! Thank you so much for the kind words. Im glad buying a home was fun for you. I know it wasnt always easy but you guys were great to work with. Im so happy we found the right investment that fit your needs!"
        }
      },
      {
        "author": "Peter Allen",
        "rating": 5,
        "review": "Leo is first and foremost a caring individual. Our conversations were as much about how he values his marriage, his friends and those he works with and for... as the property we might have been working together on. That is not to say Leo is not highly professional and informative. He follows through, responds quickly, and gets unanswered questions followed up on. He knows the area and regulations for the different zones etc. He is hungry but not pushy, on-top of it but not hyperactive. I could go on... maybe I already have... but Leo is a a pleasure to work with and I highly recommend him as someone who cares about your purchase/sale (and all the emotions, stress and excitement behind it) and he cares about you during the process.",
        "owner_response": {
          "text": "Peter, thank you so much for the kind words. I know this was one of the most complex deals but I am so glad that we all found a way to make it work! You and Michelle were an absolute pleasure to work with."
        }
      },
      {
        "author": "Olivia Lord",
        "rating": 5,
        "review": "Leo and Chris were awesome to work with on our first home. Every thing was speedy, efficient, and this team was extremely knowledgeable about things while maintaining a professional yet laid back attitudes. If we are ever in the market to buy or sell, we will definitely make a call their way. Thank you again!",
        "owner_response": {
          "text": "Olivia, It was a pleasure to work with both you and Darren! We appreciate the kind words! Congrats on your first home :)"
        }
      },
      {
        "author": "Terri Allen",
        "rating": 5,
        "review": "Chris made our dreams of unlikely homeownership a reality.  We were in a unique position to buy the home we were currently renting.  This was our first experience as homebuyers and Chris held our hand the entire time.  I dont think Ive ever experienced the kind of customer service he provided us.  He immediately contacted us after we were referred to him by work friends.  He never left our side.  I heard from him nearly everyday during the process, sometimes just to check in and ask how we were feeling or if we needed to talk about the stress of buying a home.  We developed a warm friendship and he got us in touch with an amazing circle of professionals that treated us to the same unique customer service.  Dont pass up an opportunity to work with Chris and his amazing group!  I honestly dont think we would have purchased this house without Chris and Cohen Group NW.",
        "owner_response": {
          "text": "Terri, thank you for these wonderfully kind words. I'm so happy to have met you and had the pleasure of working together. Jessica definitely knows how to match make!"
        }
      },
      {
        "author": "Kate Fadden",
        "rating": 5,
        "review": "Leo and his team were wonderful to work with! My clients and I received great communication from start to finish and we were able to provide a smooth transaction for all parties. I look forward to doing business with the Cohen Group again!",
        "owner_response": {
          "text": "Kate! Thank you for the kind words. It was a pleasure to work with you as well. We all look forward to working with you again."
        }
      },
      {
        "author": "Robert Riese",
        "rating": 5,
        "review": "Leo and his team are fantastic! We have contracted their services for buying and selling of homes. They are professional but authentic at the same time. Do yourself a favor and let Leo do the work for you.",
        "owner_response": null
      },
      {
        "author": "Rachel Finck",
        "rating": 5,
        "review": "Leo made the process of buying our first home feel far easier than we expected it could be. He is an excellent communicator who clearly answered our questions, listened to our preferences, and kept us informed at every stage.",
        "owner_response": null
      },
      {
        "author": "Alex Mynatt",
        "rating": 5,
        "review": "Max Burrage and his team were wonderful to work with and made what is normally a stressful process much more manageable and enjoyable. I worked with him for both transactions, purchasing my new home and selling my old one. I would strongly recommend using Max as your realtor!",
        "owner_response": null
      },
      {
        "author": "Rita John",
        "rating": 5,
        "review": "Christopher Lee represented us when we bought a house in May 2021.  Christopher is professional, responsive, thorough, and has a great attitude.  He provided additional data to help ease our concerns with costs, and he has infectious optimism.  We have purchased many homes over 30 years and Christopher Lee is our favorite relator!",
        "owner_response": {
          "text": "Rita and Brian, thank you so very much for these kind words. I'm so grateful to have met you both and had the chance to work together. Cheers to years of happiness in Semiahmoo!"
        }
      },
      {
        "author": "Tamara Lyn Robbins",
        "rating": 5,
        "review": "Working with Leo and the entire Cohen Group NW was fabulous! They are meticulous, professional, and on top of everything that needs to be done! We were kept in the loop with all communication and we knew they had everything under control! And as an added bonus....they are super fun to work with!!!!",
        "owner_response": {
          "text": "Tamara! Thank you for the kind words :) As much as we are bummed to see you and Dirk leave down south, we are so happy for you in finding your next home! Thank you for your trust in our team to get the job done. Em and I will miss you both!"
        }
      },
      {
        "author": "Jeremy",
        "rating": 5,
        "review": "Leo and his team are simply the best you can find. The amount of comfort and knowledge they gave us throughout homebuying process can't be beat. I would and will recommend Leo and his team to anyone.",
        "owner_response": {
          "text": "Jeremy! Thank you for the kind words my friend. We had a blast working with you and Stacy. Excited to see what you guys do to your FIRST HOME! Congrats again!"
        }
      },
      {
        "author": "travisandrebecca fox",
        "rating": 5,
        "review": "It was a great pleasure working with the Cohen Group. Top notch communication. So many Realtors forget we all have the same goal no matter which side we represent, and that is to sell the house. It was a collaborative effort with this one, and I wish all Realtors had your mindset. Keep up the good work and we'll see you on the next one.",
        "owner_response": {
          "text": "Travis, Thank you again for another smooth experience. I couldn't agree with you more. I really appreciate your mindset and collaboration to make this work. We are most definitely on the same page. Thank you for doing a great job for your clients and we look forward to working with you again!"
        }
      },
      {
        "author": "Sierra Beard",
        "rating": 5,
        "review": "Best real estate agent ever!! Super friendly and easy to work with. He got us everything we wanted in a home and was super patient with our requests! If anyone is looking for a home I would 100% suggest Leo Cohen as your agent.",
        "owner_response": {
          "text": "Sierra! Thank you for the kind words. We are are honored that you and Josh chose us to help you buy your first home! I know it wasn't always the easiest journey but we are so happy for you both. Onward and upwards!"
        }
      },
      {
        "author": "Levi Evans",
        "rating": 5,
        "review": "Leo and Chris are a great team! They were able to sell me house in WA in 3 days while I currently live in Indiana. You can expect honest and fast communication with Leo",
        "owner_response": {
          "text": "Levi, Great to meet you and we are all so happy that your home sold so quickly! Again, thank you for your kind words and we look forward to staying in touch."
        }
      },
      {
        "author": "Lauren Pena",
        "rating": 5,
        "review": "Leo, Chris and Mike did an amazing job on the sale of my condo. It sold in a week over asking price! I couldn't be more thrilled with the service that was provided (Photography, Open Houses, Time lines and Communication). I plan on using them for any of my upcoming real estate needs and referring them to friends and family.",
        "owner_response": {
          "text": "Lauren, thank you for the kind words and we are all so glad we were able to help you guys get your condo sold and on to the next phase of life! We are all happy it went so smoothly and are honored that you chose our team to help you do so!"
        }
      },
      {
        "author": "Dylan Langei",
        "rating": 5,
        "review": "Buy or sell, Leo is the guy. Not only does he have his thumb on the pulse of the market, but he puts you at ease with his stellar communication and friendly personality. If you want to buy or sell your next home and receive top notch service, call Leo.",
        "owner_response": {
          "text": "Dylan, thank you for your kind words and trust in us!"
        }
      },
      {
        "author": "Steve Mullenix",
        "rating": 5,
        "review": "Big shout out to Leo Cohen and Chris Lee at Cohen Group NW! This team is professional, punctual, and personable. I recommend them to anyone and hope we can close more deals together. Steve Mullenix, owner/broker at Peace Arch Real Estate in Blaine, WA.",
        "owner_response": {
          "text": "Steve, it was an absolute pleasure to work with both you and Julia! It always makes it easier for our clients when there are other great agents on the other end."
        }
      },
      {
        "author": "Christo Bolger",
        "rating": 5,
        "review": "Leo and his team are top notch. Very knowledgeable about the area and puts in the effort to find you a home. He's the type of person that I'd feel 110% comfortable referring my mom to which is feel like is saying a lot about someone. I'd highly recommend him.",
        "owner_response": {
          "text": "Christo, Thank you for the kind words! Doing business with you has been a pleasure!"
        }
      },
      {
        "author": "Jensen Lowell",
        "rating": 5,
        "review": "Leo and his team are the best choice in the business. They have strong knowledge of the market, take a hands on approach to selling property, and invested all the time needed for our deal to be successful.",
        "owner_response": null
      },
      {
        "author": "Stefanie Hindmarch",
        "rating": 5,
        "review": "We had a fantastic experience working with Max Burrage on the purchase of our first home! Max and his team were communicative and super easy to work with. We would definitely work with them again in the future.",
        "owner_response": null
      },
      {
        "author": "Paul Cohen",
        "rating": 5,
        "review": "I am retiring soon and Leo has been very resourceful, attentive, and explains well the process of purchasing my first investment property. He understands my situation, knows the region, and has a lot of contacts.",
        "owner_response": {
          "text": "Paul, It has been a pleasure working with you!"
        }
      },
      {
        "author": "Adam Morvee",
        "rating": 5,
        "review": "Leo is an enthusiastic Real Estate professional, who has his clients best interests in mind. I would recommend using Leo to sell or buy your next home.",
        "owner_response": {
          "text": "Adam, Thank you! Your recommendation is much appreciated. You have been great to work with!"
        }
      },
      {
        "author": "Andy Brandt",
        "rating": 5,
        "review": "Leo did a fantastic job taking care of me when I was shopping for a new home this summer. Very hands on and proactive. I wouldn't hesitate to recommend him to anyone looking in the area!",
        "owner_response": {
          "text": "Andy, thank you for the kind words. I know our situation wasnt the easiest road but Im so glad we found an off market home for you and everything ended up working out."
        }
      },
      {
        "author": "Tom Dietrich",
        "rating": 5,
        "review": "We worked with Jess Davis as an agent, and she's amazing. Jess was very communicative and responded to any questions very fast. She is extremely knowledgeable about the Bellingham area and real estate there. She also has a ton of inside knowledge and connections. Jess helped us learn so much in Bellingham house-hunting journey, and I would recommend her highly to anyone looking in the area.",
        "owner_response": null
      },
      {
        "author": "Sarah Sisk",
        "rating": 5,
        "review": "I highly recommend Cohen Group NW in Bellingham. They recently helped me buy a home in the neighborhood I chose and for the right price. Their communication was awesome and everyone on the team very friendly, helpful and knowledgeable. They are really connected with the Bellingham community which was a big benefit through the whole process.",
        "owner_response": {
          "text": "Sarah, It was so great to meet both you and Laura through your purchase of a home up here in Bellingham! I know it was definitely a challenge buying sight unseen but we are grateful that we were able to help keep things simple and smooth. Congrats on yours/Laura's purchase!"
        }
      },
      {
        "author": "J. Dobson",
        "rating": 5,
        "review": "Leo was easy to work with and very responsive to our needs.  He works hard to make the experience of buying a house as painless as possible.",
        "owner_response": {
          "text": "Jennifer! Thank you for the kind words. It was a pleasure working with you both to find the right investment property"
        }
      },
      {
        "author": "Alicia Shropshire",
        "rating": 5,
        "review": "Leo is an absolute pleasure to work with. He is reliable, knowledgeable and personable. He truly cared about his clients and will go above and beyond to meet your needs!",
        "owner_response": {
          "text": "Alicia, Thank you for the kind words! We are happy that we have been able to help you with your real estate adventure and are excited for what the future holds for you!"
        }
      },
      {
        "author": "C. Monster",
        "rating": 5,
        "review": "Leo and his team are amazing to work with. Their knowledge of local real estate and their professionalism make them my go to for all things real estate in Bellingham. Add to that they are fun to be around!",
        "owner_response": {
          "text": "Gary! Thank you for the kind words and thank you for contributing so much locally from both Click Monster and 122 West!"
        }
      },
      {
        "author": "Banipal Benjamin",
        "rating": 5,
        "review": "Leo Cohen and his team made our purchase transaction very easy and smooth.  We are looking forward to work with Cohen team as we are planning to relocate in Bellingham Washington near future.",
        "owner_response": {
          "text": "Ben, it was our pleasure! Thank you for choosing our team. We look forward to continuing to help you and your family in the future!"
        }
      },
      {
        "author": "Shawn VanLeeuwen",
        "rating": 5,
        "review": "Im an electrical contractor who deals a lot with realtors.  These people are the best to work for when the times come for our services.  They coordinate everything and are very organized and punctual.  All their clients seem to be very pleased when working with such a happy group of people.  All around a good company with good leadership.",
        "owner_response": {
          "text": "Shawn! Thank you so much for your support and providing such a high level of service to our clients."
        }
      },
      {
        "author": "Viry Bugarini",
        "rating": 5,
        "review": "What a smooth process to buy your house! From day one, Leo understood what we were searching for, and we did! I recommend him at a heartbeat to all my family, friends, and everyone!",
        "owner_response": {
          "text": "Viry, It was an absolute pleasure working with you, Matt and Kathy! We are all very excited for your new adventure and to see what you guys end up doing with the extra shop space!"
        }
      },
      {
        "author": "Melissa Walpole",
        "rating": 5,
        "review": "Leo and crew helped us find the perfect home! The whole process was smooth and fast! Much faster than I expected! This was due largely to Leo's expertise and attention! I highly recommend using Leo!",
        "owner_response": {
          "text": "Melissa, thank you for the kind words. We had a blast working with you and Charles and are so glad you guys are able to move from all of the traffic in seattle to your wooded paradise in Bellingham!"
        }
      },
      {
        "author": "Jordan Levien",
        "rating": 5,
        "review": "Layla and the team went above and beyond for me. Our home sold for well over asking in just 4 days! They worked hard to minimize the inconvenience of showings and were in constant communication through the whole process. I highly recommend them!",
        "owner_response": null
      },
      {
        "author": "Kristy Kuehfuss",
        "rating": 5,
        "review": "Leo and his team were excellent to work with from start to finish! We would recommend Leo without hesitation to our closest friends and family.",
        "owner_response": {
          "text": "Kristy! It was an absolute pleasure getting to know you and Jesse throughout this adventure making the move out to the west coast! We are so glad that you are finally able to move and happy with the service. We wish you nothing but happiness in your new home!"
        }
      },
      {
        "author": "Jim Burrage",
        "rating": 5,
        "review": "Max Burrage and the Cohen group sold our home for us in Puyallup and did an excellent job. More money, less hassle and a great smooth transaction",
        "owner_response": null
      },
      {
        "author": "Laura Randall",
        "rating": 5,
        "review": "We got the privilege to get to know Emelie a bit.  She was kind and considerate and so very patient even when we brought kiddos with us.  She listened to our wants and needs and found homes that fit our description.  Truly a delight!",
        "owner_response": {
          "text": "Thank you, Laura! It was such a pleasure getting to know you and your family. I appreciate the time you spent with me and the time you took to write this review. I look forward to seeing you out on the trails around town! - Emelie"
        }
      },
      {
        "author": "joshuaeg88",
        "rating": 5,
        "review": "I highly suggest using Leo as your realtor. He is super knowledgable, patient and very easy to talk to. I would absolutely use Leo again. Thanks for helping us find a home.",
        "owner_response": {
          "text": "Josh! We are so glad that we were able to find you and Sierra the right home. Thank you for trusting in us to do so. Congrats on buying your first home my friend!"
        }
      },
      {
        "author": "Briddick Webb",
        "rating": 5,
        "review": "Leo is a rockstar real estate agent. Great negotiator, hard worker and nice guy. Cant say enough good things about Leo",
        "owner_response": {
          "text": "Briddick! Always a pleasure doing business with you and I am glad to be in business with you as well!"
        }
      },
      {
        "author": "Coralee Lack",
        "rating": 5,
        "review": "Emelie and Chris went above and beyond!  Our home buying process was as quick and painless as possible.  They were both always available to answer our questions and solve problems.  Highly recommend!",
        "owner_response": {
          "text": "Coralee, thank you for your 5 star review! It was a pleasure working with you and Richard finding that right home with the perfect garage! We look forward to seeing the yard and home improvements in the months to come, please don't hesitate to reach out for vendor recommendations or questions moving forward. - Emelie & the entire CGNW"
        }
      },
      {
        "author": "Dustin Michaelis",
        "rating": 5,
        "review": "Cohen Group had great communication and are always willing to go above and beyond to take care of their clients. Highly recommend these amazing people.",
        "owner_response": {
          "text": "Thank you for the kind words my friend! We very much enjoyed working with you and getting to know you better in the process! Cheers to a new chapter in your life and we are excited to celebrate at your housewarming party!"
        }
      },
      {
        "author": "Rebecca Sadwick Shaddix",
        "rating": 5,
        "review": "We purchased a home listed by this group and were blown away by their professionalism, honesty, and communication skills. 10/10 would recommend working with them to buy or sell.",
        "owner_response": {
          "text": "Rebecca! You made our day (especially Layla's!) when you posted this. We're so glad to hear that Layla's work on the listing side made your buying experience a smoother process. Thanks for your vote of confidence!"
        }
      },
      {
        "author": "Ken Craig",
        "rating": 5,
        "review": "Layla, Margaret, and the entire team have been great to work with, and made buying our first home a great experience.",
        "owner_response": null
      },
      {
        "author": "molly brewer",
        "rating": 5,
        "review": "Outstanding service from start to finish. Would use them again in a heartbeat...professional, knowledgeable, and hardworking. And they have continued to help me long after the closing!",
        "owner_response": {
          "text": "Molly, thank you so much for the wonderful review! We all have loved working for you and getting to know you over the past year. Looking forward to meeting your horses when you make the final move! - Emelie\n\nThank you, Molly! It has been an enormous honor to have helped you make your purchase from afar. With all the stress and challenges that buying a home can come with, we value the trust you placed in us in seeing you through to meeting your real estate goals now, and for the future. After all, it is not just about finding you a house, it is about making that house a home! - Layla"
        }
      },
      {
        "author": "Jesse Nelson",
        "rating": 5,
        "review": "This group of awesome people donate a portion of every house sale to help people in need of clean drinking water in developing companies. That is rad!",
        "owner_response": {
          "text": "Jesse! Being in partnership with you not only as a local collaborative business but more importantly to continue the mission of bringing clean water to the world has been an absolute pleasure. We look forward to the future and continuing to grow together!"
        }
      },
      {
        "author": "Darren Richardson (Muphynz)",
        "rating": 5,
        "review": "Absolutely fantastic. Leo and Chris were on the ball and answered every question I had at any time . Day or night.",
        "owner_response": {
          "text": "Darren, we definitely pride ourselves in being on the ball and being responsive! So happy for you and Olivia on closing on your first home! This is just the beginning my friend. Cheers to being a homeowner!"
        }
      },
      {
        "author": "A",
        "rating": 5,
        "review": "Did a fantastic job, can't recommend them enough.",
        "owner_response": {
          "text": "Allyn, It was a pleasure working with you! Multiple offers in 3 days :) Thank you for being a great business partner and we are excited for you future. Cheers!"
        }
      },
      {
        "author": "Kayla Russ",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Amy Powless",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Amy! Thank you for the review. We appreciate you!"
        }
      }
    ]
  },
  "adjusted_review_count": 109,
  "adjusted_average_rating": 4.96,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 110
  },
  "summary": {
    "created_timestamp": 1739094998,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Bellingham Real Estate Co. has garnered numerous positive reviews, emphasizing their exceptional service and professionalism. Many users praised the responsiveness and dedication of their agents, particularly highlighting Leo Cohen and his team. For instance, a user described their experience as stress-free, facilitated by thorough communication and expert advice during the home buying process.</p><p>This sentiment was echoed by others who noted how the team’s local knowledge significantly eased their transition into homeownership. Reviewers consistently mentioned how comfortable they felt with their agents, who were described as personable and attentive. Overall, the company's strong customer service ethic seems to be a common thread in positive user reviews.</p></section><section id=\"great\"><h2>Great</h2><p>User reviews reveal that Bellingham Real Estate Co. is not just good; they excel in creating genuine and supportive relationships with their clients. Reviewers often mentioned how their agents went above and beyond in ensuring a smooth transaction, often noting the high level of professionalism alongside a personal touch. A particularly noteworthy review praised Leo and his team for their ability to handle multiple offers and complex negotiations, leading to successful outcomes for their clients.</p><pAdditionally, the company's commitment to community involvement, such as charitable contributions from sales, further enhances its reputation. Reviewers have expressed their appreciation for not just the professional services received, but for being part of a business that invests in positive local initiatives. This level of engagement indicates a strong alignment between the company's operations and the community values.</p></section><section id=\"bad\"><h2>Bad</h2><pDespite the overwhelmingly positive feedback, there is a notable negative review that highlights significant communication issues during a land purchase. One user felt that their agent prioritized the seller's interests, leading to an overall disappointing experience. This included delays in contract clarification and a lack of updates, culminating in the user feeling neglected in the process. They specifically pointed to the absence of communication once the property was closed as a major red flag.</p><pThis isolated incident suggests that while the team often excels in client relations, there may be inconsistencies in their service, particularly when clients feel they are not the focus. Nevertheless, this review appears to be an outlier when considering the overall enthusiasm expressed by the majority of other users regarding their experiences with the agency.</p></section><section id=\"ugly\"><h2>Ugly</h2><pUpon reviewing the collected feedback, it's evident that the Bellingham Real Estate Co. has generally avoided serious pitfalls that would warrant an \"ugly\" section. However, the one negative experience reported sheds light on potential oversights in service quality that could be considered troubling. The review pointed out the feeling of being sidelined during the transaction, especially concerning communication, which is critical in real estate dealings.</p><pThe agent's focus on securing the seller's interests at the expense of their own client's satisfaction raised concerns about the overall integrity of the service given in this specific case. While this negative experience is not representative of the company's operations, it serves as a cautionary tale for potential clients to ensure they have open lines of communication throughout their transaction.</p></section>"
  }
}