{
  "name": "Belleau Woods Apartments",
  "slug": "belleau-woods-apartments",
  "company_type": "Property",
  "address": "4018 Northwest Ave, Bellingham, WA 98226",
  "review_count": 52,
  "average_rating": 1.96,
  "reviews": {
    "google_reviews": [
      {
        "author": "Raf Xander",
        "rating": 4.0,
        "review": "Pros:\n- Relatively close to WCC, The Guide Meridian Bellis Fair and bus stops.\n- Online portal for rental payment and maintenance requests\n- Rent increases have been relatively minor compared to other rental properties\n-Staff and owners go outside of the box to help residents from time to time\n\nCons\n- Lack of parking (Depending on which building youre in, this gets worse during renovations)\n- Proximity to unhoused encampments, etc. (Had to ask someone to not sleep in our parking garage)\n- Occasional car break-ins\n- Neighbors sometimes, people pull some real petty nonsense.\n\nOverall, good for what it is if you have the right expectations going in. Fill out your entry form correctly, know your rights as a renter and keep cameras in your apartment/car if youre able. Its decent for the most part.",
        "ownerResponse": null
      },
      {
        "author": "Katie",
        "rating": 5.0,
        "review": "Overall a great experience living here. The people in the office are so nice and very helpful.",
        "ownerResponse": null
      },
      {
        "author": "kaitlin g",
        "rating": 1.0,
        "review": "The staff is very rude. And they dont leave you alone. I understand that its their job to get people to move in, but they kept calling and emailing me several times a day. The expected me to bring a deposit on the day of my tour. After just speaking on the phone with them the day before, I received a text saying they were going to shred my application if I didnt tell them what floor plan and I what day I wanted to move in by the end of office hours. The apartments are very small, dated, and overpriced for what they are. Although they do allow pets, theres no where to walk your dog or let them out at all. Parking is very limited and crowded to the point that its a safety hazard. They definitely built the community with profit in mind, not what was best for the people living there. The gym is just a small room with four machines in it, and the playground is just as small and pitiful. When I expressed to them what was holding me back from moving there, they basically told me dont bother and they blocked my number so I couldnt respond. All in all I did not have a good experience with their staff and I do not recommend them at all.",
        "ownerResponse": null
      },
      {
        "author": "Samantha Mantey",
        "rating": 1.0,
        "review": "Worst experience of my life living here. Neighbors rude claiming my dog was barking all day. Had to get a camera to prove he wasn't. They also charge you for noise complaints with no evidence. My car was stolen from the garage they have no cameras or any kind of security.Constant break ins into cars. And I have heard they changed management but when I lived there the manager was one of the rudest most Condescending people I have ever met in my life. The new management seems nicer but they just sent me a bill for damages even though it has been more than a year since I moved out. A year! This place is cheap if you absolutely need somewhere to live but I recommend looking elsewhere at all costs.",
        "ownerResponse": {
          "text": "I would like to point out that once I reviewed your file I was able to remove the charges you owed at your move out and you now do not owe anything. I am sorry that you had a bad experience here with past management.\n-Belleau Woods Apartments"
        }
      },
      {
        "author": "Seldom Pearce",
        "rating": 5.0,
        "review": "I am currently in my second year long lease agreement with them and I am very pleased. They do not claim to be a low-income housing property, and this is one of the reasons my partner and I chose the complex. Despite this, their prices are actually very reasonable considering the location, size of the units, etc. They are quite welcoming of pets, their on-site maintenance staff are friendly and have always responded quickly to our admittedly few issues. The office staff have always been courteous, polite, professional and kind when Ive dealt with them and now that we have a renters portal where we can pay our rent automatically we literally have no complaints. I highly recommend ANYONE to rent here.",
        "ownerResponse": null
      },
      {
        "author": "Trace Evans",
        "rating": 1.0,
        "review": "Where to begin. I have been renting with this complex for almost 4 years. I take my finances seriously and make it a point to drop my rent check off first thing every 1st of the month. Over the last 4-5 months they have accused me 3 times of not paying on time. Each time I had to spend my time jumping through hoops just to have the charges removed. This third time, however, they are being very difficult and the office manager is treating me, a long term, good standing tenant, with an aloof and callous attitude, and even laughed at me when I brought the concern to her attention. It is to the point now that Ive retained a lawyer to help me fight this miserable place. Rental history is extremely important so when they laugh at my concern, I take it personally. If you can help it, dont rent here. They are over-priced, small, and the office staff changes frequently. Im now on the third round of staff, and none have made me feel that my business is respected. I can only imagine what tenants who struggle with money and cant always pay on time go through with this place. They have no concern for the well-being pfntheir tenata, even those who pay on time, every time.\nThey charge erroneous fees and rent jumps by at least $30 every year. Pet fees are insane. $300 deposit and $300 Non-refundable fee plus pet rent every month. This is for 1 cat. I will be glad to leave this place.",
        "ownerResponse": null
      },
      {
        "author": "Emmanuel Waore",
        "rating": 4.0,
        "review": "This complex is great. The rent is reasonable for the size of the unit. The main office staff is friendly and helpful as well as the on site maintenance team who are efficient and resourceful at fixing problems. It's has pet friendly units and is silent at night (at least my block is). Plus a gym and lounge with a pool table. I'd recommend them to add a designated smoking zone so people stop smoking in the parking lot. It would save them face value for future residents.",
        "ownerResponse": null
      },
      {
        "author": "Katrina Anonymous",
        "rating": 1.0,
        "review": "Worst place to rent, they suck you dry, the pull all the money they can outta you the threaten you with claims, most of the fees are bogus Not worth it! They changed their managment again for the 6 time since I was there. They told me that my deposit was forfeit before I even moved out, never renting again, renting experience ruined! Not only they were changing the roof in winter time for two months my apartment was as cold as the outside! Neighbors either fighting or blasting music!!! Also they have homeless people going through garbage or random people looking into your car, there were teens smoking in the garage and taking pictures of vehicles! Never recommend this place!",
        "ownerResponse": null
      },
      {
        "author": "Rex Roussell",
        "rating": 1.0,
        "review": "I worked here for 2 months. They told me there was raises every couple months. And that it was a long term position so I quit my job with job security to try this place. Kelly knowing that I would only take the job if it was to be long term lied through her teeth to get me to join the staff. Telling me everything i wanted to hear. Well the first two paydays mind you the first month i worked there my paychecks were wrong or i didn't even get all of my pay. That was for starters. After seeing all the conditions of the apartment and how they are hiding the fact of black mold in the walls and massive amounts of water damaged wood in the structure of the building and the very sketchy way they were having us repair it. I was shocked. As many people know who live there we were doing a massive roof project on 2 of the buildings. Well as soon as they were done I was called into the office and told that I was to be termanated because of lack of performance. And that I was on my phone all the time. Witch was not true. Kelly is the worst manager I have ever work for. This place is a joke. And if you are thinking about getting a job here don't waist your time like I did.",
        "ownerResponse": null
      },
      {
        "author": "Renae L (Rusche)",
        "rating": 1.0,
        "review": "The maintenance staff are nice, but the office staff don't seem to know what they're doing. My roommate and I have gotten a few false notices about money owed or non-payment on things when we have proof our checks cleared properly. A few times we have called and left messages and then gone into the office at the end of the day to verify that anyone has received these messages and they haven't. It's ridiculous.\n\nI can nearly guarantee you won't ever receive your deposit back because they will gouge you for every penny you've got.\n\nWhile it's a convenient location, parking is getting bad and the management is awful. I would advise anyone who has other options to avoid Belleau Woods.",
        "ownerResponse": null
      },
      {
        "author": "Yarrow Decker",
        "rating": 1.0,
        "review": "4006 building is a disaster compared to the other buildings. This one seems to be ignored as far as landscaping. I think maybe its because they get money from the government to house people with disabilities, and there is no incentive for them to impress new prospects.",
        "ownerResponse": {
          "text": "We have not received any complaints in our office from you in regards to the landscaping. If there is an issue, please let us know and I would be happy to reach out to the landscaper. We have always addressed your work orders in a timely manner. And, we do not get money from the government to house people with disabilities. We have been and will continue to be making small improvements at the property as needed. Your building is certainly not a disaster as you are stating and we will be doing some siding replacement later in the summer. "
        }
      },
      {
        "author": "Sub Scorpion",
        "rating": 1.0,
        "review": "recommend not living here. management will lie to you in order to benefit. also make sure when moving out to keep a copy of every document and statements of proper procedure other wise they will falsely claim lack of proper notice. and make you forfeit your entire security deposit. also they will tell you they don't do pro rate when its stated in the contract lease that they do.",
        "ownerResponse": null
      },
      {
        "author": "Dawn Magana",
        "rating": 2.0,
        "review": "Bad management, not at all friendly.... They take care of the area around the office, but we havent had walk ways around the resident buildings presser washer in about two years they used to do that every spring or summer. Appliances are old and not always working right... used to be a clean and a friendly place to live.\nBut its hard to find a place that allows you to have pets.",
        "ownerResponse": null
      },
      {
        "author": "Kylie",
        "rating": 1.0,
        "review": "Kelly is absolutely horrible. Worst management ever. The girls in the office are super sweet, but every month I have had an issue. Kelly just wants to steal all your money, and shell bump your late fees up every month, and bounce your payments only to charge you MORE LATE FEES. shes called us names, and laughed in our faces. Shes so condescending and manipulative, and I cannot wait to be out of her facility. SAVE YOUR RECIEPTS PEOPLE! Or better yet just dont ever live here.\nI have a Stack of papers with all  mistakes, with proof of every one of them. So frustrating.",
        "ownerResponse": null
      },
      {
        "author": "Renee Chadwick",
        "rating": 4.0,
        "review": "I've enjoyed living here and never had any problems with the management or maintenance staff. They have always been quick to respond and are very helpful. The only thing that worries me is the amount of strange people walking around stalking vehicles but we have some amazing people who live here that do walk arounds.",
        "ownerResponse": null
      },
      {
        "author": "Elle13 Roses",
        "rating": 1.0,
        "review": "Nasty staff! Nasty attitudes! Rats everywhere.. junkies outside blasting loud music at the Hotel next door. Homeless people going thru the mail and trash. No security or real matainece ever unless you beg. Management is a chain-smoker never really inside the office working just outside smoking..all day. Noisey construction to try hiding the Black mold infestation and hidden fees. Rip off not worth a dime. As I moved in..five families moved out because of managements bad attitude. I held my money and left too. Dirty, uncleaned carpets in new units. Cheap breakable blinds (which your responsible for the repairs)!. Ew please avoid if possible. Place gone downhill.",
        "ownerResponse": null
      },
      {
        "author": "Tyler Ford",
        "rating": 2.0,
        "review": "Lived for ~1year horrible service, they dont care about tennents. They refuse to install cameras in parking garages where cars are \"frequently\" broken into because no one can see them do it its actually safer to park outside. Their maintenance is slow and doesn't fix things within legal time limits and do very poor work (from the repairs ive seen as a previous head maintenance elsewhere) it also seems from talking with other tennents that they'll take advantage of anyone possible when trying to get ur deposit back while not doing the things they say they are charging you for. Advice: keep photo/written records of everything and know your rights, washington has really started to recognize tenant rights, nows the time to protect yourself because our courts are finally taking the side of tenants, also one example of a law to know....if they charge you more than that was originally stated in your lease (100 for carpets \"non refundable\" part) and you can prove through photographs or other means that they overcharged or falsely charged you for anything they're required to pay you double your deposit back! Know your rights!",
        "ownerResponse": null
      },
      {
        "author": "rainen",
        "rating": 1.0,
        "review": "Do you like buildings that aren't protected or monitored? Where people can literally urinate, defecate and destroy the tenants property without the managenent doing anything at all to help? Well then belleau woods is the place for you. Horrible service unfortunately I can't give less than one star but please go not give these people your business.\n\nTwo cars broken into with rocks in the past 4 days and managements response is well too bad so sad. No cameras or anything horrible service and horrible people.",
        "ownerResponse": null
      },
      {
        "author": "Elizabeth JR",
        "rating": 1.0,
        "review": "Never live here. I still contest to that fact that living here as made my anxiety go to an all time high. I can not wait until the day our lease is up to get the hell out because of all the craziness. Place is disgusting with urine, garbage and throw up on the stair cases; loud neighbors every night partying; multiple car break ins; and horrible maintenance staff.\n\nI dread coming home every day because of this complex.",
        "ownerResponse": null
      },
      {
        "author": "Anna Melnyk",
        "rating": 1.0,
        "review": "Seriously the WORST MANAGEMENT  ever!! I strongly recommend for no one to live there because of their staff! They will get the last penny out of your pocket when youll be moving out ! They rip people off ! I had a lot of problems with then while living in their apartments . If they change their management maybe it will get better !!",
        "ownerResponse": null
      },
      {
        "author": "Joseph Pham",
        "rating": 1.0,
        "review": "They promise that they have apt at the end September when i went there to apply my application , so i believed and said to my old apt i would leave. However, the belleau woods called back and said they didn't have apartment.. Money plus apartment are gone.... I hope people who are trying to apply think carefully about this apartment service.",
        "ownerResponse": null
      },
      {
        "author": "Rey Sibay",
        "rating": 2.0,
        "review": "Rent is reasonable for the size of the unit, but there were a few problems with my shower and some things with the kitchen.\nOne lady in particular who works in the office needs to work on her professionalism, she comes off short/rude.",
        "ownerResponse": null
      },
      {
        "author": "Ravageritual X",
        "rating": 1.0,
        "review": "1/11 We have had gun shots fired within the complex 3 times in the last 2 months and the owner has taken zero action. He has not even addressed the issue through an email. Plan on moving to a place with less **gunfire**.\n\nEdit: 4 times 3/27",
        "ownerResponse": {
          "text": "The Bellingham Police Department responded to this situation and has done their job. The shooting was not related to any of the residents in this complex."
        }
      },
      {
        "author": "Cougar Holliman",
        "rating": 1.0,
        "review": "Would've gave it 0 stars if it were possible. Great area and buildings but absolutely horrific management and ownership. If you enjoy being harassed on the regular by the people in the leasing office then this is the place for you, however, if you want to live and let live this is not the place for you  .",
        "ownerResponse": null
      },
      {
        "author": "Arminda Luciano",
        "rating": 1.0,
        "review": "This is one of the worst apt. complexes I've ever resided in. The owners are thieves, they over charge for rent, many appliances have gone bad, the elevator was always malfunctioning, and they have way too many rules for tenants! It's like living in a 3rd world state! HORRIBLE! Rent elsewhere or you'll regret the day you signed a lease with these assholes!",
        "ownerResponse": null
      },
      {
        "author": "Theresia Russell (TT)",
        "rating": 1.0,
        "review": "new rentee: filthy carpets, broken disposal (6 wks, not fixed) washer leaks,  patio needs maintenance. Really gone down hill. Rented here 2 years ago and was much better.",
        "ownerResponse": null
      },
      {
        "author": "Jimmy O'Connor",
        "rating": 1.0,
        "review": "Kris Wentworth was extremely rude and will not answer mine or my lawyers calls. He modified the contract hours after we signed the pre-lease papers, which in turn makes the contract null and void.",
        "ownerResponse": null
      },
      {
        "author": "Heather Hulford",
        "rating": 5.0,
        "review": "Very hard working staff. Quick to handle work orders and always friendly.",
        "ownerResponse": null
      },
      {
        "author": "charlie defreest",
        "rating": 1.0,
        "review": "There are many bad reviews of this place on the web and they all are true! Do NOT come live here! The staff are incompetent and irresponsible. My car was wrongly vandalized by the staff and they refused to fix it. They don't care at all about the people who live here.",
        "ownerResponse": null
      },
      {
        "author": "Esther Kukhahn",
        "rating": 4.0,
        "review": "Lots of apartments at this place. Easy to get turned around. But over all nice places in the middle of Bellingham.",
        "ownerResponse": null
      },
      {
        "author": "AJ MB",
        "rating": 1.0,
        "review": "They make you pay 40$ to apply even though there is are 13 people behind you on the waiting list. I would avoid this place .",
        "ownerResponse": null
      },
      {
        "author": "Trevor Haverkamp",
        "rating": 1.0,
        "review": "Not clean when we moved in, unprofessional management, never rent here its not worth it.",
        "ownerResponse": null
      },
      {
        "author": "Doc. Vendiola",
        "rating": 1.0,
        "review": "Miscommunication, charging us on things that weren't out fault, poor management. DO NOT RENT HERE!",
        "ownerResponse": null
      },
      {
        "author": "M Vongola",
        "rating": 1.0,
        "review": "WE HAD A WASP NEST IN A WALLL AND WE MENTIONED IT FOR MONTHS THEU NEVER DID ANYTHING.",
        "ownerResponse": null
      },
      {
        "author": "angel eyes",
        "rating": 1.0,
        "review": "Realy rude staff.......bad service........big no",
        "ownerResponse": null
      },
      {
        "author": "Deadlift zach",
        "rating": 1.0,
        "review": "Bad Bad Bad Bad service!!",
        "ownerResponse": null
      },
      {
        "author": "taran Kaur",
        "rating": 4.0,
        "review": "Nice place",
        "ownerResponse": null
      },
      {
        "author": "Roman Murray",
        "rating": 4.0,
        "review": "It also holds a good job for percent things.",
        "ownerResponse": null
      },
      {
        "author": "Jill Robey",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Daniel Cox",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Devin Parke",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Blain Allred",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "S teddy",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Amanda Larson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Monique Green",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Summer Igou",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Hardi Adam",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Harsukhraj Khehra",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Samantha M.",
        "rating": 1,
        "review": "Worst experience of my life living here. Neighbors rude claiming my dog was barking all day. Had to get a camera to prove he wasn't. They also charge you for noise complaints with no evidence. My car was stolen from the garage they have no cameras or any kind of security.Constant break ins into cars. And I have heard they changed management but when I lived there the manager was one of the rudest most Condescending people I have ever met in my life. The new management seems nicer but they just sent me a bill for damages even though it has been more than a year since I moved out. A year! This place is cheap if you absolutely need somewhere to live but I recommend looking elsewhere at all costs.",
        "ownerResponse": null
      },
      {
        "author": "Aspen B.",
        "rating": 1,
        "review": "All of the negative reviews are true. The disrepair, rats, crime are all frequent issues. This place has not been maintained in years and its very apparent. My husband has severe asthma and we have been waiting for a year for them to remedy water damage and mold from old broken windows. Rents go up nearly 100 dollars every lease renewal. They lose your money and then charge late fees. Repairs often consist of telling you nothing is wrong, or stealing random possessions to fix things. When our refrigerator stopped working, it took them 3 days to bring another one (straight out of the junkyard). Walls are so thin that you can hear every conversation from all your neighbors, hope you like rap music at 2 am. Besides the structural issues (which are plentiful), the crime is outrageous as well. There is no security in place, frequent car break ins, and overdoses and other unsafe situations from people wandering in off the streets. There is now a Facebook page dedicated to petitioning for security, since management would have to spend money to make this place safer for their residents, and fixing things is not their bag. Multiple professionals have said this place should be condemned, and they're not wrong. Since speaking out I have faced retaliation from management sending erroneous threatening letters with bogus claims about our tenancy. Please for your own sanity stay far far away from this place, and if you live here and have been wronged, please speak up!!",
        "ownerResponse": null
      },
      {
        "author": "Lisa O.",
        "rating": 1,
        "review": "The management here is the worst. High attrition rate amongst office staff. Absolutely the worst human interaction I've ever had. Cars get broken into, tires slashed, not a good area, does not be fooled by appearances. Stay away!!",
        "ownerResponse": null
      },
      {
        "author": "Rebecca E.",
        "rating": 1,
        "review": "I'd like to start by saying...never live here ever. The staff is dumb and loses your rent money and causes you of never paying even though I had copies of my checks from my bank made. They sent me 3 day notice to vacate even though I paid BEFORE it was due. I told them I already paid and they said multiple times they had it taken care of but for some reason I was still getting vacate letters, emails and late charges on my portal. They don't have parking, there's rats everywhere, rude staff, don't give you notice for anything and just enter your apartment while not there and left it UNLOCKED so I come home thinking someone broke in. They look through your packages, \"lose\" your packages, mail missing, water leaks, construction 24/7, said water was included in rent but it's not and also they run the sprinklers all night and charge you because it's \"shared water\". They don't give a crap about anyone here or keeping the place clean and safe. I would give 0 star rating if I could. I also have asthma and the construction mixed with every person including the workers here smoking so I can't open my windows even though it's 85 degrees out. Also your car will get broken into, drawn on, scratched, hit, etc. no cameras, no security, and they don't care. They want money and will do anything to get/steal it.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 42,
  "adjusted_average_rating": 1.79,
  "summary": {
    "text": "<section><h2>Good</h2><p>Some user reviews express satisfaction with certain aspects of Belleau Woods Apartments, particularly appreciating the property's convenience with its close proximity to public amenities, such as WCC and The Guide Meridian Bellis Fair. Others praised specific elements such as an online rental payment system, on-site maintenance, and the staff's occasional willingness to go beyond typical duties to assist residents.</p><p>Despite the mix of sentiments found among the user reviews, an undercurrent of satisfaction comes through from tenants who appreciate the pet-friendly policies, the quietness of certain apartment blocks at night, and the fact that the apartments are equipped with essential facilities like a gym and a lounge area. These points of contentment, although not universal, indicate that for some, Belleau Woods Apartments has been a satisfactory home.</p></section><section><h2>Great</h2><p>Residents have highlighted great experiences, emphasizing the staff's friendliness and helpfulness at times, which has contributed to a positive living environment for some. There are accounts of on-site maintenance staff being efficient and resourceful, addressing issues with promptness and professionalism. The office staff have been noted for their courteous and polite interactions with tenants, creating an overall amiable atmosphere.</p><p>Not to be overlooked, some reviews reveal that the rental prices at Belleau Woods Apartments are deemed reasonable considering the apartment sizes and location. Additionally, the community's policy on pets has been highly regarded by many pet owners as a great benefit. With these positive experiences, the apartments have been recommended by various satisfied tenants, suggesting a welcomed living situation for individuals and families alike.</p></section><section><h2>Bad</h2><p>User reviews of Belleau Woods Apartments have indicated issues such as miscommunication and instances of perceived rudeness from the staff. Residents have reported frequent management changes that contribute to an environment of inconsistency and frustration, with the office staff sometimes coming across as indifferent or uncooperative. Several reviewers have recounted experiences of being inaccurately billed for rent or other miscellaneous charges, reflecting broader concerns over the management's handling of financial transactions.</p><p>Another recurring complaint mentioned in the user reviews is the problem with parking. With limited and crowded spaces, tenants have expressed dissatisfaction over what seems to be an oversight in community planning, leading to potential safety hazards. Furthermore, remarks about dated and cramped apartments have surfaced, with some users considering them overpriced given their condition. Such recurring themes in the bad aspects of reviews point to a general discontent with the way the property is managed and how resident concerns are addressed.</p></section><section><h2>Ugly</h2><p>The \"ugly\" side of Belleau Woods Apartments, as reported by users, involves serious allegations of negligence concerning security and property maintenance. Instances of car break-ins and thefts within the compound appear to be common, with a notable absence of security cameras or measures to prevent such incidents. Reviews also document cases where maintenance issues, such as water damage and mold, persisted for extended periods without adequate response from the staff, raising health and safety concerns among the residents.</p><p>Apart from physical neglect, interactions with the management have been described as hostile, with accounts of staff members being condescending and even retaliatory towards tenants. Grim descriptions include the sighting of rodents, inadequate responses to damage caused by environmental factors, and blatant disregard for tenant property. Some reviewers have expressed a sense of relief in leaving the complex, while others have warned prospective tenants to steer clear, painting a stark picture of an apartment community in distress.</p></section>"
  },
  "timestamp": "09/07/2024"
}