{
  "name": "Brampton Court Apartments",
  "slug": "brampton-court-apartments",
  "company_type": "Property",
  "address": "1470 Birchwood Ave, Bellingham, WA 98225",
  "review_count": 22,
  "average_rating": 2.95,
  "reviews": {
    "google_reviews": [
      {
        "author": "Kalia Fehlman",
        "rating": 1,
        "review": "I would LOVE to have a conversation with the people who built this place because, its done horribly. If you have a guest over and they need to use the restroom, well guess what they need to walk through the apartment into YOUR ROOM to get to a bathroom. Dont even get me started on the trim of this place, haha I can literally stick my whole finger in the trim. (Thats where the ants come into play) yes ANTS. The apartment complex does nothing about the infestation but gives you a spray can. Basically saying youll need to figure it out yourself. OH and to add if any of your lights go out YOU have to buy new ones, not the complex, and theyll even tell you it doesnt matter what the wattage is.",
        "owner_response": null
      },
      {
        "author": "Kiasia Allison Brown",
        "rating": 4,
        "review": "Brampton Court was my first apartment and choice when I moved to Washington. They were fairly priced, in a great location, and offered a wide range of bedroom and bathroom options. The community was ok, but the uptick in homeless population was the reason we opted to move especially with having young kids. I was there since March 2021 until May 2024. The management and maintenance team was very helpful and friendly throughout my tendency.. they tried their best to maintain cleanliness of the property (very pet friendly) as well as upkeep within the buildings (older apartments but it worked for us). I really enjoyed having Ray working in the office as she is very good at property management and making sure everyone is following the rules and requests get done in timely manner.",
        "owner_response": null
      },
      {
        "author": "Juliana",
        "rating": 4,
        "review": "We lived at Brampton for 5 years before buying our house. It was affordable and a good place to call home. Even with the changes in management throughout the years, they always answered all of our concerns or questions straight away and acted on it if needed. The apartments are pretty old, but the maintenance workers are nice and good at fixing things. As far as loud annoying neighbors, you will find that in any apartment building; management was always quick to respond on any noise complaints wed put in. You will need a portable AC unit in the summer, we had one in the living room and one in the bedroom and it was more than enough to keep us cool through the warmer months. If you have a dog, the place is very pet friendly as long as you leash them and pick up after them. They were also very reasonable with what they charged us for move out fees after half a decade of wear and tear of the place. Overall Id definitely recommend!",
        "owner_response": null
      },
      {
        "author": "A",
        "rating": 2,
        "review": "Where to begin. There's a lot of open space in these units, you're able to pretty much lay out your living area however you want. Though, it is an odd design choice to have the bathroom only accessible through the bedroom. If you like mirrors amd gold trim you'll be in heaven, many of the walls have sliding mirror doors which open up to a surprising amount of space.\n\nRent seems fair enough, but I was only there for nine months so my rent never had a chance to raise.\n\nI can't recommend anyone live here unless you have too. I turned my heater off in the middle of winter... It was still insufferably warm due to some of the worse insulation I have ever experienced. With only one window that opened in the apartment, even with an AC unit and several fans, the apartment would get up to 85 degrees.  I had my AC running through September and October it got that hot.\n\nIt also took management upwards of two months to replace stairs that had rotten through and were unsafe.\n\nThere's a large transient community in the parking lot next door. No big deal normally, but I'd find piles of puke in the parking lot from time to time.\n\nOverall, good learning experience.",
        "owner_response": null
      },
      {
        "author": "Red Pumpkin",
        "rating": 1,
        "review": "I used to live here for a year and at first I thought it was a good apartment complex....for my first time living on my own....and wow was I wrong. During the winter, fall and spring the apartment was pretty comfortable overall with just two box fans, one oscillating fan and one exhaust fan. But as the summer came around, the fans didnt do anything to cool down the inside of the apartment, it was so bad that I had to leave my apartment for days and stay at Starbucks or the library to stay cool.\n\nThis is unacceptable with how horribly insulated the apartment is, I feel like I could have gotten heat stroke if I wasnt careful, things didnt start to fully cool off until 2 in the morning and then I was able to finally sleep comfortably. Whenever I had called for help on something that wasnt working, it took about two weeks until someone could finally come and fix, dish washer, dryer/washer, etc. Also certain dogs arent allowed here, puppies/Pitbulls/German Shepards/ Rottweilers and mixed breeds but I saw some of these breeds before, management here I thought was strict and on top of making sure everyone living here is accommodated, guess thats not true.",
        "owner_response": null
      },
      {
        "author": "Jillyn Dillon",
        "rating": 4,
        "review": "The application process is a bit antiquated and slow-moving.  However, the lease agreement is very fair, and the month-to-month arrangement is tough to beat.\nWe were in a 2BR 1BA top-floor unit and moved to a 2BR 2BA ground floor unit. Both units were nicely laid out. The flooring, appliances and counters are all base-level, but that's to be expected at this price point.  The complex is clean, and the landscaping is well kept. Residents receive parking passes. The parking is unassigned and can be somewhat tight. This is a dog-friendly complex, and that's apparent from the number of dogs being walked on the property at regular intervals. However, all of the dogs here seem well behaved and are relatively quiet.",
        "owner_response": null
      },
      {
        "author": "Sarah Supit",
        "rating": 2,
        "review": "With all the pros and cons, it is fair. Rent was raised a few hundred dollars by the time I left. I previously gave a 4 star rating because of being a dog owner in Bellingham (difficult to rent in town), month to month, and the resources all around you. The old owners were great and the new owners somehow lost a lot of records.\n\nI lowered it to 2 star because when moving out near the end of last year, I hired a cleaner and spent two days deep cleaning. I'm not a messy person, neither my roommates. We deep cleaned to make sure we got our deposit back. The office woman had mentioned how not to vacuum because they will vacuum anyways, and we wouldn't get charged for it. I knew I should have asked for it in writing, that was my mistake. I deep cleaned everything, every corner, washed the walls so I could get my deposit back. I lost my deposit of $700 and they charged us another $200+, I wasted my last days cleaning when they took my money anyways.\n\nPrevious post that was still my honest experience living their: They are pet friendly, my dogs love the walk I take them around here and it's close to Birchwood park. If my car broke down today I could walk to get my groceries, go see an optometrist, clean my car and get it repaired at the shop close by and eat at a restaurant within less than a 5 min walk. Or go shopping at the mall and walk back 20-30 min.  I also donate a lot of old belongings to the salvation army nearby and bike around the plaza parking lot. 7/11 is nearby for my 3 am snack and I really appreciate the little things, even the gas station SUPER close before I do my road trips.\n\nThe reason it's not a higher star is not much of a view, not the nicest neighborhood and occasional homeless persons every now and then. If I had children I wouldn't want them cursing the way they do around these side walks. New management is not bad I got a new toilet with a button woo hoo lol\n\nAdvice living here: Ask for anything they say in writing. Everything, to watch your own back. Also, keep a second record of everything. I was not a bad tenant, we were the tenants who shooed off a lot of the homeless people and called the cops when they would scream and chant at 2 am. That leads to my last advice, do not be afraid to call the cops if you see anything strange or pestering in the neighborhood. Because if you don't, these people will come back to bother you.",
        "owner_response": null
      },
      {
        "author": "Maddi",
        "rating": 1,
        "review": "Seriously.... the longer you stay here the worse it gets... We moved here into a two bed two bath with rent at $985 a month and we were going to lease again despite the neighbor issues because the property itself wasn't trashy, but they raised the rates to 1180$ a month!\n\nIt states in the lease that the property is /federal/. We have a bad streak of bad neighbors breaking rules. Families leaving piles of garbage in front of the doors and one neighbor blasting a bass subwoofer at all hours of the day and sneaking their dogs and psycho girlfriend in to live full time. These people got evicted, fortunately, but not the most recent downstairs neighbors: They smoked cigarettes and weed hourly and I overheard them throwing the beer cans into the little river in our backyard. I complained to the landlord but they couldn't control these college kids, apparently! My room always smelled like smoke if I kept my screen door open.... Which I did - especially in the summer - because it was the only \"window\" in the apartment. This lasted all year, man!\n\nI wanted to live here because it was strict, which is what I desired because I don't drink or smoke and I sleep early, and I felt like the owners would care to uphold these rules but NOPE.",
        "owner_response": null
      },
      {
        "author": "Serge Plex",
        "rating": 1,
        "review": "Constantly switching management, VERY poorly insulated apartments (you will be cooking during the summer from heat and/or humidity), rude and self-centered property owners that only care about your paycheck, and inconsiderate neighbors... Oh! And no puppies. I DO NOT recommend living here. You can do better.",
        "owner_response": null
      },
      {
        "author": "indya simpson",
        "rating": 5,
        "review": "We have been here 6 months. Everything has been easy for us here even at application process.  I love the location being close to Cornwall. We have a little one so going to the park is very simple. They are ok with making sure there is no cars park that dont belong. The staff is nice. Our nabors are nice.",
        "owner_response": null
      },
      {
        "author": "Heather Pulju",
        "rating": 5,
        "review": "Reasonable rent, close to shopping, friendly neighbors and staff. We've lived here 2 years now and still very much enjoy it  ",
        "owner_response": null
      },
      {
        "author": "Mike Linebrink",
        "rating": 3,
        "review": "Not too bad of a place. Free internet isn't the best but hey it's FREE! Decent pool and lots of kids.",
        "owner_response": null
      },
      {
        "author": "Jeff Bingman",
        "rating": 1,
        "review": "The longer you stay here, the worse it gets....",
        "owner_response": null
      },
      {
        "author": "Jessica Ridge",
        "rating": 1,
        "review": "Be careful when you live here.",
        "owner_response": null
      },
      {
        "author": "Dustin Dusty Holloway",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Rafael Sanchez",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Dolola Ava",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "jorge miranda",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Maddie Marie Walker",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Anthony S",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Enna Anderson",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jasmine Fast",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 14,
  "adjusted_average_rating": 2.5,
  "distribution": {
    "1": 7,
    "2": 3,
    "3": 1,
    "4": 6,
    "5": 5
  },
  "summary": {
    "created_timestamp": 1739095004,
    "text": "<section id=\"good\"><h2>Good</h2><p>Many user reviews highlight that Brampton Court Apartments have reasonable rent rates and a dog-friendly atmosphere that is quite appealing. Several users have appreciated the location's accessibility to local parks and shops, making it a convenient choice for families. One tenant mentioned enjoying their time at Brampton Court for over five years, noting the affordable nature of the apartments and their willingness to allow pets, which added to their overall satisfaction.</p><p>In terms of management, some reviews commend the staff for being friendly and responsive to tenant needs. A user specifically praised a staff member for her effectiveness in property management and addressing community concerns. This positive sentiment regarding staff attentiveness appears to be a consistent theme among those who had a favorable experience at the apartments.</p></section><section id=\"great\"><h2>Great</h2><p>User reviews also reflect positive experiences with the general cleanliness and upkeep of the property. Many residents found that despite some aging infrastructure, the management made efforts to maintain the area and respond to tenant inquiries. For instance, one resident appreciated how quickly management addressed noise complaints, which are common in apartment living.</p><pAdditionally, the complex is described as accommodating for families, with specific amenities that make it easier for pet owners and those with children to enjoy their environment. Many tenants felt secure in their living arrangements, often highlighted by neighborly interactions and the welcoming community within the apartments.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews pointed to various issues with maintenance and property conditions that many tenants found frustrating. Complaints about poor insulation and heat retention during summer months were common; some users mentioned feeling excessively hot even with air conditioning units running. Moreover, there were also mentions of slow response times for maintenance requests, particularly for critical repairs like safety hazards.</p><pThe layout of some units has drawn criticism, such as bathrooms only being accessible through bedrooms, which has created inconveniences for many residents and their guests. The perception of management's efficiency varied, leaving some tenants feeling neglected or disappointed with their service and communication.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThe most concerning issues reported in user reviews revolve around tenant disputes and challenges with the surrounding neighborhood. Some residents expressed discontent with increased noise levels and unsightly behavior from neighbors, including smoking and littering, leading to an uncomfortable environment. This has raised concerns about the management's ability to enforce community standards and take appropriate action against problem tenants.</p><pFurthermore, numerous users have reported grievances regarding security deposits, stating that they did not receive refunds despite cleaning thoroughly before moving out. In one notable case, a resident described losing a significant amount of their deposit due to alleged charges for cleaning that they believed were unnecessary. This has fueled a sense of distrust towards the management and has contributed negatively to the overall sentiment about living at Brampton Court Apartments.</p></section>"
  }
}