{
  "name": "Briarwood Terrace Apartments",
  "slug": "briarwood-terrace-apartments",
  "company_type": "Property",
  "address": "4101 Consolidation Ave, Bellingham, WA 98229",
  "review_count": 9,
  "average_rating": 3.89,
  "reviews": {
    "google_reviews": [
      {
        "author": "Z Dumas",
        "rating": 2.0,
        "review": "Im terms of maintenance requests being dealt with and property management, both are pretty good. I have been pretty bothered with their weird communication from Sabrina, I almost never interact or talk with Lesley anymore since the first few inspections when moving in, but continuously I will be emailed about random events like everyones doors being painted and how we shouldve responded to an email that was never sent weeks ago, for us to never get our doors paintedeven though everyone left their doors open all day for it after receiving an email day of about it. Or sending out false dates about when to resign a lease and sending out last minute reminders or calls sometimes day of to resign the lease, which with co-signers is a huge hassle when youre not expecting it. In my particular situation we had one extra person to the amount of rooms we were renting, which we had informed the company of months before signing the lease, and while we were about to sign our new lease, they told us that our rent will be an extra $100 for itthe day we signed! Which later on I found out that we were paying the same amount of rent for a 3 bedroom! So we were paying extra to have two of my roommates share a room for two years for literally nothing. If you can find somewhere else I would recommend it, if you know how to get around landlord baloney, then you could give them a try. This is the only power I have to warn you of Sycamore the corporation that runs Briarwood Apartments. If youre a tenant looking, its really hard right now and it feels like no landlord company is looking out for us anymore, if you can find an independent landlord, who has some form of respect for their tenants, jump to them first.",
        "ownerResponse": {
          "text": "Dear Adam Dumas,\n\nWe would like to address the relevant issues in your review.  \n\nFirstly, your statement of our \"weird communication\"\n --our office, like many Property Management and Real Estate firms in Bellingham, utilizes Appfolio Property Management Software.  With this software we often utilize the feature which allows us to bulk email and text our tenants either by unit, or by group, or by building.  We use these features to keep our communication concise and clear for both our office and our tenants.  \n\nPerhaps by \"weird\" communication, you are referring to regular communications to our tenants regarding parking or garbage issues? Or Maybe our consistent updates during the large project to repaint the entire complex? Or perhaps our annual emails which are sent out to each and every tenant regarding rather they intend to vacate or renew? I can assure you that all of these categories of communication could not be more routine for property managers, both in Bellingham as well as other areas.\n\nRegarding your statement -- \"sending out false dates about when to resign a lease\" --you received the same emails every other tenant with your lease end date received. \n*The first of which was sent out (and opened by you) on March 24, 2023 @9:58a  --This email had a subject which read: \"LEASE ENDING {7/31/2023} -- Renew or Vacate? Deadline: {4/28/2023}\n*A reminder was sent on 3/26/2023, which you opened\n*A reminder was sent on 4/25/2023, which you opened\nYou ignored your deadlines, and continuous reminders alongside both of your roommates.\n\nRegarding emails about \"Door Painting\" or other exterior maintenance --we do our utmost to inform tenants of any ongoing maintenance that may occur on the property so that our tenants can be prepared.  I am curious why you would wait to bring up a notification to the entire property regarding the painting of doors which occurred in July of 2022?\n\nYou received the same notifications that every other tenant received, in our effort to be of minimal disturbance to our tenants while still providing updates regarding maintenance that might affect them.\n\nYour statement  --> \n\"...continuously I will be emailed about random events like everyones doors being painted and how we shouldve responded to an email that was never sent weeks ago, for us to never get our doors paintedeven though everyone left their doors open all day for it after receiving an email day of about it\"\n \n--is both inaccurate and inarticulate  ---We notified you many times prior to painting, including updates when anything changed. I will summarize here for you:\n\n*On 5/17/22 we emailed you about Painting, starting in Building A --which you opened.\n*on 5/27/22 we emailed you an update about painting, which you opened.\n*on 6/7/22 we emailed you again, an update due to weather and contractor issues, which you opened\n*on 7/20/22 we emailed you again regarding the ongoing painting at Briarwood, which you opened, and responded to letting us know about your issues with containing your animals, and stating that you had not received any emails from us regarding painting --please see above all the emails we sent you --which you opened.\n\nIs this what you are referring to when you state that we, quote --\n\"continuously... [email you]... about random events\" ??\n\nI will go ahead and skip all the incoherent nonsense in the middle and skip right on to your statement of the extra $100 of rent for exceeding occupancy limits for a unit.  \n-->for this, I will refer you to the final section of your application, entitled,\n\"Applicants Understand the Following:\" \n#....#3.) Additional occupants (i.e,. more occupants than bedrooms) may change the terms of the Lease Agreement (ex: increased rent)...\" \n\nThis is why it is so important to read the documents that you sign PRIOR to signing them. This way you are not surprised by the contents of which you will be held responsible to.\n\n\n\n"
        }
      },
      {
        "author": "Chris Mallery",
        "rating": 3.0,
        "review": "The living experience at Briarwood Terrace was great, spacious apartments, awesome location (close to grocery stores, gas and Starbucks ), and overall a quiet, peaceful complex.\n\nManagement (Sycamore Corp) on the other hand could improve. Sabrina is a doll and dealing with her is great. Lesley on the other hand is less desirable and quite abrasive. Excuses are her favorite game. However; Ive had worse property managers who are complacent and not nearly as proactive as Lesley.\n\nRecently parking garage been an issue, and Lesley continues to re assign or re-designate parking spaces (more specifically reducing the amount of visitor spaces) and adding an additional space for management parking. There is street parking outside the complex however; since the place has filled up its pretty limited as well.\n\nOverall a good place to live, although I would look around. You might be able to find better deals on Rent with better management companies in the area if you just do a little research.",
        "ownerResponse": null
      },
      {
        "author": "Matt Welch",
        "rating": 5.0,
        "review": "I moved to Briarwood Apartments in Bellingham in March of 2020. Moving across the country to a new city, amidst a global pandemic wasnt the easiest thing, but Sabrina & Lesley at Briarwood made it easier. From day one, I felt supported. Not only is the office staff AWESOME & ENGAGED (and truly care) the units are clean, updated and sit at a competitive price range for the location. Whether youre a student, a recent grad or a working professional, Briarwood apartments really is an awesome choice! Im still a resident and hoping to stay for a long time :)",
        "ownerResponse": null
      },
      {
        "author": "Libby Donaldson",
        "rating": 5.0,
        "review": "April and Amy have treated me like family in my experiences renting with them. From locking myself out of the apartment to dropping a sock down my lint trap, they have always responded to me in minutes with help. I absolutely love living here and knowing such a great management team. Renting for a second year now :).",
        "ownerResponse": null
      },
      {
        "author": "Alyssa Zapien",
        "rating": 1.0,
        "review": "My roommates and I went to their office with our applications and money ready to apply. She told us we would be put on the waitlist but would most likely get an apartment and gladly took all of our money. She said she would be in contact with us via email about a tour and our waitlist status shortly. We waited a month and never heard from her. We tried calling, got no answer and emailing as well, with no luck. We finally went to the office again and asked for our application money back since she never followed up like she said. She rudely told us no and that our emails must have went to her junk mail (not our issue). We asked for the owner's number and she said no she couldn't give that to us. She was SO rude and hurried us out of her office. We got no refund. No tour. No emails. I'm glad we didn't end up renting at Briarwood, she seems like a very bad manager who only wants your money.",
        "ownerResponse": null
      },
      {
        "author": "Last Dimstar09",
        "rating": 5.0,
        "review": "Ok cool  ",
        "ownerResponse": null
      },
      {
        "author": "Tom Hutchison",
        "rating": 5.0,
        "review": "Quality apartments with kind and proactive management",
        "ownerResponse": null
      },
      {
        "author": "Kel Videll",
        "rating": 4.0,
        "review": "Clean grounds and spacious homes.",
        "ownerResponse": null
      },
      {
        "author": "Jordan Swenson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 3.75,
  "summary": {
    "text": "<section><h2>Good</h2><p>Residents of Briarwood Terrace Apartments have expressed satisfaction with the timely and efficient manner in which maintenance requests are handled by the property management. Positive feedback reflects a perception of attention to these matters, suggesting that the operational aspect of the property is well-managed. Additionally, certain user reviews praised the location of the apartments, highlighting the convenience of being close to essential amenities such as grocery stores and gas stations, which enhances the living experience for the residents.</p><p>Another recurring positive sentiment from user reviews is the friendly and engaged nature of some staff members. Good experiences with staff like Sabrina have been highlighted, indicating that there are elements of the management team that contribute positively to the resident experience. These staff interactions have played a part in making some residents feel supported and welcomed, and are influential in their positive assessment of Briarwood Terrace Apartments.</p></section><section><h2>Great</h2><p>Several tenants have described their living experience at Briarwood Terrace as 'awesome,' citing the spacious apartments and the generally quiet and peaceful ambiance of the complex. The appreciation of these aspects suggests that the apartments provide a comfortable and desirable living space for their residents. Furthermore, there are residents who see the property as offering competitive pricing for the location, which could be considered a great advantage for various demographics including students, recent graduates, and working professionals.</p><sction><path>From the perspective of personal interaction, some members of the property management are described in glowing terms. Accounts of being treated like family, with management responding swiftly with help for issues ranging from being locked out to minor maintenance problems, suggest a level of care and responsiveness that greatly enhances the living experience at Briarwood Terrace Apartments.</p></section><section><h2>Bad</h2><p>Nonetheless, some residents have reported less than satisfactory engagement with the management team, specifying instances of what they perceive as poor communication. According to one user review, there were confusions surrounding communications about lease renewals and policy changes, which created hassles, especially for residents with cosigners. Such experiences suggest inconsistencies in the management’s ability to effectively disseminate information and synchronize with resident expectations.</p><p>An additional concern from user reviews pertains to parking issues within the complex. One review mentioned the frustration of the management reassigning or redesignating parking spaces, which included reducing visitor spaces in favor of management parking. This, coupled with reports of limited street parking, suggests that current parking arrangements may be an area where improvement is needed to meet resident needs and preferences.</p></section><section><h2>Ugly</h2><p>On the more concerning end of the spectrum, one particular resident complained of an incident where application money was accepted with promises of being placed on a waitlist for an apartment, but then experienced a lack of follow-up communication and difficulty in obtaining a refund when an apartment was not secured. This severe criticism points towards an incident marked by poor customer service and unfulfilled commitments, which can significantly damage a property management company’s reputation. Additionally, the resident described the manager's behavior as rude, which further underscores the gravity of the situation. Ensuring transparency and reliability in application and waitlist procedures is crucial to maintain trust between management and prospective tenants.</p></section>"
  },
  "timestamp": "09/07/2024"
}