{
  "name": "Bridge Creek Apartments",
  "slug": "bridge-creek-apartments",
  "company_type": "Property",
  "address": "272 E Bakerview Rd, Bellingham, WA 98226",
  "review_count": 2,
  "average_rating": 2.5,
  "reviews": {
    "google_reviews": [
      {
        "author": "American Classic",
        "rating": 2.0,
        "review": "The caregivers are not cleani g the places up and these apt are filthy, no toilet supplies like toilet paper\nand Kleenex. Clothes all over and . Disabled people so sweet but last time they ",
        "ownerResponse": null
      },
      {
        "author": "Sheena Wilkerson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 2.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>Bridge Creek Apartments offer a living space for residents with varying needs, including those who are disabled. Although specific positive aspects are not highlighted in the user reviews, the average rating suggests that some residents find the accommodations adequate. It is important to consider that different residents may have different standards and experiences, and the average rating indicates that not all feedback is negative.</p></section><section><h2>Great</h2><p>Unfortunately, the data provided does not contain enough detailed positive feedback from user reviews that would suggest areas where Bridge Creek Apartments excels remarkably. In this article, we aim to highlight areas of excellence for local property management companies, yet, in this instance, the lack of detailed positive anecdotes or commendations in user reviews limits the content that can be appreciated as 'great' regarding the property.</p></section><section><h2>Bad</h2><p>Based on the user reviews, the cleanliness of Bridge Creek Apartments has come into question. One review pointedly mentions the lack of cleaning in the residences, which implies a neglect of basic sanitary upkeep. This indicates a potential issue with the property management's attention to cleanliness, an essential aspect of any living space.</p></section><section><h2>Uly</h2><p>User reviews suggest that Bridge Creek Apartments may be facing neglect, with one tenant expressing concern about the state of the apartments, noting them as \"filthy\" and lacking essential supplies such as toilet paper and tissues. Additionally, the mention of cluttered living spaces with clothes scattered about raises serious concerns about the management's oversight and care for its disabled residents. This user's experience reflects poorly on the property's maintenance and respect for tenant welfare.</p></section>"
  },
  "timestamp": "09/07/2024"
}