{
  "name": "Brooks Property Management",
  "slug": "brooks-property-management",
  "company_type": "Company",
  "address": "1301 Iowa St, Bellingham, WA 98229",
  "review_count": 9,
  "average_rating": 1.89,
  "reviews": {
    "google_reviews": [
      {
        "author": "Jen Caldwell",
        "rating": 1,
        "review": "Renters Beware!!!!!   When we viewed the apartment it was still occupied. We had Melanie, property manager, sign a contract stating it would be clean when we moved in. This place stinks soooooo bad still! I go to work smelling like a cat box and bad B.O. When we asked for repairs they immediately served us with a Quit of Tenancy and forced us to move out three weeks after we moved in. To top it off, three days after we moved in we we're drinking coffee \"enjoying\" our \"new\" stinky apartment and Mimi, the owner, comes barging through the back door. She pulled the trim that the \"security\" chain was attached to off the wall. Don't make the same mistake we did, keep looking. There's a reason why it's month to month here. And it's no good reason...",
        "owner_response": null
      },
      {
        "author": "Chuck Marquart",
        "rating": 5,
        "review": "Very professional......",
        "owner_response": null
      },
      {
        "author": "Jackie Kemmet",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Paula Gatti",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "paul compton",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "haydn doggett",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Chandler J.",
        "rating": 1,
        "review": "We recently had brooks take over our apartment complex, horrible company. They have lost multiple checks, then made it our problem to track down the check numbers and prove to them that we payed them for rent. They also do not take care of the property, everything is now overgrown, the parking lot is filled with leaves and other debris, and they have sent nobody to tend to the property.\n\nI would highly recommend avoiding this company if you can. They obviously do no care about their properties or tennants, and are poorly managed. We will be moving out at the end of our lease.",
        "owner_response": null
      },
      {
        "author": "Olivia O.",
        "rating": 1,
        "review": "Company consistently loses rent checks after they have been turned in before the due date, then blames the tenants for the mishap. Do not rent with them they cannot be trusted to keep track of your money and when they lose your checks will threaten to evict you.",
        "owner_response": null
      },
      {
        "author": "Ty J.",
        "rating": 1,
        "review": "My fianc missed 2 and half hours work for them to no show an appointment to see a property. There were 4 other potential applicants stood up.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.8,
  "distribution": {
    "1": 6,
    "2": 1,
    "3": 0,
    "4": 1,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739205407,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite the overwhelmingly negative feedback, a few reviews highlighted positive aspects of Brooks Property Management. One user described their interaction with the staff as very professional, suggesting that the company has individuals who attempt to maintain professional standards despite criticisms. There was also praise for the friendliness and professionalism of one staff member, though these instances appear infrequent based on overall feedback.</p></section><section id=\"great\"><h2>Great</h2><p>Instances of exceptional service or standout positive experiences with Brooks Property Management are rare according to user reviews. The majority of reviews are critical, making it challenging to find consistently positive themes or anecdotes. However, the fact that there is at least one five-star review suggests that some tenants' expectations were met or exceeded under certain circumstances.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews commonly mention issues with lost payments and poor property maintenance. There were multiple complaints about Brooks Property Management losing rent checks, which forced tenants to track payment details to resolve the errors, causing significant frustration. Furthermore, tenants reported overgrown properties and debris-filled areas, indicating neglect in property upkeep. A tenant's experience of missing work due to a no-show for a property viewing reflects poor management practices.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Several user reviews describe distressing experiences with Brooks Property Management that go beyond inconvenience. One tenant experienced forced eviction shortly after moving in when they requested necessary repairs—a practice that raises serious concerns about fair treatment. Another tenant recounted a violation of privacy where the property owner entered their apartment unannounced, damaging the door trim, contributing to a sense of insecurity and violation. The company’s failure to respond to these serious grievances suggests a lack of accountability and responsiveness to tenant concerns.</p></section>"
  }
}