{
  "name": "Brooks Property Management",
  "slug": "brooks-property-management",
  "company_type": "Company",
  "address": "1301 Iowa St, Bellingham, WA 98229",
  "review_count": 9,
  "average_rating": 1.89,
  "reviews": {
    "google_reviews": [
      {
        "author": "Jennie Black",
        "rating": 1.0,
        "review": "Well just I had horrible experience with Brooks, I was misinformed by Opportunity Council and I was under the impression opportunity council would help with first and last month rent.  I had told Meliane as good faith I could pay next month due to lack of rental history I could pay next months rent at the time of moving in,  I then reached back out to meliane and explained that oppertunity council was NOT going to pay 1st and last month rent like I had thought. In the emails I had received I was to come up with $1,000 deposit $1700 *2 and rest of the rent for July  I had hustled up $5,000 dollars in less than 3 weeks for this unit. I go to let Meliane know that i finally have enough for this unit, mind you that after Meliane knew i was not going to get help from oppurinty council she still wanted me to pay next month rent  even thought it was not in  the original agreement or even apart of there guidelines I was just tryin to show good faith by paying next months rent, so even after she knew i wasnt; going to get help she still demanded I pay next month rent, So I had hustled up $5,000 cash I go to let Meliane know and she says oh you need another $1700 on top of it, This woman knew how badly my son and I needed this place, she knew I was counting every penny and for them to still want next month rent even tho is was not apart of their requirements even tho I begged her to please not charge me for next months rent and she still did anyways, it was a horrible thing to do to a single- homeless mother.",
        "ownerResponse": null
      },
      {
        "author": "Jen Caldwell",
        "rating": 1.0,
        "review": "Renters Beware!!!!!   When we viewed the apartment it was still occupied. We had Melanie, property manager, sign a contract stating it would be clean when we moved in. This place stinks soooooo bad still! I go to work smelling like a cat box and bad B.O. When we asked for repairs they immediately served us with a Quit of Tenancy and forced us to move out three weeks after we moved in. To top it off, three days after we moved in we we're drinking coffee \"enjoying\" our \"new\" stinky apartment and Mimi, the owner, comes barging through the back door. She pulled the trim that the \"security\" chain was attached to off the wall. Don't make the same mistake we did, keep looking. There's a reason why it's month to month here. And it's no good reason...",
        "ownerResponse": null
      },
      {
        "author": "Chuck Marquart",
        "rating": 5.0,
        "review": "Very professional......",
        "ownerResponse": null
      },
      {
        "author": "Jackie Kemmet",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Paula Gatti",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "paul compton",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "haydn doggett",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Olivia O.",
        "rating": 1,
        "review": "Company consistently loses rent checks after they have been turned in before the due date, then blames the tenants for the mishap. Do not rent with them they cannot be trusted to keep track of your money and when they lose your checks will threaten to evict you.",
        "ownerResponse": null
      },
      {
        "author": "Ty J.",
        "rating": 1,
        "review": "My fianc missed 2 and half hours work for them to no show an appointment to see a property. There were 4 other potential applicants stood up.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.8,
  "summary": {
    "text": "<section><h2>Good</h2><p>Among the mixed sentiments in the user reviews, there are instances where Brooks Property Management has been acknowledged for its professionalism. One review stands out where the user rated their experience with five stars and succinctly described the interaction as \"Very professional......\", suggesting that there may be aspects or occasions where the company's conduct meets clients' expectations.</p><p>However, with the limited number of positive remarks, it is difficult to expand on specific experiences where the company's performance was above par. While this article aims to provide a balanced view, the paucity of detailed praise constrains a fuller depiction of the positive experiences with Brooks Property Management. The available evidence hints at potential areas of competency that could be better understood with more comprehensive positive feedback.</p></section><section><h2>Great</h2><p>Unfortunately, this article could not find comprehensive data in the user reviews to warrant a separate section devoted to instances where Brooks Property Management's services were classified as 'great'. The overall sentiment of user reviews does not provide a foundation for detailing any exceptional service or exceedingly positive experiences.</p><p>Should more detailed reviews emerge that showcase the company going significantly beyond expectations in areas such as customer service, property maintenance, or tenant relations, this section could be expanded to reflect such examples of greatness. Until such time, the absence of robust affirmative testimonies precludes a 'great' categorization.</p></section><section><h2>Bad</h2><p>Several user reviews indicate that tenants have faced challenges with Brooks Property Management, ranging from potential miscommunication to dissatisfaction with the handling of their situations. One reviewer detailed a distressing experience regarding financial misunderstandings and a perceived lack of compassion for their personal circumstances. This sentiment of frustration over financial arrangements is mirrored in another review, where the tenant expressed concerns over the company allegedly losing rent checks and then threatening eviction over this mishap.</p><p>The lack of attention to property conditions is another sore point mentioned in reviews. In one case, renters moved into an apartment that was reportedly so unclean it left persistent unpleasant odors, affecting their daily lives. When these tenants sought repairs, the response was alarmingly severe, with a 'Quit of Tenancy' notice that hastened their departure. Such experiences suggest lapses in fundamental aspects of property management and tenant relations, representing key areas for improvement for Brooks Property Management.</p></section><section><h2>Ugly</h2><p>The 'ugly' aspects of Brooks Property Management's service are highlighted by user reviews describing more serious grievances. A disturbing account involved an instance where a company representative arrived unannounced and forcefully entered a tenant's apartment, breaching privacy and creating a distressing situation. Moreover, another review mentioned potential applicants being 'stood up' with no communication or apology for missed appointments to view properties, indicating a disregard for prospective tenants' time.</p><p>These troubling narratives, while limited, are severe enough to draw considerable concern. They underscore a significant breach of the trust and safety that tenants should expect from their property management company. Such incidents could have lasting negative impacts on the company's reputation and highlight an urgent need for changes in company policies and customer service training to prevent a recurrence of such issues.</p></section>"
  },
  "timestamp": "September 7 2024"
}