{
  "name": "Canterbury Court Apts",
  "slug": "canterbury-court-apts",
  "company_type": "Property",
  "address": "3790 Canterbury Ln Bellingham, WA 98225",
  "review_count": 8,
  "average_rating": 2.75,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Guy C.",
        "rating": 1,
        "review": "Not safely maintained and amenities are not readily available.\n\nPool is constantly closed due to lack of consistent and proper maintenance by the staff, and they won't put a notification on their website or anywhere if it's closed. This means, you won't know it's closed till you're in the building and right at the door, which is very annoying for me as I'm disabled and it would be nice to know if I don't need to aggravate my condition when I need to do hydrotherapy.\n\nThe pool was also closed for years, understandably so during COVID, but they kept it closed for more than a year after while fumbling to install a new HVAC system that got delayed months. Since then, it's been super spotty as it's been closed every time I've tried to visit this past week. \n\nThere's also the issue of the exterior stairs as they're concrete slabs with rebar, and they don't maintain them. In 2019, I fell through one of them as the rebar had completely corroded, and I had to go to the ER. I am now permanently disabled, and got ghosted by the staff when I tried to file an incident report.\n\nMeanwhile, the rent has gone from $950-1650 since 2017 due to numerous reasons (as specified on their notices) from \"market research\" to \"raising of the state minimum wage.\" All the while they've implemented new policies such no longer being able to grill small butane grills on the balcony and forcing residents to get renters insurance when it wasn't required before. We've gained nothing but lost a lot while paying more.\n\nI would move if I could, but this seems to be the norm for property management across the county. The staff are publicly nice, but are still tools to horrible policies.",
        "owner_response": null
      },
      {
        "author": "Dan M.",
        "rating": 5,
        "review": "I've lived here for about ten months now, and while I wouldn't recommend moving across two states in the middle of February, Emileigh was amazing in helping an out-of-towner figure out how to get situated.  Everything from the screening process to the move-in to the pet approval was handled quickly and easily, and the facilities are really nice.\n\nNow, this is 2020, and some of the onsite amenities are sadly unavailable, but they're doing the responsible thing which I can respect.",
        "owner_response": null
      },
      {
        "author": "Chantilly H.",
        "rating": 1,
        "review": "Amenities are not available due to what ever excuse they come up with month to month. I lived there a year and only got to use the pool/hot tube twice. Your heat bill will be $200.00 in winter, and the windows will condensate and freeze over and then mold. You will sweat to death in summer because you can not use a window AC. Washer and dryer is mini so power bill will also be high all year, due to having to do multiple loads and the appliances are outdated. If you are a lower unit you will hear everything from your neighbors upstairs. I mean everything and it will startle you out of bed at night as if they will fall through the ceiling. You will hear the neighbors toilet flush every single time. My neighbor used the toilet a lot! They won't properly clean the apartment before you move in, if you have a cat or dog on the lease , they will keep your entire deposit claiming the entire carpet in the unit needed to be replaced due to urine ,only proof of their false claim is a black light they apparently use after you move out but not when you move in.... You will be refused a walkthrough on exit and the the carpet cleaners are also, the same person who replaces carpet.. even though they never cleaned carpets before you moved in and will not show proof when you ask. To top it off you will be forced to pay an added amount to cover all the cost of replacing carpet after they already kept 1500.00 or be reported to collections. The time and cost of fighting them in court is costly and time consuming.",
        "owner_response": null
      },
      {
        "author": "Kathy M.",
        "rating": 1,
        "review": "I gave a great review last month, then I received a lengthy explanation for why they were keeping my $600 deposit and charging me an additional $339.31 for replacing carpet that was disgusting when I first moved in!  I have NEVER been treated like this and I am so disappointed.  They claim there were traces of urine through most of the living room and dining room. They provided where this supposedly was and all of the areas were covered by my furniture and my cat would NOT have had access to them.  My cat NEVER peed on the carpet. She is a house cat and they are very picky.  She always uses her litter box.  Wish I could post without any stars!",
        "owner_response": null
      },
      {
        "author": "Kayla B.",
        "rating": 5,
        "review": "Wonderful neighborhood, quiet and private, maintenance does their job quickly and effectively, and the property manager Emily is wonderfully helpful and educated. Highly recommend this company.",
        "owner_response": null
      },
      {
        "author": "Naomi R.",
        "rating": 5,
        "review": "I loved living here! Emily, the woman at the office, was always professional, respectful, and remembered everyone's names. I thought the apartment complex seemed small enough to seem personable. Very quiet apartment and neighbors were great. Highly recommend living here. Will miss the great, convenient location.",
        "owner_response": null
      },
      {
        "author": "Gail C.",
        "rating": 2,
        "review": "Old management was overbearing and intrusive.  I had kayak on deck and was asked to move out because I wouldn't store it in my apartment.",
        "owner_response": null
      },
      {
        "author": "Lee R.",
        "rating": 2,
        "review": "My wife and I have lived at Canterbury Court on and off since 2001.  Our last move out was on December 29, 2013 just over a month ago after living there for eight years.  We expected to pay a reasonable cleaning fee as we have paid before in our other two move outs.  Unfortunately this did not happen this time.  We were charged an excessive cleaning fee which was very disappointing but we paid it and wrote a letter explaining our disappoint but no one has responded to our letter to see how we could improve this issue.  I know there are new owners which then caused a change in management at Canterbury Court which probably explains the reduction in customer care.  Before these changes took place we have written positive reviews in the past of the customer care that we received from the former owners and managers.  Obviously from our long stay at this site it has been a place that we have enjoyed living.  With the new direction owner/management has taken Canterbury Court  is not the great experience that we came to expect.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 2.75,
  "distribution": {
    "1": 3,
    "2": 2,
    "3": 0,
    "4": 0,
    "5": 3
  },
  "summary": {
    "created_timestamp": 1739095012,
    "text": "<section id=\"good\"><h2>Good</h2><p>Canterbury Court Apts has received some positive feedback, particularly regarding the property management staff and their approach to customer service. Several user reviews commend the professionalism and helpfulness of the office manager, who is noted for her ability to remember tenants’ names and maintain a friendly atmosphere. Residents appreciate her quick responses to inquiries and an overall sense of community within the complex, which many describe as quiet and private.</p><p>In addition to effective management, some users highlighted the well-maintained facilities, remarking that maintenance requests were addressed timely and satisfactorily. One resident, living there for nearly ten months, expressed that even during a tumultuous move across states in February, the transition was smooth, underscoring that the management team did a commendable job in facilitating a welcoming environment amidst challenging circumstances.</p></section><section id=\"great\"><h2>Great</h2><p>The property’s tranquil setting and convenient location significantly enhance its appeal. User reviews reflect a collective appreciation for the peaceful neighborhood, with tenants enjoying their private living spaces. The complex's amenities, despite occasional unavailability, are generally regarded as pleasant and well-kept. Many believe that while some amenities may not always be accessible, the responsible management of the complex during ongoing challenges is commendable.</p><p>Furthermore, residents value the quick turnaround on maintenance requests, which exhibits the management's commitment to tenant satisfaction. Such efficient service contributes to a comfortable living experience that encourages repeat occupancy, with users expressing a willingness to recommend the complex for its overall pleasant living conditions.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positive aspects, Canterbury Court Apts has garnered notable complaints regarding maintenance issues and rising costs that concern residents. Several user reviews indicate a frustrating pattern with amenities, particularly the pool, which has been closed for extended periods due to poor management and maintenance practices. This lack of timely communication about amenity availability has led to dissatisfaction, especially for those who rely on the facilities for health reasons.</p><p>Additionally, a number of tenants voiced frustrations about the management's approach to cleaning fees and security deposits. Instances of excessive charges have been reported, particularly when residents move out and claim they face unjust fees that are difficult to contest due to poor management responsiveness. These concerns illustrate a potential gap in the property management's duty to uphold tenant rights and foster transparent communication.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most concerning reviews express severe dissatisfaction with the management's practices regarding move-out conditions and deposit returns. One tenant described an alarming situation where they were charged for cleaning fees and carpet replacements that they felt were unwarranted. This has raised doubts about the management's integrity, as the reasons for retaining deposits and charging additional fees seem arbitrary and poorly justified.</p><pFurthermore, reports of neglect stemming from unresolved maintenance requests and a lack of adequate safety measures contributed to an overall grim sentiment among some users. One user specifically noted a personal injury due to the negligence in maintaining the exterior stairs, which evokes a sense of disregard for tenant safety. Collectively, these alarming narratives paint a troubling picture of the property’s management practices, pointing to a need for significant improvements in tenant care and safety protocols.</p></section>"
  }
}