{
  "name": "Cascade Meadows",
  "slug": "cascade-meadows",
  "company_type": "Property",
  "address": "455 Westerly Rd, Bellingham, WA 98226",
  "review_count": 26,
  "average_rating": 2.96,
  "reviews": {
    "google_reviews": [
      {
        "author": "Mercedes Short",
        "rating": 1,
        "review": "Absolutely horrible. I have been a tenant for 1 1/2 years and they have not once answered the phone, returned my calls, answered an email, or resolved any issues. The maintenance team has come in twice and left things in disarray and left their garage on my floors. Today they apparently came into my apartment while I was working and stole one of my kitchen drawers and left the stuff that was in said drawer dumped all over my countertop. I have even gone to the office in person with not much luck. I work in property management so I understand the ropes and this is the WORST property management I have experienced. I feel unsafe living here.",
        "owner_response": null
      },
      {
        "author": "Velvet Humphres",
        "rating": 2,
        "review": "Its hard to not be frustrated after years of being here. It causes me anxiety to even think about the place, even though I have been moved out since February. The staff are underpaid and overworked. My mail was stolen more than once from this location. Indigo Real Estate is in Seattle, and doesnt give a damn about the tenants in these buildings as long as their standards and regulations are seemingly kept up to par. My neighbor was shooting drugs, dealing to strangers, smoking cigarettes in his apartment, and at one point multiple people banged on my back sliding glass door thinking my unit was his. No matter how many written complaints I made, the management could not or would not kick him out. His car window got bashed and he blamed it on my family even though we saw three people he used to deal to roaming the parking lots for a few days prior and heard them state that he owed them money. After that we decided to move, and the management charged us an arm and a leg for services that werent done to our unit because they mixed us up with another unit that had moved out the same week and trashed their place (luckily most charges were removed).\n\nIts a big relief in my life to be rid of this place. Even though the location was convenient, the neighbors were not, and it was not a kid friendly/family friendly neighborhood. I would never recommend it to anyone who can afford something else.",
        "owner_response": null
      },
      {
        "author": "idkhonestly haha",
        "rating": 1,
        "review": "This place has gone really down hill, the dog waist trash cans are overflowing constantly, there seems to be garbage and dog waist everywhere. Its disgusting and un sanitary! There is almost never any dog waist bags either. There are random holes in the ground that Im constantly tripping on in the larger field, making it a safety hazard, and graffiti on the playground. The people working here always seem to be rude. They didnt put anything down when it got Icy and multiple people were slipping and falling. They just dont seem to care about there tenants at all.",
        "owner_response": null
      },
      {
        "author": "Xak Walls",
        "rating": 1,
        "review": "We've lived here for years, the first half was great, the second half wasn't. What changed? The apartments got bought out by a different company. After the take over office hours seemed to be cut in half, and the overworked staff got rude, understandably as they now have the same amount of work to do, in about half the time. Our car has been broken into twice. The staff didn't even say \"that sucks\" just \"that happens\". Our upstairs neighbor is loud and vacuums as late as 4am. Despite it claiming in the lease this is against the policy, the staff refuses to do anything. Our lease ended this month, and we got a letter saying that our rent is going up by $175 dollars. Making our one bedroom cost more than our 2 bedroom 2 years ago! When we brought this up to the staff their response was \"well, now the two bedrooms are $1300. (This is untrue, our old roommate said the rent changed from 875 to 1200) and told my wife she could get a second job or go on government assistance! The nerve! Well we found a new apartment, and when we went to notify the office of our intent to move they told us that we are a day late for the 20 day prior. One. Freaking. Day. Late. So now we have to pay 387 dollars plus rent for everyday the apartment isn't filled with a new tenant. For being one day late. They refused to give us any leeway on this. Now here the real assinine part. We never intended to move until the beginning of this month, despite everything we were going to sign a new lease, until we saw that the rent was increasing by 175 dollars. We got that notice 30 days before we had to sign a new lease, and we have to give notice of intent to leave 20 days before the lease signing, meaning we had to find and get approved for a new apartment all within 10 days. I had to take sick days at work to do that. And we were still one day late. This place blows, no one move in.",
        "owner_response": null
      },
      {
        "author": "Marlena Hunsaker",
        "rating": 1,
        "review": "The staff is overwhelmingly rude and disorganized. The people living here are shady and hostile. It's definitely not a place I recommend anyone to live. People steal the reserved parking regularly, there's garbage all over the parking lot, people are too loud. I couldn't tell you how many times I've woken up in the middle of the night on a work night because of the inconsiderate people living here. Maintenance issues also take about a month or so to get resolved.. So that's ALWAYS a plus",
        "owner_response": null
      },
      {
        "author": "Aleksander Greenleaf (Alek)",
        "rating": 4,
        "review": "Section 8 housing offers a huge tax break. I get it. Cascade Meadows staff work hard for very little pay. They are yelled at every day by some of the craziest people in Bellingham. And they endure. They do their best and I really appreciate the people.\n\nThe company that purchased Cascade Meadows is called Indigo Real Estate. They couldn't care less about their employees or residents. This is the only place I know of in Whatcom that doesn't recycle. At all.\n\nGood location. A gamble on neighbors. Good customer service.",
        "owner_response": null
      },
      {
        "author": "Nathan Ash",
        "rating": 2,
        "review": "I agree with the negative reviews that seem to be everywhere about cascade meadows. i have been here for years and it gets worse every time. The extremely rude office ladies and a sarcastic and rude maintenance staff. even the most simple question is \"answered\" with a passive aggressive tone. my neighbors a few numbers down broke their lease to and had to pay around $1000 just to get out of here! the rent goes up every year and the quality of the apartment is pretty shabby. I could really go on about the disappointing facts that surround Cascade Meadows.",
        "owner_response": null
      },
      {
        "author": "Amy Martin",
        "rating": 5,
        "review": "This is an awesome place to live. The staff is incredibly friendly and polite. The rent is reasonable and the units come with washer, dryer and dishwashers. LOVE IT HERE!!!",
        "owner_response": null
      },
      {
        "author": "Bobby Newbie",
        "rating": 1,
        "review": "Do not rent or go near this place! They will take your deposit and shove it. Ruder than heck and poor upkeep. Sense getting bought out, it has been a nightmare and has affected people's renting history sense. Do not rent here at all!",
        "owner_response": null
      },
      {
        "author": "Nick Ocean",
        "rating": 3,
        "review": "I lived a large portion of my early life here at that time I did not know what to think of it but now I see.all that I actually liked was the office mostly because they had free cookies and a vending machine rarely I would get my way into the pool table room also the tennis quart we got a plastic basket ball net and roped it on the fence now I see it was not as great as I thought now that I look back I think of how I actually liked it there guIddddidentyahw",
        "owner_response": null
      },
      {
        "author": "Lisa Rodriquez",
        "rating": 2,
        "review": "Very pretty appartments. Pretty quiet. Moved in there several years ago so I could attend WCC easier.",
        "owner_response": null
      },
      {
        "author": "Abigail Darden",
        "rating": 5,
        "review": "Extremely nice office manager and most well kept low income housing I've seen, maintenance men are super nice",
        "owner_response": null
      },
      {
        "author": "Amy Dodds",
        "rating": 4,
        "review": "Nice place never had any problems and it great to be close to everything!",
        "owner_response": null
      },
      {
        "author": "Rob Martin",
        "rating": 1,
        "review": "Office staff was downright rude when i was inquiring about the complex. Nasty!!!",
        "owner_response": null
      },
      {
        "author": "Larry Sand",
        "rating": 1,
        "review": "J house 419",
        "owner_response": null
      },
      {
        "author": "Ning Chen",
        "rating": 2,
        "review": "Now",
        "owner_response": null
      },
      {
        "author": "Patricia Ramirez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Rhiannon Train",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "ana isabel perez zafra",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Illumination Expedition",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Brittany Evans",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "chris kinsland",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "c Web",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "O",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Dalene Robinson",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Sheena Wilkerson",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 16,
  "adjusted_average_rating": 2.25,
  "distribution": {
    "1": 9,
    "2": 4,
    "3": 1,
    "4": 3,
    "5": 9
  },
  "summary": {
    "created_timestamp": 1739205416,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite several negative user reviews, Cascade Meadows does have some positive aspects noted by its residents. A few residents highlighted the reasonable rent and included amenities such as washer, dryer, and dishwashers in the units, making living here convenient. Moreover, some residents appreciated the nice and polite demeanor of the office staff. The location of Cascade Meadows received praise for being conveniently close to amenities, which some find beneficial to their daily commuting needs.</p><p>Another positive point brought forward is the commendable efforts of some staff members, specifically maintenance and office personnel, who were able to provide friendly and efficient service in some circumstances. The effective handling of certain maintenance requests and the helpfulness of staff in these instances left a positive impression on a handful of residents. It seems that despite broader issues, some components of the management team continue to bring value and support to the community.</p></section><section id=\"great\"><h2>Great</h2><p>A select group of user reviews describes Cascade Meadows as an exceptional low-income housing option. For instance, one resident mentioned how Cascade Meadows features some of the best-maintained housing for low-income individuals, highlighting a commendable standard of upkeep compared to similar options. The property manager is recognized for professionalism and a helpful demeanor, contributing to a more pleasant living experience for some.</p><p>Safety and cleanliness are aspects that particularly stand out. Certain residents have found Cascade Meadows great in terms of its peaceful and quiet environment. They commend the management for ensuring a clean and orderly property, which brings peace of mind to those particularly concerned with cleanliness and tranquility. Overall, the combination of a strategic location and good customer service on many fronts enhances the living conditions significantly.</p></section><section id=\"bad\"><h2>Bad</h2><p>Many user reviews indicate frustrations with communication and management practices at Cascade Meadows. A prevalent theme points to slow response times and inadequate handling of maintenance issues. Tenants describe difficulties reaching staff or receiving follow-ups on reported issues, resulting in unresolved maintenance that can lead to health and safety concerns, such as unkempt common areas and overflowing waste bins.</p><p>The attitude and professionalism of the staff have also been called into question. Some residents reported unpleasant interactions with office personnel and described them as unhelpful and rude. Besides, residents have repeatedly mentioned that living costs continue to rise without any noticeable improvements in facilities or services. Rent hikes coupled with a perceived lack of appropriate management deteriorate trust and satisfaction among tenants.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>A number of tenants have shared particularly distressing experiences that show a serious need for improvement in property management at Cascade Meadows. The overwhelming sentiment from certain reviews is an environment of neglect and inefficiency, highlighted by issues such as unsanitary conditions due to insufficient waste management and safety risks due to maintenance neglect. One tenant notably reported an intrusive maintenance situation where personal property was mishandled.</p><p>Safety concerns further arise from reports of theft and poor security measures within the complex. Some user reviews describe scenarios of crime and disturbance, painting a picture of an unsafe living environment that management has inadequately addressed. Additionally, issues with proper tenant service, such as security deposits and correct lease terminations, are emerging as significant grievances that tarnish the reputation of the property management at Cascade Meadows.</p></section>"
  }
}