{
  "name": "Coldwell Banker Bain of Bellingham",
  "slug": "coldwell-banker-bain-of-bellingham",
  "company_type": null,
  "address": "3610 Meridian St, Bellingham, WA 98225",
  "review_count": 20,
  "average_rating": 4.85,
  "reviews": {
    "google_reviews": [
      {
        "author": "Gina Fagan Kley",
        "rating": 5,
        "review": "Erika Smith is the most professional and kind realtor Ive ever met. She helped me to sell my beloved home of 26 years and purchase my new home while grieving the recent loss of my spouse. I was confused about many steps of the process, but she gently and kindly assisted me throughout with genuine care, spot on professional advice and understanding. She went above and beyond checking in with me and offering assistance with the complicated decisions of downsizing my home and preparing my home for sale. My family and I are very grateful to her for working so diligently to get the best prices for both my old and new homes. Erika is an excellent realtor who gracefully knows how to navigate the complex realty business while demonstrating care and respect for clients complicated needs. My family and I highly recommend Ms Erika Smith of Coldwell Banker Bain.",
        "owner_response": null
      },
      {
        "author": "A",
        "rating": 5,
        "review": "Working with Max Kwiatkowski and Matia Schwartz was an absolute dream come true. As a first-time homebuyer, I was completely lost - but they held my hand through every step of the process with patience, kindness, and a level of expertise that put my mind at ease. No matter how many questions my family threw their way, Max and Matia were always there with clear, comforting answers.\n\nBut their support went far beyond just explaining the process. They were our fierce advocates, using their magic touch to secure us an unbeatable deal on our move-in ready home - a staggering $16,000 off the asking price, practically unheard of in Whatcom! At every turn, they had our backs, working tirelessly to ensure we got the absolute best possible outcome.\n\nThe impact of Max and Matia's help cannot be overstated. With their guidance and our lender's support, they literally changed our lives for the better. We wouldn't be in our new home without them. I can't recommend Max and Matia enough - if we ever move or sell in the future, I wouldn't dream of working with anyone else. From the bottom of my heart, thank you both for everything you do.",
        "owner_response": null
      },
      {
        "author": "Pete Gegenhuber",
        "rating": 5,
        "review": "Our realtor went way, way above and beyond his responsibilities to provide us with excellent first class service! He took care of all our needs and made it a real pleasure, even when things went sideways, and we were worried about the sale. He stepped up and took care of everything! I would recommend Chuck Occhigrosso to everyone to sell their home, in a heartbeat. He is truly a man of honor and great integrity!",
        "owner_response": null
      },
      {
        "author": "corey smith",
        "rating": 2,
        "review": "We worked with Ann Cantrell and Derek Buse to sell our home in Bellingham.  While they are both kind and friendly people, we were very disappointed with the sale overall.  In the initial listing, they made some errors, including the amount of rent charged for our lower unit and the type of heating in the home.\n\nWe were impressed by their marketing reach, but found that we had many questions along the way that went unanswered.  After receiving an offer, we found that Derek advised us to continue lowering the price again and again even in the final stages of negotiation.  He was less and less responsive the closer it got to closing; it almost seemed like the brokers were doing all the negotiating without our being included in the conversation.\n\nWhen they were courting our business, Derek and Ann gave the impression we might get close to our initial listing price, but ultimately we ended up receiving a significantly lower amount.  We wish we had gone with Monte Young, who helped us buy our home originally, because he always took the time to answer questions and he gave us a realistic idea of what to expect every step of the way.",
        "owner_response": {
          "text": "Hello Corey,\nIt sounds like you had an unfortunate experience; however, your experience wasnt with any of our agents and specifically not with Ann and Derek. We believe you may have the wrong company and wed like to respectfully request that you remove your review. We have reported your review to Google since it violates the following policies:\n\nSpam and fake content: Your content should reflect your genuine experience at the location and should not be posted just to manipulate a places ratings.\n\nOff-topic: Only post content based on your experience or questions about experiences at the specific location.\n\nGoogle states We dont allow individuals to use Google Maps to mislead others. This applies to deceptive content as well as false representations.\n\nIf you have any further questions, please feel free to call us at (360) 734-3420. We look forward to this review being removed and wish you all the best.\n\nDean Ulrich, Principal Managing Broker of Coldwell Banker Bain of Bellingham"
        }
      },
      {
        "author": "Tim B.",
        "rating": 5,
        "review": "I can't imagine a better realtor than Coldwell Banker's Jeff Braimes. He has that great combination of professionalism and sincere friendliness. His ethics through a myriad of selling and buying situations were impeccable. He dealt collaboratively with other realtors, banks, builders, inspectors, etc. He clearly has experience and exceptional skill in all of the challenging turns that occur in real estate transactions. He helped us find the right buyer at the right price for our home, and then spent endless hours exploring a very wide and constantly changing variety of buy options for us. We learned a lot and by the time the right home came up, we were prepared to move. We are moving in this week, and still Jeff stays in direct contact to help keep things moving smoothly. Couldn't be more pleased and grateful for having met Jeff.",
        "owner_response": null
      },
      {
        "author": "Herman Hamm",
        "rating": 5,
        "review": "My agent, Ms. Stephanie McSorley, is the best advocate I have ever had as my representative,  She has found property for me more than once, and - for a friend of mine- at least twice.  I have owned 12 parcels of land over the years, and I know what agents are like.  She is light-years above the average and/or median.   Proactive, aggressive in getting the fest deal financially, immediate follow-up on any unresolved issues, and committed to client satisfaction.  She is a thorough professional and a credit to BainCB.",
        "owner_response": null
      },
      {
        "author": "Pamela Banin",
        "rating": 5,
        "review": "Bryan Smith is the best possible real estate agent ever!! I would never have a home in Bellingham without Bryan's expertise and endless patience,during a confusing and challenging sequence of events.We still keep in touch if a question arises, and other family members are working with Bryan presently and are equally pleased. Thank you so much!!!\nPamela B.",
        "owner_response": null
      },
      {
        "author": "Eric McRory",
        "rating": 5,
        "review": "Charly Meyers did a fantastic job handling a real estate transaction between me and a personal friend.  My primary concern was that my personal relationship with the seller would be preserved and the utmost of respect would be provided for maintaining the integrity of this relationship.  Charly did a fantastic job earning the trust of the seller and at the same time protecting me as the buyer.  Great diplomacy!  I would recommend Charly to anyone.",
        "owner_response": null
      },
      {
        "author": "Eighteen Echo",
        "rating": 5,
        "review": "Have worked with Ed Hanley of and on for the last 15 years. Mr. Hanley is a very competent, friendly, and hard working realtor. So when we decide to downsize our home in retirement we will definitely hire him again.",
        "owner_response": null
      },
      {
        "author": "Denis McGuire",
        "rating": 5,
        "review": "Carrie Vike Hilleary's professionalism, care and attention, when we recently purchased a home in Bellingham, was outstanding. My family and I would certainly recommend Carrie to anyone looking for an agent to sell or purchase property.\nThank you Carrie\nDenis McGuire",
        "owner_response": null
      },
      {
        "author": "Mark Lawrence Dobbie",
        "rating": 5,
        "review": "It was an education and a joy to learn about the process of selling a house and to be helped through it. I can't imagine a happier experience (and the circumstances were by no means easy). Mr. Hanley's readiness to help and, at the same time, his discretion, were exemplary. Nothing can beat the human touch we experienced. Thank you.",
        "owner_response": null
      },
      {
        "author": "Sebrina Holmstrom",
        "rating": 5,
        "review": "Ken Harrison is the Best!He is considerate, kind ,Funny and would be my first choice!\nIn January my Sister lost her husband to heart disease. Two years prior she was a flight attendant for Alaska and at 50 yrs old had a severe stroke!\nWe needed the perfect home for her where she could be some what independent. Dawn also wanted to live on the water!\nConsidering we had to move her here from Boise we had some time.\nKen was patient with her,lots of issues ,probate , attorneys and Idaho laws!\nKen reached out to his fellow realtors and found Dawn the perfect condo!\nFirst floor ,1 step inside .\nAmazing view !\nAffordable!\nKen is and always will be very special to me and now is a shining star in my sisters eyes!\nThank you Ken Harrison!\n\nSebrina Holmstrom &Dawn Vermeulen",
        "owner_response": null
      },
      {
        "author": "Rick Wilson",
        "rating": 5,
        "review": "Greg Grant is a no-nonsense, get things done guy. His honesty and integrity are beyond reproach. I have had the opportunity to participate in several real estate transactions with him. I marvel at his expertise.",
        "owner_response": null
      },
      {
        "author": "Allan Chaloupka",
        "rating": 5,
        "review": "We liked that Ken Harrison kept with us for nearly four years until we found the house that was right for us. No matter how many times he took us to see properties, he was cheerful and always trying to help us find \"the one.\"",
        "owner_response": null
      },
      {
        "author": "Kayla Dalle",
        "rating": 5,
        "review": "Trish at CBB is amazing! In a crazy market like this you need an agent like Trish to get your dream house! We will always work with her in the future.",
        "owner_response": null
      },
      {
        "author": "Peter Venable",
        "rating": 5,
        "review": "Lori Jo Smith is such a great person to work with and she gets things done quickly when it matters.",
        "owner_response": null
      },
      {
        "author": "Linda Leum",
        "rating": 5,
        "review": "ken harrison was excellent in every way!",
        "owner_response": null
      },
      {
        "author": "Kenny Bahar",
        "rating": 5,
        "review": "Best brokerage in town!!!",
        "owner_response": null
      },
      {
        "author": "Julie Morris",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Margaret McMinn",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 18,
  "adjusted_average_rating": 4.83,
  "distribution": {
    "1": 0,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 19
  },
  "summary": {
    "created_timestamp": 1739205422,
    "text": "<section id=\"good\"><h2>Good</h2><p>Users expressed satisfaction with Coldwell Banker Bain of Bellingham in numerous reviews, praising the professionalism and knowledge of the realtors. Many clients were pleased with the strong negotiation skills demonstrated by the agents, as exemplified by stories of securing favorable deals well below asking prices. Additionally, several users highlighted the agents' ability to communicate effectively, explaining the home buying process in detail, which helped put them at ease.</p><p>The company's commitment to staying in contact with clients even after the transaction was complete stood out as a positive aspect of their service. Several clients noted that their agents remained available to answer any lingering questions or to assist with post-purchase needs. This continued support appears to have left a lasting impression, fostering strong client-agent relationships. Many reviewers remarked that they would not hesitate to recommend Coldwell Banker Bain to others.</p></section><section id=\"great\"><h2>Great</h2><p>Reviews often described exceptional experiences with specific agents at Coldwell Banker Bain, who went above and beyond normal expectations. For instance, one client praised Jeff Braimes for his professionalism and dedication throughout a complex buying and selling process, ultimately leading them to find the perfect home. In another review, a client highlighted the efforts of Charly Meyers in maintaining a delicate balance between buyer and seller relationships during a transaction with a personal friend.</p><p>User reviews frequently commended the agents for their personalized approach and genuine care for client needs. Agents like Erika Smith and Bryan Smith were specifically highlighted for their ability to handle emotionally challenging situations with kindness and professionalism. Such positive experiences have fostered a high level of trust among clients, many of whom wished to work with these agents again in the future.</p></section><section id=\"bad\"><h2>Bad</h2><p>In contrast to the overwhelmingly positive feedback, there was one negative review that addressed issues encountered during a home sale process. The client expressed dissatisfaction with Ann Cantrell and Derek Buse, citing errors in the initial listing and lack of responsiveness when handling inquiries. This left the feeling that the negotiation process was not sufficiently inclusive of the client's input.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>One specific review, which was characterized as unjust, claimed that a client had a bad experience with Ann Cantrell and Derek Buse. However, the company responded to clarify that the review did not pertain to their agents, suggesting it might have been intended for a different agency. The company took steps to address this by requesting the removal of the review, which they believed was based on a misunderstanding, and highlighted their commitment to maintaining accurate and fair representations in reviews.</p></section>"
  }
}