{
  "name": "Crescent Apartments",
  "slug": "crescent-apartments",
  "company_type": "property",
  "address": "420 West Stuart Road, Bellingham, WA 98226",
  "review_count": 10,
  "average_rating": 2.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Davey Fromthenavy",
        "rating": 1.0,
        "review": "Update: Fleas on the 3rd floor as of April - one of the units has a warning on their door. Management did not give any notice to tenants that there were fleas in the building. ",
        "ownerResponse": null
      },
      {
        "author": "Jamie M",
        "rating": 1.0,
        "review": "Zero Stars.\n\nManagement is non existent, heat is inadequate, door locks on building do not ",
        "ownerResponse": null
      },
      {
        "author": "Jordan Grant",
        "rating": 3.0,
        "review": "Lived here for a little over 2 months so far and no issues! Quiet and good location with trails. Will update if anything changes. ",
        "ownerResponse": null
      },
      {
        "author": "Helen kh",
        "rating": 1.0,
        "review": "management is a ghost. submitted a maintenance request got cancelled and was told to do it myself with no direction or special tools that require to fix outlets and kitchen lights. The front door hasnt been working for days and one of the ",
        "ownerResponse": null
      },
      {
        "author": "Tracey Stich",
        "rating": 1.0,
        "review": "Tried to apply for an apartment and management was nonexistent, it took 3 weeks to get a reply. Tried calling the office several times and the phone just rings. After reading all the other bad reviews, I don't think it will be worth it to ",
        "ownerResponse": {
          "text": "Thank you for your feedback, Tracey. From our records, we show that a member of our team has been in contact with you, but we will be happy to reach out again to make sure we address your concerns!"
        }
      },
      {
        "author": "Trevor M",
        "rating": 1.0,
        "review": "Spend your money elsewhere... We moved into this brand new building that had and still has more issues than they know what to do with. If you can even get a hold of someone in their office they'll just play dumb and act sorry. Maintenance ",
        "ownerResponse": {
          "text": "Thank you for your feedback, as it helps us make improvements for the community. We are sorry you have not been satisfied with your experience so far at Crescent, and we take your concerns seriously. Our maintenance team should have been in  More"
        }
      },
      {
        "author": "Kyle E",
        "rating": 5.0,
        "review": "Have had a great experience here.  Apartments are new and in good condition.  Good walking trails and dog areas.",
        "ownerResponse": {
          "text": "Thanks for your feedback! We're so glad to hear you enjoy the community. Let us know if there is ever anything we can do to improve your experience. "
        }
      },
      {
        "author": "Kevin M",
        "rating": 1.0,
        "review": "Same as everyone else...",
        "ownerResponse": null
      },
      {
        "author": "allayna williams",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Allayna, thank you for your review. We are sorry to see that you have not been pleased with your experience, and a member of our team has reached out to you directly to see what we can do to help. "
        }
      },
      {
        "author": "Katy McAdams",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for your review! "
        }
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 1.75,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is a summary generated by ChatGPT, designed to provide an overview of user reviews for Crescent Apartments. It is intended as a tool to aid in finding a property management company or rental property, not as a definitive guide. All opinions are based on the reviews collected and no identifiable information from the reviewers is disclosed in this article.</p>  </section>    <section>    <heading><h2>Good</h2></heading>    <p>Crescent Apartments have been praised by some residents for their newness and the condition of the apartments. A handful of user reviews reflect a positive experience with the property, highlighting that the apartments are in good condition, possibly due to their recent construction. Amenities such as walking trails and dog areas have been mentioned positively, indicating that the complex caters to pet owners and individuals who enjoy outdoor activities.</p>    <p>The engagement of the property management with the reviewers is another positive aspect that emerges from the user reviews. In cases of positive feedback, the management has taken the time to express gratitude for the compliments received, indicating attentiveness to resident satisfaction. This can be a reassuring sign for potential residents that their voices could be heard and appreciated.</s></p>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>A few reviewers have encountered a relatively issue-free living experience, citing the quietness of the environment and the convenient location, with access to trails as significant advantages. These testimonials indicate that for some tenants, Crescent Apartments meet their expectations of a comfortable and tranquil home. Residents who prioritize peace and accessibility to nature may find these insights particularly appealing.</p>    <p>Additionally, the responsiveness of the management to online reviews is noteworthy, at least in instances of criticism. In several cases where reviews have been less than favorable, the management has shown a willingness to engage and respond, suggesting an inclination to address concerns and improve the living experience at Crescent Apartments.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>The user reviews reveal a trend of dissatisfaction regarding the management's presence and responsiveness. Several reviewers have expressed frustration with the difficulty in contacting management, either for inquiries regarding apartment applications or seeking assistance with issues within the building. In particular, delays in communication have been noted, with some tenants reporting that it took weeks to receive a reply, if at all.</p>    <p>Maintenance appears to be another primary concern highlighted by residents. Reports of maintenance requests being ignored or inadequately addressed are common among the complaints. For example, specific issues with appliances, such as outlets and kitchen lights not working, have been mentioned, with residents being left to resolve these issues without proper guidance or support from the Crescent Apartments management team.</p>  </section>  <section>    <heading><h2>Ugly</h2></heading>    <p>Among the more severe criticisms of Crescent Apartments is the mention of infestation, specifically of fleas in the building. The impact of such an issue on the quality of life for the tenants cannot be underestimated, and it appears worse by the lack of proactive communication from the management to inform and reassure tenants of steps being taken to address the problem.</p>    <p>Security concerns have also been mentioned, with reports of the front door lock being non-functional for an extended period. Such security lapses can be distressing for residents and may contribute to a feeling of neglect and unsafe living conditions. The culmination of these issues can paint a grim picture of the day-to-day realities some tenants at Crescent Apartments may face.</p>  </section> </article>"
}