{
  "name": "Crescent Apartments",
  "slug": "crescent-apartments",
  "company_type": "Property",
  "address": "420 West Stuart Road, Bellingham, WA 98226",
  "review_count": 17,
  "average_rating": 2.59,
  "reviews": {
    "google_reviews": [
      {
        "author": "Terese Capogna Brown",
        "rating": 4,
        "review": "I have been living here for almost three years, since Crescent opened. I have an apartment facing east which looks out onto trees and protected green space for wildlife. This serene view has been the highpoint of living here. My neighbors on my floor are very nice and friendly and people in general are whom live in the building. What I like are the different age groups of people living here. The managers, Tim and Sarah, have been very helpful, kind and responsive. I got my dryer looked at the next day by a technician. The complex is clean and someone vacuums the rugs in the corridors every week and washes the lobby floor. The reason I give it four stars instead of five is that the soundproofing is not great here especially for people above one. If you have a noisy neighbor above you then it can be very difficult, but it's probably the same for any apartment building. I would recommend living on the fifth floor! We are close to the coop and the mall, Fred Meyers, Mud Bay, CVS, Walgreens, etc. Walking around the area is lovely, with trails, trees, mountains in view. I feel safe living here and in this area.",
        "owner_response": null
      },
      {
        "author": "Paige Vinton",
        "rating": 3,
        "review": "I lived in this apartment complex for a little over a year. The location was great, my apartment was very clean when I moved in, and the amenities in the building are nice. Up until recently, the on-site manager was hard to get ahold of. Now there are new on-site managers who have been responsive and helpful. When I lived there, there was a person who didnt leash their dog and I would voice my concerns, but the dog would continue to be off leash as I had a reactive dog and the complex requires dogs to be leashed. All of my animals ended up with fleas which most likely came from living in the complex as they dont have contact with other animals.",
        "owner_response": {
          "text": "We're always looking for ways to improve, and we appreciate your feedback. We're glad to hear that you enjoyed the community and apartment, and happy to hear that our current onsite team has been responsive to your needs. If there is anything else we can assist you with, please let us know! "
        }
      },
      {
        "author": "John Smith",
        "rating": 1,
        "review": "I would give this place no stars but unfortunately Google doesnt provide that option. This is by far the worst and I mean WORST place to live if youre living in Bellingham, WA. Management never answers their emails, voicemails, or phone calls. Maintenance requests take forever to be processed and fulfilled. The gym equipment is always faulty or broken. The hallways stink. The icing on the cake is you incur ridiculous hidden charges throughout the month and if those charges arent you incur a $5 a day late fee. I dont even know what these charges are for when I already have renters insurance. I would almost rather choose couch surfing or living in my vehicle than living at Crescent Apartments in Bellingham. Please, PLEASE do yourself a favor and save yourself the headache but more importantly the money thatd youd waste living here, find somewhere else to live because this place from top to bottom is absolutely horrible.",
        "owner_response": {
          "text": "Thank you for your review. We weren't able to find you in our system, but if you are a past resident with us, we would love the opportunity to assist you. We have a new management team onsite at the community, and they have made responsiveness to residents a top priority, responding to all emails and voicemails within one business day and processing maintenance requests as quickly as possible. We're also happy to report that the gym equipment is now fully operational. \n\nWe would be more than happy to explain any charges on your ledger or guide you through the process of unenrolling in our insurance program. Please give us a call or stop by our office, so that we can assist you further."
        }
      },
      {
        "author": "Ryan Walker",
        "rating": 5,
        "review": "Great experience!! Just moved into town from the central states to Bellingham for work. Kendall and Tim were great, made it really easy on the transition as I made the choice and filled out the application online. There portal to pay rent and work is very simple and easy to use. Apartment is great, very clean and simple. Very good and brand new appliances. Every question I had moving in was answered in a timely manner. Very good overall. 5 stars.i highly recommend.",
        "owner_response": null
      },
      {
        "author": "Andrea Coudray",
        "rating": 5,
        "review": "I have been here at Crescent for a year and a half.  Have been very happy here. Beautiful apartments and location. Love the walking trail.  Whitney was very helpful when moving in and now Tim is a great manager.",
        "owner_response": {
          "text": "Thanks for your feedback, Andrea! We're so happy to hear that you're enjoying the community and service so far. "
        }
      },
      {
        "author": "Davey Fromthenavy",
        "rating": 1,
        "review": "Update: Fleas on the 3rd floor as of April - one of the units has a warning on their door. Management did not give any notice to tenants that there were fleas in the building.\n\nWish I could give this place 0 stars. Building was nice when new last year but has quickly gone downhill. The grass outside was a foot deep for the entire summer which was just the start. Had poison hemlock growing around the property, fatal if your dog ingests this. Then one of the elevators broke and was down for months. The front handle of front building door was ripped clean off. When it snowed nothing was maintained around the building - sidewalks were like an ice rink. Power was out for the parking lot lighting for a solid two weeks. The entire building is usually a mess, someone keeps dragging leaves and dirt into the hallways, with cleaning people only showing up once a month if at all. Noisy and bothersome construction of the second phase apartment buildings next door which make working from home impossible without headphones - and the building shakes. Got notification that my lease is actually increasing when there are a ton of units available for 300$ less per month. Consistent with the theme of ignorant management. Will be looking elsewhere, not worth the price whatsoever - half the tenants have already moved out!",
        "owner_response": null
      },
      {
        "author": "Julie Keeffer",
        "rating": 5,
        "review": "We have been here over a year, always felt secure. Love the apartment and area. The manager, Tim, has been great .",
        "owner_response": {
          "text": "Thanks so much for your review! We love when our residents are happy!"
        }
      },
      {
        "author": "Jordan Grant",
        "rating": 3,
        "review": "Lived here for a little over 2 months so far and no issues! Quiet and good location with trails. Will update if anything changes.\n\n*update 1/27: I have also experienced the same problems other reviewers have mentioned. The elevator are now fixed but it took far too long. The door is now \"lockable\" but remains open unless you force it closed.\n\nThe amenities in the apartment are nice and the location is good...so 2 stars? Customer service is important.\n\nNow the streetlights are out outside making it difficult when you come home in the evenings. The little inconveniences add up. Again, I'll update if anything changes.\n\n*update 6/19: Some concerns have been addressed but only when residents band together. I've noticed more effort recently but that may be due to people signing new leases. No major elevator or door issues for awhile. The theft in the bike storage was addressed. Upping my review to 3 stars for now. Hoping things continue to get better, especially since Crescent 2 is coming along.",
        "owner_response": null
      },
      {
        "author": "Jamie M",
        "rating": 1,
        "review": "Zero Stars.\n\nManagement is non existent, heat is inadequate, door locks on building do not work, loud and dusty construction outside, crime and homelessness surrounding the building all night, street lights in parking lot go out often leaving the parking lot dark, units are poorly constructed with no sound deadening between units, snow removal over winter never happened leaving multiple people from being able to leave, Kylie the leasing agent told us there was air conditioning while there is not, summer time temps on the 5th floor were over 90 degrees (inside) daily, elevators rarely both work, lawn was never cut, and more. The list goes on.\n\nDo not rent here, youll regret it. Most residents are breaking their lease and leaving early, leaving the building in shambles.",
        "owner_response": null
      },
      {
        "author": "Helen kh",
        "rating": 1,
        "review": "management is a ghost. submitted a maintenance request got cancelled and was told to do it myself with no direction or special tools that require to fix outlets and kitchen lights. The front door hasnt been working for days and one of the elevators has stopped working for months. The one that does work sounds like itll snap at any second and theres no ventilation on it so it always stinks like trash or wet dogs. Everything is built very tall and high and is impossible to reach and very inconvenient even as a tall person. None of my emails to Leasing ever get a reply. Also there doesnt appear to be any insulation in the apartment for heating so youre forced to rank up on your utilities bill. On top of overpriced rent. Also if you miss rent for whatever reason they display it by posting the past due on ur door, not even in a discreet envelop like most places with a little empathy. Found this out by walking past a neighbor. look elsewhere",
        "owner_response": null
      },
      {
        "author": "Tracey Stich",
        "rating": 1,
        "review": "Tried to apply for an apartment and management was nonexistent, it took 3 weeks to get a reply. Tried calling the office several times and the phone just rings. After reading all the other bad reviews, I don't think it will be worth it to rent from this property. It's a shame because the building is beautiful. It has so much potential to be a great place to live. New management is a must!",
        "owner_response": {
          "text": "Thank you for your feedback, Tracey. From our records, we show that a member of our team has been in contact with you, but we will be happy to reach out again to make sure we address your concerns!"
        }
      },
      {
        "author": "Trevor M",
        "rating": 1,
        "review": "Spend your money elsewhere... We moved into this brand new building that had and still has more issues than they know what to do with. If you can even get a hold of someone in their office they'll just play dumb and act sorry. Maintenance issues do not get addressed. Take your money elsewhere. They were and are not willing to work with us when we had unexpected life-issues come up forcing us to move, they just care about getting their overpriced rent. Maintenance and snow removal are non existent, this past snow storm the sidewalks and parking spaces weren't touched. Sidewalks were not walkable, and the front door doesn't open so tenants were supposed to walk around the building on ice-covered sidewalks to get inside. One of the two elevators has been broken 6 of the 8 months we've lived here. Heating systems inside units aren't able to keep up, and they won't heat or fix the heat in the buildings hallways and common areas so our electric heat has to run 24/7. The units do not get warmer than 60 degrees. Leasing agent also lied upon move in claiming the units have A/C. They do not. My fault for not checking, I guess I should have known I was being lied to. Winter temps are no warmer than 60 inside while summer temps are 90+ on the 5th floor. I guess I had decent expectations for almost $2000 a month \n\nUPDATE 01/06/2023\nPTLA HAS NOT reached out like they insisted, instead someone got upset that the front door has been faulty for quite some time now, forcing everyone to walk around. The only handicapped door that is. And now someone ripped the door handle off. Id imagine this will take months for them to fix as well. Once again, do not rent here.\n\nUpdate 01/30/23\nThe streetlights and exterior walkway lights have been out for over a week now. You can hardly see anything in the parking lot or behind the building, must walk with a flashlight. Just a matter of time before all the local Bellingham tweekers that live in the woods next to the building come out and start smashing into car windows to steal stuff now that they dont have to worry about streetlights. Have to assume PTLA just hasnt paid the bill, theyre cheap (obviously).",
        "owner_response": {
          "text": "Thank you for your feedback, as it helps us make improvements for the community. We are sorry you have not been satisfied with your experience so far at Crescent, and we take your concerns seriously. Our maintenance team should have been in touch with you regarding the items you have requested service for, but we will make sure to follow up if there is anything else we can take care of for you. We hope we can improve your experience going forward. "
        }
      },
      {
        "author": "Kyle E",
        "rating": 5,
        "review": "Have had a great experience here.  Apartments are new and in good condition.  Good walking trails and dog areas.",
        "owner_response": {
          "text": "Thanks for your feedback! We're so glad to hear you enjoy the community. Let us know if there is ever anything we can do to improve your experience. "
        }
      },
      {
        "author": "Kevin M",
        "rating": 1,
        "review": "Same as everyone else...",
        "owner_response": null
      },
      {
        "author": "allayna williams",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Allayna, thank you for your review. We are sorry to see that you have not been pleased with your experience, and a member of our team has reached out to you directly to see what we can do to help. "
        }
      },
      {
        "author": "Katy McAdams",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thanks for your review! "
        }
      },
      {
        "author": "Tseke Tsog",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Thanks for your feedback. A member of our team will be in touch with you soon to see how we can help improve your experience."
        }
      }
    ]
  },
  "adjusted_review_count": 14,
  "adjusted_average_rating": 2.64,
  "distribution": {
    "1": 9,
    "2": 0,
    "3": 2,
    "4": 1,
    "5": 5
  },
  "summary": {
    "created_timestamp": 1739205419,
    "text": "<section id=\"good\"><h2>Good</h2><p>Within the Crescent Apartments, residents have expressed appreciation for the community's vibrant atmosphere and helpful management. One resident mentioned the serene view of trees and wildlife from their east-facing apartment, which adds a touch of nature's tranquility to their living experience. The general friendliness of neighbors and the diverse age groups within the community contribute positively to the apartment's environment. Additionally, the proximity to various amenities, such as the coop, mall, and walking trails, offers convenience and leisure options. The management team, including Tim and Sarah, received praise for their responsiveness and efforts in maintaining cleanliness within the complex, such as regular vacuuming and cleaning of the lobby and corridors.</p></section><section id=\"great\"><h2>Great</h2><p>Some residents at Crescent Apartments have experienced exceptional service and amenities that stand out. For example, one recent tenant highlighted their smooth and stress-free moving process facilitated by the management team. The ease of rent payment through a user-friendly portal and the high-quality appliances in their new apartment significantly contributed to their satisfaction. Another resident appreciated the aesthetic appeal and excellent management communication, specifically mentioning Whitney and Tim's outstanding support during their stay. Additionally, the secure environment and beautiful location close to trails further enhance the living experience for some new tenants, encouraging them to recommend the property to others.</p></section><section id=\"bad\"><h2>Bad</h2><p>Unfortunately, not all experiences at Crescent Apartments have been positive, with some residents facing notable issues. A recurring theme in user reviews highlights a lack of management responsiveness, such as delayed maintenance requests and difficulty reaching the management team. Several residents reported unresolved issues with building facilities, including faulty gym equipment, non-functioning elevators, and poorly maintained outdoor areas, such as overgrown lawns. Additionally, the presence of fleas and other pests has been a concern, with some tenants experiencing flea infestations and insufficient communication from management regarding such issues. This lack of prompt resolution and preventative measures significantly detracts from the living experience.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>User reviews have brought attention to severe issues at Crescent Apartments that extend beyond typical maintenance concerns. Some tenants report a complete lack of management presence, where communication is non-existent, and critical maintenance issues, such as ineffective heating, broken door locks, and hazardous winter conditions, go unresolved. The property has been critiqued for hidden charges that incur late fees, further straining tenant finances. Additionally, unsafe conditions, such as faulty street lighting leading to dark parking areas and an increase in crime, have heightened tenant dissatisfaction. Noise from nearby construction and lack of soundproofing exacerbate the frustration, prompting some residents to break leases and move despite financial penalties, describing the overall experience as disorderly and unsafe. These compounding issues contribute to a severe erosion of trust and confidence in the management team at Crescent Apartments.</p></section>"
  }
}