{
  "name": "Crestwood Manor Apartments",
  "slug": "crestwood-manor-apartments",
  "company_type": "Property",
  "address": "2728 W Maplewood Ave Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Jeffrey H.",
        "rating": 1,
        "review": "When I was a tenant at Crestwood Manor, it was an absolute nightmare. The property manager was extremely nosy and came to my door unannounced several times. She lost my rent checks THREE TIMES, would not fix ANYTHING in the apartment without being asked for weeks. My oven completely stopped working and she didn't get someone in to fix it for three weeks. I was completely without an oven for THREE WEEKS. Property manager lives in a house in the front of the place and there's always questionable looking people standing around and old beat up vehicles. It seemed like there might have been a lot of drug activity because some places had a LOT of traffic, and most of the tenants were pretty noisy. Doors slamming, yelling, music, knocking clear up until midnight sometimes. Glad I got out of there",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739095015,
    "text": "<section id=\"good\"><h2>Good</h2><p>Unfortunately, there are no positive sentiments reflected in the user reviews for Crestwood Manor Apartments. The sole review is overwhelmingly negative, focusing primarily on dissatisfaction with the property management and living conditions. Since there aren't any positive insights or commendations from previous tenants, it is clear that this property has significant areas for improvement.</p></section><section id=\"great\"><h2>Great</h2><p>In this article, there are no exemplary aspects to highlight at Crestwood Manor Apartments. The user reviews do not mention any great experiences or standout features that would normally contribute to a positive living environment. The lack of great feedback reinforces the challenges tenants face in this property.</p></section><section id=\"bad\"><h2>Bad</h2><p>The user review regarding Crestwood Manor Apartments indicates several serious issues with property management. The reviewer describes a problematic environment, claiming the property manager was intrusive by showing up unannounced and failing to appropriately address maintenance requests, such as a broken oven that went unfixed for three weeks. Furthermore, there seems to be a lack of professionalism and reliability, with lost rent checks reported multiple times.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The negative experience described in the user review sheds light on potential safety concerns at Crestwood Manor Apartments. The reviewer mentions the presence of questionable individuals and activities around the property, suggesting an environment that could be unsafe or unsettling for residents. This alarming atmosphere, combined with the noise disturbances and management issues, paints a grim picture of life at this apartment complex, ultimately leading to the tenant's relief at having moved away.</p></section>"
  }
}