{
  "name": "Crescent Apartments",
  "slug": "crescent-apartments",
  "company_type": "property",
  "address": "420 West Stuart Road, Bellingham, WA 98226",
  "review_count": 10,
  "average_rating": 2.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Davey Fromthenavy",
        "rating": 1.0,
        "review": "Update: Fleas on the 3rd floor as of April - one of the units has a warning on their door. Management did not give any notice to tenants that there were fleas in the building. ",
        "ownerResponse": null
      },
      {
        "author": "Jamie M",
        "rating": 1.0,
        "review": "Zero Stars.\n\nManagement is non existent, heat is inadequate, door locks on building do not ",
        "ownerResponse": null
      },
      {
        "author": "Jordan Grant",
        "rating": 3.0,
        "review": "Lived here for a little over 2 months so far and no issues! Quiet and good location with trails. Will update if anything changes. ",
        "ownerResponse": null
      },
      {
        "author": "Helen kh",
        "rating": 1.0,
        "review": "management is a ghost. submitted a maintenance request got cancelled and was told to do it myself with no direction or special tools that require to fix outlets and kitchen lights. The front door hasnt been working for days and one of the ",
        "ownerResponse": null
      },
      {
        "author": "Tracey Stich",
        "rating": 1.0,
        "review": "Tried to apply for an apartment and management was nonexistent, it took 3 weeks to get a reply. Tried calling the office several times and the phone just rings. After reading all the other bad reviews, I don't think it will be worth it to ",
        "ownerResponse": {
          "text": "Thank you for your feedback, Tracey. From our records, we show that a member of our team has been in contact with you, but we will be happy to reach out again to make sure we address your concerns!"
        }
      },
      {
        "author": "Trevor M",
        "rating": 1.0,
        "review": "Spend your money elsewhere... We moved into this brand new building that had and still has more issues than they know what to do with. If you can even get a hold of someone in their office they'll just play dumb and act sorry. Maintenance ",
        "ownerResponse": {
          "text": "Thank you for your feedback, as it helps us make improvements for the community. We are sorry you have not been satisfied with your experience so far at Crescent, and we take your concerns seriously. Our maintenance team should have been in  More"
        }
      },
      {
        "author": "Kyle E",
        "rating": 5.0,
        "review": "Have had a great experience here.  Apartments are new and in good condition.  Good walking trails and dog areas.",
        "ownerResponse": {
          "text": "Thanks for your feedback! We're so glad to hear you enjoy the community. Let us know if there is ever anything we can do to improve your experience. "
        }
      },
      {
        "author": "Kevin M",
        "rating": 1.0,
        "review": "Same as everyone else...",
        "ownerResponse": null
      },
      {
        "author": "allayna williams",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Allayna, thank you for your review. We are sorry to see that you have not been pleased with your experience, and a member of our team has reached out to you directly to see what we can do to help. "
        }
      },
      {
        "author": "Katy McAdams",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for your review! "
        }
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 1.75,
  "summary": {
    "text": "<section><h2>Good</h2><p>Despite the mixed reviews, Crescent Apartments offer some redeeming features that some tenants appreciate. For instance, there are tenants who have had a great experience, citing the new and well-maintained condition of the apartments. Additionally, the location is highlighted for its tranquility and proximity to good walking trails and dog areas, catering to outdoor enthusiasts and pet owners.</p><p>A few tenants have not encountered significant issues during their stay, suggesting that individual experiences can vary greatly. These residents seem satisfied with their living situation, which may indicate that the Crescent Apartments have the potential to provide a comfortable living environment when conditions are favorable.</p></section><section><h2>Great</h2><p>The property has responded to some user reviews, offering to reach out and address concerns raised by the tenants. This indicates an intention to engage with residents and potentially improve the services provided. Some reviews have also mentioned that the apartments themselves are new, which can be a draw for those seeking contemporary housing options.</p><p>The positive interactions with the property management, as indicated in their responses to reviews, show a level of customer service that is attentive to feedback. This responsiveness is crucial in creating a conducive living environment and fostering a good relationship between the tenants and management.</input></section><section><h2>Bad</h2><p>Unfortunately, the number of critical observations in user reviews cannot be overlooked when evaluating Crescent Apartments. Several tenants have expressed frustration over what they describe as the lack of presence and ineffectiveness of the management team. There have been instances where maintenance requests were canceled without resolution, leaving residents to fend for themselves without proper guidance or the necessary tools.</p><p>Security concerns have been raised due to malfunctioning door locks, which have reportedly gone unaddressed for extended periods. This strikes at the heart of tenant comfort and safety, two fundamental elements of property management that seem to be lacking attention according to the user reviews.</p></section><section><h2>Ugly</h2><p>The more alarming issues at Crescent Apartments appear to be chronic and systemic according to some tenants. There are reports of familiar problems being ignored, such as inadequate heating systems and a visible warning about flea infestation within the building that was not communicated to the tenants in a timely manner. It's also worth noting that issues within brand new buildings are especially disappointing to residents who had higher expectations for their living conditions.</p><postData></postData><p>Communication has also been cited as a significant problem, with some prospective tenants experiencing substantial delays in response times when trying to apply for an apartment. Such challenges in communication exacerbate the frustration felt by current and potential residents, casting a doubt on the efficiency and reliability of the property management team at Crescent Apartments.</p></section>"
  }
}