{
  "name": "Crestwood Manor Apartments",
  "slug": "crestwood-manor-apartments",
  "company_type": "Property",
  "address": "2728 W Maplewood Ave Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Jeffrey H.",
        "rating": 1,
        "review": "When I was a tenant at Crestwood Manor, it was an absolute nightmare. The property manager was extremely nosy and came to my door unannounced several times. She lost my rent checks THREE TIMES, would not fix ANYTHING in the apartment without being asked for weeks. My oven completely stopped working and she didn't get someone in to fix it for three weeks. I was completely without an oven for THREE WEEKS. Property manager lives in a house in the front of the place and there's always questionable looking people standing around and old beat up vehicles. It seemed like there might have been a lot of drug activity because some places had a LOT of traffic, and most of the tenants were pretty noisy. Doors slamming, yelling, music, knocking clear up until midnight sometimes. Glad I got out of there",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739205422,
    "text": "<section id=\"good\"><h2>Good</h2><p>In this article, we strive to capture aspects that could be seen in a positive light at Crestwood Manor Apartments. Although the availability of detailed positive user reviews is lacking, potential factors that might typically be appreciated are the location and the potential for community living, factors generally favorable in apartment complexes. The property is located in Bellingham, Washington, which could offer access to local amenities and services. However, specifics on these aspects are not detailed in the limited user feedback available.</p></section><section id=\"great\"><h2>Great</h2><p>The article wishes to emphasize standout qualities that would typically be lauded, but currently, there are no reported experiences from the user reviews to draw from regarding exceptional features of Crestwood Manor Apartments. Without further positive insights, it's challenging to highlight extraordinary characteristics, such as exceptional property management efficiency or outstanding maintenance services, which remain unreported according to the reviews.</p></section><section id=\"bad\"><h2>Bad</h2><p>The user reviews for Crestwood Manor Apartments indicate significant areas of concern primarily related to property management. One of the key issues highlighted includes the property manager's approach, described as invasive due to unannounced visits, and a failure to manage rent collection efficiently, with reports of lost rent checks on multiple occasions. Moreover, maintenance responsiveness is a critical concern, as there were delays in addressing significant repairs like a non-operational oven, which took three weeks to be rectified. Noise levels and potentially troubling neighborhood activities were additional points of dissatisfaction among residents.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most distressing accounts from Crestwood Manor Apartments primarily revolve around the living conditions and surrounding environment. Reviews describe a concerning atmosphere with frequent, questionable activities suggesting possible substance-related activity, accompanied by considerable noise disturbances at all hours from other tenants. The presence of derelict vehicles and dubious individuals reportedly loitering around the property further detracted from the appeal and perceived safety of the environment. These factors contribute heavily to the negative perception of the living situation at Crestwood Manor Apartments.</p></section>"
  }
}