{
  "name": "Dargone USA",
  "slug": "dargone-usa",
  "company_type": "Property",
  "address": "2363 Main St Ste 102 Ferndale, WA 98248",
  "review_count": 3,
  "average_rating": 1.33,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Liliana M.",
        "rating": 1,
        "review": "We were one of the first tenants in the building so we didn't realize how thin the walls were. Once the building filled up, I could hear my neighbor sneeze next door and use the bathroom. \n\nThey don't maintain the property. It's a mess. They don't even clear/de-ice the stairs in the winter. \n\nUpon move out, we CLEANED. It was absolutely spotless. We received $96.00 out of $1000.00 deposit. Apparently we left the apartment a mess. I would NEVER recommend living there.",
        "ownerResponse": null
      },
      {
        "author": "Christine R.",
        "rating": 1,
        "review": "These apartments suck!!  They are glittery on the outside but are carelessly built and very poorly run.  If you want to live in an expensive ghetto with riff raff for neighbors and an ignorant not present manager than this is the place for you.  Loud neighbors, with lots of rules but no one to enforce them.",
        "ownerResponse": null
      },
      {
        "author": "David M.",
        "rating": 2,
        "review": "The apartments were ok when they were brand new . Physically the apartments are cheap and have a \"mass produced\" feel. By that I mean the plumbing is finicky and there are funny design flaws all over (exposed pipes, malfitting cabinets). The building I was in had almost no insulation. I could literally hear one neighbor sneez, and I knew when video game time came around for my other neighbor (this is all while I was watching TV). However other buildings were reportedly better in that aspect. There is minimal storage. Since the new manager came around the quality of people has dropped dramatically. I love kids, however, the kids at these apartments are largely unsupervised and leave their toys all over. On more than one occasion I had to move bikes so I could leave the parking lot. Trash blows around alot until the landscaping guy brings his kids to pick it up once a week, a few months out of the year. When I moved out at the end of February 2012, there was still three Christmas trees from the previous Christmas and one from the year before. I can see this being a step up from some situations but not many. I rated the apartments two stars because it was bearable for the first two years of the three I lived there.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 1.33,
  "summary": {
    "text": "<section><h2>Good</h2><p>Currently, based on the user reviews provided, there are no positive comments highlighted that outline the good qualities or experiences associated with Dargone USA. The data given does not include content that reflects satisfaction with the company's property management services. If there were aspects of the services rendered by Dargone USA that could be considered good, they are unfortunately not reflected within the scope of the user reviews available up to the knowledge cutoff.</p></section><section><h2>Great</h2><p>The information at hand does not specify any instances or experiences that can be construed as great in the context of Dargone USA's property management. User reviews have not brought to light examples of the company exceeding tenant expectations or delivering exceptional service. The absence of such information precludes the ability of this article to comment on any 'great' experiences had by residents or clients of Dargone USA.</p></section><section><h2>Bad</h2><p>The user reviews document several shortcomings in Dargone USA's property management, including complaints about poor construction quality and inadequate maintenance. One tenant mentioned experiencing \"funny design flaws\" such as exposed pipes and ill-fitting cabinets, indicating a lack of attention to detail during construction. Furthermore, there is mention of poor soundproofing, allowing tenants to hear neighbors' everyday activities, which significantly detracts from the living experience.</p><p>Additional grievances pointed towards the company's failure to maintain the property, with one tenant describing it as 'a mess' and noting the dangerous lack of ice clearing in winter conditions. The tenants' dissatisfaction is also linked to a perceived neglect by management to enforce community rules, leading to issues like unsupervised children and toys obstructing parking areas, as well as uncollected trash and litter around the property. Such consistent feedback paints a clear picture of tenants feeling disregarded by the management company.</p></section><section><h2>Ugly</h2><p>The most severe criticism of Dargree USA stems from its handling of security deposits and the apparent discrepancy between the tenants' accounts of property conditions upon move-out and the company's assessment. One reviewer explicitly recounted leaving their apartment 'spotless,' only to receive a meager fraction of their $1000 deposit, with the implication being that the apartment was left in a messy state. This kind of practice raises significant concerns about the company's fairness and transparency in financial dealings with tenants.</p><p>Moreover, the user reviews have not mentioned any responses from the owner to the complaints, indicating a lack of engagement and communication with the tenants regarding their issues. The apparent absence of management presence, as mentioned by another tenant, further compounds the impression of an unresponsive and possibly negligent property management company. Such unsettling experiences contribute to the 'ugly' aspects of Dargone USA's reputation, as per the user reviews.</p></section>"
  },
  "created_timestamp": 1725642000
}