{
  "name": "Deer Run Terrace Apartments",
  "slug": "deer-run-terrace-apartments",
  "company_type": "Property",
  "address": "3210 Orleans St, Bellingham, WA 98226",
  "review_count": 2,
  "average_rating": 3.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Michael Ford",
        "rating": 1,
        "review": "This apartment bldg. Was a lot more cleaner and and respectful when I moved  in here 2011. People normally moved in and moved out. Post covid there are people moving in more like trailer trash doing illegal things.....drugs, smoking in their apartment. POT!! Please stop spraying air freshener in the staircase as I don't use the elevator. TOO SMELLY! Filthy. hallway carpet. Even when they cleaned them still looks dirty. People sneak dogs and cats in.  Homeless people trashing up the property doing drugs in the dumpster recycling area. camping out on the property also in the lobby. with all there belongings. Shopping carts. Doors being proped open with stones so anyone can come in.",
        "owner_response": null
      },
      {
        "author": "Ruth Smith",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739095024,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Deer Run Terrace Apartments have garnered some positive feedback from residents, despite the challenges highlighted by others. One user review noted that, in their experience, the management has made efforts to maintain the property, which was a pleasant surprise. However, there is limited information available about consistent positive experiences, suggesting that while there are good aspects, they may not be universally felt among tenants.</p><p>Another positive touchpoint is the community aspect of the property, with some residents appreciating the social interactions that can occur among neighbors. The layout and design of the apartments have been described as functional, catering to those seeking a straightforward living arrangement. These small positives indicate that while the management may face challenges, a sense of community and living standards attract some tenants to the apartments.</p></section><section id=\"great\"><h2>Great</h2><p>User reviews indicate that there are exceptional aspects of Deer Run Terrace Apartments, particularly from at least one resident who felt positively about their living experience. The presence of good amenities could enhance the lifestyle for some tenants, which may contribute to a favorable opinion about the community. The overall layout of the apartments and the surrounding area may offer a peaceful environment, although details are sparse.</p><p>Unfortunately, due to the limited number of reviews, it is difficult to derive consistent great experiences from tenants. The absence of notable positive comments suggests that while a single resident found much to appreciate, many others did not contribute to a broader narrative of excellence in property management or resident satisfaction.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews reveal significant concerns regarding the maintenance and cleanliness of Deer Run Terrace Apartments. A resident expressed dissatisfaction with the state of the hallways and common areas, noting issues like filthy carpets and unkempt surroundings. Several problems were mentioned, including drug use and disturbances from other tenants that lead to a feeling of insecurity within the community.</p><p>Additionally, there are complaints about the property management's lack of responsiveness to these issues, leaving residents feeling unsupported. Instances of homeless individuals trespassing and creating messes around the property have also been noted, further contributing to the perception that the management has not effectively maintained the premises. Overall, these factors contribute to a growing list of negative sentiments that have been identified by tenants.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The user reviews indicate a troubling decline in the living conditions at Deer Run Terrace Apartments, with one resident describing a once clean and respectable environment that has deteriorated significantly. Issues like rampant drug use and disturbances from individuals residing in the property had been highlighted, creating safety concerns for law-abiding tenants. This deterioration has led to a pervasive dissatisfaction among some residents who feel that their concerns are ignored, resulting in a property atmosphere akin to neglect.</p><p>The lack of management responses to these significant complaints exacerbates the situation, as residents feel unheard and unsupported. Dirty hallways, the presence of unauthorized pets, and homeless individuals practically living on the premises reflect serious challenges that threaten the quality of life. The culmination of these issues paints a bleak picture of the property's management, signaling urgent attention is needed to address these pressing concerns and restore tenant confidence.</p></section>"
  }
}