{
  "name": "Dex Apartments",
  "slug": "dex-apartments",
  "company_type": "Property",
  "address": "904 E Chestnut St Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Nohero T.",
        "rating": 1,
        "review": "Western Washington University students should beware of this landlord.  Suggest you stay away \nfrom this apartment.  Rent somewhere else; but if you do choose to rent at Dex, note well:\n\nThis landlord charges a lot of dubious opportunistic fees and a one-month security deposit  PER TENANT when applying for an apartment lease.  A lot of money.\n\nThe landlord will unilaterally withhold some or all of your security deposit money for cleaning and painting when you and your roommates vacate.  This is irregular and is wrong.  Security deposits can only be held for damage to the apartment and are NOT nonrefundable.  \n\nMake sure you document the condition of the apartment before taking occupancy.\n\nThe apartment was not painted when we occupied.  The landlord attempted to charge us for painting the apartment.  We had to PROVE that the apartment was not painted when we entered.  How many times does this landlord take advantage of students and gets away with charging unwitting students erroneously?!!  BEWARE.\n\nThe landlord failed and refused to present an invoice for cleaning charges.  This is a violation of the WA State Landlord and Tenants Act.\n\nSave yourself the trouble and live elsewhere.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739205427,
    "text": "<section id=\"good\"><h2>Good</h2><p>There are no positive aspects mentioned in the user reviews for Dex Apartments. The information available is limited, but the article aims to present a comprehensive view based on the reviews provided. Given the overall negative sentiment from the single available review, it appears there might be room for improvement in terms of service and management practices.</p></section><section id=\"great\"><h2>Great</h2><p>Unfortunately, the user reviews did not highlight any great experiences or praise for Dex Apartments. The article's intent is to thoroughly evaluate available feedback, and in this case, there is a significant lack of positive experiences documented. Enhancements in operations or communications could potentially improve user perception in the future.</p></section><section id=\"bad\"><h2>Bad</h2><p>The user reviews for Dex Apartments describe several unsatisfactory experiences, particularly in the handling of security deposits. According to a review, there are reports of dubious fees and unjust withholding of deposits for charges like cleaning and painting, which frustrated tenants. This indicates a need for clearer communication and fairer policies regarding deposits and move-out procedures.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The ugly side of Dex Apartments, as reflected in user reviews, includes serious allegations of violating tenant rights. One review highlighted a potential breach of the WA State Landlord and Tenant Act due to non-provision of invoices for claimed charges. This creates an impression of the landlord possibly exploiting tenants, particularly students. No owner responses were noted, which points to a lack of engagement with tenant concerns or an opportunity to address grievances publicly.</p></section>"
  }
}