{
  "name": "Dex Apartments",
  "slug": "dex-apartments",
  "company_type": "Property",
  "address": "904 E Chestnut St Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Nohero T.",
        "rating": 1,
        "review": "Western Washington University students should beware of this landlord.  Suggest you stay away \nfrom this apartment.  Rent somewhere else; but if you do choose to rent at Dex, note well:\n\nThis landlord charges a lot of dubious opportunistic fees and a one-month security deposit  PER TENANT when applying for an apartment lease.  A lot of money.\n\nThe landlord will unilaterally withhold some or all of your security deposit money for cleaning and painting when you and your roommates vacate.  This is irregular and is wrong.  Security deposits can only be held for damage to the apartment and are NOT nonrefundable.  \n\nMake sure you document the condition of the apartment before taking occupancy.\n\nThe apartment was not painted when we occupied.  The landlord attempted to charge us for painting the apartment.  We had to PROVE that the apartment was not painted when we entered.  How many times does this landlord take advantage of students and gets away with charging unwitting students erroneously?!!  BEWARE.\n\nThe landlord failed and refused to present an invoice for cleaning charges.  This is a violation of the WA State Landlord and Tenants Act.\n\nSave yourself the trouble and live elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>In this article, we are tasked to provide a well-rounded examination of Dex Apartments, but the reviews provided do not contain positive experiences shared by the tenants. Therefore, it is challenging to present favorable details about the property management company in this section. We acknowledge that the absence of good reviews does not necessarily reflect the entirety of the tenants' experiences, and there may be satisfied residents with no reviews submitted.</p></section><section><h2>Great</h2><p>Similarly to the 'Good' section, the data provided does not include commendations or praise for Dex Apartments, which significantly limits our ability to highlight any exceptional features or services offered by the company. It is important to note that this article's intent is to give a balanced overview; however, the lack of positive user reviews restricts us from showcasing any standout qualities that may exist.</p></section><section><h2>Bad</h2><p>User reviews have expressed concerns about Dex Apartments, particularly criticizing the high fees and security deposit policies. It was reported that the landlord charges substantial amounts for questionable fees, including a one-month security deposit from each tenant, which users find excessive. Such practices have left tenants feeling unfairly treated, especially given the hefty financial burden it imposes on them.</p><p>Moreover, the landlord faces accusations of inappropriately withholding security deposits for expenses such as painting and cleaning upon vacancy. Such conduct is perceived as irregular and unethical, as security deposits should be reserved for damages, not routine maintenance. This behavior suggests a deviation from standard landlord-tenant protocols and could potentially violate housing laws. Tenants are advised to meticulously document the apartment's condition when moving in to avoid unwarranted charges.</p></section><section><h2>Ugly</h2><p>The situation with Dex Apartments takes a particularly concerning turn when addressing the refusal to provide invoices for cleaning charges, as recounted in the user reviews. This lack of transparency breaches the WA State Landlord and Tenants Act and reflects poorly on the company's management practices. Furthermore, there are implications of recurrent misconduct, with suspicions raised about the landlord regularly exploiting students by erroneously imposing charges for unprovided services, indicating a pattern that tenants have found distressing and deceptive.</p></section>"
  },
  "timestamp": "09/07/2024"
}