{
  "name": "Dex Apartments",
  "slug": "dex-apartments",
  "company_type": "Property",
  "address": "904 E Chestnut St Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Nohero T.",
        "rating": 1,
        "review": "Western Washington University students should beware of this landlord.  Suggest you stay away \nfrom this apartment.  Rent somewhere else; but if you do choose to rent at Dex, note well:\n\nThis landlord charges a lot of dubious opportunistic fees and a one-month security deposit  PER TENANT when applying for an apartment lease.  A lot of money.\n\nThe landlord will unilaterally withhold some or all of your security deposit money for cleaning and painting when you and your roommates vacate.  This is irregular and is wrong.  Security deposits can only be held for damage to the apartment and are NOT nonrefundable.  \n\nMake sure you document the condition of the apartment before taking occupancy.\n\nThe apartment was not painted when we occupied.  The landlord attempted to charge us for painting the apartment.  We had to PROVE that the apartment was not painted when we entered.  How many times does this landlord take advantage of students and gets away with charging unwitting students erroneously?!!  BEWARE.\n\nThe landlord failed and refused to present an invoice for cleaning charges.  This is a violation of the WA State Landlord and Tenants Act.\n\nSave yourself the trouble and live elsewhere.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739095020,
    "text": "<section id=\"good\"><h2>Good</h2><p>Unfortunately, there are no positive reviews available for Property Dex Apartments. The sentiment surrounding the property management company has been overwhelmingly negative. Users have expressed serious concerns about the management practices that have left a bad impression on potential and current tenants.</p></section><section id=\"great\"><h2>Great</h2><p>This article's intent is to objectively discuss the Property Dex Apartments, even though there are no favorable comments to highlight. The absence of user reviews praising the management or the living conditions suggests that there might be numerous areas needing improvement. This indicates a lack of positive experiences that might otherwise be showcased.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews indicate significant issues with the landlord's handling of security deposits and maintenance practices. A tenant reported that the landlord incorrectly withheld part of their security deposit for cleaning and painting, which is against the rules outlined in the Washington State Landlord and Tenant Act. This indicates a troubling trend where students might be unfairly charged for things that should not be deducted from their deposits, creating an untrustworthy environment.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The feedback on Property Dex Apartments details concerning practices that raise ethical questions on how management operates. There were accusations of dubious fees being charged, which seem opportunistic, particularly against a student demographic that may lack experience in rental agreements. Furthermore, the landlord's failure to provide invoices for cleaning charges could represent a blatant disregard for legal obligations, ultimately leaving former tenants feeling exploited.</p></section>"
  }
}