{
  "name": "Dex Apartments",
  "slug": "dex-apartments",
  "company_type": "property",
  "address": "904 E Chestnut St Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Nohero T.",
        "rating": 1,
        "review": "Western Washington University students should beware of this landlord.  Suggest you stay away \nfrom this apartment.  Rent somewhere else; but if you do choose to rent at Dex, note well:\n\nThis landlord charges a lot of dubious opportunistic fees and a one-month security deposit  PER TENANT when applying for an apartment lease.  A lot of money.\n\nThe landlord will unilaterally withhold some or all of your security deposit money for cleaning and painting when you and your roommates vacate.  This is irregular and is wrong.  Security deposits can only be held for damage to the apartment and are NOT nonrefundable.  \n\nMake sure you document the condition of the apartment before taking occupancy.\n\nThe apartment was not painted when we occupied.  The landlord attempted to charge us for painting the apartment.  We had to PROVE that the apartment was not painted when we entered.  How many times does this landlord take advantage of students and gets away with charging unwitting students erroneously?!!  BEWARE.\n\nThe landlord failed and refused to present an invoice for cleaning charges.  This is a violation of the WA State Landlord and Tenants Act.\n\nSave yourself the trouble and live elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "summary": "<article class='review-summary'>  <section>          <h2>Disclaimer</h2>        <p>      This article is a synthesized summary generated by ChatGPT and is intended to serve as a tool to aid individuals in their search for a property management company or rental property. It combines information from an array of user reviews and presents it in a structured format with the aim of providing a balanced overview. It is however, crucial for readers to perform their due diligence before making any decisions based on this content.    </p>  </section>  <section>          <h2>The Good</h2>        <p>      This article strives to present an even-handed look at Dex Apartments, however, based on the data provided, it appears challenging to identify elements that reflect a positive sentiment towards the property management. No direct quotes from user reviews commend the management, nor do they highlight any particular areas where the company exceeds expectations.    </p>    <p>      In the absence of positive comments, this section serves as a reminder that the user reviews are subjective and may not represent the experiences of all tenants. It is possible that satisfied residents have not shared their opinions as frequently or as publicly as dissatisfied ones.    </p>  </section>  <section>          <h2>The Great</h2>        <p>      Details or instances showcasing the management's exemplary service are not delineated in the user reviews provided. Therefore, this article cannot substantiate claims of outstanding performance, dedication, or resident satisfaction concerning Dex Apartments.    </p>    <p>      However, the article acknowledges that sometimes the absence of feedback could be the silent testament of a frictionless living experience for some residents, but in the interest of data-driven conclusions, assertions of great service cannot be made without corroborative user reviews.    </p>  </section>  <section>          <h2>The Bad</h2>        <p>      According to one user review, a recurring theme of dissatisfaction pertains to non-transparent and excessive fees. There are assertions that the landlord charges a hefty one-month security deposit per tenant, which is considered an unusually high amount by the reviewer. Additionally, potential occupants are cautioned about dubious fees that may be levitated.    </p>    <p>      Furthermore, there is mention of discontent regarding how the security deposit is managed. The reviewer claims that the landlord unilaterally withholds the security deposit for cleaning and painting, a practice deemed irregular and wrong since security deposits should only be retained for damages to the property.    </p>  </section>  <section>          <h2>The Ugly</h2>        <p>      Delving deeper into the unpalatable aspects, the review alleges that the landlord at Dex Apartments might attempt to charge for services like painting the apartments, which are not substantiated by evidence or prior condition documentation. Such charges go beyond the accepted norms as they do not reflect true wear and tear, and the burden falls on the tenants to disprove these charges.    </p>    <p>      In addition, the landlord's refusal to furnish invoices for cleaning charges upon move-out raises serious legal concerns, potentially violating the WA State Landlord and Tenants Act, as indicated by the reviewer. This lack of transparency and alleged infringement of tenants' rights casts a worrying shadow over the property management's practices.    </p>  </section></article>"
}