{
  "name": "Dwell Real Estate Asset Management",
  "slug": "dwell-real-estate-asset-management",
  "company_type": "Company",
  "address": "104 Front St, Lynden, WA 98264",
  "review_count": 24,
  "average_rating": 4.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Erika Scott",
        "rating": 5,
        "review": "Dwell is by far the best management company in the PNW! They are super attentive, kind, and knowledgeable in the property management field. Their employees are kind, respectful, and very helpful when I have questions. I highly recommend renting from Dwell!",
        "owner_response": {
          "text": "Thank you Erika for the kind feedback, it has been a pleasure working with you."
        }
      },
      {
        "author": "Brett Canion",
        "rating": 1,
        "review": "Their credit application process is terrible. They will not rent to college students who don't have full time jobs to support themselves all their own. They do not value Co-signer agreements. Please avoid this property management company.",
        "owner_response": null
      },
      {
        "author": "Ariane Stough",
        "rating": 1,
        "review": "We had a HORRIBLE experience trying to rent a townhome with Dwell. First off the property was available immediately, but when I toured the place it was still very dirty and needed cleaning. In addition, there were a couple doors that had holes kicked in them that need replaced. Due to that and the fact that we needed to sublet our current apartment to move in, we set a move in date of 3 weeks later. With a move in date 3 weeks out, we expected prompt communication and updates on our application. There was a severe lack of communication from Tess and it felt like we had to call every day just to get updates on what they needed from us even though we promptly filled out our application. Less than two weeks out from the move in date, we finally called and said we needed to know that day and then suddenly, Tess emailed us saying we couldnt rent the place because we didnt carry a balance of 2.5x rent every month. No option to get a co-signer or anything. The lack of communication and follow-through could have left us homeless. My husband and I have over 10k in our bank accounts and we cant rent a $1800 townhome ",
        "owner_response": null
      },
      {
        "author": "Luie Smit",
        "rating": 5,
        "review": "Excellent company to work with. Kolton is professional, and very responsive. Would absolutely do buisness with them again in the future.",
        "owner_response": null
      },
      {
        "author": "Rachel Williams",
        "rating": 5,
        "review": "We love working with Dwell! What a great property management company. We have worked a lot with Kolton - he has been on point with communicating with us. We value this working relationship and strongly recommend them to everyone! #dryguysrestoration",
        "owner_response": null
      },
      {
        "author": "Marilene S.",
        "rating": 5,
        "review": "Kolton is the most competent, helpful, respectful, and kind property manager I have ever encountered. Communicative, organized, and emotionally intelligent, which is a rare in property management folks but an essential skill in success and good relationships. I 100% recommend Dwell because of this professional.",
        "owner_response": null
      },
      {
        "author": "Emily Shumway",
        "rating": 5,
        "review": "Finally an honest, helpful property management company in Whatcom county! Kolton is highly responsive, sympathetic and reasonable. Things are never perfect in an apartment complex, but Dwell tries their best to ensure everyone is happy.",
        "owner_response": null
      },
      {
        "author": "Isabel Mace",
        "rating": 5,
        "review": "We recently started renting with Dwell and it has been such an easy and nice experience. We have had a few issues with lights and such which is to be expected in brand new construction and they have very quickly come to help us figure out the problem and get us the things we need. They have been nothing but helpful and amazing with us and all of our questions. I highly recommend renting with Dwell!",
        "owner_response": {
          "text": "Thank you so much for the feedback Isabel, we have really enjoyed getting to serve you with a higher level of service."
        }
      },
      {
        "author": "Lucky Lucan",
        "rating": 1,
        "review": "called and inquired about a one bedroom apartment. was guided all the way through the process for over 10 minutes and suddenly asked for my credit score. 680-690 i replied. SORRY. we dont give out apartments to anyone with a credit score under 700. she literally said that. no one in bellingham has a credit score over 700. otherwise they wouldnt be looking for an apartment in bellingham. wild and discriminatory customer service. no matter what your credit score, avoid.",
        "owner_response": null
      },
      {
        "author": "carleeeyyy c",
        "rating": 5,
        "review": "Dwell was great to work with in leasing a townhome! Kolton is a very responsive & knowledgeable property manager, always willing to offer help when needed! Their platform for the residence is a breeze to use & paying rent is very easy.",
        "owner_response": {
          "text": "We appreciate the feedback Carley, we try our best to create a seamless leasing process. We look forward to serving you more in the future!"
        }
      },
      {
        "author": "Jonathan LeBlanc",
        "rating": 5,
        "review": "We recently began renting a townhouse managed by Dwell and are very impressed! This unit was brand new but there were a few minor issues we found during the walkthrough, Dwell was quick to respond and resolve these issues. They are friendly, helpful, and have made our move one of the easiest yet!",
        "owner_response": {
          "text": "Thank you so much Jon for the positive feedback. We look forward to serving you with an unmatched level of service."
        }
      },
      {
        "author": "Ellie Moffitt",
        "rating": 5,
        "review": "Previously rented from Dwell and had the best experience!! Kolton went above and beyond to serve my roommates and I. Grateful for the opportunity Dwell gave us and the extraordinary service they provided.",
        "owner_response": null
      },
      {
        "author": "Elyssa Kuik",
        "rating": 5,
        "review": "We've had a great experience with Dwell! Kolton went above and beyond to have everything ready for our move-in on short notice, and responds quickly and kindly to any questions we have.",
        "owner_response": {
          "text": "Thank you Elyssa. We've made it a priority to provide quick response times and believe communication is a key factor to our business. We appreciate the kind review and are thankful for the opportunity to serve you."
        }
      },
      {
        "author": "Andrew Ziegenfus",
        "rating": 5,
        "review": "Dwell is a fantastic management company. As a vendor, they treat us with respect and are very reasonable. We look forward to continuing to work together.",
        "owner_response": null
      },
      {
        "author": "Ty Rawls",
        "rating": 5,
        "review": "My wife and I have had awesome experience doing business with them. The Dwell team are super friendly and helpful and care for their clients! Would highly recommend! Thank you for everything you guys do.",
        "owner_response": {
          "text": "Thank you for the kind words Ty, we have really enjoyed getting to serve you and your wife!!"
        }
      },
      {
        "author": "Karly Gilgen",
        "rating": 5,
        "review": "I absolutely love this company! SUCH AN EASY PROCESS! Moving has literally never been so easy.\n100000000% recommend them if you need to rent a place to live or if you need to rent out your own place.",
        "owner_response": null
      },
      {
        "author": "Carson N",
        "rating": 1,
        "review": "This company has been extremely hard to work with. I do not recommend attempting to rent through them.",
        "owner_response": null
      },
      {
        "author": "Jesse Gilbert",
        "rating": 5,
        "review": "Definitely the best property manager I have used in Bellingham. They have been approachable and easy to work with! Highly recommend.",
        "owner_response": null
      },
      {
        "author": "davis kenny",
        "rating": 1,
        "review": "Just another greedy property management in Bellingham. They raise went for no reason. Maintenance is horrible. Rich elite own Everything in Bellingham and dwell is just another greedy company",
        "owner_response": null
      },
      {
        "author": "David Tucker",
        "rating": 5,
        "review": "Great apartment and very well managed by Dwell, very responsive and always pick up the phone when I had a concern or question.",
        "owner_response": null
      },
      {
        "author": "Karen L",
        "rating": 5,
        "review": "Responsive, friendly and great to rent from. Been tenant with them since 2022, Kolton is awesome.",
        "owner_response": {
          "text": "Thanks Karen, weve really enjoyed serving you!"
        }
      },
      {
        "author": "Kelly Carroll",
        "rating": 5,
        "review": "Easton does an excellent job with maintenance management! Thanks Easton!",
        "owner_response": null
      },
      {
        "author": "Erik Carlson",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Sean O'Connor",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 22,
  "adjusted_average_rating": 4.09,
  "distribution": {
    "1": 6,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 18
  },
  "summary": {
    "created_timestamp": 1739095029,
    "text": "<section id=\"good\"><h2>Good</h2><p>Dwell Real Estate Asset Management has garnered numerous positive reviews from tenants who appreciate the responsiveness and professionalism of the management team. Many users have highlighted Kolton as an exemplary property manager who is not only knowledgeable but also friendly and available to assist whenever needed. For instance, multiple tenants mentioned that their experiences were smooth, with timely communication and support throughout the rental process, making moving in an enjoyable affair.</p><pIn addition to the exceptional customer service, tenants also commend Dwell for maintaining properties well and addressing minor maintenance issues promptly. Reviews reflect that the company is proactive in ensuring residents have a comfortable living experience, which is particularly beneficial for those renting new constructions or townhomes. Overall, the sentiment indicates that Dwell is committed to providing a high level of service that can greatly enhance the rental experience.</p></section><section id=\"great\"><h2>Great</h2><pWhile most reviews are overwhelmingly positive, some tenants have expressed appreciation for Dwell’s effort to resolve issues quickly and efficiently. For instance, certain renters have noted quick responses to minor problems they encountered shortly after moving in, contributing to an overall satisfactory living experience. These instances of good problem-solving reflect a strong dedication to tenant satisfaction that is crucial in property management.</p><pThe communication style of the management is frequently praised, with many past tenants highlighting that they felt well-informed about their applications and housing situations. The ability of Dwell to create a seamless leasing process is apparent, as several user reviews expressed gratitude for the scholarship of knowledge exhibited by the team. This accessibility and responsiveness are evident, further reaffirming Dwell's reputation as a reputable company in the property management sector.</p></section><section id=\"bad\"><h2>Bad</h2><pOn the other side of the spectrum, Dwell has faced criticism regarding its application process and communication with potential tenants. A number of reviews pointed out frustrations with the property management's strict credit requirements, particularly for certain demographics like college students. These reviews indicate that the company has a rigid stance on co-signer agreements, which can alienate many prospective renters seeking housing opportunities.</p><pAdditionally, some users have reported discontent with the level of communication during the application process. One tenant shared their frustration after experiencing a lack of updates on their application status, leading to a challenging and anxiety-inducing situation. This inconsistency in communication can contribute to potential renters feeling neglected and may tarnish the overall impression of Dwell’s operational efficacy.</p></section><section id=\"ugly\"><h2>Ugly</h2><pSeveral reviews have been strongly negative, emphasizing issues of perceived unprofessionalism in the application and renting stages. One user recounted their discouraging experience, noting that an initially available property was in poor condition upon viewing, with inadequate cleaning and maintenance prior to their scheduled move-in date. The dissatisfaction was exacerbated when this potential tenant was informed of restrictive rent-to-income ratios shortly before their move-in date, further indicating poor internal coordination and communication.</p><pMoreover, reviews that express sentiments about the overall management style describe Dwell as a company focused on profit rather than tenant satisfaction. Some past tenants have called Dwell a \"greedy\" property management firm, revealing a perception that the company prioritizes financial gain over providing quality housing solutions or maintaining good tenant relationships. Such reviews paint a troubling picture that could deter potential renters from considering Dwell for their leasing needs.</p></section>"
  }
}