{
  "name": "Echo Flats West",
  "slug": "echo-flats-west",
  "company_type": "Property",
  "address": "4071 Home Rd, Bellingham, WA 98226",
  "review_count": 12,
  "average_rating": 3.67,
  "reviews": {
    "google_reviews": [
      {
        "author": "Spewnami",
        "rating": 5,
        "review": "I lived here for 2.5 years. It was actually nice and felt warmer and quiet as the time went by. At first it felt small, but it was affordable and private. The place felt much bigger once I settled in and utilized the loft. The AC and heating unit worked wonders without raising my power bill that much. The long-term neighbors were all welcoming. I never participated, but it felt good seeing them barbeque together during the summer. Started to get to know people on a first name basis. Parking never maxed out beyond 75% of the lot. If you're a student, single/small couple, or looking for somewhere to afford Bellingham, this place works. Not perfect, but certainly not bad. Management was always very personal and understanding. Only downside was one bad neighbor blasting music late at night and then into the early early mornings, but that didn't last long. Small-time landlord, nothing like PTLA/Windermere/or others like Lark that are owned out of state. Fred Meyers, Starbucks, and Taco Time (best in town) are just 5 minute walk away (except for Starbucks, 2 minute walk).",
        "owner_response": null
      },
      {
        "author": "Nate Tatem",
        "rating": 1,
        "review": "I stayed here for a year in 2023, and honestly, the rent at $800 a month felt steep for what was basically a tiny box with a small window and no kitchen. The overall vibe from neighbors and the maintenance staff wasnt great, which made me feel unsafe and hesitant to leave my window or blinds open. This added to the already enclosed space.\n\nDealing with cigarette smoke from neighboring apartments was a constant issue. It was seeping directly into my unit. Despite repeatedly voicing my concerns and the impact on my health, the landlord was slow to take action. Eventually, they allowed me to switch units, but it took a lot of back-and-forth.\n\nWhen moving out, I was frustrated to find a big part of my security deposit withheld for Basic Cleaning. Requests for detailed receipts or proof were met with vague responses. The landlord produced a questionable receipt from a supposedly hired cleaning service, which I couldnt find any information on. Attempts to verify this directly with the cleaning company were blocked by the landlord, who then stopped responding to my follow-up questions.\n\nI never met the landlord in person, which probably explains the distant management style. For those looking for a new place, you might want to consider paying a bit more for somewhere that truly feels like home and where the management is more upfront and responsive.",
        "owner_response": null
      },
      {
        "author": "Khaenin Rutherford",
        "rating": 1,
        "review": "A huge portion of my deposit was taken for hauling heavy appliances when all appliances were fully functional at the time I moved out. The only possible damages involved paint touch-ups or removing a small ink stain from the floor. There was no justifiable reason to deduct $500. While living here, management took over a month to remove birds from my apartment. The birds managed to get into the duct over my kitchen area and woke me up nearly every morning between 4-6 am. I would only recommend living here if its absolutely your only option and youre willing to wait weeks for maintenance issues. Dont expect your deposit back even if you take great care of the space.",
        "owner_response": null
      },
      {
        "author": "Margi Hay",
        "rating": 5,
        "review": "I lived here for a little over two years and really appreciated the new management that started one month later. Within two or three months of Michele becoming manager we had new dumpsters and recycle bins, twice per week removal service, cleaner parking area, beautiful lawn care and we began getting great neighbors. If you are looking for a reasonably priced studio apartment, be sure to look at these units. For two years I had no electric bills, no water/sewer/garbage bills, and air conditioning!",
        "owner_response": null
      },
      {
        "author": "Dominick Pace",
        "rating": 5,
        "review": "This is no longer the \"hotel\" it once was!  It's under new ownership and they've spent a lot of time and money renovating it and getting rid of all the riff raff!  I've lived here almost 3 years, first couple downstairs in a studio and now upstairs in a loft and have never had any issues with bed bugs.  Maybe if former tenants kept their place clean they wouldn't have any problems!  This is a great place to live with friendly tenants and thanks to the new owners I feel safe and comfortable living here!  Great, inexpensive and unique apartments!",
        "owner_response": null
      },
      {
        "author": "Ben H",
        "rating": 1,
        "review": "I sadly have to report how aweful my year experience living here was. When I moved in I wasnt told that the place that once was a hotel was flooded with bedbugs. Noise was loud as construction is always going on next door. Even though the apartments are more updated and nice you dont get an oven or any major appliances that are necessary. After a year of dealing with bedbugs and a few thousand dollars of furniture I had to throw out I left early left my deposit and all because I couldnt handle it. Previous owner upon finding out multiple people had bedbugs and were threatening action because it wasnt getting fixed sold the place under the table on August 1st and no emails were sent out till the 6th. The place will soon be torn down probably for parking for the new shopping center going up next door. New pending residents should be warned not to move here because of new ownership, BEDBUGS, and possibility of it being shut down.",
        "owner_response": null
      },
      {
        "author": "Tyson Stap",
        "rating": 4,
        "review": "I lived here for what i consider a lengthy term of time by bellingham standards and enjoyed my tenancy. New management gave the property major renovations inside and out, successfully improving the property for tenants! As a smaller complex they provide great security when it comes to unit access. In unit amenities aside you just cant beat a 5 minute walk to the grocery store. Affordable and well located are a hard find here in bellingham and this property has both!",
        "owner_response": null
      },
      {
        "author": "Dominick Pace",
        "rating": 5,
        "review": "Great place under new ownership!  100% different from when it was the old Orca Inn (extended stay hotel).  Its been renovated and has cool studios, loft units and 2 bedroom lofts!  Cool and quiet!  If you're looking for a friendly, safe place check them out!  If a unit is available it'll go quick!",
        "owner_response": null
      },
      {
        "author": "J. Dub",
        "rating": 5,
        "review": "Small studio but really homey. Management is great. They have studios 1 and 2 bedrooms at a very affordable price  which is nice given the current housing market. Bots on a dead end road so very little traffic. Close to everything- fred myers next door, bus station and the mall within half a mile, freeway us just down the street, strip mall next door as well, fast food, hotels etc.",
        "owner_response": null
      },
      {
        "author": "Matthew Fleet",
        "rating": 2,
        "review": "Buyer beware, if you happen to get a unit that overlooks Bakerview Rd, the road-noise is atrocious.\n\nIf you are working around the \"house\" it fades into the background most of the time, but god help you if you want to sleep in past 6 A.M.\n\nI use industrial ear-plugs and had to buy blackout-curtains, because the ones which came with the unit are worthless for blocking out light.",
        "owner_response": null
      },
      {
        "author": "Mikki Hageman",
        "rating": 5,
        "review": "Management responds quickly and effectively to all inquiries and have the tenants best interest in mind. I have watched the place grow and mature to a wonderful complex over the past years. They are wonderful to work with!",
        "owner_response": null
      },
      {
        "author": "Amanda Claybo",
        "rating": 5,
        "review": "Michele is an amazing landlord and the apt is absolutely perfect. Loved living here.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 12,
  "adjusted_average_rating": 3.67,
  "distribution": {
    "1": 3,
    "2": 1,
    "3": 0,
    "4": 1,
    "5": 7
  },
  "summary": {
    "created_timestamp": 1739205436,
    "text": "<section id=\"good\"><h2>Good</h2><p>User reviews indicate that Echo Flats West offers a good blend of location and affordability for prospective tenants. Tenants have highlighted the property's proximity to essential services, with grocery stores, bus stations, and shopping malls nearby, offering convenience to residents. Reviewers have also praised the availability of parking, which seldom fills beyond 75%, easing residents' concerns in Bellingham's bustling environment.</p><p>Another positive aspect reported by tenants is the complex's structure and facilities. The availability of air conditioning and effective heating has been a welcome feature for many, as it doesn't significantly increase utility bills. Furthermore, many residents have noted that the loft spaces, once properly utilized, provide a comfortable living environment that feels larger than one might initially expect.</p></section><section id=\"great\"><h2>Great</h2><p>Echo Flats West stands out for its welcoming community and active neighborhood atmosphere. Tenants particularly appreciate the efforts made by new management in fostering a friendly environment. The updated property managers have worked hard to enhance the quality of life by investing in renovations and facilitating a sociable neighborhood, aiding new tenants in feeling at home.</p><p>The management team itself receives glowing reviews for its responsiveness and care toward tenants. Several reviewers have noted how quickly management addresses inquiries and their emphasis on maintaining tenant satisfaction. Many long-term residents have observed significant improvements under the new management, complimenting the cleaner facilities and rejuvenated communal spaces, echoing the sense of community experienced throughout the property.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positive attributes, Echo Flats West is not without its shortcomings. Several user reviews point to dissatisfaction with the unit conditions and neighborhood atmosphere. Noise pollution, especially from the bustling Bakerview Road, is a common grievance. Tenants facing this side of the building report disturbances that make restful sleep a challenge, despite attempts to mitigate it with personal solutions like earplugs and blackout curtains.</p><p>Furthermore, communication issues with management have been a source of frustration for some tenants. Slow responses to maintenance requests, particularly concerning health-related issues, such as pervasive cigarette smoke infiltration and bird infestations, have been highlighted in reviews. These delays led to dissatisfaction and discomfort, painting a picture of inconsistent service quality in certain instances.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Some residents have had severely unpleasant experiences at Echo Flats West, most notably involving financial aspects and bedbug infestations. Multiple reviews recount issues with excessive deductions from security deposits for questionable cleaning charges, with details inadequately provided by management, leading to heightened tenant anxiety and distrust.</p><p>Additionally, previous management allegedly sold the property amid unresolved bedbug infestations, with tenants claiming negligence and a lack of transparency regarding pest control issues. Such unresolved challenges severely affected tenants' livelihoods, leading some to prematurely terminate their leases at great personal expense, reinforcing a sense of being undervalued and overlooked by the property's management.</p></section>"
  }
}