{
  "name": "Ed Finlan Group",
  "slug": "ed-finlan-group",
  "company_type": "company",
  "address": "425 Commercial St Ste 200 Mount Vernon, WA 98273",
  "review_count": 5,
  "average_rating": 4.2,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Samantha M.",
        "rating": 1,
        "review": "Buyers & Sellers Beware!! \nThis was the worse and most stressful experience ever with a real estate company. I'm completely mortified about the way we were treated, and manipulated. We felt extremely mislead, bullied, were given legal advice on multiple accounts and other extremely unethical practices. They pretend to care, but really don't. Very two-faced. The \"supervisors\" are not any better, they are a joke and don't follow through with a single commitment they make. An alarming fact, the supervisor told me that they deal daily with unhappy clients with their agents!!!! Seriously, daily???? That's a major red flag. Go to John L Scott or Remax, but don't use these guys. \nI wouldn't even give them a single star,  more like 5 thumbs down",
        "ownerResponse": null
      },
      {
        "author": "Charles H.",
        "rating": 5,
        "review": "Ed Finlan is the definition of a strong Realtor.  He knows the business, the market and possesses huge people skills.  Common sense and integrity combined with an incredible work ethic, sets him apart from the average Realtor.  One other thing, he produces.  \n\nCharles Kent Holyoke",
        "ownerResponse": null
      },
      {
        "author": "Catherine W.",
        "rating": 5,
        "review": "Ed Finlan was a great realtor for my mom when she decided to sell her house.  Ed advised her and assisted in every step of the process, reassuring her when needed.  If you are wanting to buy or sell a home in Mount Vernon, WA, Ed Finlan should be your first call.  He is an absolute necessity!",
        "ownerResponse": null
      },
      {
        "author": "Andrea P.",
        "rating": 5,
        "review": "Ed and company are fantastic. Good communicators, qualified to handle any transaction. Have done at least 10 deals with them.",
        "ownerResponse": null
      },
      {
        "author": "Reina G.",
        "rating": 5,
        "review": "As first-time home buyers, my husband and I couldn't have asked for anyone better than William (Bill) Hornbrook as our agent. He exceeded our expectations. We appreciated his responsiveness and knowledge/insights. As high-strung and stressed as I could be, I appreciated that he was never pushy but always patient even when we saw house after house or got discouraged. We had a deadline a few months away and in a demanding market, he directed us to houses within our criteria and though we had a couple of failed offers, he kept an eye on the house we really wanted so when it came to market he immediately let us know. And we got it! Bill immediately sent all paperwork via secure email for convenient electronic signing and easy download. The search was the most stressful part but once we were in escrow with Guild Mortgage (his recommendation!), it was a breeze. We couldn't be happier with the whole process and our lovely new dream home.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 4.2,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the realm of positive experiences, individuals have spotlighted the Ed Finlan Group for its strong understanding of the real estate market and large reservoir of people skills. Clients praise the company for exhibiting an impressive work ethic and note that the integrity of the agents, especially Ed Finlan himself, enhances the overall customer experience. Additionally, the group has been acknowledged for its ability to navigate various transactions successfully, which is a testament to their professional competence.</p><p>User reviews often highlight the responsive nature and substantial knowledge of the agents at Ed Finlan Group. For those entering the market for the first time, such as first-time home buyers, the patience and diligence of agents like William Hornbrook have made significant positive impressions. The dedication to guide clients through the purchasing process, coupled with the straight-forward communication and efficient handling of paperwork, instills a sense of trust and satisfaction among clients.</p></section><section><h2>Great</h2><p>The Ed Finlan Group has been acclaimed for exceptional customer service, particularly when dealing with complex or multiple deals. User reviews mention completing at least ten transactions with the team, alluding to a strong recurring trust and continuity in professional relationships. Satisfied clients celebrate the attention to detail provided by the agents and their unwavering support throughout the entire process of buying or selling a property.</p><p>Moreover, some clients have portrayed the company as an essential partner in the real estate process, offering reassurance and advice that proved invaluable. The high degree of personalized care and involvement has helped clients sell homes successfully and has fostered a comforting and reliable environment for those unfamiliar with the market dynamics.</p></section><section><h2>Bad</h2><p>Despite many positive endorsements, the Ed Finlan Group does not escape criticism. Some user reviews remark on instances of feeling misled and bullied, pointing to a level of dissatisfaction with the treatment they received. Such experiences highlight a potential inconsistency in the company's service quality, where expectations were not met, and clients felt that they were given subpar legal advice. Furthermore, several clients found the follow-through on commitments to be lacking, diminishing their trust in the agency.</p></section><section><h2>Ugly</h2><p>The more distressing allegations against the Ed Finlan Group include accusations of unethical practices. According to a particular user review, the company's supervisors were described as ineffective and even joked about the frequent dissatisfaction among clients. This paints a concerning picture of the company culture and hints at a systemic issue with client relations that may require urgent attention and remedy.</p></section>"
  }
}