{
  "name": "Edgemont Apartments",
  "slug": "edgemont-apartments",
  "company_type": "property",
  "address": "3420 W McLeod Rd, Bellingham, WA 98225",
  "review_count": 21,
  "average_rating": 3.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Heather",
        "rating": 1.0,
        "review": "Apex is now PTLA and ever since they bought this property it has been grossly mismanaged. The beautiful trees that made living here bareable were butchered last year or cut down altogether. There is constantly barking dogs despite complaints and trash everywhere. This used to be a well maintained property with an on site manager, but now I'm lucky if I get a response through email or maintenance tickets. I never wanted to live where Apex owned, now my family has to move again. There is so much more to write....",
        "ownerResponse": {
          "text": "As of last week, the property is now managed by Gather Property Management, and we are really looking forward to addressing the things you mentioned, so that Edgemont is a place you are happy to call home. We have opened the on-site leasing office, so we will be regularly available to you. The property has such a lovely setting, and the floor plans of the apartments are so spacious. We are immediately focusing on things like keeping up the garbage areas daily, tending to the pet waste stations, and making sure that your maintenance requests are handled timely. The new fitness center will be opening soon, and there will be more amenities to come for our residents at no additional cost. If you have any other suggestions or concerns, please bring them to us in the office. We look forward to getting to know you!"
        }
      },
      {
        "author": "Teasa B",
        "rating": 3.0,
        "review": "There's a lot of upgrading happening here at the moment. Sometimes it's noisy. The \"Club House\" has been unusable for about a year. They're working on it but no ETA. Pet friendly apartment. You will hear dogs! (I don't mind but someone might.)\n\nI've noticed the people tend to stay to themselves, but will usually throw out some small talk. There are a considerable amount of kids and new families. Mostly it's a quiet and peaceful place surrounded by trees. I hear birds outside my door everyday. We can sometimes hear the planes go by overhead since we are close to the airport. If you're in the back theres a... factory (?) that makes noise, I don't really notice but my husband has made comments about it. I like how close we are to the freeway and stores while also still feeling out of the way. Parking is crazy compact, it's also all assigned and guests are supposed to park on the street, but usually don't.",
        "ownerResponse": null
      },
      {
        "author": "Z K C",
        "rating": 1.0,
        "review": "Dogs Barking at Night has gotten better. Trash is Everywhere. If you smoke here please try to pick up ur cigarette filters and garbage plz. Dogs do bark constantly during the day. If you have a dog please find a way to keep them entertained especially for puppies. Parking space is tight sometimes vehicles get bumped.",
        "ownerResponse": null
      },
      {
        "author": "Rose Carmen",
        "rating": 1.0,
        "review": "Don't rent here unless you want to live in a place that goes neglected.  PTLA took over mgmt of this property in Feb and they are running the place down. It is the middle of June and they have not sent anyone out to maintain the lawn. The grass is taller than my dog and in some places it is taller than my son who is 5'10\".\n\nTrash is a problem here too. I have seen trash that has been laying around since November. PTLA is aware of the problem because myself and others call weekly but they refuse to do anything about it. We are also supposed to have an on-site property manager and yet we have not had one in 5 mos. The office should send someone once a week to deal with issues here. Lawn maintenance, trash pickup, and on-site manager are things that are supposed to be included in our rent. These things have been neglected and yet we are still paying the same amount of money.",
        "ownerResponse": null
      },
      {
        "author": "Erin Mccauley",
        "rating": 1.0,
        "review": "DO NOT RENT!!!!! First off, this company refuses to do any communication by email so they have no paper trail of any of their promises or issues. Red flag. Secondly, they will not tell you that half of the buildings back up to a large industrial site that starts it machinery at 6 am every day, even weekends. Lastly, when we tried to break our lease during the pandemic due to needing to financially help family, we spoke to Rea, the property manager (we emailed her first to get this in writing, but the only way she would actually talk to us was on the phone) and she told us we would need to forfeit our deposit, which we expected and were ok with, but also pay a $375 cleaning fee, which we decided was ok as well.   A few days later, the new maintenance man cornered me alone in the mail room (I am a 24 year old woman) and told me he knew what apartment I was in and interrogated me about the state of the carpets as he would be moving into that unit when we vacated. This was a scary and unsettling experience.\nOnce we finally moved out, we got a call stating that we needed to pay the next month's rent as they could not get the carpets cleaned in time to rent it. We had given ample notice and agreed to the initial fees.\nThese were not new carpets and it was their employee moving into this unit, not a tenant. They knew we would not be able to take them to court or fight this so we did just have to eat the charge as they were threatening us with collections. They took advantage of a young couple during a global pandemic and grossly extorted us for money they had verbally promised us was not expected. Not worth the hassle for overpriced, shoddily built apartments.",
        "ownerResponse": null
      },
      {
        "author": "Jessica",
        "rating": 5.0,
        "review": "Ive really enjoyed living here so far. This is the best apartment complex Ive ever lived in. The property is well maintained. Ra (the property manager) and Jordan (in charge of maintenance) are always very communicative and helpful. If I ever have an issue with something they are very responsive and attentive. I feel cared for and taken care of!",
        "ownerResponse": null
      },
      {
        "author": "Carter Fuehr-Bush",
        "rating": 5.0,
        "review": "The place changed ownership just before we signed our lease in September, and there haven't been any issues so far. Our unit was in great condition, the place is clean, laundry machines work, great location, friendly manager, etc.",
        "ownerResponse": null
      },
      {
        "author": "Jake Widener",
        "rating": 4.0,
        "review": "Some friends just moved here from Utah the place looks really nice but no guest parking and there is always someone else in his reserved parking space",
        "ownerResponse": null
      },
      {
        "author": "ed rod",
        "rating": 5.0,
        "review": "Little hidden community with great neighbors. Management really trying to improve things up.",
        "ownerResponse": null
      },
      {
        "author": "Alfred Fleming",
        "rating": 3.0,
        "review": "Older, quiet apartments.",
        "ownerResponse": null
      },
      {
        "author": "Joe Busch",
        "rating": 1.0,
        "review": "Edgy complex",
        "ownerResponse": null
      },
      {
        "author": "B. Nichole",
        "rating": 1.0,
        "review": "Hattee Hatie Hate ",
        "ownerResponse": null
      },
      {
        "author": "Stefan Carlsen",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "cassie w",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Melinda",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Rozi Sandhu",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kev",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tabitha Collmann",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joy Richmond",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Blanca Ortega",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "johnny gaona",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 12,
  "adjusted_average_rating": 2.58,
  "summary": "<article class='review-summary'>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>This article is generated by ChatGPT and is intended to be a tool to help individuals find a property management company or rental property. The article summarizes user reviews and provides a synthesized overview without disclosing any identifiable information about the reviewers. The sentiments and experiences expressed in this article are derived from user reviews and do not necessarily reflect the views of the assistant providing the summary.</p>  </section>  <section>    <heading>      <h2>Good</h2>    </heading>    <p>In terms of the positives, some user reviews have highlighted the responsiveness and attentiveness of the Edgemont Apartments’ management and maintenance staff. One resident expressed satisfaction, mentioning that the property is well maintained and that they feel taken care of by the management. This sentiment seems to be echoed by another user who cited a clean environment, efficient laundry machines, and friendly manager as strong points of the complex.</p>    <p>The property's location and the sense of community were also appreciated by residents. The presence of trees and the sound of birds were noted as charming attributes that contributed to the peaceful environment. Residents also mentioned that the property is undergoing upgrades, hinting at an initiative by management to improve the living experience. This indicates a propensity by the property management to invest in their facilities, potentially leading to better living conditions for residents.</p>  </section>  <section>    <heading>      <h2>Great</h2>    </heading>    <p>Certain reviews point out that major improvements are underway, which could be indicative of a turning point for the property. The management company responsible for Edgemont Apartments appears to have changed hands, with the new management team expressing a commitment to address past concerns and enhance the quality of life for residents. This is evident in the management's response to a review, detailing efforts to attend to maintenance requests promptly, manage garbage areas more efficiently, and opening an on-site leasing office for better accessibility.</p>    <p>In addition to operational improvements, the management has plans to introduce additional amenities, such as a new fitness center, at no extra cost. Such initiatives are typically indicators of a forward-looking management approach aimed at providing value to residents. A few residents appreciate this progressive stance, sharing praise for the ongoing development efforts and the neighborly vibe within the community.</p>  </section>  <section>    <heading>      <h2>Bad</h2>    </heading>    <p>However, the reviews also reveal a number of persistent challenges faced by residents. Complaints about noise from surrounding areas, including a nearby airport and possibly a factory, have troubled some tenants, with one mentioning that their spouse was particularly affected. Furthermore, dissatisfaction with parking arrangements was evident, including incidences of guests parking on the street despite rules to the contrary and residents finding their assigned parking spaces occupied.</p>    <p>Communication with property management has been a recurring issue amongst user reviews. One review explicitly called out the lack of correspondence through email, which can create a void of written records of communication – a practice that may lead to misunderstandings and complicate dispute resolution. Additionally, a review described a distressing interaction with a maintenance employee, which contributed to an impression of an unprofessional management atmosphere.</p>  </section>  <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>The more concerning issues are highlighted by reports of neglect and mismanagement, particularly under previous ownership. Multiple reviews cited a failure to address landscaping, resulting in overgrown grass and uncollected trash, which seems to suggest a lack of regular maintenance. A lack of an on-site manager was also mentioned, signaling a potential gap in direct oversight and accountability for addressing resident concerns promptly.</p>    <p>One of the most severe critiques involves allegations of mismanagement of lease termination procedures and financial disputes. A review detailed a situation involving the alleged mishandling of lease break fees, cleaning costs, and an extension of rent demands. If accurate, this scenario illustrates a severe lack of transparency and fairness in the property management's dealings, causing distress and inconvenience to the affected residents during an already challenging time.</p>  </section></article>"
}