{
  "name": "Elevate Bellingham",
  "slug": "elevate-bellingham",
  "company_type": null,
  "address": "900 N Forest St, Bellingham, WA 98225",
  "review_count": 172,
  "average_rating": 3.69,
  "reviews": {
    "google_reviews": [
      {
        "author": "Trey",
        "rating": 2.0,
        "review": "I unfortunately lived here for 1 whole school year, and boy did I encounter a ton of interesting things.\n\nPros: Maintenance crew. These guys are the only thing keeping this place afloat, and they dont even have that large of a team, quick responses to tickets for apartment issues when I sent items in (bulbs out or closet off the tracks).\n\nCons: Lack of security, Managers, front hosts, price\n\nSecurity: Not only did I encounter a homeless man passed out in the stairwell when going in for a morning final, I had my car vandalized within the garage of this complex, as well as encountered a trespasser at 4am lurking around my floor looking for unlocked rooms. I too came across someones back car window smashed out and items stolen within (premium parking spot, 2nd floor garage).\n\nThe garage is a hotspot for sketchy things to happen, and this all stems from the company being too cheap to install a gate, the maintenance team recommended this a while back, but the company refused it due to the cost.\n\nManagers: I dont understand how these people still have jobs, they sit at their desk for 8 hours managing the front hosts, and dont do anything useful, theyre not lenient in re-scheduling room checks for people out of town for holidays, theyre not useful in managing noise complaints against other rooms, and from previous posts it also seems as if they cant even get security deposits back to people within a timely manner.\n\nFront hosts - I understand they are college students, so theres only so much they can do with their useless managers, so again not much complaints for them, rather how they are managed. They respond quick to noise complaint responses via text within working hours, but those complaints werent of any help as the I continued to send complaints over (manager not taking action). But apart from that, they are helpful over the phone with questions and helpful when filling out paperwork.\n\nPrice: The apartment price doesnt come with the cost of the monthly garage price; and for the cost of this place, it wasnt worth it. The room itself you pay for an internet router that is on the ceiling, a lack luster living room that is furnished, skimpy drawers for your room and a rock solid prison bed. Not to mention the jail like courtyard that no one ever used.\n\nAll in all, this place is at best a 2/5, for location to campus and the maintenance staff. I would stay away if you can, there are plenty of other better spots around (New England apartments for example). This company will soon go under, it seems like their owner is also running his other locations as poorly as this one in other states, which makes sense as to why the onsite managers are as useless as they are. Unfortunately the maintenance team isnt getting the resources they need in order to keep this place afloat. As for what we are paying, they should have plenty of funds to manage their costs and upkeep, but the owner is losing money, so hes cutting his spending unfortunately. Spend your money on a house or other well managed properties if you can, if this happens to be your last resort, just expect to encounter what Ive written out.",
        "ownerResponse": {
          "text": "Hello Trey!\n\nThank you for sharing your honest feedback with us! We apologize for the inconvenience you have experienced. We would love to hear more from you, regarding your experience here. Please give us a call during office hours and speak to one of our managers. Elevate Bellingham."
        }
      },
      {
        "author": "Scott Langston",
        "rating": 1.0,
        "review": "The things that the management do and don't do here is audacious.\nThings that they do: ask for rent early, walk into your apartment without notice while your girlfriend is changing, randomly shutoff the water, violate the lease agreement terms multiple times. Things that they don't do: fix the security cameras, fix broken locks, have functioning handicap accessibility buttons, clean up the broken glass from the several cars that have been broken into, clean up the puke that has been in the parking garage for over a month now, respect their tenants. Do not live here unless it is a LAST RESORT",
        "ownerResponse": {
          "text": "Hello Scott,\n\nWe're sorry to hear about your experience with Elevate Bellingham. We urge you to adress your concerns as a resident to our property manager. There may have been some miscommunications and oversight regarding notices for the following events listed. Please know that Elevate follows WA state RCW's when it comes to notice of entries, and providing notice when drastic measures occur.\n\nMany of your concerns regarding property related items, are in the hands of our corporate office, which we sympathize with the residents frustration. If you would like to address your concerns further please stop by the leasing office Monday -Friday between 10 am & 6pm, and speak to our property manager who is always willing to adress concerns. \n\nThank you!"
        }
      },
      {
        "author": "Josh Houlding",
        "rating": 4.0,
        "review": "Pros:\nPretty solid apartments. Pricey, but all the appliances are good quality and function well. Nice amenities, including an awesome top-floor deck overlooking downtown, full gym, and study lounge. Close proximity to both campus and downtown is a huge plus. Maintenance staff are fantastic and fixed every issue my roommates and I had within a few hours usually.\n\nCons:\nIn the 3 years I lived here, though, I found there to be an overabundance of irritating, immature people living here. If you live here, be prepared for a fair amount of noise and to be surrounded with people who don't care about others and vandalize exit signs, handrails, floor signs, and all manner of other things. This isn't necessarily the fault of the complex, but it's something to know if you decide to live here. They don't empty the trash room on the 3rd floor enough either, so it was disgusting and overflowing much of the time. Also, because it's on a major road to downtown in a college town, be prepared to hear a lot of loud cars, trucks and motorbikes with modified exhausts. Internet speeds are decent (25mbps down and up), but stability is questionable.\n\nOverall, I don't regret living here, and while I can't say how it compares to other apartments in Bellingham (I only lived in the dorms my first year and here my other 3), it's solid if you're willing to spend a lot. It seems like Elevate gets a lot of hate, and I don't think most of it is justified.",
        "ownerResponse": null
      },
      {
        "author": "Nick Houlding",
        "rating": 5.0,
        "review": "Maintenance service quickly restored power to dishwasher. Submitted request and had our dishwasher repaired the next day.",
        "ownerResponse": {
          "text": "Thank you, Nick, for your wonderful 5-Star review regarding our maintenance service. We are pleased to hear that your work order was addressed in a timely manner. Please continue to reach out to us, on how we can better serve our residents. Or any feedback you have regarding our maintenance. "
        }
      },
      {
        "author": "Colleen Mahan",
        "rating": 3.0,
        "review": "Loved the living experience. The room is great and I dont hear much from my fellow neighbors. My one critique is that they arent very clean regarding the fitness room and hallways. I wish they vacuumed and maintained the fitness equipment like their yoga balls, basic cleanliness, and replace broken equipment (like the punching bag). The staff is very friendly and have fun activities for their residents. Maintenance requests are dealt with in a timely manner. There are wifi/ internet problems here and there but overall not an issue day to day.",
        "ownerResponse": null
      },
      {
        "author": "Miranda",
        "rating": 1.0,
        "review": "would give 0 stars if I could moved out 3 years ago and still havent received deposit after legal action.. shady",
        "ownerResponse": {
          "text": "Hello Miranda! \n\n\nThank you for sharing your honest feedback with us! We apologize for the inconvenience you have experienced. We would love to hear more from you, regarding your experience here. Please give us a call during office hours and speak to one of our managers. Elevate Bellingham."
        }
      },
      {
        "author": "Ariana Gant",
        "rating": 5.0,
        "review": "This is my second year living at Elevate and I've renewed my lease for next year. I love living here! When I first visited, Corbin gave me a great tour and from there the application process was easy and the employees were very helpful and kind. I feel safe living here as there is a key fob system so the keys can't be copied and there are locks on nearly every door in the whole building. The facility is always clean and the staff members who fill maintenance requests are always very friendly and helpful. The apartments are spacious and the windows are nice and large. Elevate is pet friendly too, so having a cat has been very easy. Elevate also does a lot of awesome events and giveaways and they offer free printing (you just have to bring paper). The apartment is the perfect distance from the WWU campus- it usually takes me about 5-10 minutes to walk to campus. Overall I would highly recommend Elevate!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Smiles Cas",
        "rating": 4.0,
        "review": "When we moved in, our garage disposal wasnt working well (which seems like something they should have fixed during inspection) but a few days after I put in the maintenance request, it was fixed and sounding and working like it should.",
        "ownerResponse": {
          "text": "Greetings Smilescas,\n\nThank you for your wonderful and honest 4- star review. We appreciate and value the feedback that our residents have to offer. We are glad that our maintenance team was able to fix the issues you had experienced with your disposal. We do apologize for the inconvenience, when you moved in. While we do work to resolve all maintenance issues during our turn inspection process, we realize that some items may have been missed. We will continue to improve on this and ensure that maintenance items are thoroughly completed before our residents move-in. \n\nIf you have or would like to provide any additional feedback, please don't hesitate to let us know!\n\nThank you,\n\nElevate Bellingham"
        }
      },
      {
        "author": "Robert Perry",
        "rating": 5.0,
        "review": "The only thing that would have made it better is if there had been a studio apartment to view.",
        "ownerResponse": {
          "text": "Hi Robert! Thank you so much for sharing your honest feedback with us - we greatly appreciate your 5 star review! Best, Elevate Bellingham"
        }
      },
      {
        "author": "Ciera Abrams",
        "rating": 3.0,
        "review": "I moved out on August 31st of last year and did not receive my deposit back. There were promises being made that it would get back but no results. However, the Elevate Bellingham property management wasnt necessarily the bad guy in this case and were very communicative and were mostly just the middleman to get stuff done right.\nThe issue lies with the management company and their tardiness and lax behavior towards getting people the deposit they are owed. After a whole year of communication I can confirm that Veronica, the community manager, was nothing but kind and helpful and truly wanted to right the wrongs that management was doing. Im not saying what they did isnt bad, but from a property level Elevate did all they could to help.",
        "ownerResponse": null
      },
      {
        "author": "Shorb Family",
        "rating": 5.0,
        "review": "Flooding in bathroom.  Immediately responded to request and fixed within a few hours.  Respectful of our schedule/needs over their time.   Maintenance here is wonderful and responsive every time.  Small or big issues.",
        "ownerResponse": {
          "text": "Hello Rinda! :) Thank you so much for your 4-Star Review! We greatly value your feedback and are glad you have chosen Elevate as your home. Please let us know if there's anything else we can do to help make Elevate a great place for our residents. Thank you!"
        }
      },
      {
        "author": "Emma Wiechert",
        "rating": 5.0,
        "review": "Ive lived here for the past two years and its been great! Im only leaving because Im graduating. The gym and study room are huge bonuses and its great being in between campus and downtown. Any time we have a maintenance request its filled so quickly and done well and all of the staff are super nice (shoutout to Ariana especially!).\nThe furniture is also nice, especially for someone who doesnt live in the area.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Daniel",
        "rating": 5.0,
        "review": "Great place to live - the gym is great, but heavier weights would make it exceptional. The place is always kept very clean, all problems addressed immediately, things that do break are fixed within the same day.\n\nFree coffee available, very secure and safe building, parking is great with cameras all over the place and the overall cost is very reasonable for what you get. Not to mention the great huge, yet cozy, study room with Macs and desktops.\n\nThe only downside is the architecture is reminiscent of Soviet Era Brutalism - I think it's great but other people might find it dreary. Excellent place to live.",
        "ownerResponse": null
      },
      {
        "author": "Sabine Hunter",
        "rating": 5.0,
        "review": "I've lived here for almost two years and will be living here next year as well and honestly can't say enough about how great my experience has been. They've been through many staff and company changes, and their staff this year is incredible. They are always personally invested in sorting out any issues quickly and are always willing to go the extra mile. I'm always greeted by name and with a smile, and they absolutely love my dog which isn't always the case for apartments in the city. The apartments and amenities far surpass anything in the area. The security is great with outdoor cameras, well-lit areas throughout the building, parking garage, and areas outside as well as electronic key checks throughout the building. Pet friendly and welcoming.",
        "ownerResponse": {
          "text": "Sarah! Thank you so much for the honest positive review. There have been many changes in the past year but nothing short of amazing. Our staff thoroughly enjoys interactions with our residents on the daily. With fantastic residents like you it makes our job even more worthwhile! We are lucky to have both you and Atlas here with us. Thanks again Sarah! If you need anything you know where to find us! (360) 474-7845 gather@nelsonpartners.com"
        }
      },
      {
        "author": "Shannon Reel",
        "rating": 5.0,
        "review": "My daughter has really enjoyed living here and I love feeling like I'm in a fancy hotel with her when I visit! I wish I could have had places like this when I was her age. The on-site maintenance staff is always timely and trustworthy, and the office staff is always friendly when I call! Ariana recently helped us with a few questions we had. I also love that it is pet friendly for my grandpup!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Sruejun Chaudhary",
        "rating": 5.0,
        "review": "I live at Elevate Bellingham and it is by far the best place to live if youre attending western. The building is clean and modern, and the employees are so helpful. Griffin Garnett in particular has always been helpful, even in difficult situations. He is so nice to me and my parents when we have questions about our lease or anything. Awesome building would recommended.",
        "ownerResponse": null
      },
      {
        "author": "Dan Hill",
        "rating": 5.0,
        "review": "My daughter has been a resident for a few years while in college, having a building that feels safe and secure for her is everything we care about. The building and garage are very well lit and the electronic locks are something that stood out from our other options. Anytime we have called Sarah and Laura have been great help in walking us through our questions and setting up online payments. Quite pleased with our experience here",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Michael Baldwin",
        "rating": 5.0,
        "review": "I have had only great experiences working with the team. One member in particular that goes out of his way to make sure I get what I need is named Griffin. He is always so helpful whether it is on the phone, dealing with rent, or mail, or anything. He always has a smile that can even be recognized through a mask. He makes you guys look good! Thank you for making my living experience here great, guys.",
        "ownerResponse": null
      },
      {
        "author": "Stacey Thorkildsen",
        "rating": 5.0,
        "review": "My daughter attends WWU and lives at Elevate. It has been such a great experience, especially with my daughter being so far away. I can be a bit of a worrier and one of the team members, Corbin, has been so wonderful with all my questions and concerns. He was so caring and patient with me. My daughter loves it there and tends to seek him out when she needs anything. It is clean, safe and overall a great experience.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Madeline Holden",
        "rating": 1.0,
        "review": "Apartment itself looks nice, but appliances and furniture are generally pretty cheap. My friends referred to my couch as the \"hospital couch\" because it is so stiff and plastic like, and our refrigerator when we moved in had dents all over it from previous tenants that Elevate chose to leave as-is. Walls are covered in the thinest layer of paint ever, meaning if you so much as bump into a wall it leaves giant black marks, and the walls themselves are so thin you can hear basically all noise including your neighboring units through them.\n\nMy biggest problem with this company is the fact that they have not returned my security deposit to me after countless phone calls and over 3 months since moving out. When I told them that they had broken their contract by not returning this to me within 30 days they said there was nothing they could do about it and that they were understaffed, which is absolutely not an excuse to break their end of a contract that THEY created! Elevate also forced one of my roommates to move all of her things and switch rooms because of an error they had made in filling paperwork on which room she was living in. Instead of allowing her to keep her room because of their mistake, they comped her rent by $5 a month and said, \"consider this a free coffee on us every month!\" All of this is insanely unprofessional and unethical behavior on the part of Nelson Partners.\n\nUpdate: 9 months now and have still not received my deposit. If you currently live there- be warned you will probably never get your deposit back!",
        "ownerResponse": {
          "text": "Hi Madeline, thanks for your review. We apologize for the delay in your security deposit. We hope to send those soon! And you are welcome to contact us anytime for more assistance at the front office. We sincerely appreciate your patience!"
        }
      },
      {
        "author": "Ethan Nishi",
        "rating": 2.0,
        "review": "I have no recollection of leaving a 5 star review. this place is not that nice and while i lived there i was paying full price while all of the amenities that they advertised were closed. Also, when you sign a lease you dont get assigned a room until AFTERWARDS. it seems like almost 1/3 of the rooms are looking inwards into the depression courtyard. They also havent given us our security deposits back after more than 6 months and now their phones have been down for a month and half?? seems kinda urgent dont ya think!? location is kinda nice and thats about it unless you wanna have daddy or mommy pay for the nice views on the 6th floor.",
        "ownerResponse": {
          "text": "Hey Ethan!!\n\nThank you taking the time to leave us a 5 star review! We are glad you have had a great experience while working with us! If you need anything or have any questions, please reach out!"
        }
      },
      {
        "author": "Lisa Carlson",
        "rating": 1.0,
        "review": "I wouldn't even give this place one star!! My daughter moved out March of 2021 and they still owe her $873.36.  They are ripping off students and it is amazing that they are getting away with it. After several attempts to get this money they \"claim\" the check is in the mail and it never comes. They should all be ashamed of themselves.",
        "ownerResponse": null
      },
      {
        "author": "Gina Tonole-Towler",
        "rating": 1.0,
        "review": "We have been in contact for months to get a 2400 deposit back. We moved out in August, and its now mid December! Thats not acceptable. Weve given enough time, and are finally starting legal proceedings.\n\nIt is now February. We still dont have our deposit. Its hard to serve papers, but well find a way. We have court date but court said we need to serve him first. We can now get  double the 2400.\n\nIt has now been one year and no deposit. We waiting long enough and just served them papers. Why couldnt they have just given it back? Its sad we had to do this.\n\nThis is the conclusion of our 13 month battle with management of Elevate Apts. We served the property management company finally, and the court date was tomorrow. We asked for what we thought fair, and they are settling at the last minute. I dont understand why they did this! I wish we wouldnt have had to take it so far, but big business thinks they can walk all over people like us. I need to say that Elevate Apts were always nice and cooperative. I communicated weekly for awhile and then monthly, with property manager Veronica. She would always communicate in a timely manner, and was friendly and told us whatever they wanted her to say. They said it was in the mail for awhile, and then it was Covid shortage of staff. It wasnt the apartment complex at fault, but Nelson Property Management. I hope none of you had the same issue. Im just glad its over!",
        "ownerResponse": null
      },
      {
        "author": "Tate Van Patten",
        "rating": 1.0,
        "review": "Good amenities, but the move in was unsatisfactory. The unit felt as though it had not been swept or mopped at all in the last year because the floors are extremely sticky. I also ran my finger on some of the window sills and other random spots and they turned black from all the dust. It would be great if they actually hired a professional cleaning crew in between move-ins as is expected for an apartment. The walls are also very thin so noise travels very easy. It's not terrible and they're definitely worse options for in Bellingham but it was not as good as I was expecting.\n\nUpdate: After a few months I had a problem roommate and asked to break lease. They put in no effort to find a replacement and because there was no break clause I was stuck paying rent at a place I wasn't even able to live at.",
        "ownerResponse": null
      },
      {
        "author": "Gavin Klinger",
        "rating": 2.0,
        "review": "Was fine when it was used to be called Gather Bellingham, now its gone downhill. The apartments are ok, decent furniture that comes with the apartment and also the location close to downtown. The reason i gave it 2 stars is the management.\nMy car got broken into (keep in mind you pay 30 dallors for a spot, probably raised it) and they treated it like its not important. Trash room was always a mess. I had other complaints with them. However, the worst was when we moved out we didnt get the refund back despite deep cleaning the whole apartment, only to be told its dirty.\nIt is best to pick another apartment then Elevate Bellingham and save your money and time.",
        "ownerResponse": {
          "text": "Gavin,\n\nThank you for stopping by the office earlier to talk about your concerns and displeasure's upon move out. We're happy to discuss your specific situation further to clear up any miscommunication that may have happened between the two of us. We can be reached at (360) 474-7845 or elevatebellingham@nelsonpartners.com for further assistance.\n\nThank you!"
        }
      },
      {
        "author": "Mackenzie Wight",
        "rating": 5.0,
        "review": "The guy that helped me showed up very quickly, and was extremely nice. I am new to owning to living on my own and the experience made me feel a lot better about having normal problems such as shower plumbing issues",
        "ownerResponse": null
      },
      {
        "author": "Brandon Hanrahan",
        "rating": 1.0,
        "review": "DON'T WASTE YOUR TIME AND MONEY!!!\nThis rental company will not hesitate to gouge you any chance they get. Office hours are inconsistent and maintenance is a constant. Something is always broken or out of order and may remain like that for weeks. The overall appearance of the building is rather nice however the material quality is terrible, you will hear everything because the walls are paper thin. If you decide to set yourself up for failure here, you better read the lease very carefully. There are other options out there at a very similar price point.\n-Just another person wronged by this company",
        "ownerResponse": {
          "text": "Hi Brandon, thanks for your feedback. We had adjusted our hours due to COVID, which was inconvenient for some of our residents. We apologize for that! With COVID, our staff has also been under-staffed, which delayed maintenance orders to be fulfilled. As of June 2021, we are fully staffed and back on track. We are also open M-F 10-6pm and even open Saturday's for our residents convenience. We hope this helps!"
        }
      },
      {
        "author": "Quentin sermet",
        "rating": 1.0,
        "review": "This place looks good on the outside but when you move in its bad. Front desk is pretty useless most of the time (that isnt their fault) Maintenance comes in when they feel like it without prior warning. They list off a bunch of amenities, that either broken or closed. Now it is know around town for cars being broken into. Lived there for 2 years and was the best thing out there at the time but overpriced and the customer service was pretty bad.",
        "ownerResponse": null
      },
      {
        "author": "Don Gale",
        "rating": 5.0,
        "review": "I just want to take out a few moments to commend Dan, the Property Manager of Elevate. With every single contact with us, he has been totally reliable for being warm, welcoming, generous, and accommodating, with his time, his heart,  and his energy.\n\nWhile the particular apartment did not work out, as our daughters plans changed once Covid-19 came to sequester us all, and she is now living with us in our home near Seattle until we get more certainty in terms of future plans, Dan has been nothing short of extraordinary in his commitment to be of service to us during this difficult time.  Thanks to him, we have been able to sublease our studio, (as our daughter is not living in it!) which supports us so much during this time.\n\nHe is a gem!",
        "ownerResponse": {
          "text": "Hi Don!\n\nThank you so much for your 5 star review. You and your family have been nothing short of amazing to work with on your housing needs. We are saddened the apartment never worked out but are thrilled your family is together during this unprecedented time. We wish you all the best for what the future holds.  Feel free to reach out to us if you make your way up to our neck of the woods again! Stay safe and healthy!\n\nRespectfully,\n\nDan"
        }
      },
      {
        "author": "Julianna Mason",
        "rating": 5.0,
        "review": "I just moved into Elevate this past September of 2020. I have very much enjoyed living here thus far and am looking forward to staying for the rest of the year! One member of the Elevate team who has been particularly helpful to me in relaying important information about Elevate and making sure my stay here has been satisfactory is the awesome Griffin Garnett.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Gordon Jack McCallum",
        "rating": 5.0,
        "review": "Elevate is good. They have good employees. One of them is Corbin. Corbin is nice. Hes friendly. Hes one of the best in the biz. Just like his predecessor Rob. He is funny and has lots of extra skin. But not Corbin. Corbin keeps it tight. Tight like his customer service skills. I like it when I pump up his tires. 7 trees is always good",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Kiersten Krumm",
        "rating": 1.0,
        "review": "Absolutely a scam of a place to live. They only care about money. They advertise free coffee, cereal, and free printing, but the coffee was only free one day a week, the cereal jars always empty, and printer broken and never had any paper in it. Easier to just print on campus. When I finally was able to move out, they charged me $200 for carpet repair. I sent a total of 14 different emails asking to see a photo of what needed to be repaired in my room, but never got a response, only an email warning me that there would be late fees if I didnt pay the $200 repair fee soon. Dont live here, theres much better student housing available in Bellingham",
        "ownerResponse": {
          "text": "Kiersten,\nThank you for taking the time to share your thoughts with us.  It sounds like youve had some frustrating experiences, and for that were truly sorry. Wed very much like to ensure that as a resident, you feel well cared for.  Id love to discuss with you in person or over the phone how we can address your concerns.  I can be reached at DanD@nelsonpartners.com.\nThank you again,\nDan\nProperty Manager"
        }
      },
      {
        "author": "Katherine Rockhold",
        "rating": 1.0,
        "review": "This has been the worst living experience I have ever had. Management is always confused and never on the same page; they will also try to take every dollar they can from you at every turn. They are way overpriced, make promises they don't keep, and the building itself (as well as the individual units) is shoddily built. Twice in a 4 month period there was massive flooding that resulted in several floors being soaked and residents having to evacuate.",
        "ownerResponse": {
          "text": "Hi Katherine, thanks for your feedback. Although we cannot control when property damage is done, Elevate has handled every flood within a week, and everything is opened again. As for your situation, we offered a $200 deduction off your bill to transfer units smoothly. We hope this makes your stay alittle better. Reach out if you ever need any other assistance in the future."
        }
      },
      {
        "author": "price tsai",
        "rating": 5.0,
        "review": "The team was exceptionally helpful during my on-site visits & were very collaborative in the decision-making process; really appreciated them taking the time to find just the right fit.",
        "ownerResponse": null
      },
      {
        "author": "Sarah Mackenzie",
        "rating": 5.0,
        "review": "I've lived here for a few years and I'm dreading the day I have to move for work! The building feels super safe, the units are furnished, and it's location between WWU and downtown is perfect! Corbin is always really helpful when I have questions!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Devin Morrow",
        "rating": 5.0,
        "review": "So the big thing here is that the property manager was willing to work with us on renting a unit. We were coming from a unique position and from all over the place and she assisted with the application process and helped us get everything in order from long distances. The rent is not a huge burden, it is relatively inexpensive. However the office hours are minimal and very select on when they are in the office. The rooms are not bad, however even with on site maintenance because of their limited office hours you have to go through a separate office to put in work orders half the time. But like the title says, they are nice for what you pay. Other good qualities of the property is that is pretty well located just a few miles from a lot of things, and just outside the complex is a bus stop as well as a school, so the neighborhood itself is really not that bad.",
        "ownerResponse": {
          "text": "Thank you so much for leaving us a review! We're really glad we were able to help you find a place. As for the office hours, we are evaluating community feedback to best serve our residents. Currently, we are open Monday through Friday, from 10 a.m. to 7 p.m., Saturdays from 10 a.m. to 5 p.m. and Sunday from 12 p.m. to 5 p.m. We will take your request for additional hours into consideration. As for maintenance, you can submit a maintenance request at any time online through your resident portal, regardless of our office hours, and our full-time staff members will monitor those requests and assign them as necessary. Please continue to let us know how we can better assist you during your residence at Gather Bellingham"
        }
      },
      {
        "author": "Cassie Rossow",
        "rating": 1.0,
        "review": "This review does not reflect on Dan the leasing manager, because I do believe he is trying his best.\nHorrible customer service. I went in to grab a package from the front desk and was asked in a rude and uninterested tone, do you need anything or.... Seemed as if my precense was a nuisance to them. Not the way to go about running a business. My roomate has had numerous encounters with the uninterested and rather unknowledgeable staff. Incredibly rude and uncaring towards her situations. I would not recommend this place to anyone at the moment. These are strong words I know, but as someone whos worked in retail for many years I understand the importance of customer service. I also believe in giving the benefit of the doubt, however this place has disappointed me and others too many times to count.\nAs far as other important things to note: appliances are subpar. Our dishwasher didnt really work well, just seemed to be cheap.  Water wasnt clean when we moved in. You need a key for every single floor (which can be an issue). Printer in the study lounge never worked and there was also never ink. Free amenities were never restocked or refilled (coffee and cereal).\nThis place has potential but until changes are made to staff I dont see this place succeeding because students are not the companys first interest.",
        "ownerResponse": null
      },
      {
        "author": "Erika Silva",
        "rating": 1.0,
        "review": "Guess what? People moved out on August 31st and didnt get their security deposit back. I guess Ill be filling a claim in court because they arent even calling me back to give me a reason why its taking so long.\n\nIn response to their answer below: The Washington Residential Landlord-Tenant Act states if a landlord intentionally fails to return a deposit or send an itemized statement, a tenant may ask a court to double the amount of the deposit to be returned.\nI have been patiently calling and sending you emails and I got a bunch of nothing for months. I will request you to pay me double because it's my right.",
        "ownerResponse": {
          "text": "Hi Erika! We understand your frustration, and we sincerely apologize. We haven't been able to send them out yet due to global short-staffing and new people coming on. Your security deposit will be returned soon, and you are welcome to call us at 360-474-7845 for updates! Hope this helps!"
        }
      },
      {
        "author": "Andrea Wooley",
        "rating": 2.0,
        "review": "For one bedroom in an apartment with 3 other roommates the cost is too high. Most amenities were not available while I lived here, there was no change to rent and the company withdrew their offer for reduced rent with proof of good grades. The staff seems to do their best but were ill-equipped for the maintenance necessary for the building. The only elevator to the non-reserved parking garage is frequently in disrepair including on move-in day, forcing residents to walk up 3-7 flights of stairs to access their apartment (folks with ability impairments too!) Neighbors within the building are often inconsiderate in 3 ways: 1) noise penetrates the walls, floor and ceiling so there is potential disruption from any and all directions making studying from home a challenge. 2) messes in the trash room, hallway, parking garage and other common areas are constant. The 6th floor entrance is frequently soaked in dog urine. 3) many residents (and staff) don't follow COVID guidelines regarding large gatherings and wearing masks. Yes this apartment has conveniences but there are also many drawbacks.",
        "ownerResponse": {
          "text": "Thanks for your feedback Andrea! We have address all your concerns to the property management. Thanks for bringing this up to us! Our priority is to always make sure our residents are happy."
        }
      },
      {
        "author": "Rachel Polhamus",
        "rating": 5.0,
        "review": "Staff is very friendly and helpful. Especially Griffin Garnett, when I called for information about signing a lease he was very professional. The building is new and has a great court yard for dogs and a nice gym as well.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Abbi Ford",
        "rating": 5.0,
        "review": "Living here has been a very pleasant experience, and every time I talk to the staff they are super helpful, especially Sarah! She answers all my silly questions about building rules and other things. Its great to live in a place that feels secure like this.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Randall Dickinson",
        "rating": 5.0,
        "review": "I absolutely love the views here! The community is immaculate, and their maintenance crews are always very quick to respond. My favorite employee is Corbin - whenever I'm having a bad day, he always has the right joke to make it better!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Katie Winkelman",
        "rating": 1.0,
        "review": "Ok folks so if you dont read anything read this: DO NOT LIVE HERE. ITS A SAFETY HAZARD\n\n1) so youd expect your apartment to at least have something like...gee I dunno, a lock on your front door? Well that apparently sets the bar too high for this apartment complex. The first 2 weeks we lived here we didnt have a lock on our front door. We had a lock that wouldnt read our keys and malfunctioned and gathers response? We will get it fixed when we can we waited 2 weeks and got a lock that didnt even LOCK. I could stick my fingernail in it and it would unlock it was so flimsy. When we asked for a lock that had a key reader we did not receive one until about 6-7 months into our lease. And when we FINALLY received one they changed the locks without telling us, so I couldnt get into the apartment and had to spend 3 hours in their office explaining to them the situation and missed a work shift because I couldnt get into MY apartment.\n\n1.5) (locks continues) the doors work on a double locking system. So you need a key to get out. So if you forget your keys youre screwed. My friend forgot her keys and her phone died as she was going down to get her laptop out of her car to turn in an assignment. SHE WAS TRAPPED IN A STAIRWELL FROM MIDNIGHT TO 6AM because her phone died and she couldnt get out. Need I say more? Gather is a safety hazard\n\n2) the elevators just shut down or randomly undergo maintenance at a moments notice so if you have a disability that makes stairs difficult maybe dont live here. And even IF you are on the first floor where there are ADA accessible ramps, forget about access buttons on the doors. But lets just say you CAN get through the doors. Each apartment is set up totally randomly so the chances that the hallways or bathrooms are set up correctly for you is like zero to none.\n\n3) gather Bellingham promises many amenities that they dont deliver. They provide their own internet which, yes, will randomly kick you off your connection and even with your resident log in sometimes it DOESNT WORK! And free coffee, isnt free. Free printing isnt free and he printer doesnt work. Free cereal, well they dont ever stock the study room with cereal so its free but nonexistent for the past 4 months. The gym? Not as good as westerns. The TV package, you could get one of way better. For 675-800 a month just go pay rent at a house and pay for all these amentiriws yourself and pay like 600 a month for THE SAME STUFF.\n\n4) the staff is either totally clueless or totally rude. I dont blame the students who work here, theyre in over their head and there is poor management. They just simply dont know how to answer tough questions because they werent trained on HOW to. The upper management Ive dealt with has been incredibly rude. When I asked them to replace the lock on our door they said that would be nice. NO IT WOULDNT BE NICE ITS THEIR FREAKING JOB TO PROVIDE US WIH A SAFE PLACE TO LIVE\n\n5) and while Im on safety. This is located on the 900 block. If anyone is familiar with this block you will be familiar with the 30+ western alerts throughout the year about car break-ins, people mastrabuating in the windows, flashing people, etc.\n\n6) the furniture they give you is super crappy and cheap. Not to mention they didnt even bother to paint or seal the drywall??\n\n7) speaking of drywall WHEN WE MOVED IN THERE WAS DRYWALL IN THE WATER. we had giant white chunks floating in our water and had to get a filter. Again when we approached management they said oh that should stop in a few days. Great. So no locks, no clean water, Id be better off sleeping in my hammock in the arb and taking showers in the sink at western because at least the water wouldnt be toxic and Id have the same amount of security\n\nTLDR; Gather is a money grabbing, safety hazard that wont put locks on your doors, will trap you in a stairwell, and has hazardous water with expensive amentiites that dont work. Youre better off living at a hammer property (and thats saying something) that or live with a private landlord and save $150+",
        "ownerResponse": null
      },
      {
        "author": "Jackie Benson",
        "rating": 5.0,
        "review": "A GREAT place to live if you want to be off campus, but close enough to walk to class. All the employees are respectful and friendly, specifically Dan and Laura, they were instrumental in helping me and my friends rent there.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Natalie Harris",
        "rating": 5.0,
        "review": "I just moved into Elevate this past September of 2020. I like it here. One member of the Elevate team who has been especially helpful to me in relaying important information about Elevate and making sure my stay has been satisfactory has been the awesome Griffin Garnett!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Taryn Mindt",
        "rating": 1.0,
        "review": "Please do not move in here. Such high prices and terrible living spaces. My dryer door has broke three times now, my roommates toilet seat always falls off, electricity bill is always insanely high no matter how much electricity we use that month, and so on. There are by far better places to live in Bellingham.",
        "ownerResponse": {
          "text": "Hi Sticky, thanks for your feedback. Elevate had been short-staffed during COVID, which delayed maintenance requests to be filled. However, as of June 2021, we are fully staffed and caught up with all of our maintenance requests! If you ever have any other concerns, please call us!"
        }
      },
      {
        "author": "Isaiah Britt",
        "rating": 5.0,
        "review": "When inquiring for information about Elevate I was greeted over the phone by the nicest employee Ariana. She informed me of all the great perks that Elevate has to offer; and where the best place to eat in town was! Great customer service and patience!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "John Mitchell",
        "rating": 1.0,
        "review": "To be honest, I have not been here, but when a friends child with a life threatening illness is told they have to pay a fee to get out of their contract, even though they found someone to take their place, seems like a place not worth supporting.  Listen, I understand contracts very well, I also understand compassion...clearly this company needs to take a look in the mirror and realize that life isnt always about making a buck.  Just realize what you are getting into if you choose to live here.",
        "ownerResponse": {
          "text": "Hello John,\n\nIt has been great to see the love and support from friends and family of one of our residents. I invite you to reach out to your friend and get an updated status of this concern of yours. John, thank you for your review and know that you were heard.\n\nGather Bellingham wishes your friends family the best!\n\nGather Bellingham\n360.474.7845\ngatherbellingham@achliving.com\nwww.gatherbellingham.com"
        }
      },
      {
        "author": "Makani Falkin",
        "rating": 5.0,
        "review": "Ive enjoyed great service at elevate, from being interested in housing and visiting my friends. When I was interested in housing at elevate I went to the office, Griffin Garnett explained to me in great detail how everything works and how I would get settled if I wanted to room at elevate. Great friendly workers and nice establishment!",
        "ownerResponse": null
      },
      {
        "author": "Vincent Garcia",
        "rating": 5.0,
        "review": "I've been living here since they opened in September, and I renewed as soon as I could. I'll probably renew next year too.\n\nThe quality of living is p nice. Decent sized rooms (I'm in a 4br/2ba), enough for my computer desk as well as the desk they provide in front of my bed. The bed was a bit firm, so I snagged a $60 memory foam pad from Amazon, and bam it's hella comfy.\n\nThe appliances are decent enough, everything was brand new. The stove is a coiltop, which is a bummer, but I imagine glasstops are more expensive.\n\nStaff has been hella chill and wicked helpful anytime we needed anything, including maintenance.\n\nThe internet is fixed at 15mb/s, which sucks when you're downloading games, and in-game I occasionally deal with lag (esp Doom. Dota has always been fine). There isn't a way to get more speed, unfortunately, but at the same time It's free so.\n\nThe hangout zones are interesting, and the fitness center is good enough as any gym, thankfully it's almost never overly busy.\n\nThis place just needs a pool or a grassy hangout spot. The concrete courtyard is just weird :\\ it would serve better as a vertical garden.",
        "ownerResponse": null
      },
      {
        "author": "Alivia Eng",
        "rating": 5.0,
        "review": "Elevate provides a cozy, fun place to live with a super convenient location thats walking distance to campus and downtown. Whenever I have a question or concern the staff answers promptly- Griffin has been especially helpful on a number of occasions.",
        "ownerResponse": null
      },
      {
        "author": "Tyler",
        "rating": 5.0,
        "review": "Great location, friendly staff. If your looking for an off campus location then this is the one you want to go with. Everything is as the photos portray. Very modern and well designed. Fully furnished and yes... high speed internet!",
        "ownerResponse": {
          "text": "Thank you so much for your kind words. Resident satisfaction is very important to us so your review made our day!!! Please let us know if there is anything we can do to help you continue to enjoy your home. 360-474-7845 community email gatherbellingham@achliving.com"
        }
      },
      {
        "author": "Liam Gleeson",
        "rating": 5.0,
        "review": "The ultimate chad apartment complex. Pictures this, your all alone in Bellingham and have no idea where to stay. Now this sweet sweet apartment complex in a duster comes up and says, you know elevate has great residency for such a small price. Obviously you take its advice, and then boom! You end up spending the rest of your life there. But dont worry, when workers like Corbin benson are there, its worth every (cheap) penny! Take it from me, Im 64 and still living it up in elevate! Long live the chad apartment complex!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Sydney Evans",
        "rating": 5.0,
        "review": "Griffin gave me a tour of elevate and he was awesome, he had really awesome people skills and was super friendly! such a good tour guide, and when I walked in kind of unsure about how I thought about living at elevate he really kinda sold me on it and Im definitely going to look into it as an option.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Aiden Nash",
        "rating": 5.0,
        "review": "I love the location! Its super close to campus so it didn't take long to get there from my dorm. I believe I spoke with Griffin on the phone, and he answered all of my questions and was able to walk me through the leasing process since I've never leased before.",
        "ownerResponse": null
      },
      {
        "author": "Tara Zwink",
        "rating": 1.0,
        "review": "I'm also posting a review regarding my nephew who had to leave school early due to a serious illness and was then charged a large fee for terminating his lease. My nephew's family has been extremely busy with doctor appointments and everything that goes with it and yet they still took the time to find a replacement renter. This new renter moved in immediately and also was found because he was a good fit for the other roomates. No person was inconvenienced and no money was lost to the apartment complex. Sadly they still got charged a large fee. My nephews family did the right thing and it would be nice if Gather Bellingham would do the right thing and waive the fee considering the circumstances. So far they have only acted extremely rude regarding this matter and even accusatory.  I'm sad that any person would have to go through such a horrible experience when dealing with a medical crisis.",
        "ownerResponse": {
          "text": "Hello Tara,\n\nBefore anything else, Gather Bellingham wants to express how saddened we are by the circumstances your Nephew and Family are going through. There are no words to say to you and your family to make things better, except take action in what we can do. Please feel free to reach out to your Nephew and you will be pleased to hear we were able to accommodate to his circumstances.\n\nThank you so much, Tara! Your feedback has been helpful and know you were heard!\n\nGather Bellingham wishes your Nephew a fast recovery!\n\nGather Bellingham\n360.474.7845\ngatherbellingham@achliving.com\nwww.gatherbellingham.com"
        }
      },
      {
        "author": "Jason Maki",
        "rating": 4.0,
        "review": "Great living conditions, although sometimes the staff was a little bit ill prepared. This created some unfortunate situations, but overall they did a good job at trying to met the needs of the residents. They need a guest parking area, even if it is just a couple spots.",
        "ownerResponse": {
          "text": "Thank you for your patience as we get adjusted to our new location (we're moving in just like everyone else!) We're always looking for feedback from our residents, and we've been tossing around a few ideas internally as to how we can address any parking concerns they may have, so we appreciate your input. Call or email us any time with other suggestions!(360)4747-845 gatherbellingham@achliving.comgatherliving.com/gather-bellingham/"
        }
      },
      {
        "author": "john doe",
        "rating": 1.0,
        "review": "For around $800 a month for most rooms, Gather Bellingham is taking way more than it is giving. They advertise all of these incredible amenities with pictures of clean, modern furniture and attractive 20 somethings smiling and holding skateboards or coffee; but they dont deliver. In fact, they straight up lie sometimes. In each lease, lessees are promised a pool, hot tub, and tanning salon. Guess what Gather doesnt have. Yep! No pool or anything else to be found! They advertise free coffee and cereal in the study room too. So, lets start with the study room.\nCoffee is only free if you are getting regular. They used to have other drinks like lattes and mochas and espresso also free, but I guess even when youre taking wads of cash from all of your residents, you sometimes cant afford to pay for things that you promise them. The cereal only gets restocked on the first three days of the workweek, so good luck if youre trying to get a bowl on the weekend. It will be long gone by then. Free printing isnt free either. You have to bring your own paper and just hope that theres ink in the printer (theres usually not). And this is all just in the main study room! In the other, smaller study rooms on most other floors youll find nothing. Yep, nothing. For almost 6 months, Gather Bellingham has had signs on the doors saying study room: coming soon. As residents, we pay for the amenities we were promised, and to still not have study rooms furnished and set up isnt just irresponsible, it shows that Gather Bellingham only cares about getting you to sign the lease. Once youve done that, theyre not trying to impress you anymore. Dont get me wrong, most of the employees are friendly and as helpful as they can be. But it seems that most of them are unprepared and uninformed, and frankly, theyre in over their heads. I dont know who in the chain of command is responsible for this, but its obvious that someone doesnt care about Gather Bellingham. They dont care about the residents, they dont care about keeping their word, and they dont care if their employees are left out to dry. They are only concerned with getting you in the door. And, while were on the topic of doors, it would probably be a good time to mention another place where Gather falls short.\nDoors. The doors in Gather are a nightmare. The doors in Gather are like if they were installed by someone who is obsessed with security, but who also has no idea how to actually make something secure. To get into a stairwell, you can just walk on in. But to get out, you need a key. You cannot exit a stairwell without one. So, if theres ever a fire lets just hope that you remembered to grab your keys before fleeing a burning building! They also have key readers that activate the elevators, but only at certain floors. The basement, first, and second floors have key readers on the elevators there, as does the elevator closest to the skybridge entrance on the 6th floor. These are all places where people would be arriving at the elevator from the outside. So to dissuade non-residents sneaking in, they made these elevator entrances only accessible by key. Except they did it in a way that makes no sense. Seriously, youd have to see it to believe it. And they didnt even make the building any safer. If you get in through the skybridge and make it to the keyed elevator and find yourself without a key, fear not! You can always just walk down the hall to the other elevator that doesnt require a key from that floor. Safe and sensible, right? And to put the cherry on top, sometimes your key just wont work. The key reader simply wont accept it and you cannot get into whatever door or elevator you were trying to unlock. Gathers response to this? Just have someone with you whenever you need to go through a locked door! Because you always have a buddy with you when youre coming home from class, or work, or going down to check your mail, right?\n\nalso:\nbreak ins\ncourtyard restrictions\nfines everywhere",
        "ownerResponse": {
          "text": "Hi John,\n\nI want to thank you for taking the time to write this, and I sincerely apologize that your experience with Gather has led you to writing such a review. We work hard to ensure that our residents have only the best experience with us.\n\nI want to address some of your comments.\n- You will never need a key to get out of the stairwell. I encourage you to see for yourself by going into our stairwell and then walking to the bottom floor, where you should go in case of a fire. The entrances to the stairwell from the outside are locked from the outside. We only lock the stairwells from the inside on the residential floors to help make sure only those who live here have access to residents' rooms. Many of our residents are happy with this added feature.\n- We pride ourselves in offering free drip coffee and free cereal to our residents.\n- I encourage you to research what was advertised and what our lease promises residents will receive, as I assure you that we have not misled our residents in any way from when they signed a lease back in the leasing office until they moved in.\n- In regards to printing, we don't charge for printing. You may still incur an additional cost by purchasing paper. We do know our printer has some issues every now and then, and we try to respond to those issues as quickly as possible. In those instances, we are happy to provide free printing in the leasing office. All you'll need to do is email us the document you need to print, and we'll be happy to get that printed for you.\n- If you notice that one of our locks aren't working, we can usually have it repaired within a minute or two so long as it is reported to us, so we hope you can be an active member of our community and alert Gather Staff when these things happen so we can repair them. (We do see Google reviews, but not as immediately as we do friendly faces, and this doesn't help us know which lock is malfunctioning).\n\nPlease feel free to reach us directly at (360)474-7845. I know you left this review anonymously, and we can certainly appreciate that desire, but rest assured we will work hard to help you in anyway we can should you give us a call or come into the office in need.\n\nThank you again, and have a wonderful day!"
        }
      },
      {
        "author": "Mic Pan",
        "rating": 5.0,
        "review": "This place is great if you're looking for a place nearby WWU. Clean rooms. Friendly staff. Clean atmosphere. Multiple Study Rooms. Awesome events. The pricing is decent too. Cheaper than WWU housing by roughly $30 depending on your circumstances. What more could I say?\n\nMost important thing is Gather Bellingham has secure bike rooms. I remember having my bike stolen at WWU Birnam Woods housing. Wasn't fun. Gather Bellingham also has dryers for your clothes, so you don't have to air dry them which WWU housing also doesn't have.",
        "ownerResponse": {
          "text": "Hello Mic!\n\nThank you so much for the five stars! We appreciate the time you took to write us a review. Hope you are having an awesome quarter at Western!\n\nGather Bellingham\n360-474-7845\ngatherbellingham@achliving.com"
        }
      },
      {
        "author": "Brian Ellis",
        "rating": 3.0,
        "review": "Rooms are fairly large and there are plenty if amenities. Haven't had a problem with management either, but the building's full of college students who trash the halls almost every weekend.",
        "ownerResponse": {
          "text": "Thanks for your review Brian! We appreciate it! Let us know if you need any help with anything!"
        }
      },
      {
        "author": "Todd Zwink",
        "rating": 1.0,
        "review": "My nephew had an apartment at Gather apartments.  He had to leave school because he was diagnosed with a life threatening illness.  The family found someone to pick up the lease, so no loss of revenue to the apartment complex.  They still stuck my nephew with a hefty leaving early fee.  Way to profit on someone facing a life threatening disease!",
        "ownerResponse": null
      },
      {
        "author": "Jeff Mesan",
        "rating": 2.0,
        "review": "Really expensive apartments. Although they are nice, be more practical and share a cheaper apartment if it's necessary to be moved out.\n\nI don't particularly like companies like this trying to profit from students... But it is the students choice in the end obviously.",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave us a review. We certainly understand that the biggest factor in choosing a place to live is price. When compared, our pricing is very similar to the annual cost of living in the dorms. However, in addition at Gather you get the benefit of living in a Brand New apartment complex with several state-of-the-art amenities and the luxury of having a private bedroom and private bathroom option. Due to our close proximity to WWU campus and downtown Bellingham, our prices are comparative, and lower in cases, than those in the surrounding areas. For the students at WWU and residents of Bellingham who live at Gather our top priority is to provide them with exceptional customer service, a truly outstanding product, and a place that they are proud to call home. We hope that you'll give us a chance to showcase that by choosing to live at Gather."
        }
      },
      {
        "author": "Rosa Marie",
        "rating": 1.0,
        "review": "I scheduled a tour for a studio for today, at 1:30, I called multiple times, went out of my way to schedule one, and called and they just redirected my call to another call! so unprofessional and kind of upset ! If they cant even tour and show up, for a tour, why would I want to live here??",
        "ownerResponse": {
          "text": "Hi Rosa, thanks for your feedback. Since we open at 10am - 6pm M-F, the calls that we get before and after that automatically get sent to VM. We apologize for the miscommunication, and hope you find housing that makes you happy!"
        }
      },
      {
        "author": "Madalyn Dahl",
        "rating": 5.0,
        "review": "Sabine is incredible! I toured with her last week and she was very knowledgeable! Elevate is incredible, and I cannot wait to be moving in next Fall.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Noah Butler",
        "rating": 5.0,
        "review": "Absolute pro. My new fridge handle is the best fridge handle Ive ever had.",
        "ownerResponse": {
          "text": "Hello Noah,\n\nThank you so much for your 5-star review. We are pleased that your maintenance items have been addressed and resolved. Please continue to let us know what else we can work on to improve and continue to provide excellence for our residents.\n\nElevate Bellingham"
        }
      },
      {
        "author": "Ryan Wood",
        "rating": 1.0,
        "review": "Elevate is managed by Nelson Partners, a cut-corners operation out of California. They do not replace furniture when needed and withhold employee reimbursement checks, I guess in an effort to have people forget so they can earn additional money.",
        "ownerResponse": {
          "text": "Hi Ryan, thanks for your feedback. Although we understand your frustrations, we make the effort to always reimburse our employees in a timely manner. Sometimes this process is delayed due to short-staffing, which we apologize for. We really do care for all of our employee very much. And from our understanding, you have been fully reimbursed for your past expenses. If there is anything we might've missed, don't hesitate to reach out!"
        }
      },
      {
        "author": "James Mitchell",
        "rating": 1.0,
        "review": "This place sucks. Yeah they have nice apartments and lots of amenities, but the service is horrible. They don't explain anything until last minute (move in day), they charge a lot of money for stupid things ($250 early move in, $50 per in broken down box in recycle), and they can't ever answer any of your questions because no one that works there ever knows what they are doing.",
        "ownerResponse": {
          "text": "All of our residents are important and we are sincerely sorry that you have experienced a problem. We would love to schedule a meeting to document your issues and concerns so you can be assured that they will be addressed. Please contact us at your earliest convenience. Our office is open M-F from 10-7 Sat 10-5 and Sun 12-5, our phone number is 360-474-7845, and you can contact the management team directly at community email gatherbellingham@achliving.com www.gatherbellingham.com"
        }
      },
      {
        "author": "Tomio Norris",
        "rating": 4.0,
        "review": "Maintenance requests are processed in a timely and efficient manner.",
        "ownerResponse": {
          "text": "Thank you, Tomio for your amazing 4-Star review! We greatly appreciate your feedback, please don't hesitate to reach out to us if you have any concerns or additional feedback, on ways we can improve. Thank you, Elevate Bellingham"
        }
      },
      {
        "author": "Brenda Davis-Fisher",
        "rating": 3.0,
        "review": "The rent has increased significantly every year.",
        "ownerResponse": {
          "text": "Hello Brenda, thank you for sharing your honest feedback. Please give us a call at 360-356-1458. We would be happy to answer any questions you have regarding the standard increases. \n\nBest, \n\nElevate Bellingham."
        }
      },
      {
        "author": "Brian Carlson",
        "rating": 5.0,
        "review": "I was moving up to Bellingham and requested a virtual tour of the place. The rooms looked clean and Laura did a great job explaining the prices and options I had. Great experience.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Jon Flanagan",
        "rating": 5.0,
        "review": "Elevate is number 1. Corbin is numero uno when it comes to customer service and I miss Jeremy but performance has not suffered in his absence. Come to elevate Bellingham (formerly gather) for all youre housing and home needs",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Petra McDonnell Ingoglia",
        "rating": 5.0,
        "review": "Just had a tour of Elevate today and it was awesome! Our tour guide was great and answered all of our questions. Looks like a super cool place to live!",
        "ownerResponse": {
          "text": "Petra! Thank you so much for the 5 star review! We are beyond excited that you had a wonderful time touring our property. Our staff are well trained and take pride in Elevate Bellingham. Please reach out to us if you have any questions! (360) 474-7845. elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Ken Terry",
        "rating": 5.0,
        "review": "I was looking for somewhere to live in Bellingham and found this property. I had the pleasure of talking with Dan and he did an amazing job explaining the pricing and amenities. Beautiful place and excellent service!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Carly Cloward",
        "rating": 5.0,
        "review": "Pretty great place to live. Well furnished, good security, and great amenities. Ari at the front office has always been super helpful.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Matthew Chandler",
        "rating": 5.0,
        "review": "About a week ago I had a great interaction with Laura the leasing agent she helped me decide if elevate is the right place for me, hoping to move in around fall!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Mara Scally",
        "rating": 5.0,
        "review": "Was visiting Bellingham looking for off campus housing. Sarah was super helpful when letting us tour the place and filling us in on the rundown. Very helpful and informed.",
        "ownerResponse": {
          "text": "Mara,\n\nWe are so glad to hear you had a wonderful time touring our property! If you have any questions, we are always here to help :). (360) 474-7845 elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Emily Creamer",
        "rating": 3.0,
        "review": "Not great management, very dorm lifestyle feeling. Its nice and brand new but if youre looking to get away from feeling like youre a child this is not the place to live. Also very expensive",
        "ownerResponse": {
          "text": "We are disappointed to hear you are not pleased with the experience Gather Bellingham provides. We would like the chance to discuss your concerns in person. Please stop by our office at your earliest convenience to speak with our staff in person. Thank You."
        }
      },
      {
        "author": "Tanguy Cimetiere",
        "rating": 5.0,
        "review": "Absolutely love this place! The staff is super nice. Griffin gave me a great tour of the place. Would highly recommend to everyone.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "sophia marie",
        "rating": 5.0,
        "review": "Great apartments, and the customer service is amazing! Laura at the front office has always been very helpful & friendly ",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Susan Shjerven",
        "rating": 2.0,
        "review": "The apartments themselves are nice but the grounds and hallways are always dirty. And the security is pretty sketchy.",
        "ownerResponse": null
      },
      {
        "author": "Casey James",
        "rating": 5.0,
        "review": "This is a great apartment. I toured with Sabine and she was very informative and helpful with all the questions I had!",
        "ownerResponse": null
      },
      {
        "author": "Nicole Laudisio",
        "rating": 5.0,
        "review": "Had a really great experience living here! Every time I came to the office with questions or concerns Griffin was extremely helpful!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Audrey Putnicki",
        "rating": 5.0,
        "review": "i like living here. griffin garnett has made it very positive for me especially during the move in process.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "lukas motheral",
        "rating": 4.0,
        "review": "Solid staff and great amenities\nsad to leave so soon",
        "ownerResponse": {
          "text": "Hello Lukas,\n\nThank you so much for you 4-star review! We are pleased that you have enjoyed your time here with us at Elevate. We appreciated having you as our resident, and greatly appreciate your feedback.\n\nElevate Bellingham"
        }
      },
      {
        "author": "Ofek Inbar",
        "rating": 5.0,
        "review": "I had a couple of questions to ask over the phone and Griffin was able to answer them all quickly and overall it was a very positive experience",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Trevor",
        "rating": 5.0,
        "review": "Beautiful area. Even better service thanks to the guy in the office griffin! Two thumbs up! Thanks again!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Rj Secrest",
        "rating": 5.0,
        "review": "Helpful staff, griffin was really friendly over the phone and in person.\nCool giveaways!",
        "ownerResponse": null
      },
      {
        "author": "Daniel M",
        "rating": 5.0,
        "review": "Got a sweet virtual tour from Corbin a few days ago. Place looks amazing!",
        "ownerResponse": null
      },
      {
        "author": "Evan Hunt",
        "rating": 5.0,
        "review": "Elevate workers always make things easy, the times Ive called in with a question Griffin has always helped me out right away",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Thiago Barreto",
        "rating": 5.0,
        "review": "Laura helps me with any questions I have on the phone and recently the tour looked great!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Brandon Cooley",
        "rating": 5.0,
        "review": "Great place to live, Griffin and Laura are always super helpful at the front desk",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Hart Heffelfinger",
        "rating": 1.0,
        "review": "Staff is rude, unprofessional, inexperienced, and even threatening on one occasion. Facility is dirty and profits first. Avoid renting here at all costs.",
        "ownerResponse": null
      },
      {
        "author": "Camden Smith",
        "rating": 2.0,
        "review": "The maintenance staff is the only thing keeping this place afloat",
        "ownerResponse": {
          "text": "Hello Camden!\n\nThank you for your honest review and feedback. We would love to hear more about your concerns and feedback. Our managers are available Monday through Friday and welcome all feedback. Thank you!"
        }
      },
      {
        "author": "Bradley Harp",
        "rating": 5.0,
        "review": "Very beautiful.",
        "ownerResponse": {
          "text": "Thank you Bradley! We do our best with grounds to make sure we welcome all guests and residents to a clean, welcoming environment! Have an amazing day!"
        }
      },
      {
        "author": "Jared Taylor",
        "rating": 5.0,
        "review": "Laura helps answer questions everytime I call and has great people skills!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "janet smith",
        "rating": 1.0,
        "review": "Once your child signs paperwork without adult consult gather will screw your child",
        "ownerResponse": {
          "text": "We want to thank you for taking the time to leave this review. We're sorry you didn't have the best experience with Gather Bellingham. We try to be as clear as possible with all of our residents about the nature of their lease agreements, and the many amenities Gather Bellingham offers, but, if all else fails, we do offer all of our residents the option to re-let their unit at any point, which is a good option for anyone who may be dissatisfied with their experience. If you have any feedback as to how we can improve our service in the future, we would love to hear from you. Please give us a call or send us an email.(360)474-7845GatherBellingham@achliving.comGatherBellingham.com"
        }
      },
      {
        "author": "Natina Dudley",
        "rating": 5.0,
        "review": "Nice, but not expensive unless you use all the facilities.",
        "ownerResponse": {
          "text": "Hi Natina,\n\nWe genuinely appreciate honest reviews like yours.  They help us maintain and improve our resident experience while staying at our property.\n\nThank you Natina for your kind words. If you need anything feel free to reach out to us @ (360)474-7845 or gather@nelsonpartners.com"
        }
      },
      {
        "author": "nikodemus case",
        "rating": 5.0,
        "review": "Ari is a great help on the phone when I needed to find out if this place is right for me!",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Ryan C",
        "rating": 1.0,
        "review": "Elevator is consistently broken, ironic",
        "ownerResponse": null
      },
      {
        "author": "Alex Hyde",
        "rating": 4.0,
        "review": "New courtyard is much better and more visually appealing",
        "ownerResponse": {
          "text": "Alex,\nWe genuinely appreciate the updated review. The courtyard was our summer project and we are beyond happy that it achieved resident satisfaction. Please contact the office if you need anything! (360)474-7845 or elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Nathan Winney",
        "rating": 5.0,
        "review": "Talked with Ari. Super helpful! Great energy there.",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "jason lacy",
        "rating": 4.0,
        "review": "Nice building. Top floor has good view",
        "ownerResponse": {
          "text": "We are so happy that you're pleased with our community. Our priority is to provide excellent customer service, so thank you for taking the time to share your experience with our future residents. If you need anything, please\ndon't hesitate to contact our management office 360-474-7845 www.gatherbellingham.com"
        }
      },
      {
        "author": "Ilanit Inbar",
        "rating": 5.0,
        "review": "This place is amazing!\nSo calm and peaceful",
        "ownerResponse": {
          "text": "Thanks for the positive feedback!"
        }
      },
      {
        "author": "Charlie Young",
        "rating": 4.0,
        "review": "Lots of college students but all the amenities you could need.",
        "ownerResponse": {
          "text": "We appreciate you taking the time to give us **** Stars and we look forward to many more good experiences. If you ever need to contact us you can do so directly at 360-474-7845-Gather Bellingham"
        }
      },
      {
        "author": "Don Steve (Smooth)",
        "rating": 5.0,
        "review": "Best gym in Bellingham Washington hands down",
        "ownerResponse": {
          "text": "Thank you for the kind recommendation! We are glad to hear you enjoy it! If you ever want to see something else get added to the gym, let us know!"
        }
      },
      {
        "author": "Nadia Velasquez",
        "rating": 4.0,
        "review": "Pretty nice student living though they have their problems",
        "ownerResponse": {
          "text": "Hello Nadia! Thank you so much for the Four Stars! At Gather Bellingham we aim to continuously improve our service and make living at Gather Bellingham an awesome experience. We would love to hear how we can earn that extra star to make it a Five Star review from you. Feel free to reach us at 360-474-7845 or gatherbellingham@achliving.com\n\nHappy Holidays and Enjoy Your Break!\n\nGather Family"
        }
      },
      {
        "author": "Nick monaghan",
        "rating": 4.0,
        "review": "Interesting but most definitely a collage spot.",
        "ownerResponse": {
          "text": "Thank you for your review!"
        }
      },
      {
        "author": "H B",
        "rating": 1.0,
        "review": "Terrible lease agreements shady practices",
        "ownerResponse": null
      },
      {
        "author": "Michael Phillips",
        "rating": 5.0,
        "review": "I love this place moved around a bit and I like it here.",
        "ownerResponse": {
          "text": "Hi Michael, Thank you so much for your 5 star review! We are  incredibly grateful that you took the time out of your day to leave us this note. All the feedback we receive helps us continue to uphold and improve our residents experience.\n\nThanks again Michael for taking the time to leave us a review! If you need anything feel free to reach out to us. (360)474-7845 gather@nelsonpartners.com"
        }
      },
      {
        "author": "Linda C",
        "rating": 5.0,
        "review": "A little expensive but great apts",
        "ownerResponse": {
          "text": "Hi Linda, Thanks for leaving us such a wonderful honest review. We are incredibly grateful that you took the time out to leave us this note. Our company strongly values resident satisfaction. All the feedback we receive helps us continue to uphold and improve our residents experience. Thank you, once again, for your kind words."
        }
      },
      {
        "author": "mauri arminen",
        "rating": 5.0,
        "review": "Very nice",
        "ownerResponse": {
          "text": "Hi Mauri, Thank you so much for your positive 5 star review! Our staff will always go to great lengths to make sure your stay is comfortable and to your standard. Thanks again for taking the time to leave us a review! If you have any questions please reach out to us! | (360) 474-7845 | elevatebellingham@nelsonpartners.com |"
        }
      },
      {
        "author": "Troy Marklin",
        "rating": 4.0,
        "review": "Great place for a college student to live.",
        "ownerResponse": {
          "text": "We are so proud of Gather Bellingham and thrilled that you love living here! Thank you for the GREAT review! If you need anything, please feel free to give us a call or send us an email. (360)474-7845GatherBellingham@achliving.comGatherBellingham.com"
        }
      },
      {
        "author": "Masako Derr",
        "rating": 5.0,
        "review": "Hard work!",
        "ownerResponse": null
      },
      {
        "author": "diana zaragoza",
        "rating": 5.0,
        "review": "Great",
        "ownerResponse": {
          "text": "Thank you kindly for the 5 star review. If you need anything just let us know! elevatebellingham@nelsonpartners.com | (360)474-7845."
        }
      },
      {
        "author": "Tyler Huse",
        "rating": 4.0,
        "review": "Great place to live",
        "ownerResponse": {
          "text": "Whats better than a satisfied resident? A satisfied resident who writes a review! Seriously, this review made our day! Thank you so much for sharing your positive feelings about your home. If you need us, please reach out!  You can reach us at 360-474-7845 -Gather Bellingham"
        }
      },
      {
        "author": "Faith Rowles",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jacob Sundberg",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Jacob! Thank you so much for your amazing 5-Star Review - we greatly value your feedback and are glad you have chosen Elevate as your home. Thank you!"
        }
      },
      {
        "author": "Christopher Rosenquist",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Christopher,\n\nThank you for the wonderful 4 - star review. We greatly appreciate the feedback our residents have. Please don't hesitate to reach out if there's anything else we can do to help our residents have a positive experience. We greatly appreciate your patience and understanding!"
        }
      },
      {
        "author": "Marek Valvas",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Marek,\n\nThank you for you amazing 5- star review. We greatly appreciate your feedback, and patience with us as we navigate new challenges. Pleased don't hesitate to reach out to us on ways we can help improve!\n\nBest,\n\nElevate Bellingham"
        }
      },
      {
        "author": "Max Gargano",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Max,\n\nThank you for you amazing 5- star review. We greatly appreciate your feedback, and patience with us as we navigate new challenges. Pleased don't hesitate to reach out to us on ways we can help improve!\n\nBest,\n\nElevate Bellingham"
        }
      },
      {
        "author": "Fire Kex",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Nick, Thank you for your wonderful 4-star review. We appreciate any feedback our residents have to offer and there's anything we can do to help make Elevate a better place for our residents. Please don't hesitate to reach out to us! Thank you, Elevate Bellingham"
        }
      },
      {
        "author": "Jordan Streitz",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Jordan!\n\nThank you so very much for your wonderful 5-star review! We greatly value the feedback of our residents and welcome any suggestions you or other residents may have. Please don't hesitate to let us know on how we can continue to improve and make Elevate a welcoming place for our residents. \n\nWarmest Wishes,\n\nElevate Bellingham"
        }
      },
      {
        "author": "Keyana McCain",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you, Keyana for your amazing 5- star review!\n\nWe greatly appreciate your feedback, please don't hesitate to reach out to us if you have any concerns or additional feedback, on ways we can improve.\n\nThank you,\n\nElevate Bellingham"
        }
      },
      {
        "author": "Ayden Evans",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Ayden!\n\nThank you so much for your honest 4-star review! Please don't hesitate to reach out to the leasing office and let us know how we can help improve and continue to make Elevate great place for our residents."
        }
      },
      {
        "author": "Kya",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Andilard",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "trenton rice",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Amy Pham",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joe Chriest",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Asher P",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Destinee Hardenbrook",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Desintee!\nThank you for your 4 star review! We appreciate the feedback. Feel free to let us know how we can improve further! (360) 474-7845 or elevatebellingham@nelsonpartners.com\n\n-Elevate Staff"
        }
      },
      {
        "author": "Emma",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Emma,\n\nWe are concerned about your negative experience with our community. Please contact the office and we would be happy to remedy any concerns you have. (360)474-7845 elevatebellingham@nelsonpartners.com.\n\nElevate Staff"
        }
      },
      {
        "author": "Roy Granados",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Roy,\nThank you for the 5 star review! We appreciate having you as a resident!\nThanks,\nThe Elevate team"
        }
      },
      {
        "author": "Lane Stewart",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Lane!\n\nThank you so much for taking the time to leave us a 5 star review. If you need anything you can always reach out to our information below!\n\nEmail: elevatebellingham@nelsonpartners.com | Phone: (360) 474-7845"
        }
      },
      {
        "author": "Josh",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Josh,\n\nWe are concerned about your negative experience with our community. Please contact the office and we would be happy to remedy any concerns you have. (360)474-7845 elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Jesus Soto",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Jesus, Thank you for taking the time in leaving us a 5 star review! We are pleased to hear that your experience with Elevate has been positive. If you need anything please let us know! elevatebellingham.com | (360) 474-7845"
        }
      },
      {
        "author": "Spencer Jones",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Spencer! Thank you so much for the 5 star review. Let us know if you need anything!! (360) 474-7845 | elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Peter Anderson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Peter! Thank you so much for taking the time in leaving us a 5 star review. Please reach out if you need anything! (360)474-7845 or elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Sophia Passarelli",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Sophia!\n\nThank you so much for taking the time in leaving us a 5 star review. We loved getting the opportunity to show you our beautiful property. If you have any questions please reach out!\n\nelevatebellingham@nelsonpartners.com (360)474-7845"
        }
      },
      {
        "author": "Lucas Waters",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Lucas, Thank you so much for your positive 5 star review! Our staff will always go to great lengths to make sure your experience with Elevate Bellingham is nothing short of amazing. Thanks again for taking the time to leave us a review! If you have any questions please reach out to us! | (360) 474-7845 | elevatebellingham@nelsonpartners.com |"
        }
      },
      {
        "author": "Solveig Gallego",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Solveig!\n\nThank you kindly for the 5 star review! We are excited for this upcoming lease year!! If you need anything just let us know! elevatebellingham@nelsonpartners.com | (360) 474-7845"
        }
      },
      {
        "author": "Rachel Thompson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Rachel,\nThank you for taking the time in leaving us a 5 star review! We are beyond happy that your experience with Elevate has been nothing short of your rating.\nIf you need anything please let us know!\nelevatebellingham.com | (360) 474-7845\n\nThank you!"
        }
      },
      {
        "author": "Eli Goldberg",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Eli,\n\nWe are concerned about your negative experience with our community. After searching through our records, we are unable to find evidence of you being a current or previous resident. Please contact the office and we would be happy to remedy any concerns you have. (360)474-7845 elevatebellingham@nelsonpartners.com"
        }
      },
      {
        "author": "Fabian Morales",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Esteban, we are sorry to hear that you have been experiencing some issues during your stay with us. We are here to assist you in any way we can. Please contact the office at your earliest convenience. (360)474-7845 or gather@nelsonpartners.com."
        }
      },
      {
        "author": "Jennifer Brown",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Jennifer,\n\nWe genuinely appreciate you taking time out of your day to give us this review. Thank you so much! We hope to continue your positive experience moving forward.\n\nIf you need anything feel free to reach out to us @ (360)474-7845 or gather@nelsonpartners.com"
        }
      },
      {
        "author": "Badtz Maru",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "robert angelotti",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Christy Anderson",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Christy for your detailed review. We are certainly just as concerned as you are about the condition of our brand new building, which is why we have a top-notch grounds-keeping team working around the clock, in addition to contracted cleaners, to keep Gather Bellingham's condition up to the standards of our residents. Of course, we rent to anyone who meets our rental criteria, and we do ask people to do their part in maintaining the beloved look and feel of Gather. Sounds like you're part of the solution, and we thank you for that! Please do not hesitate to call or email us with any other feedback you may have. We really appreciate it!(360)474-7845GatherBellingham@achliving.comgatherliving.com/gather-bellingham/"
        }
      },
      {
        "author": "Joey Zhang",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for your positive review of Gather Bellingham! Let us know if you ever need anything or have any further questions regarding our property, feel free to give us a call! Our office is open M-F 10-6, Sat-Sun 12-5. Phone: 360-474-7845 Email:gatherbellingham@achliving.com"
        }
      },
      {
        "author": "Ashley Carpenter",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for your rating. Resident satisfaction is very important to us so your rating really makes us happy!!! Please let us know if there is anything you need!!! Our office is open M-F 10-6, Sat-Sun 12-5. Phone: 360-474-7845 Email:gatherbellingham@achliving.com"
        }
      },
      {
        "author": "Melanie Daniels",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Melanie,\n\nThank you for giving us a 5 star review! We are excited to have you here! If you need anything, just let us know!\nPhone: 360-474-7845 Email:gatherbellingham@achliving.com"
        }
      },
      {
        "author": "Abby Rand",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Abby,\n\nThank you so much for the 5 Star Review! The fact that you took time out of your day to review us, warms our hearts. Let us know if you need anything to continue your positive stay.\n\nPhone: 360-474-7845\nEmail:gatherbellingham@achliving.com"
        }
      },
      {
        "author": "Liam Gallagher",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Liam,\n\nWe appreciate you taking time out of your day to give us this review! Thank you so much. We hope to continue your positive experience here at Gather Bellingham.\n\nPhone Number: 360-474-7845\nEmail:gatherbellingham@achliving.com"
        }
      },
      {
        "author": "Emily Bickel",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Emily,\n\nThank you for taking the time to leave this review! We're so glad your experience with Gather has been positive and inspired you to rate us as highly as you did.\n\nAny feedback you have as to how we can improve our service and turn 4-star reviews like yours into 5-star reviews would be immensely helpful! Feel free to give us a call at (360)474-7845 or email us at gatherbellingham@achliving.com.\n\nThank you again!"
        }
      },
      {
        "author": "Saad Almutairi",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Saad,\n\nI want to thank you for leaving this review. We are always looking for feedback from our community, and we love opportunities to learn and grow.\n\nPlease let us know what we can do to prevent you and others from having any more negative experiences with Gather. We are happy to listen to anything you have to say.\n\nYou can reach us directly at (360)474-7845 and via email at GatherBellingham@achliving.com.\n\nThank you!"
        }
      },
      {
        "author": "Robinson Paulino",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Robinson,\n\nThank you so much for the FIVE STARS! It really means a lot to us here at Gather Bellingham. We appreciate the time you took to rate us.\n\nHave an awesome day!\n\nGather Bellingham\ngatherbellingham@achliivng.com\n360-474-7845"
        }
      },
      {
        "author": "CharLee Bethje",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello CharLee! Thanks for the four stars, you rock! Let us know how we can make that five stars. We love to get feedback to we can make Gather Bellingham even better for our residents.\n\nHappy Holidays!\n\nGather Bellingham\n360-474-7845\ngatherbellingham@achliving.com"
        }
      },
      {
        "author": "Johnny Stephens",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for your review. Resident satisfaction is very important to us so your review made our day!!! Please let us know if there is anything we can do to help you continue to enjoy your home. (360)474-7845GatherBellinghamgatherliving.com/gather-bellingham/"
        }
      },
      {
        "author": "Season Rovang",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We really appreciate you taking the time to leave this positive review! Your time is valuable and you spent some of that time to compliment us  THANK YOU SO MUCH! Give us a call or send us an email if you have any helpful feedback! (360)474-7845GatherBellingham@achliving.comgatherliving.com/gather-bellingham/"
        }
      },
      {
        "author": "Kaylee Smith",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "We're so sorry you've had a negative experience with Gather Bellingham. Whether you are a dissatisfied resident or were otherwise discouraged from renting with us, we would love to hear from you about how we could improve our service. Please give us a call or send us an email.(360)474-7845GatherBellingham@achliving.comGatherBellingham.com"
        }
      },
      {
        "author": "Jesse Diemert",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Few things make us happier than satisfied residents! We are so pleased that you spent some of your valuable time with this review. Please let us know if there is anything you need to continue to love your home! (360)474-7845GatherBellingham@achliving.comGatherBellingham.com"
        }
      },
      {
        "author": "Hannah Beasley",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We really appreciate you taking the time to leave this positive review! Your time is valuable and you spent some of that time to compliment us  THANK YOU SO MUCH! Let us know what we can do to keep you happy! We can be reached via Phone at 360-474-7845 or via email at gatherbellingham@achliving.com."
        }
      },
      {
        "author": "Santiago Lopez",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We really appreciate you taking the time to leave this positive review! Your time is valuable and you spent some of that time to compliment us  THANK YOU SO MUCH! Let us know what we can do to keep you happy!"
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Branden W.",
        "rating": 1,
        "review": "This place sucks every is broken and the never fix anything, our door lock has not work for almost a year and they were not able to fix it, all the exit signs are broken and there is hardly fire extinguishers, there are holes in the walls and the game room has been closed for like two years off and on, the rent is to high for the experience you get living here...",
        "ownerResponse": null
      },
      {
        "author": "Doug B.",
        "rating": 1,
        "review": "Please read the following post before renting an apartment at The Elevate.\n\nMy son has lived here for a couple of years now.  Recently, the batteries went dead on the electronic lock on his door so he was unable to lock his door.  He notified the management that he could not secure his apartment (studio) and that he was basically stuck at home there until maintenance could fix his door lock.\n\nThe management sent the maintenance guy down who told him that they could change the batteries out but didn't have the computer program to re-program the locks (computers with program on them stolen evidently) so his apartment would remain unlockable.  This was on a Thursday.  My son went back on Friday.  No resolution, no plan, no repair just lots of excuses to not repair door.  No urgency, no apparent desire to solve the problem before the weekend. Entire weekend then stuck in an unlockable apartment.  My son missed his weekend at work because he could not lock his door and leave and subsequently missed out on a couple hundred dollars of pay.\n\nMonday, same song and dance.  Run around from management.  Calls to regional manager who wouldn't answer phone and apparently would not authorize the placement of a simple mechanical lock on the door. \n\nOn Tuesday I got involved and called asking to talk to the manager.  She was pleasant but said her hands were tied.  I requested to talk to regional manager and got his number.  Based out of Arizona, he would not answer my calls or return my calls.  Several attempts but no contact and zero customer service.  I asked the building manager if they could at least put a standard mechanical lock on the door so he could lock his apartment and attend class. More run around, no resolution.\n\nFinally on Wednesday, we heard they were going to fix the lock sometime between 10am and 2pm.  My son went to class expecting the problem to be resolved.  Came back from class-door lock still broken.\n\nThursday, one week from door lock problem the maintenance guy came back out and put a mechanical door lock on his door which is what should have been done on day one. \n\nSo, what is your time worth?  What value do you put on expecting that your apartment is going to be lockable and secure?  What value do you put on your belongings?  Your computer and personal items?  What does it feel like to be sequestered in your room because the management would not authorize a door lock for your apartment? (a really simple and inexpensive fix)  What kind of obligation do you feel toward your employer and the job that you have?  What dollar value do you think this should impact rent?\n\nPlease remember that Elevate is a private for profit business that recognizes that students are transitory and likely will only live there for a year or two.\nTaking care of their residents does not appear to be a priority in any shape or form.  Please take this into consideration before renting an apartment here.\n\nDoug S",
        "ownerResponse": null
      },
      {
        "author": "Erika S.",
        "rating": 1,
        "review": "Guess what? People moved out in August 31st and didn't get their security deposit back. I guess I'll be filling a claim in court because they aren't even calling me back to give me a reason why it's taking so long.",
        "ownerResponse": null
      },
      {
        "author": "Kristine P.",
        "rating": 1,
        "review": "Our daughter moved out in August and has been trying to get her deposit back since then. Don't rent here!!  They don't respond when there's anything broken. They don't respond when you ask for your deposit. Just look at the responses on this page - they only respond to positive reviews. Very sad. I hope all renters get together and take them to court over deposit issues.",
        "ownerResponse": null
      },
      {
        "author": "Andrea W.",
        "rating": 2,
        "review": "For one bedroom in an apartment with 3 other roommates the cost is too high. Most amenities were not available while I lived here, there was no change to rent and the company withdrew their offer for reduced rent with proof of good grades. \nThe staff seems to do their best but were ill-equipped for the maintenance necessary for the building. The only elevator to the non-reserved parking garage is frequently in disrepair including on move-in day, forcing residents to walk up 3-7 flights of stairs to access their apartment (folks with ability impairments too!) \nNeighbors within the building are often inconsiderate in 3 ways: 1) noise penetrates the walls, floor and ceiling so there is potential disruption from any and all directions making studying from home a challenge. 2) messes in the trash room, hallway, parking garage and other common areas are constant. The 6th floor entrance is frequently soaked in dog urine. 3) many residents (and staff) don't follow COVID guidelines regarding large gatherings and wearing masks. \nYes this apartment has conveniences but there are also many drawbacks.",
        "ownerResponse": null
      },
      {
        "author": "Julia G.",
        "rating": 1,
        "review": "Too expensive, especially considering they never fix anything. There has been a door into the mail room that has been broken for six months and they just haven't bothered to fix it. There was an alarm that was going off for about a week in the basement that I honestly don't know what was for but it wasn't life threatening so idk why they never shut it off. They also stopped sending notifications for when you get packages (which btw is annoying that the hours to pick them up are really limited) at one point without telling anyone they would and my roommate needed her meds but had to go a few days without them since she didn't know they were here... the trash room is always a disaster, the dishwasher is unreliable, and the vibe is like a hotel dorm situation. That being said dorms are usually more maintained. To be fair everyone that worked in the office quit on the same day so I can see why for a while the maintenance was worse than normal but then you have to question why everyone quit. Also the certification for the elevator expired, and it was down for a hot minute so not good for accessibility reasons AT ALL. This complex is located on a street that a ton of party houses are on so I hope you like noise and fireworks at 2am. Also just cars are loud and frequent. The walls are super thin though so everything is loud. \nNow I know covid made things difficult and that's fair, but the amenities were down for the majority of the time and they never did anything to make up for it (such as a refund for amenity fees as an example) \nIf you're thinking about moving to bham, especially as a student, just get a house, it's roughly half the cost per month if you can get some good roommates (and it's easier to avoid them in a house if they are bad so...)\nIt seemed like a good decision when we signed the lease, but that wasn't the case.  Covid did screw some stuff up and it probably would have been better without it and they might have gotten a higher rating from me, but they handled it poorly, it's like they gave up on everything, and they it really hard to get of the lease so I know people that never set foot in here and still paid full price the whole time. \nTLDR; they need to Elevate their standards",
        "ownerResponse": null
      },
      {
        "author": "Gina A.",
        "rating": 1,
        "review": "My daughter moved out of Elevate August 2021. I co signed on her lease, and they asked for a 2,400 dollar deposit. She was going to move back to Oregon, and needed the deposit for another apt. They said it would get to her soon. We communicated with Veronica in the office weekly for awhile. She was always nice and answered our questions. The weeks turned into months, and still nothing. They would tell her to tell us it in was in the mail. The employees at Elevate were always nice and helpful, but management was not. We decided to take them to court at one year, and just served them papers. We were angry at how management brushed us off, and asked for what we thought was fair. It's the day before court day14 months later, and they agree today. Elevate was   not at fault in this matter and Veronica the office mgr. is a very nice person! It's just too bad we had to go that far just to get our money back.",
        "ownerResponse": null
      },
      {
        "author": "Lori G.",
        "rating": 1,
        "review": "TERRIBLE communication regarding anything.  My daughter moved out 8/31/2021 and we have yet to receive her security deposit.  We've reached out and they have nothing to say except it'll come eventually.  It's been over two months which is over the allowance by law.",
        "ownerResponse": null
      },
      {
        "author": "John S.",
        "rating": 1,
        "review": "BEWARE! This management company will take every penny they can get from you, no matter the circumstance.  Be very aware of what you are signing!\nOur friend's son had to leave school and his apartment to return to Seattle for treatment of cancer.  Our friends found a new renter to take over the lease but the management company refused and are holding our friends responsible for the remaining rent.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 124,
  "adjusted_average_rating": 3.56,
  "summary": "<article class='review-summary'>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>This article has been created by ChatGPT, summarizing user reviews to aid potential clients in evaluating local property management companies. It is not an exhaustive report, and the sentiments and specific examples cited reflect only the opinions of individuals who wrote the reviews, without confirmation or endorsement of their claims. The purpose of this article is to serve as a tool for those seeking information about Elevate Bellingham and should not be the sole factor in making a decision regarding property management services.</p>  </section>  <section>    <heading>      <h2>Good</h2>    </heading>    <p>Several user reviews reveal areas where Elevate Bellingham property management excels. Tenants have praised the location for its proximity to campus and downtown, appreciating the convenience this offers. The quality of appliances within the apartments has also been complimented, suggesting that they function well and enhance the living experience. The property is known to host a variety of events and giveaways, creating a vibrant community atmosphere that many residents enjoy.</p>    <p>In addition to this, the maintenance staff receives significant adoration from tenants for their prompt and efficient handling of service requests. Whether it's quickly restoring power to a dishwasher, fixing garage disposal issues, or courteously interacting with residents, the maintenance crew is seen as an asset to the property and essential in maintaining its operability and appeal.</p>  </section>  <section>    <heading>      <h2>Great</h2>    </heading>    <p>The level of tenant engagement and the amenity offerings at Elevate Bellingham come across as notable positives in user reviews. Specifically, the fitness room, study lounges, and the top-floor deck with its panorama of downtown have been highlighted as standout features. The pet-friendly policy is also a boon for animal-loving residents, allowing for a more inclusive and homey environment.</p>    <p>Furthermore, some reviews applaud the quick turnaround times for maintenance requests, noting that the maintenance team excels at resolving issues effectively, with responses generally seen within the same day. The addition of certain amenities, such as well-lit areas for added security and the availability of furnished units, have also been cited, reflecting that the management responds to feedback and continuously works on improving the resident experience.</p>  </section>  <section>    <heading>      <h2>Bad</h2>    </heading>    <p>The bad aspects of Elevate Bellingham are well-documented in several user reviews, with a common theme being the delay in returning security deposits to former tenants. Reports suggest a tendency towards slow communications and a lack of urgency in processing these returns, leading to frustration and even legal action. Additionally, some reviewers mention that while the apartments look attractive, they are furnished with cheap materials, leaving residents dissatisfied with the quality, given the high cost of the rent.</p>    <p>Another problematic area is tenant security concerns, as some reviews recount experiences of cars being vandalized within the garage and trespassers on the property. This has led to a call for improvements in security measures, such as the installation of a gate, which the company has reportedly been reluctant to address due to cost considerations. Moreover, noise complaints and the handling of maintenance issues have also been cited as areas where the company's performance does not meet expectations.</p>  </section>  <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>In the realm of the truly alarming, user reviews speak to instances of profoundly inadequate management practices at Elevate Bellingham. Disturbing accounts of management entering apartments without notice, violating lease terms, and not addressing crucial facility problems like broken security cameras and faulty locks add to the perception of oversight and neglect. Such disregard for standard property management protocols and resident privacy cast the company in a decidedly negative light.</p>    <p>To compound these issues, the property has faced ourtright accusations of audacious behavior—ranging from extreme neglect that contributes to an unsafe living environment to exploiting legal loopholes at the residents' expense. The lack of basic cleanliness in certain communal areas, such as fitness rooms and hallways, not to mention the mismanagement of facilities and delayed maintenance, reflects a problematic disregard for tenant welfare. Overall, patterns of neglect, poor customer service, and failure to fulfill promised amenities contribute to a stressful and unsatisfactory living experience for numerous tenants.</p>  </section></article>"
}