{
  "name": "Elite Association Management",
  "slug": "elite-association-management",
  "company_type": "company",
  "address": "1313 E Maple St Ste 209 Bellingham, WA 98225",
  "review_count": 3,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "John B.",
        "rating": 1,
        "review": "Unprofessional and incredibly slow. You can expect up to a week to get a response and if you call their emergency number you will get taken to a full voicemail inbox.\n\nThey will purposely ignore your urgent mail and delay. Their employees are snarky, rude and WILL use slurs. \n\nI for one, would rather have my nails pulled out than interact with this company in any capacity ever again.",
        "ownerResponse": null
      },
      {
        "author": "Diana J.",
        "rating": 1,
        "review": "Run!   Terrible business ethics and unprofessional.  Our HOA is seriously considering taking Elite to small claims court. They paid themselves for services at the beginning of the last two contract months and did not perform the work.   Did not like the newly elected board members and refused to work with them.   Not much positive to say.  We will be writing to the Better Business Bureau so that other HOAs do have to go down the road we did.",
        "ownerResponse": null
      },
      {
        "author": "Tom A.",
        "rating": 1,
        "review": "This is the worst HOA management service company I have ever had to deal with. Judith Hamner is one of the most unprofessional personalities I have yet to come across. She doesn't respond to any calls, requests, emails or messages unless it's convenient for her. She accomplishes absolutely nothing and doesn't work well with homeowners nothing about the matter you bring to her attention gets done. She has a horrible attitude and not only can you hear it in her somewhat rude inadequate tone, but you can also feel her lack of respect and concern through the way she carries herself. I would never recommend this \"community association specialist\" company to anyone. Judith Hamner is a horrible management administrator and a waste of time, money and effort. . \"If you're in a self-managed association looking to relieve board members from endless administrative duties, if your association needs a change in management, if you're planning a new community development -- you can expect the very best service from us.\" This quote and expectation taken directly from their website is false, inaccurate and should be heeded as services they DO NOT provide. Let me save you time and a headache and suggest you look elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 1.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>Despite the critical nature of the reviews, this article's intent is to present a balanced view of Elite Association Management. In the user reviews available, there are not enough positive detailed experiences shared to construct a \"Good\" section that accurately reflects the sentiments of the reviewers. It is essential to consider that reviews online can be biased towards negative experiences, and not all clients may share positive encounters.</p></section><section><h2>Great</h2><p>As mentioned in the \"Good\" section, the lack of detailed favorable reviews makes it challenging to create a \"Great\" subsection for Elite Association Management. Customers who have potentially had satisfactory interactions with the company may not have contributed their stories to the pool of online user reviews, which does not allow for a representation of exemplary traits or instances where the company may have exceeded expectations.</p></section><section><h2>Bad</h2><p>User reviews consistently reveal a troubling pattern of unprofessional behaviors and slow response times at Elite Association Management. Customers have reported experiencing up to a week of delay before receiving responses, even when resort shorting to the company's emergency contact number, only to find a full voicemail inbox. Additionally, reviews indicate a concerning scenario where employees have been described as snarky and rude.</p><p>The sentiment of frustration continues with reports that the company appears to ignore urgent communication from clients and allegedly uses inappropriate language. These are serious claims that, if true, betray a significant neglect of professional standards and duty of care expected from a property management company. The lack of positive engagement in the user reviews suggests these are not isolated incidents, and a common theme emerges of consistently poor conduct.</p></section><section><h2>Ugly</h2><p>Decking even deeper into dissatisfaction, some homeowners have experienced such negative dealings with Elite Association Management that they are considering legal action. The company has been accused of unethical practices, such as charging for services not rendered. Particularly, there are allegations against specific employees, like Judith Hamner, accused of being unprofessional and unresponsive to homeowners' needs and concerns. Such reviews paint a bleak picture of a company that falls dramatically short of its promise to provide the \"very best service\" as claimed on their website.</p><p>Furthermore, the unprofessional demeanor and attitude reported by users, including not collaborating with newly elected HOA board members and displaying a lack of respect, reflect poorly on the company's reputation. The gravity of these user experiences suggests a systemic issue with customer service and company ethics, strengthening the argument for prospective clients to exercise caution and consider alternative management services.</p></section>"
  }
}