{
  "name": "Elite Association Management Company",
  "slug": "elite-association-management-company",
  "company_type": "Company",
  "address": "1313 E Maple St Ste 209 Bellingham, WA 98225",
  "review_count": 37,
  "average_rating": 1.51,
  "reviews": {
    "google_reviews": [
      {
        "author": "Monique Mackson",
        "rating": 1,
        "review": "They should have a section where you give no stars because this HOA is the worst never did nothing for the community never respond or answer calls and I've been trying to contact them since last week and my title company been trying to contact them to finalize the sale of my house now I am on hold because nobody can reach HOA what kind of mess is this I still don't know why we was paying HOA fees because they never did nothing",
        "owner_response": null
      },
      {
        "author": "Ashleigh Oviedo",
        "rating": 1,
        "review": "The worst HOA in Houston. Incompetent and lazy people work here. They dont respond to emails or answer the phone. When they do answer they are nasty and dismissive. Dont expect to get help from them.",
        "owner_response": null
      },
      {
        "author": "Alexandria Watson",
        "rating": 1,
        "review": "I truly wish that I could give Texas Community Management 0 stars. They deem it an acceptable practice to tow vehicles of residents at their properties for no good reason and refuse to speak with them on the matter. My vehicle was towed after I parked in my assigned parking space. This is the second time this has happened. I was aware that management was having the parking spaces painted and that parking was restricted on July 24-25. I moved my vehicles so the spaces could be painted on July 24, and I moved them back because painting was complete by my building. MY VEHICLE WAS STILL TOWED AND NO ATTEMPT WAS MADE TO CONTACT ME. I attempted to speak with someone on this matter, but Jessica refused to speak with me. I do not understand this because I was able to speak with someone the last time my vehicle was wrongfully towed. She also proceeded to hang up when I asked if there was someone else I could speak to or a corporate office. That was very unsettling and very unprofessional. I would advise any and everyone against dealing with Texas Community Management.",
        "owner_response": null
      },
      {
        "author": "Fayeza Khan",
        "rating": 1,
        "review": "I live in Great Oaks South subdivision and i don't see what the HOA does for this community. We purchased a house here and I had to follow up with them 3 months in a row before they just sent me an invoice. No welcome newsletter or information just an invoice. I notice there are cars parked on the front yard grass, people have broken fences, there's absolutely no landscaping anywhere or trees for HOA to maintain.  So I'm not sure what my money is going towards. Noone ever answers when I call or returns my calls. How does one go on about changing this HOA because this is literally us throwing money in garbage ...",
        "owner_response": null
      },
      {
        "author": "Thomas F",
        "rating": 1,
        "review": "Dishonest Crooks. Staff here refuses to offer even their First name in any interactions, attempted fraud and unethical dishonest billing practices, they attempt to create lien illegally without notifying, make zero attempt to collect a debt 1 single time prior to attempting to file fraudulent lien, Vastly incorrect amounts and refuse to break down explanation of any amount, will not stand up in court. absolute fraud and dishonest harassment.  Actively Taking them to court",
        "owner_response": null
      },
      {
        "author": "Jacquelyn Guilbeaux",
        "rating": 1,
        "review": "This is the worst management company ever! They no longer have a website where you can check your statements or make payments if that tells you anything. 10 years in my neighborhood they have made no attempt to have an actual meeting for our hoa, as well as stating there is a board of directors when none actually exists so they are falsely representing information to the homeowners. They illegally posted private documents on front doors throughout the neighborhood. The \"case manager\" Patricia is inefficient & incompetent if she is ever in the office she never knows what is going on. To get any information the secretary is more helpful! The owner of the company was at one time in charge of my neighborhood & sent out a letter that clearly showed he didn't even know the bylaws of our hoa. The accounting department is unorganized & incompetent just like the rest of them. The only thing this company seems interested in doing is collecting dues. They also can't manage the financials efficiently for any neighborhood improvement. Other than that you could get better management from a potted plant.",
        "owner_response": null
      },
      {
        "author": "carol coleman",
        "rating": 1,
        "review": "My granddaughter lives in my my town home Elite Association is the management company they had her car towed I had to pay $230.91 I asked why was it towed when I just purchased the car less than 5 days ago for my granddaughter and she didn't have time to put the stickers up in the car window the car was parked there no more than 6 or 7 hours because the house is being repaired at this time and they told me it was nothing they could do the car is in Coleman so they know this is a resident of the property which I own.  The next door nebor u s on the board and she was aware that this was a resident vehicle.",
        "owner_response": null
      },
      {
        "author": "Atinuke Aduke",
        "rating": 1,
        "review": "These are the \"rudest\" group of people I have ever had to make contact with. I did not get the usual notice for the annual mentainance  payment. I have come to their office location several times  , it is always locked with no sign of any serious office bussiness going on.  This makes it hard to drop a check at the door. It is 5pm , I am sitting in front of this \"office\" faustrated and  needing to make a payment.\nOh God please sent help from above. It is impossible to deal with these people. .",
        "owner_response": null
      },
      {
        "author": "sydney blankenship",
        "rating": 1,
        "review": "Worst company ever. Patricia is extremely rude and incompetent. Took her weeks to turn over documents, needed for a prospective buyer to close. Nearly lost the buyer. She is impossible to communicate with as well.   Wish I could give her 0 stars.",
        "owner_response": null
      },
      {
        "author": "Heather M",
        "rating": 1,
        "review": "I called to ask when the HoA meeting was and for details of an assessment.  They refused to tell me when the HoA meeting was for and said someone would call me back.  Needless to say, no return call.  They also said they have sent notices but I checked with neighbors and they have not received them and nor have I.  The person who answered the phone is dismissive and rude.",
        "owner_response": null
      },
      {
        "author": "Thuan Nguyen",
        "rating": 1,
        "review": "not sure who answered the phone but she is very rude. We requested statement for 2 weeks +  yet it took them forever to answer. Buyer could not get into their house because of missing docs.",
        "owner_response": null
      },
      {
        "author": "William Tong",
        "rating": 1,
        "review": "I was incorrectly billed hundreds of dollars by the HOA and it has still not been resolved over a year later! Little to no response after months of calling and emailing. Who runs a business like this? Shameful...",
        "owner_response": null
      },
      {
        "author": "brian cureton",
        "rating": 5,
        "review": "Very professional company. I needed questions answered about what we can and can not add to my house. They explained everything I needed and offered some suggestions that would raise my property value.",
        "owner_response": null
      },
      {
        "author": "Noel Gonzalez",
        "rating": 1,
        "review": "Patricia was very rude she stated she never received closing papers, when her office had already cashed checks.  She needs training on how to talk to people.",
        "owner_response": null
      },
      {
        "author": "Zatiah Moore",
        "rating": 4,
        "review": "I was able to quickly get my association's documents after closing on my new house and my questions answered during my first call to the office. Really appreciated the kindness.",
        "owner_response": null
      },
      {
        "author": "David Okoko",
        "rating": 1,
        "review": "The office manager Patricia is extremely rude and her staff is inexperienced. They will give you the run around when it comes to making installations on rental properties.",
        "owner_response": null
      },
      {
        "author": "star lol",
        "rating": 1,
        "review": "it remiinds me of old west movies where the powerful master takes over your propety for pennies for a delay of de 30 dollars",
        "owner_response": null
      },
      {
        "author": "Diverse G",
        "rating": 1,
        "review": "Only interested in there money and not the community at all. These guys do not clean or presure wash the community lowering home values. The do not have working camras either.",
        "owner_response": null
      },
      {
        "author": "Mark Gordon",
        "rating": 1,
        "review": "Dishonest crooks and complete liars. 1.7 stars is way too high of rating of this shady company",
        "owner_response": null
      },
      {
        "author": "Diane Niyo",
        "rating": 1,
        "review": "Bad company they dont care about the property owners. Everything about them is bad all they care is their money",
        "owner_response": null
      },
      {
        "author": "Lacy Barns",
        "rating": 1,
        "review": "This place is absolutely crooked! They keep reincorporating to by pass the law.",
        "owner_response": null
      },
      {
        "author": "Nina Thornton",
        "rating": 1,
        "review": "Patricia is extremely rude!!! Very poor customer service. Period!",
        "owner_response": null
      },
      {
        "author": "Houston Homes & Real Estate",
        "rating": 1,
        "review": "Would avoid at all costs.",
        "owner_response": null
      },
      {
        "author": "Bertram Garner",
        "rating": 5,
        "review": "Excellent relationship with HOA.",
        "owner_response": null
      },
      {
        "author": "Cristian Lopez",
        "rating": 1,
        "review": "Organization very questionable",
        "owner_response": null
      },
      {
        "author": "Jacqueline Johnson",
        "rating": 1,
        "review": "Is not a good management company.",
        "owner_response": null
      },
      {
        "author": "Nghi Nguyen",
        "rating": 5,
        "review": "great customer service",
        "owner_response": null
      },
      {
        "author": "Hong X",
        "rating": 1,
        "review": "This is a criminal group",
        "owner_response": null
      },
      {
        "author": "Al Hernandez",
        "rating": 1,
        "review": "nothing professional",
        "owner_response": null
      },
      {
        "author": "alicia montalvan",
        "rating": 1,
        "review": "Terrible association!!!!!",
        "owner_response": null
      },
      {
        "author": "gustavo rubio",
        "rating": 1,
        "review": "It has terrible service and a terrible education. I went to visit a friend and they damaged my truck and when I dialed they never answered. I got tired of dialing and when they finally answered, a woman answered reluctantly and very despotic and rude and did not help me. solve nothing he didn't care about my problem they are the worst the worst service and terrible kindness he treated me as if I had done it the worst",
        "owner_response": null
      },
      {
        "author": "Meena Patel",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Matgarits Mendes",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Ana Angeles",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jessica Loving",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Rute Tesfay",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Debberiel McKinnie",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 31,
  "adjusted_average_rating": 1.48,
  "distribution": {
    "1": 32,
    "2": 0,
    "3": 0,
    "4": 1,
    "5": 4
  },
  "summary": {
    "created_timestamp": 1739205438,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite the largely negative feedback, there are a few user reviews highlighting positive encounters with Elite Association Management Company. One user noted a professional experience, where the company's representatives provided valuable suggestions for home improvements that increased property value. This indicates instances where the company excels in customer relations by offering insightful advice to homeowners.</p><p>Another user expressed appreciation for the quick and efficient service they received from Elite Association Management Company. This user was pleased with how swiftly they obtained their association's documents and had their questions answered promptly. Such feedback suggests that while rare, there are occasions when the company delivers commendable service to its clients.</p></section><section id=\"great\"><h2>Great</h2><p>Elite Association Management Company receives praise from users who describe experiences of excellent customer service and smooth management operations. The ability to build strong relationships with homeowners is noted as a highlight, with users expressing satisfaction over professional interactions and willingness to address needs effectively. This suggests that when the service works, it works very well.</p><p>Another instance of exceptional service is highlighted by users who could not only get their queries answered immediately but also received comprehensive explanations regarding property enhancements. Such positive reviews, although few, underline the company's potential in providing valuable and beneficial homeowner support when the right approach is taken by their staff.</p></section><section id=\"bad\"><h2>Bad</h2><p>Elite Association Management Company faces criticism for its lack of responsiveness and communication failures, as highlighted in multiple user reviews. Customers express frustration over unanswered calls and emails, illustrating a frequent inability to reach the company for urgent matters. This communication gap raises concerns among homeowners regarding the company's reliability in managing their properties.</p><p>Further feedback points to issues with billing inaccuracies and failure to resolve financial disputes. Users recount long periods of unresolved billing errors and difficulties in obtaining transparent explanations from the company. Such concerns suggest possible inefficiencies within the company's administrative processes that negatively affect the overall customer experience.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most severe grievances against Elite Association Management Company include accusations of unethical behavior and misconduct. One user reported being charged unjustly and facing threats of illegal lien filings without prior communication. Such situations indicate deep-rooted issues in the company's operational transparency and ethical standards.</p><p>Further darkening the company's reputation are experiences involving staff rudeness and unprofessionalism. Multiple user reviews describe instances of hostile interactions with staff, particularly a case manager known for being dismissive and uncooperative. Reports of towing resident vehicles without due cause add to the narrative of a management entity acting without accountability, severely undermining homeowner trust.</p></section>"
  }
}