{
  "name": "Elite Association Management",
  "slug": "elite-association-management",
  "company_type": "company",
  "address": "1313 E Maple St Ste 209 Bellingham, WA 98225",
  "review_count": 3,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "John B.",
        "rating": 1,
        "review": "Unprofessional and incredibly slow. You can expect up to a week to get a response and if you call their emergency number you will get taken to a full voicemail inbox.\n\nThey will purposely ignore your urgent mail and delay. Their employees are snarky, rude and WILL use slurs. \n\nI for one, would rather have my nails pulled out than interact with this company in any capacity ever again.",
        "ownerResponse": null
      },
      {
        "author": "Diana J.",
        "rating": 1,
        "review": "Run!   Terrible business ethics and unprofessional.  Our HOA is seriously considering taking Elite to small claims court. They paid themselves for services at the beginning of the last two contract months and did not perform the work.   Did not like the newly elected board members and refused to work with them.   Not much positive to say.  We will be writing to the Better Business Bureau so that other HOAs do have to go down the road we did.",
        "ownerResponse": null
      },
      {
        "author": "Tom A.",
        "rating": 1,
        "review": "This is the worst HOA management service company I have ever had to deal with. Judith Hamner is one of the most unprofessional personalities I have yet to come across. She doesn't respond to any calls, requests, emails or messages unless it's convenient for her. She accomplishes absolutely nothing and doesn't work well with homeowners nothing about the matter you bring to her attention gets done. She has a horrible attitude and not only can you hear it in her somewhat rude inadequate tone, but you can also feel her lack of respect and concern through the way she carries herself. I would never recommend this \"community association specialist\" company to anyone. Judith Hamner is a horrible management administrator and a waste of time, money and effort. . \"If you're in a self-managed association looking to relieve board members from endless administrative duties, if your association needs a change in management, if you're planning a new community development -- you can expect the very best service from us.\" This quote and expectation taken directly from their website is false, inaccurate and should be heeded as services they DO NOT provide. Let me save you time and a headache and suggest you look elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 1.0,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is an informational summary generated by ChatGPT, based on user reviews of Elite Association Management. It is intended to be a tool to help individuals in their decision-making process when seeking a property management company or rental property. Please note that this summary does not reflect the views of Elite Association Management, nor does it aim to provide a comprehensive analysis of the company's service quality. The user reviews are the primary source for this article's content, and no direct interaction with Elite Association Management has been conducted to create this summary.</p>  </section>  <section>    <heading><h2>Good</h2></heading>    <p>As per the user reviews, it appears that there is a limited number of positive experiences shared by clients of Elite Association Management. Due to the nature of the user reviews provided, concrete examples of good service are not readily identified. There could be instances where expectations were met without incident, but these have not been highlighted in the user reviews available.</p>    <p>A possible upside could be identified in the domain where the company might have had engagements or transactions that went unnoticed due to their adequacy or satisfactory outcomes, thus not prompting reviews. Given the absence of positive user reviews, it is challenging to accurately describe what Elite Association Management has done well in these cases.</p>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>Within the set of user reviews, the sentiment of the section \"Great\" lacks representation, as the provided user reviews do not shed light on any outstanding experiences. Any excellent service elements, such as exceptional customer care, successful project completions, or above-and-beyond performance, are not mentioned in the reviews.</p>    <p>The absence of comments celebrating particularly well-managed properties, timely responses, or commendable communication suggests that these areas may not reflect the experiences of the reviewers. However, without explicit user reviews to the contrary, it cannot be definitively concluded that such instances do not occur with other customers of Elite Association Management.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>According to the user reviews, Elite Association Management has fallen short in several areas, adversely affecting customer satisfaction. Reviewers have cited significant delays in response times, taking up to a week to respond to inquiries, with an emergency contact line leading to a full voicemail inbox. Additionally, there is mention of unprofessional conduct amongst employees, with reports of rude and snarky interactions.</p>    <p>Clients also reported instances where urgent communications were purportedly ignored or delayed. Furthermore, there are complaints regarding the handling of contractual duties, with one reviewer mentioning an avoidance of work with newly elected board members and a failure to perform paid services. These testimonies reflect a pattern of negligence and unprofessionalism in the company's operations.</p>  </section>  <subsection>    <heading><h2>Ugly</h2></heading>    <p>The \"Ugly\" aspect of Elite Association Management highlights severe dissatisfaction in their management services. A user has expressed that dealing with a particular staff member was one of the most unprofessional experiences they've encountered. The user described a lack of responsiveness to phone calls, emails, and requests, alongside an apparently disrespectful attitude emanating from this staff member.</p>    <p>Another detrimental issue reported involves the company's integrity with respect to their own advertised promises. One user review bluntly states that the company's claims of exemplary service on their website are misleading, based on the lack of substantial support and co-operation with homeowners. This discrepancy between the advertised and delivered services is a critical area of concern for potential clients, according to the user reviews.</p>  </subsection></article>"
}