{
  "name": "Elwood Edge Apartments",
  "slug": "elwood-edge-apartments",
  "company_type": "property",
  "address": "3815 Elwood Ave, Bellingham, WA 98229",
  "review_count": 12,
  "average_rating": 1.58,
  "reviews": {
    "google_reviews": [
      {
        "author": "Kendra Smith",
        "rating": 1.0,
        "review": "This building is clearly built poorly, lots of things have broken down. For example:\n-The elevator has broken multiple times and trapped people inside, also its operating certificate has been expired for almost a year.\n-the first floor flooded due to poor drainage in the courtyard, which also causes the water to leak into the parking garage underneath and form a huge puddle every-time it rains, which cant be safe.\n-Also, the siding of our building was falling off earlier and they had to fix them, mind you this happened within a year of the building being built.\n-the garage door will malfunction sometimes and close on your car\n-The building is also not very well maintained and the hallways can get dirty, especially with the construction going on outside.\n-The construction will also wake you up every morning at 7am besides sundays.\n\nThe management is also not very responsive, they also raised our rents to which it will now be over $2000 to rent a 1bed, which is the same amount you can get other 2 bedrooms apartments downtown.\n\nThe only positive to the building is the modern look and appliances, but definitely not worth when you consider all the negatives and the rent increase.\n\nWould not recommend!",
        "ownerResponse": null
      },
      {
        "author": "Alia Grey",
        "rating": 1.0,
        "review": "I loved living there, at first. I had my own space and it was my first apartment. However, the property wasnt great. Construction was really loud and constant, they cut all the greenery on the property. People who parked on the property would get nails in their tires with no reimbursement. There was no guest parking, and I was on the parking waitlist for nearly 8 months with no response. People who parked on the street adjacent to the property had their windows smashed and stuff stolen, and it happened more than once to the same people. Packages inside the property are also broken into and stolen constantly, and nothing is done. The fire alarm would go off constantly, which was really distressing as I lived with animals I had to evacuate with. The first floor floods during heavy rainfall. Now theyre raising prices by $300+ to a place thats already overpriced, making it completely unaffordable and definitely not worth it. I do not recommend living here as a college student. The parking situation was the worst part, for me, and I can imagine its going to be even worse with 2 more new buildings crammed in such a small space. Ill rapid fire a few other issues: mice in the fitness room, trash piled up in the dumpster area, some of the parking spaces are impossible to get into.",
        "ownerResponse": null
      },
      {
        "author": "Connor Mickel",
        "rating": 1.0,
        "review": "Stolen packages in the mail room, waking up daily to construction, garbage in utter chaos. All of this was alright until they increased the entire building's rent by over 500$, more than a third of what most of us were paying after we got \"new management.\"\n\nNew management has been horrendous to contact for so much as a door latching as these apartments were put together in such a rush I'm pretty sure any amateur could outperform. It took multiple weeks for a response to a maintenance issue and even more time for the problem to be resolved. I fear retaliation as the contract we all signed had all sorts of hidden fees making it a minefield to simply live here.\n\nThe contract we signed originally was outrageous however the initial price of the apartment kept it somewhat reasonable. If you come and tour an apartment I implore you to try opening and shutting every door and cabinet before you sign as you will be fined damages if you find out afterward.\n\nI'm pretty sure the security outside a run down gas station is more advanced that the one camera we have watching the entirety of the mail room. It is a common occurrence for mail to be stolen out of it. I had my prescription stolen outright and once again no one to contact with an entire \"Mail your home at your own risk\" deal.\n\nWe have been completely taken advantage of when many were first time renters and had no idea we would have our apartments bought and played with by an investor gambling with lives.\n\nDon't make the same mistake as the rest of us. Although, I'm still not sure where we went wrong.",
        "ownerResponse": null
      },
      {
        "author": "Faith Graf",
        "rating": 2.0,
        "review": "Although the apartment is modern and new, its downfalls often make me question the overall living experience. After being a resident for two years, I can say that the units themselves are nice, but everything else weighs negatively on the overall experience. There is constant construction leaving nails in the parking lot, trucks blocking the driveway, and terrible views (not to mention the non-stop and unbearable noise!!). The mail room and parking garages have had countless break-ins and theft due to lack of cameras and security. The elevator has failed (and reportedly dropped) multiple times. The fire alarms frequently go off, forcing residents to evacuate at all hours of the day and night. The bottom floor has flooded more than once due to poor design of the courtyard. There is absolutely NO options for visitor parking. The cleaning is inconsistent, leaving a filthy elevator and dirty carpets in entrances and all floors of the building. There is no A/C, which makes the summer heat miserable. Often times, there is a lack of response and timeliness from management for any inquiry. There is plenty of noise from upstairs neighbors (and I have lived in two different units). Ultimately, the greatest dealbreaker is the price, which was raised nearly $600 in ONE year (increase by roughly a 1/3!). That cannot be understated as an issue, especially with all of the problems residents have dealt with. I have enjoyed the apartment for its updated quarters and its location, which is absolutely credible, however, I feel that prospective tenants should be aware of all factors when considering potential residence. At the end of the day, its up to you to decide the pros vs. cons!",
        "ownerResponse": null
      },
      {
        "author": "Trinity Kaeding",
        "rating": 3.0,
        "review": "It is a nice place but very overpriced. We also were told there wouldn't be construction while living here and instead have been woken up pretty much every morning since moving here by sunrise by heavy machinery. I was unable to do many classes here due to noise. There is also no parking available (no guest parking at all) and I have to park a 7 minute walk away where cars are frequently broken Into. Also no AC so summers of the fourth floor whyere deadly haha!\n\nThe apartment is nice though and the washer and dryer are a life saver. The location is AMAZING. The neighbors are very nice and the sound proofing is great! There is a good amount of storage space, however for the price it's a small space and can feel cramped with any more than two people. Not really college student friendly due to price, lack of parking and noise.",
        "ownerResponse": null
      },
      {
        "author": "Xin F",
        "rating": 1.0,
        "review": "Poorly built. It looks nice in pictures but many things are built poorly. Many of the doors didn't latch and it'd not worth $2200. You get woken up by construction very early and everyday minus sunday, no guest parking or any free parking, very thin walls, everything is cheaply made, fire alarms going off a lot. You can hear other people talking who are one floor above you.",
        "ownerResponse": null
      },
      {
        "author": "Jayda Libadisos",
        "rating": 1.0,
        "review": "To put it simply, this place is the perfect example of \"don't judge a book by its cover.\"\nAdmittedly, there are pros, such as: the newness of the building (updated appliances and modern style of architecture), having lovely neighbors, solid pet policy, and convenience of location... but these fall short when considering the following:\n- The space itself can feel easily crowded (limited storage and cramped design)\n- There are issues in regards to the buildings mechanics, including (but not limited to) the parking garage and building entrance malfunctioning on multiple occasions, elevator operation concerns, fire alarm issues, the list goes on...\n- The construction is miserable and notorious for leaving nails scattered across the property\n- The cleanliness and condition of the building is poorly maintained (including the trash and recycling area!)\n- freezing during the winter and unbearable during heat waves\n- There's no guest parking\n- lots of stolen mail... \nAdditionally, the property management is near-impossible to  get in touch/problem solve with.\nWith all this in mind, it's important to note that the cost of renting here is astronomically high and unsustainable given these concerns. For perspective, some studios here cost more than/equal to other 1-2 bedroom places in town. Overall not very ideal",
        "ownerResponse": null
      },
      {
        "author": "Daniel Decker",
        "rating": 1.0,
        "review": "This place is a joke honestly,no guest parking, constant construction, fire alarms were going off frequently for awhile, the elevator has gone down often, the units were built poorly, management is useless. At 1500 dollars or more for a studio it's not worth it",
        "ownerResponse": null
      },
      {
        "author": "Maya Williams",
        "rating": 1.0,
        "review": "Nice building but they're trying to raise rent by $500 for next year, what a joke. Not to mention I've had nothing but problems with the management company. Don't live here its not worth it",
        "ownerResponse": null
      },
      {
        "author": "Megan Ditty",
        "rating": 1.0,
        "review": "No parking and terrible construction disturbances since we moved in 2 years ago!",
        "ownerResponse": null
      },
      {
        "author": "Kevin McGhee",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for your review! Let us know if there is anything we can do for you in the future!"
        }
      },
      {
        "author": "Samantha Farrand",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 10,
  "adjusted_average_rating": 1.3,
  "summary": {
    "text": "<section><h2>Good</h2><p>Elwood Edge Apartments boast modern aesthetics including updated appliances and contemporary architectural style, a feature that may attract residents looking for a stylish living space. Additionally, some residents report great soundproofing between units and emphasize the convenience of having amenities like in-unit washer and dryers. While the pet policy is appreciated, along with mentions of friendly neighbors, these positive aspects provide some degree of comfort amidst various concerns raised by residents.</p></section><section><h2>Great</h2><p>The article's intent is to also highlight the exceptional facets of Elwood Edge Apartments. The location has been praised as 'AMAZING' by a user, indicating a potentially strategic placement that residents find convenient. Furthermore, the building's pet policy is reportedly solid, which could be a significant factor for pet owners searching for accommodation. However, these are but brief oases of respite in what the majority of user reviews describe as a challenging living environment.</p></section><section><h2>Bad</h2><p>From user reviews, it is evident that Elwood Edge Apartments face a myriad of issues. Residents repeatedly mention problems related to building maintenance, such as the malfunctioning of elevators, frequent fire alarms, issues with doors not latching properly, and general cleanliness concerns. The property management's lack of timely responses to maintenance issues has compounded these frustrations, leading residents to feel neglected and undervalued.</p></section><section><h2>Ugly</h2><p>The most troubling concerns revolve around safety and cost. User reviews detail incidents of frequent thefts, including stolen packages from mail rooms and vehicle break-ins. The construction work associated with the property is also a source of distress, contributing to noise pollution and hazards like scattered nails. Moreover, the sharp increase in rent — with studios reportedly reaching over $1500 and a general hike by about $500 — is a source of significant discontent among the residents, raising questions about the value for money offered by Elwood Edge Apartments.</p></section>"
  }
}