{
  "name": "EMB Management",
  "slug": "emb-management",
  "company_type": "company",
  "address": "15301 NE 90th St Ste 170 Redmond, WA 98052",
  "review_count": 44,
  "average_rating": 1.59,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Liz C.",
        "rating": 1,
        "review": "I'd like to understand why an account paid in full on 12/27/2023 for 2024 dues of $430 due on 1/1/2024 is considered delinquent, incurring NSF fees (for EMB error), exorbitant processing fees for sending a letter, and interest fees on outstanding balance.  \n\nMy statement issued by EMBAssocia clearly shows a -0- balance on the account as of 1/1/2024.  Why then would EMB initiate a direct debit to our bank account for the $430 already paid? \n\nEMB has advised me strongly to pay the outstanding amount to prevent further issues and the fees billed are hard costs to them.  To date, they have not taken any responsibility for their billing error and are expecting us to pay for their mistake.     \n\nIrritated and frustrated yet hoping to get this resolved!\nForever an optimist!!",
        "ownerResponse": {
          "text": "Hello Liz,\n\nThank you for sharing your concern regarding your account. For reference, NSF fees are incurred when an owners payment is returned by the bank. Any returned payment does take time to reflect on an account, so while there may be a period where the payment is applied to the account, once the notice from the bank is received confirming that the payment has not cleared, that payment is reversed on the account. Further, Direct Debit is set up only at the written request of the owner and does pull the assessment amount each billing cycle. Should an owner wish to discontinue their Direct Debit, this would also require written request from the owner. Again, we are happy to help review your account specifically, so please email us directly at customerservice@embmanagement.com, so a member of our team can assist you.\nThank you."
        }
      },
      {
        "author": "Mondy V.",
        "rating": 2,
        "review": "The monthly meeting packet that EMB sends to our condo board is always titled \"ENGLISH POINT CONDOMINIUM,\" which is odd, since that isn't the name of our condominium. We've been told that this is \"a glitch in our server,\" that the problem can't be fixed, and \"Does that for all of our PDFs.\"\n\nNeedless to say, receiving a business report every month with the wrong title from a team who seems unwilling or unable to correct the problem does not inspire confidence. Requests to escalate the issue seem to have fallen on deaf ears. There are other issues as well. Clearly, our management company is not the A Team.",
        "ownerResponse": {
          "text": "Hello, thank you for your feedback. In reviewing I just want to clarify that the external PDF file name and the information within the PDF is for the correct community, however when opening the document the internal tab had a general community name. We have further reviewed this concern and were able to determine that this was an additional setting in the original template file during the save process that we have adjusted. Hopefully this has resolved your concern, however should you require further assistance please feel free to reach out to us directly at customerservice@embmanagement.com."
        }
      },
      {
        "author": "Tina N.",
        "rating": 1,
        "review": "Horrible management company, make a lot of mistakes, irresponsible on customer inquiry. I sent my HOA check early every month. They received my October check, circling it around among offices. Then sent back the image of the check with an email to me asking me if I wanted to get it back after charging me for a late fee. Dealing with this type of management company, as a community member, you will be anxious for their irresponsible act. Very disappointed with the service!!!",
        "ownerResponse": {
          "text": "Tina, we would love to address your concerns. Please email us directly at customerservice@associaonline.com so a member of our team can assist you. Thanks again for your review and we will do our best to resolve your issue."
        }
      },
      {
        "author": "Mary A.",
        "rating": 5,
        "review": "I am GRATEFUL to EMB Management! As a busy Realtor, I work with a lot of property management companies. Lisa and the team at EMB work hard to be very helpful. As you try to understand all the needed information, they are great communicators and great about patiently explaining things.",
        "ownerResponse": {
          "text": "Hi Mary, thank you for taking the time to let us know how we did. We hope you have a great day!"
        }
      },
      {
        "author": "Sheila T.",
        "rating": 5,
        "review": "Thank you for your swift reply.  I hope/think the form you sent is the one required by our mortgage holder.  \n\nIf I need any additional information I'll request it.  Again, thanks for your assistance!",
        "ownerResponse": {
          "text": "Hi Shelia! We're so happy we were able to help you out!"
        }
      },
      {
        "author": "James C.",
        "rating": 5,
        "review": "This review is specifically for Brenda Jacobs who used to work for EMB management.   I worked with Brenda 10 years ago as a vendor who provided maintenance services around King county for the properties that Brenda managed.   Brenda was a great property manager.   She was responsive, kind, and always very easy to work with.   Her professionalism was extraordinary especially considering the high-stress environment that she had to manage.   I've managed condos myself and I know first-hand how complicated and difficult it can be.   But through it all Brenda was always professional even when dealing with irate and unreasonable clients.   There was even one time Brenda stood up for me when I was physically attacked by a board member who  was having some sort of mental breakdown and I'll never forget that. \n\n I understand Brenda has left EMB and I just hope wherever she is that Brenda is doing well, and I hope she knows how appreciated she was for all the effort she put forth",
        "ownerResponse": null
      },
      {
        "author": "Vladimir S.",
        "rating": 1,
        "review": "It has been more than three months since December 2022, when we discovered roof leak at our house at 615 Chelan Pl. NE in Renton. We had numerous conversations with EMB office (Jennifer and Chelsea), we had three roof inspections and nothing has been done. Nothing - roof is leaking as before, destroying interior wall not only at my house, but also damaging wall common to  my neighbor. More to that, EMB Manager Chelsea Pollard stated today that roof has been repaired. I wonder by whom and when. Nobody was at our house - maybe they did it at night. Horrible service.",
        "ownerResponse": {
          "text": "Vladimir, we would love to address your concerns. Please email us directly at customerservice@associaonline.com so a member of our team can assist you. Thanks again for your review and we will do our best to resolve your issue."
        }
      },
      {
        "author": "George L.",
        "rating": 1,
        "review": "Dear EMB Management, I recently purchased a condo in the Maxwell, 700 E. Denny Way Unit 103, Seattle, WA. 98221.  I'm going to rent it out and I have only one set of common area keys, and fob.  I need 2 additional fobs and two sets of common area keys.  I have called 425-452-7330 repeadly and it goes to your parent company Associa.  I'm always on the line for at least a half an hour and they treat me more like it's a social call than a business call.  They keep telling me they are forwarding the request to you but I never get a response.  I am Case #00425595.  They have started to give me your office number but it's 760-346-1161 which is Desert Resorts, Palm Springs.\n\nI want to inform you that this unit will be a rental per the HOA rules and get the fobs, keys, and learn how I can pay my HOA Dues.  Thank you so much,\nSincerely,\n\nGeorge Lund\n206-683-2864",
        "ownerResponse": {
          "text": "George, we're very sorry to hear that you're disappointed with the service that you've received thus far and apologize for the inconveniences you have experienced. At EMB we take customer care very seriously and your Association Manager will be reaching out to you today to discuss the rental procedures at your Association as well as the options for paying your assessments.  Thank you."
        }
      },
      {
        "author": "Celeste M.",
        "rating": 1,
        "review": "EMB's property management services have been severely lacking. During our annual meeting, our Property Manager, Chelsea Pollard, displayed unprofessional behavior by rolling her eyes, snickering, and making condescending remarks. This kind of attitude is unacceptable and unbecoming of someone in her position. Furthermore, our property is not being adequately maintained, and the lack of cleanliness and upkeep is a major concern. Additionally, EMB seems to lack proper budget management skills, which is reflected in the poor state of our property. I strongly advise against using EMB's services if you are seeking a well-run property.",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave us feedback. Weve received confirmation that someone from the branch has made contact with you to resolve your issue. Please contact us at customerservice@associaonline.com if your issue was not resolved or if you would like to let us know how we can improve your experience."
        }
      },
      {
        "author": "Don't F.",
        "rating": 1,
        "review": "Dismal company to work with. They have completely failed to perform any of the mandated maintenance on the complex, and don't respond to inquiries.",
        "ownerResponse": {
          "text": "Thank you for taking the time to rate us. We are sorry to hear that you've had a negative experience with EMB Management. Unfortunately, we are unable to locate your information in our records system. Please email us at customerservice@associaonline.com with your contact information and a team member will reach out to you."
        }
      },
      {
        "author": "Jack G.",
        "rating": 1,
        "review": "Took them 35  days to send me one email for footage of my truck getting vandalized. They ignored my phone calls for weeks and when I finally got a single email in return, they gave me a fake number to call. I cannot fathom what kind of people run this business. It is absolutely UN-believable it takes over a month to get in contact with the right person to review footage of my truck getting vandalized.",
        "ownerResponse": {
          "text": "We are sorry you are frustrated about your experience and as you know when you spoke to the team, we needed permission before sharing access to the footage. \nWe appreciate your feedback Jack, and if you'd like, please contact us at customerservice@associaonline, and we'll get back to you within 24 hours. \nWe hope to have an opportunity to support your service requests on behalf of your Association in the future. \nMany thanks."
        }
      },
      {
        "author": "Tony B.",
        "rating": 5,
        "review": "EMB Management based in Redmond, WA is excellent: professional; responsive and knowledgeable. \nMonika is our contact and is first class. Our condo owners association has been able to bring back financial, operational and regulatory rigor for our owners. \nMaintenance issues get acknowledged with two to three days and emergency issues are dealt with promptly and correctly, in terms of adherence to our governing documents, bylaws and house rules.",
        "ownerResponse": {
          "text": "Hi Tony, thank you for taking the time to leave a review for us at EMB Management. We're happy we could meet your service expectations! We will share your excellent review with Monika and our team."
        }
      },
      {
        "author": "Wombat W.",
        "rating": 4,
        "review": "Although we used EMB several years ago, based on subsequent experience with other management companies, I am going to upgrade my review of EMB to Good based on subsequent experience.",
        "ownerResponse": {
          "text": "Hello, I am Stephanie with Associa headquarters. Thanks for leaving your comments, and we are anxious to understand how we can better improve our service to you. Please email customerservice@associaonline.com with a number where you can best be reached, and we will ensure that an executive speaks with you soon."
        }
      },
      {
        "author": "Jenn N.",
        "rating": 1,
        "review": "If I could give a negative rating ai would.  Associa tries to act like it is being responsive by asking negative reviewers to contact them directly.  However, the customer service at Associa is as abysmal as it is at EMB Management.  Associa, I reached out to you BEFORE my negative review and received NO response.  \n\nYour property managers are rude and useless.  They do not respond to homeowner requests.  They encourage boards to not communicate with homeowners directly, hold closed board meetings and refuse to provide contract documents in violation of Washington State law.  An HOA board serves at the behest of its homeowners, not EMB or Associa.  My HOA dues pay your PM's salary.\n\nRun, run, run as far away as you can from EMB Management and any property management company owned by Associa.  Attached are screenshots of my recent communications with our property manager Jodi Kay.",
        "ownerResponse": {
          "text": "Jenn, thank you for taking the time to leave us feedback and for bringing this to our attention. We apologize for the inconveniences you have experienced and would like to reach out to you in order to fully understand your situation. Please contact us at customerservice@associaonline.com with your contact information and any additional details and a team member will reach out to you."
        }
      },
      {
        "author": "Craig P.",
        "rating": 1,
        "review": "On 11/09/20 I purchased a Logitech Wireless Illuminated Keyboard on walmart.com; the seller was EMB Phones.  I received the keyboard on 11/12/20; it was easy to setup and use.  On 01/09/21, they keyboard keys wouldn't light up nor respond to typing even after changing batteries twice (the batteries worked elsewhere).  It was when I went to walmart.com to look into a return that I found the keyboard had come from a 3rd party vendor (EMB Phones).\n\nI went to EMB Phones website and filled a form to tell them their keyboard had died in 60 days and asked how to proceed.  The first reply I got said \"Sorry. 30-day return only.\"  When I replied that I would be posting negative comments, I received a reply from a different agent telling me they would send a return label.  When I replied to that email, I received a reply from a different agent saying \"Sorry. 30-day return only\".\n\nSo, I paid $45 for a keyboard that stopped working after 60 days and it seems like they just \"take your money and run\".",
        "ownerResponse": null
      },
      {
        "author": "Jenny A.",
        "rating": 1,
        "review": "If I could rate this company 0 stars I would.  This is the WORST management group I've ever had in an HOA.  My neighbors and I have contacted the company multiple times regarding CC&R violations.  It's rare for the company to respond, and if they do, their e-mails are belittling, disrespectful and rude.  Community concerns go unaddressed and they don't do anything to enforce CC&R's.  If anyone is planning on using this company, I suggest you run for the hills. Beware.",
        "ownerResponse": {
          "text": "Hi Jenny,\n\nEMB Management appreciates you taking the time to provide your feedback, as we strive every day to improve our services to clients. As we have previously communicated with you, as your community's new managing agent as of February 1, 2020, we have been diligently working with the board of directors to create governing documents for the Association which will include a defined fine policy to assist with enforcing the infractions of the governing documents. We have interim procedures in place currently and have taken actions to address the issues you have brought to our attention. The team continues to be dedicated to serving you and your community. We would be happy to setup a call to discuss your concerns further. Thank you"
        }
      },
      {
        "author": "M G.",
        "rating": 1,
        "review": "Pay attention to the number of 1 star reviews (and the people, like me, who wish they could give zero stars). You might be able to save yourself time, money and a nightmare experience.",
        "ownerResponse": {
          "text": "MG, thank you for taking the time to leave us feedback. If you'd like, contact us at customerservice@associaonline.com to let us know how we can improve your experience."
        }
      },
      {
        "author": "Brendan H.",
        "rating": 1,
        "review": "I have bought and sold in many condo communities and dealt with many management companies. EMB is the worst. \nI am trying to buy in a community that they are managing. I've left 3 messages for someone to call me back and no response. The community is in debt so bad that I can not get a loan and will not work with my lender to refinance. \nWhen I finally got Claire to answer my call, she was no help. I wish the hoa would realize that EMB is hurting their values. \nI will repost my follow up interactions with them as I am still trying to close on my condo.",
        "ownerResponse": null
      },
      {
        "author": "Larry L.",
        "rating": 3,
        "review": "Unable to contact the company. They do not answer the phone or return email requests. They delay processing payments resulting in late fees, processing fees, and interest charges. I have been waiting on hold this time for over an hour, and found time to write this review while still on hold. I now am paying two months in advance to possibly avoid their charges. As an HOA member for almost 8 years, I have never had this problem communicating with the managing company, or had late fees. I finally had a call back a day later, and she explained they do not have anything to do with the HOA payments, yet they are sent c/o EMB management. To reverse the errant fees, EMB said to have the HOA board vote on it. My recommendation to our board is to vote EMB out. After contacting our board, they agreed that it was refundable, and directed EMB to so. I will revise the rating from one star to three for finally responding and having the matter corrected.",
        "ownerResponse": {
          "text": "Larry, thanks for bringing this matter to our attention. Please email us directly at customerservice@associaonline.com so a member of our team can assist you. Thanks again for your review and we will do our best to resolve your issue."
        }
      },
      {
        "author": "Ed W.",
        "rating": 1,
        "review": "Unbelievable...  I've had countless issues with this management firm for several years now and have periodically looked up their poor reviews.  However now they pay google to move their manufactured reviews up the list to promote their unethical unfair practices online.  The company I work for has great reviews, and we pay Google to feature them, but this is just disgusting.  For some reason I can't find a way to post my review in the same threads as EMB's 4* review pages.  Hmm...  \n\nIf your HOA already contracts with EMB, they have already employed their strategy of creating havoc which alienates board members from the rest of the community.  Using this tactic all the fees they assess go right into their pockets.  I have yet to see a community hire this firm since Associa acquired them, but I've seen several HOA's fire EMB as a result of the acquisition.  One of which was a large community that used them for over a decade and fired them 3 months after the acquisition.  I can't personally attest to this, I have to assume the information I received from the HOA president that oversaw their termination is accurate.  \n\nIf your HOA is considering hiring EMB as their management firm, tell your board your will happily absorb a 10% increase in dues if they choose a different management firm.  I assure you, you will benefit in the long run. \n\nThis firm is as crooked as they come...",
        "ownerResponse": {
          "text": "Ed, thank you for taking the time to leave us feedback. We take your review very seriously. We would like to reach out to you as soon as possible in order to fully understand your situation and help resolve any issues you have. Please contact us at customerservice@associaonline.com with your contact information and any additional details and a team member will reach out to you."
        }
      },
      {
        "author": "Margarita G.",
        "rating": 1,
        "review": "I strongly believed that my my conflict with the company is an extraordinary case until I checked reviews for this company across different social platforms. My experience with the EMB Management is exactly the same as others wrote here: 1) They simply ignore the requests made by home owners 2) tell you that they are \"working on the issue\" without providing any ERD 3) You have to work for them to manage their people in order to get any response at all. \n\nHere is my story:\n\n1) It took company over a YEAR to resolve an issue with leaking gutter. I strongly believe that if I would not constantly remind them of the issue they would actually never get it resolved. \n2) I submitted a different ticket to them about a potentially serious issue with the building that I currently live in. It's been almost 2 months. They told me that they contacted the vendors and waiting for a response. I had to constantly contact them in order to find out that there was no progress on my case. Now they \"got lost\" again after almost 2 month they told me that they contacted one more vendor. \n\nI hope facts speak for themselves here. Thanks,\n\nUpdate: I ended up addressing my concerns via email with the president of the company who responded saying that she doesn't see any issue and there are no issues with the \"work that they provide\". I ended up sending an additional email highlighting all of the work that either was not done or was not done on time on what she responded: \"Thanks for the email\" and I've never heard from her since.",
        "ownerResponse": {
          "text": "Margarita, Thank you for your feedback, it is important to us. We want to help resolve the issue you mentioned, and will be happy to work with your Board of Directors for their approval on the expense to move forward and resolve the items you mentioned.\nWe have received your email with the same information and are preparing a response with the timeline of events and action taken to date.\nThanks again."
        }
      },
      {
        "author": "Judy C.",
        "rating": 1,
        "review": "Worst HOA ever. They overcharged me twice in my bank account with auto payment and keep denying it. I send them my bank statement which clearly state \"EMB\" but still denying it. No apology and keep saying my bank screwed it up. I stop all my auto payment and instead pay them by bank payment every month and now they claim that I have late payment.",
        "ownerResponse": {
          "text": "Hi Judi, thank you for taking the time to leave us feedback and for bringing these serious matters to our attention. We sincerely apologize for the inconveniences you've experienced. We would like to reach out to you to fully understand the situation and help resolve the issues in a timely manner. Please contact us at customerservice@associaonline.com with your contact information and any additional details and a team member will reach out to you."
        }
      },
      {
        "author": "Christina Z.",
        "rating": 1,
        "review": "They will never respond your email. I need to call again and again to check whether the contractor is scheduled.\nMy house has some issues so I sent 3 emails to them and asked them to schedule contract to take a look at the issue. They didn't reply any email. Then I called them, got response was they were working on it.\nAfter 3 weeks, I called them again to ask about the progress, they told me they didn't get any updates yet.\nThe other thing is during the whole process I didn't have any chance to talk with the specific property manager that handles my case, the whole process is someone picks up the phone and asks me to wait, then she checks with the property manager.",
        "ownerResponse": null
      },
      {
        "author": "Reverend Bob D.",
        "rating": 1,
        "review": "If Yelp gave an award for the business that receives the largest number of  terrible reviews EMB Management would have to be a leading candidate to take down the top prize! I didn't see a single review that has anything good to say about the company, which doesn't surprise me in the least. \n\nAs an industry, the HOA \"management\" industry doesn't receive very high marks, but this is really beyond the pale. \n\nHaving been a vendor that provides services to HOAs for quite some time, I have worked with a number of communities in both Washington and Oregon that had the misfortune of being managed by one of the companies that are owned by EMB's parent company and without exception the experiences of these communities have been uniformly bad. \n\nThe business model of the management industry in general is to get the HOA under contract and then proceed to extract as many of the HOA's dollars from their bank account and relocate the dollars to the management company's bank account as you possibly can, all while doing as little actual work as possible.\n\nIn the case of EMB's parent company they own all sorts of ancillary service providers that always seem to end up being the provider that is chosen when one of the HOAs they manage contracts with a vendor. \n\nIf your HOA is managed by EMB it is a safe bet that the insurance you are buying is sold by a company out of Dallas, TX that just so happens to maintain an office right down the hall from the corporate headquarters of Associa, the company that owns EMB. \n\nIf you research the trail of ownership of this insurance agency you will find that the  registered agent for the insurance agency is a Dallas attorney and an employee of Associa, whose office address is the same as the address for Associa's corporate headquarters.\n\nIt is also a safe bet that your Association's reserve study was prepared by the management company, if that management company is owned by Associa, and if it isn't it soon will be! The list goes on and on. \n\nDepending on the market where your HOA is located, if you are managed by an Associa-owned company,  you could have a maintenance contractor that maintains the facilities in your community that is owned by Associa; a security service that patrols your community that is owned by Associa; a porter/janitorial service that is owned by Associa; and possibly a pool or landscape maintenance service that is owned by Associa.\n\nMeanwhile, you are probably getting lousy management service and a lousy reserve study all while a healthy chunk of your HOA's money is being siphoned off into Associa's bank account!",
        "ownerResponse": null
      },
      {
        "author": "C W.",
        "rating": 1,
        "review": "The most frustrating incompetent management company out there. \n\nDon't bother emailing them, you'll never get a response. Like many people here we had issues with late fees that were eventually resolved but it took quite a while. After sending emails and getting no response we had to leave a couple voicemails. It was probably two months or so but it eventually got resolved. \n\nCalling always goes to voicemail and either their mailbox is full or they have a greeting saying they're out of the office from two months ago that they never wound up updating. Once you leave a message theres a 50/50 chance you'll get a call back. \n\nWhen they do respond it's like talking to a wall. We had issues with a contractor doing work on our property and they were less than helpful getting anything resolved. Never followed up with us despite trying to email and call for updates. \n\nIt also took us forever to get the resale cert. like someone else mentioned in a review. \n\nI don't know if maybe the property managers have too many properties to keep up with or they genuinely don't care but I would not recommend dealing with this company if you don't have to.",
        "ownerResponse": {
          "text": "Hello Corey W.\nI would really like to get some more information in regards to your issues with a contractor and  the late fees you recieved. Please send me an email at customerservice@embmanagement.com or call me during business hours, weekdays 8:30am-5pm at 425.452.7330. I would like to help fix the problems you are having as soon as possible."
        }
      },
      {
        "author": "Robbie L.",
        "rating": 1,
        "review": "Our community had the misfortune of working with EMB for several years.  They started out okay, but once Associa took over, it was all downhill.  There were major issues towards the end and we had no less than three different managers in less than a year.  They overload their managers and don't provide the support they need, then they get burnt out and fail to provide the support the community needs.  \n\nThe final straw for us to cancel our contract was when they misplaced $175,000 of the reserve fund.  At the beginning of 2015, EMB closed a reserve account of ours and received a check.  The strange thing is, the board never authorized them to close the account or to move it somewhere else.  They also continued to put the $175K on our monthly financials so it appeared nothing was wrong.  We only found out there was an issue when our yearly audit began asking where the money was.  For two months we repeatedly asked EMB managers, accountants, and supervisors where our missing money was and they could not provide any answers.  In less than one day with our new company, they found that the check issued to EMB was never cashed.  The bank reissued a new check to our new company and it all worked out.  But for six months, EMB had misplaced $175K and couldn't tell us where it went.  \n\nIf you are an association looking for a management company, I would avoid EMB.  Look for a locally based company that handles billing locally as well, not Dallas or San Francisco as is the case with EMB.  It's now been 6 months since we dropped EMB and our neighborhood has improved dramatically.  We will not be going back.",
        "ownerResponse": {
          "text": "Hello Robbie,\nI am really sorry to hear about the accounting issues your association encountered. This is a rare case. I would love to talk more with you about your experiences and gather some feedback that we can use to improve moving foward. Please contact me, Aimee, by email customerservice@embmanagement.com or by phone 425.452.7330, weekdays 8-5. Thank you."
        }
      },
      {
        "author": "Diane S.",
        "rating": 1,
        "review": "I am the president of a homeowners association on Queen Anne and we had used EMB Management for over ten years.  When they were bought out by Associa was when our problems began.  They started out by letting our property manager go, who we were happy with.  Then they started doing all the accounting in Dallas TX.  There were so many mistakes it was incredible, starting with them charging me (and other homeowners) a monthly charge for an assessment we had already paid up front. They ended up having to reimburse me almost $800 that was taken from my checking account without authorization. I received the check in the mail with no letter or any kind of explanation or apology.\n\nThey also lost homeowners checks that were never found, the list goes on and on...but the worst part was when the board voted to terminate their contract we were informed that we could only terminate them in the month of May or otherwise pay them a 50% fee from the termination date until the next May!  It's something called an \"evergreen\" contract - hard to believe they are even legal.  \n\nWe waited until Jan. 1st to terminate and are biting the bullet and paying the 50% until May - that's how strongly we felt about terminating their service.  Also, when we sent them the termination letter we did not receive a call or anything personal from the company - just a letter from their attorney!!  Unbelievable to be treated so badly after being a client for over 10 years.  When we started with EMB it was a decent local company, after being taken over by Associa I would absolutely not recommend them to any HOA looking for a property management company.",
        "ownerResponse": null
      },
      {
        "author": "Jessica S.",
        "rating": 1,
        "review": "The worst company you can ever imagine. Like many individuals writing these reviews have stated that emailing them will get you nowhere. They will give you a half-assed response of: \"We're looking into it...\" That is all. But don't expect them to be actually looking into anything. They spent 6 months \"looking into\" nothing and they're still not doing anything. If you think you have been frustrated with a company, well, you're in for a surprise. Good luck...",
        "ownerResponse": null
      },
      {
        "author": "Lola S.",
        "rating": 1,
        "review": "I am trying to buy a condo in one of the condo complexes that EMB Management is managing. It's taking  them over two weeks now to return the Resale cert for the condo I am buying. It typically takes 3-10 days. I seriously doubt whether I want to buy a unit in the condo complex they manage. I might as well start shopping for a different condo because I still don't know when I will receive the resale cert. I don't really have 2 months to wait for the resale cert. I also don't want to have a hard time selling the unit in the future because EMB Management can't produce a resale cert. I also don't want to live in a badly managed condo complex with unresponsive property management team. They don't seem to be very good at what they do. \n\nAlso it's laughable that they posted a response to Lew H.'s review 7 months after he actually posted his review. I guess that's just their turnaround time.",
        "ownerResponse": {
          "text": "Hi Lola, thank you for your feedback. We're very sorry to hear of your concerns in regard to customer service and responsiveness in regard to condo resale certs, as well as any miscommunication issues that may have caused inconvenience. However, our records show that your order was placed on July 8th at 10:32 a.m. and our proposed turnaround time is 5-10 business days. Given that our records also that you received your requested service on Monday, June 21st, we were still within that timeline. That being said, we take matters like customer service very seriously and if you would like to discuss matters further, please email us at customerservice@associaonline.com and we will ensure that someone speaks with you soon. Thank you."
        }
      },
      {
        "author": "S. N.",
        "rating": 1,
        "review": "This company never picks up their phone and never responds to emails and voice mails. I was sent a bill for a late fee without any explanation. I tried to contact them 5 times without any success in getting a hold of anyone or receiving a call back. I did pay the late fee in good will but now I am regretting this decision as I have yet understand or receive an explanation. This company has very poor customer service and very questionable accounting practices. I suggest that you avoid purchasing a home managed by this company.",
        "ownerResponse": {
          "text": "Hello S.N.\nWe are very sorry to hear that you have been having difficulties reaching us. Please email me directly so that I can look into this late fee you have recieved. My email is customerservice@embmanagement.com or give me a call at 425.452.7330 during office hours 8:30am- 5pm weekdays."
        }
      },
      {
        "author": "Lee L.",
        "rating": 1,
        "review": "This is the worst \"company\" ever. As stated by many reviewers here, they will ignore you. The whole staff is extremely rude.",
        "ownerResponse": null
      },
      {
        "author": "Kristina S.",
        "rating": 1,
        "review": "this is a terrible property management company.  I recently received a notification that I had three late fees in 2014.  The late fee date on my bills is the 16th of each month and they charged me on the 10th of each month.  I requested a full refund on all the fees and they did 2 of them and then I had to keep emailing to get the third on taken care of.\n\nI finally get my updated statement and wham!  Another late fee charged on 10/10/14!!  Grrr!!  Obviously they never corrected the root problem.  This is so frustrating.\n\nI would never do business with this company if I had the choice.",
        "ownerResponse": null
      },
      {
        "author": "Lew H.",
        "rating": 1,
        "review": "I wish there was a way to leave negative stars. This company has \"managed\" our HOA for more than ten years. They've burned through our money and our community looks like a Calcutta Slum. Nearly a quarter-of-a million dollars has been pumped from our bank account into the coffers of EMB. We have nothing to show for it but obtuse reports and a near-bankrupt organization. We canned them and hope that no one else makes the mistake of bringing this clown-car to their neighborhood.",
        "ownerResponse": {
          "text": "Hello Lew, it's Stephanie with Associa headquarters.  I know I have previously left you messages on several sites; however,  please know that if you would like to discuss this matter further, feel free to e-mail customerservice@associaonline.com with a number where you can best be reached. We will ensure that an executive speaks with you soon."
        }
      },
      {
        "author": "Robin B.",
        "rating": 1,
        "review": "To call EMB incompetent would be giving them a better rating then they deserve.  Over the 3 years I dealt with them on the Bridgehaven Association Board our property manager lied to us on a regular basis, they did a financial software conversion where they were unable to produce financial statements for months, they misunderstood bids, were slow to pay our vendors and we had a bank account turned over to the state as unclaimed property because they did not return the paperwork to the bank. When we complained they patted us on the head and said everything was fixed but the issues continued.\nI would recommend any property considering doing business with EMB run away as fast as they can. We hired a new manager and we are all so happy with the change.",
        "ownerResponse": null
      },
      {
        "author": "Christine S.",
        "rating": 1,
        "review": "If i could give this Company minus stars, i would. Thank goodness our Complex is finally rid of this disgraceful company. Yes, they are crooks and completely incompetent..especially with YOUR money and accounting practices. All i can say is please go to the BBB and check out the over 500 complaints this company has received before signing them on! They are horrible and getting any kind of response from anybody in this company is impossible...unless they are trying to sign you up. Go to the BBB!",
        "ownerResponse": null
      },
      {
        "author": "Ken S.",
        "rating": 1,
        "review": "This company is so crooked, so incompetent and so appallingly bad that they owe me 7-70 stars just to brake even. They were thrown out of our master community after their employees were found to have embezzled HOA funds but were retained by our smaller affiliated community much to the detriment of our home values. Why, because our association president worked for them, I guess we had no conflict of interest clause in our association By Laws, oh well, la de da. Oh yes, no follow up, no returned calls, no newsletter, but annual rate increases were about all they were good for. I would caution any prospective home owner from buying into one of their managed properties, since you will be paying hundreds of dollars monthly for no return on your dollar. I'm sure this will generate one of their canned responses, but here's my answer to that, \"Where were you when we needed you, drinking mai tais in the Bahamas on our dollar, because you sure weren't answering our phone calls?\" Fast forward, I did get a computer generated canned response to this review, smelled like red herrings from Amsterdam, when I opened the can.",
        "ownerResponse": {
          "text": "Hello Ken,\nI am very sorry to hear about your experience. A member of our executive team would be more than happy to speak with you in regards to this. Nicole Washington, our Branch President, can be reached by phone 425.452.7330."
        }
      },
      {
        "author": "Craig G.",
        "rating": 5,
        "review": "I recently reviewed EMB management, and gave a lot of credit to Associa for either acquiring or recruiting Blue Mountain as one of their property managers.  I have been interacting with Regina J. at Blue Mountain about a roofing project for my home.  I wrote a long review recently about my experience, and it continues, with a very positive interaction with Regina getting that work approved.  She has been very responsive, very helpful, with her very prompt replies to all of my emails.  My assessment of EMB Management is all about Regina (especially and foremost), Blue Mountain, and by extension, Associa in bringing them on board, as I said in my previous review.  Please see my previous review concerning Regina, and, Blue Mountain.  If you are looking for a property manager, I think that you would be hard pressed to find a more helpful and responsive one than Regina J. with Blue Mountain.  As long as this team is part of EMB Management, I would recommend them by extension.  If you read my previous review of this company, my 5 star evaluation was for Regina, with a negative review of EMB Management.",
        "ownerResponse": {
          "text": "Craig, thank you for taking the time to leave us an excellent review and rating! We truly value your feedback and are glad you are satisfied with the service provided by Regina. We will share this fantastic review with Regina and our team here at EMB Management."
        }
      },
      {
        "author": "Jin C.",
        "rating": 1,
        "review": "By the looks of reviews on this site I'm not the only one with complaints about EMB/Associa. I used to live in a condo managed by EMB and after moving out have been trying to get a refund of HOA they withdrew from my account for over 8 months now. Called again today and was told since they no longer managed the condo they couldn't do anything regarding my refund. They had 5 weeks since my last phone call to issue the refund before they were terminated as the manger of the condo but chose to do nothing let alone inform me of the change.",
        "ownerResponse": null
      },
      {
        "author": "Glen N.",
        "rating": 1,
        "review": "We have lived in a community in Harbour Pointe, Washington for nearly 6 years.  When we moved in to our Condominium community our home owners association (HOA) used another property management firm to oversee the property.  Our ex-president and now an ex-resident proposed that we (our community) were being charged way too much by our property management company.  The HOA deliberated for some time and decided to change to EMB Management of Bellevue, WA.  It seemed okay in the beginning, but when an issue came up that needed attention, the representative, LJ Richards turned a deaf ear.  We have had EMB overseeing our community for 4 years now.  It has now become a precedent that if an issue should arise, we need to contact LJ Richards via email or phone and ask her to correct it.  I will give some examples of LJ's shortcomings in the paragraphs below, and then you may decide for yourself. Our HOA purchased a great deal of new mulch to help beautify our landscaping somewhat.  Many of the residents here volunteered to distribute the new soil media throughout the property.  I must say that it looked marvelous!  I was sitting on my porch a week later and saw some young men (age 9 to 15 years) playing army with plastic nerf guns.  Unfortunately, the youths were running through our newly replaced landscaping material.  They trampled many of the plants and pulled branches off of the ornamental trees to use as camouflage.  I also saw one of the boys deliberately jump up and down on one of the sprinkler heads.  I went out and asked the boys to play elsewhere and they left, but my wife said they were back doing the same thing the next day while I was at work.  I was in my home when I saw LJ Richards drive up one morning.  I met her at her vehicle and shared my concern with her.  In our brief meeting I explained what had occurred and showed her the damage the kids had done.  I asked for her opinion in the matter and she quickly agreed with me and told me that what the kids were doing was destruction of property. I asked her if she could send an email or a letter to the parents since they would be the responsible parties for the damage.  She declined and told me that she would put out a general email to all members of the community, and ask parents to talk with their children.  I was at home last week when I heard some commotion in the common area.  I looked out my window only to see the same children playing army in the landscaping once again.  I went through me emails and noticed no general email from LJ Richards or EMB Management regarding the \"Destruction of Property\" that LJ Richards acknowledged.  This is a no-brainer in my book!  I am not certain how much has been spent on replacement of broken sprinkler heads in our community.  But one thing I do know for sure; it can be prevented by keeping the children out of there in the first place.  I am not sure what is up with LJ Richards, but she is anything but professional. Lastly, we once had a problem with a next door neighbor and her barking dog.  The dog would bark continually nonstop when the resident was not at home.  We had the police out here 8 times and each time is well documented in my briefcase.  I emailed her and I phoned her, but nothing was done.  We put up with the barking for months and months to no end.  I recall the most unprofessional conversation I ever had with LJ Richards.  I remember the police had just left and I had filled out a statement for them.  I called LJ that evening to ask what was being done to squelch this little minion.  She informed me that she had been talking to the resident and her landlord regarding the barking dog.  What was said after that nearly floored me; she told me that the renter and the homeowner thought I was overreacting!  Overreacting!  We have 8 documented incidents from the police and other residents that say otherwise.  Very unprofessional indeed!\nThese are but a few examples of EMB Management and the funky tidily wink mentality of the persons that represent them.  I really wish our HOA had not been so stupid and just held onto our previous property management firm; we would be far better off.  With our previous firm if we had an issue; it was usually resolved the same day, now it may be several months.  One thing I do find consistent about EMB, they always collect their money on time; it comes out direct deposit every 5th of the month.  UGH!!!  Now we are stuck with them!\nIf it's EMB Management? Stay away!!!",
        "ownerResponse": null
      },
      {
        "author": "Victoria H.",
        "rating": 1,
        "review": "Not professional - that's the bottom line. Best not to trust the maintenance and care of a major and important investment to this organization. They have been more of a liability to me as a homeowner, then the advocate and project managers they are hired to be.",
        "ownerResponse": {
          "text": "Hi Victoria, I am Stephanie with Associa headquarters, EMB Management is one of our local branches in your area.  Thanks for leaving your comments, and we are sorry to hear of your concerns.  If we can be of further assistance in better improving our service to you, please email us at  customerservice@associaonline.com with a number where you can best be reached, and we will ensure that an executive speaks with you soon."
        }
      },
      {
        "author": "Hugh J.",
        "rating": 1,
        "review": "This is a big corporation and have managers overworked and upper managements too busy.  Also, base monthly fee seem competitive but ultimately services they charge is very high.  Will not recommend.  No customer service.",
        "ownerResponse": {
          "text": "Hi Hugh - I am Stephanie with Associa headquarters.  We are available to discuss any questions or concerns that you may have with EMB or Associa services.  If you email your contact information to customerservice@associaonline.com, we will make sure an executive gets back in touch with you as soon as possible.  Thanks so much and have a great day."
        }
      },
      {
        "author": "Katelyn S.",
        "rating": 1,
        "review": "Is is possible to have zero stars? They are literally the worst. They don't care about tenants let alone even know where they live even after multiple conversations. I had serious trouble with my car getting keyed (twice) in Bellevue because people kept parking in my space. They told me to just park on the street...guess what, we don't even have street parking. They have one measley sign covered by bushes saying it's tenant parking only which according to them is \"ample signage.\" What a joke this company is. I'm moving out of my condo and I haven't even been there a year because they are so terrible. Not even one guest spot...so lame.",
        "ownerResponse": {
          "text": "Hi Katelyn, thank you for giving us your feedback. We're sorry to hear about your car and your concerns in regard to parking within the property. I can assure that EMB does care about their tenants and if you feel that your concerns are not being properly addressed by EMB staff, that is very concerning to us. We take matters like this very seriously and are anxious to understand how we can better improve our service to you. Please email customerservice@associaonline.com with a number where you can best be reached, and we will ensure that someone speaks with you soon. Thank you."
        }
      },
      {
        "author": "K W.",
        "rating": 1,
        "review": "Terrible Terrible Terrible TERRIBLE Company.  A joke really. We unfortunately have them managing our condo. We had flooding strike our condo and they did everything it seemed in their power to make the situation the worst it could possibly be. The entire thing was drawn out. We can back to shambles. They made false promises. When we asked for help from the manager she said...\" I have not been involved, I let the contractors handle things..\" Im  so sorry we pay our HOA dues and you are suppose to be involved. POS company. There is a completely RUDE manager we have.   In the time of turmoil and loss for our community.. they made it ten times worse.. They refused to have our backs on anything and only wanted to do what was most convenient for them. I hope this business fails HARD. People deserve to be represented not pushed under a carpet. Not to mention I had to email her several times to get any response... One time she told me \" I am busy\"",
        "ownerResponse": {
          "text": "Hello Krista,\nI am sorry to hear of the difficulties you have been experiencing with the manager of your community. I want to make sure to resolve any negative experiences you have been having and would love some more information from you. Please contact me, Aimee, by email customerservice@embmanagement.com or by phone, M-F, 8:30am - 5:00pm, 425.452.7330. I want to ensure that your experience from now on is a positive one!"
        }
      },
      {
        "author": "Tina L.",
        "rating": 1,
        "review": "Run very far away from this unscrupulous, litigious-hungry and incompetent property management company! I lived for 18 years in one of their managed properties in Washington state and it was by far the worse experience of my life as a homeowner. The problems started from the day I bought my condo when they tried to get me to pay the back dues accrued from the previous owner. Then tried to get me to file an insurance claim on my own insurance policy for the water damage caused by a plumbing defect not of my doing. Over the years there was a pattern of slow or non-responsiveness to simple maintenance requests like power washing of decks and sidewalks, carpet cleaning of common areas, snow removal, etc. Decks were left to rot because nobody would power wash them on a regular basis. When most of them were inspected and needed to be replaced, EMB sent out shaming letters to the homeowners reminding them of their responsibility to keep their decks moss free. Our bylaws clearly stated that the EMB was responsible for the exterior maintenance of the buildings, including the decks. The exterior paint of the buildings were faded and discolored. Only half the complex of 40 units were repainted once in the 18 year I lived there. Comments by other Yelp posters about the overcharging was absolutely true. I too was the victim of their sloppy accounting and overcharges for late fees. When I challenged the validity of the assessment of 3 years worth of late fees ($1,000), I was sent to court, costing me $15,000 in attorney fees and finally ending with the sale of my condo in 2013. If I had the deep pockets that this business has to hire the most vicious HOA attorneys to let loose on me, I would have fought my way to the Attorney General's office. But I'm just a little person who tried and lost against another soul-less company more concerned with their profit margin than doing the right thing by their customers. The mental anguish they put me through and the fact I was forced to sell my property to pay these vultures off, is irreparable.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 44,
  "adjusted_average_rating": 1.59,
  "summary": "<article class='review-summary'>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>This summary article is generated by ChatGPT and is intended to be a tool to help readers find a property management company or rental property. The content within reflects a synthesis of user reviews and does not represent the views of any individual reviewer. This article's intent is to provide a balanced overview of the discerned sentiment among users towards EMB Management. It should be noted that specific details such as direct quotes or identifiable information from reviews are not included to respect privacy. Furthermore, the company's reply trend is examined to ascertain their responsiveness to concerns raised in user reviews.</p>  </section>  <section>    <heading>      <h2>Good</h2>    </heading>    <p>EMB Management has been praised for its professional and responsive team, which has been highlighted in the positive reviews. Some users expressed gratitude for swift replies and effective assistance from particular EMB staff members. These users appreciated the property management's help in addressing their urgent needs efficiently, indicating that when EMB performs well, responsiveness and helpfulness are often noted. In these instances, the company was able to facilitate relevant processes for the homeowners or investors, illustrating its potential to provide satisfactory service.</p>    <p>A handful of user reviews underscored successful interactions with EMB Management that involved resolving complex tasks and concerns with attentiveness. Examples of such interactions included facilitating paperworks and coordination with external parties, demonstrating EMB's capacity to handle a range inquires with professionalism when engaged effectively. The instances where the company exceeded expectations generally involved clear communication and a proactive approach from their team.</p>  </section>  <section>    <heading>      <h2>Great</h2>    </heading>    <p>From some outstanding reviews, EMB Management has been complimented for offering exceptional service beyond the basic expectations of a property management firm. For instance, the proactive and courteous demeanor of certain employees has been lauded, with users noting that their thorough explanations and patience in communication made positive impressions. These instances of 'great' service often stand out against the backdrop of negative experiences, providing some evidence that EBR Management is capable of commendable performance.</p>    <p>Moreover, there are incidences where the company has been critically acknowledged for its streamlined operations and adept handling of management complexities. When EMB Management shines, it appears to do so through a combination of effective property maintenance, transparency in financial dealings, and consistent adherence to governing documents. User reviews suggest that in these scenarios, the satisfaction is not only with the outcome but also with how the process is managed, implying that EMB has the potential for strong service delivery.</p>  </section>  <section>    <heading>      <h2>Bad</h2>    </heading>    <p>The 'bad' elements of EMB Management, according to some user reviews, involve an apparent lack of coordination and mismanagement. There are claims of misplaced cheques or disorganized billing practices that culminated in unwarranted late fees for homeowners. Additionally, simple mistakes, such as erroneous property names on documents, reflect a concerning inattention to detail. These incidents have seemingly contributed to a general sense of distrust towards the firm's administrative capabilities and cast doubt on its reliability.</p>    <p>Communication challenges are another area where EMB Management has received criticism. Users have reported difficulties in reaching the proper channels for assistance, with phone calls going unanswered and emails being ignored. This poor responsiveness has been a source of frustration, leaving clients feeling neglected. The lack of timely and clear responses has often exacerbated existing issues, leading to prolonged disputes and unresolved queries, thereby impacting the company's reputation for customer service.</p>  </section>  <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>The 'ugly' side of EMB Management seems to be mirrors significant displeasure, with consistent themes across numerous reviews indicating profound dissatisfaction. Several users have described experiences of disrespectful and unprofessional behavior from company representatives, including instances of eye-rolling, dismissive attitudes, and condescension. Inadequate property maintenance and a purported failure to enforce bylaws and regulations have also been cited as major points of contention, leading to overall low confidence in EMB's commitment to its fiduciary responsibilities.</p>    <p>Further exacerbating these dire sentiments is the observation of EMB's failure to address egregious accounting errors and the mismanagement of funds. User reviews detail shocking instances of lost reserve funds amounting to sizable sums, with ineffective resolutions or accountability from EMB. Additionally, long response times from the management to critical issues, like security concerns and structural damage, have been sources of severe irritation and worry for clients, further compounding the negativity surrounding the company's reputation.</p>  </section></article>"
}