{
  "name": "Evergreen Ridge Apartments",
  "slug": "evergreen-ridge-apartments",
  "company_type": "property",
  "address": "3451 Woburn St, Bellingham, WA 98226",
  "review_count": 13,
  "average_rating": 3.15,
  "reviews": {
    "google_reviews": [
      {
        "author": "Andres Moreno",
        "rating": 5.0,
        "review": "The place is excellent, very clean and organized, the attention is ideal, they are very considerate.\nThe manager John is very attentive he cares about making you feel welcome and solving any concerns that arise.",
        "ownerResponse": {
          "text": "Thank you Andres, we're very happy to have you here!"
        }
      },
      {
        "author": "Autumn Archuletta",
        "rating": 1.0,
        "review": "If I could give a 0 I would. The new owners are supposedly a non profit and these are income restricted. So why, in a single increase, was my rent raised by $890!? There is mold everywhere from previous water damage that I wasnt told ",
        "ownerResponse": null
      },
      {
        "author": "johnathan Hawkins (Guy)",
        "rating": 1.0,
        "review": "As of right now They like to tow cars and they have no signs up on who tows the car. After there remodel they have no signs up. So just call the cops to find out where your car goes.",
        "ownerResponse": null
      },
      {
        "author": "Karaoke Kitten",
        "rating": 5.0,
        "review": "I have lived at Evergreen Ridge apartment for 5+ years and my experience here has been exceptionally pleasant! The management and maintenance are very accommodating and friendly. The apartments are well cared for, clean and inviting. Pet ",
        "ownerResponse": null
      },
      {
        "author": "Helen Steele",
        "rating": 5.0,
        "review": "Great staff and a great location and within walking distance from two shopping centers, post office, restaurants and movie theatres.  The place has been relatively quiet, safe with a good sense of community. At this complex  a tenant may ",
        "ownerResponse": {
          "text": "Thank you Helen, we appreciate you!"
        }
      },
      {
        "author": "Pretty Betty",
        "rating": 5.0,
        "review": "I have lived here 5 plus years. The apartments are nice. It's clean and quiet. Our management/maintenance team are the best!! They are very helpful and always fix things right away. Both are very personable and kind.",
        "ownerResponse": {
          "text": "Thank you for the kind words, we're happy to have you here!"
        }
      },
      {
        "author": "Debbie Perez",
        "rating": 5.0,
        "review": "I have lived here for 2 years, going on 3. I am happy with my apartment. Management is kind and friendly. Maintenance is taken care of in a timely manner. Grounds are kept up nicely. Any concerns are always dealt with. I would recommend Evergreen Ridge Apts..",
        "ownerResponse": {
          "text": "Thank you Debbie! We appreciate you and hope to have you as a tenant for many more years!"
        }
      },
      {
        "author": "B",
        "rating": 5.0,
        "review": "Evergreen Ridge apartments is a wonderfully maintained property with a very professional and caring manager. The maintenance manager is available 24 hours a day and does great work in a timely manner. Location is perfect near Barkley and a few minutes to the freeway.",
        "ownerResponse": {
          "text": "Thank you for your review!"
        }
      },
      {
        "author": "Rose Flush Lawrence",
        "rating": 1.0,
        "review": "The managers at these apts. are very rude and was in a very bad mood when i inquired about them the lady and the gentleman think they have so much control with peoples lives I witnessed this one day when the manager was going to kick out a ",
        "ownerResponse": null
      },
      {
        "author": "Damascus Ventica",
        "rating": 1.0,
        "review": "LIES!\nJust so everyone knows, if you're looking for an honest genuine review, \"Google\" is not the place for that (nor is anywhere else on the internet). ",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "James P.",
        "rating": 5,
        "review": "This apartment complex is among the best, well managed small community  you can find today. I have lived in many apartment complex's in my time and this is by far the best. The management team was completely professional throughout the application process, yet still welcoming. We ran into a few snags with section 8 housing, but the team there took it in stride. At one point it was uncertain when and even if we were going to move in. Management continued to hold the apartment for us. The complex is also very strict on the rules and regulations of the lease agreement. This was a breath of fresh air for me because being lax leads to no one fallowing the rules. Lastly, the complex is in an ideal location and most areas, as well as the freeway are easily accessible. Renting here has been a pleasant experience thus far!",
        "ownerResponse": null
      },
      {
        "author": "Michelle G.",
        "rating": 1,
        "review": "I rented here for six years , the worst place ever ! Don't let the new paint they put on the outside and new windows and cheap blinds make you think they are nice . This new management is the worst. My unit flooded due to an explosion's of the expansion tank. They have 3 days to fix it . By law they have to offer you either another unit or a hotel. They said it would take one week to repair . When I asked the manager what they were doing to fix it they said oh dry the carpets out and your good to go. This happened on the 4th of November 2023. It was still not repaired when I moved out. I gave my notice as I asked them to replace the very old already stretcher out carpet and they had just sent on the 28th of November someone to asses the drywall damage as it had over two inches of water through the entire apartment, it was all declaired damaged so still no repairs. The water was left off and they put up no safety warnings for the water in the unit to stay out or anything. they didn't ask if i had a place to go or if i needed a place they never followed up to let me know what was going on with the unit but had me pay rent for the entire month . I was in it for 4 days . they had heaters running and fans for 24/7 days a week. My power bill never past 100 a month was over 200.00 and they also sent me a notice to inform me my rent was short and that they had added late fees for a unit i couldn't even stay in. i found out from several other tenants that they expansion tanks had also flooded their unit which meant they had never serviced them or done any checks on any of the hot water heaters following several floods continued to let them happen instead of replacing the 1995 expansion tank they had in the units. these by law are to be inspected once a yr. This place is awful the manager wouldn't answer our calls she was screening them. if any others want to come forward about there unit flooding at evergreen ridge i am taking them to small claims court in the process of filing now and have a good strong case for rent deposit as we cleaned without water. also for the cost of the 1000 deposit on new unit and extra expenses for the month i coach surfed. my things were al in my unit ruined and i expect payment for this . I have been stressed out and treated terrible by the management. No notices given when many people entered my apartment and a 48 hour notice must be issued leaving my things exposed and vulnerable to anyone who walked in my unit. Find another place do not move here they are money hungry unkind and  cheap.",
        "ownerResponse": null
      },
      {
        "author": "Melina Z.",
        "rating": 1,
        "review": "This apartment complex appears clean and maintained. DO NOT RENT FROM EVERGREEN RIDGE. My husband and I were model tenants--we kept our dog on his lead, cleaned up after him, and always paid rent on time, or within the 5-day window they state in the lease as being acceptable. When we moved out after two years, everything was cleaner than when we found it. We spent hours in there making sure. They not only revoked a free carpet cleaning they granted us after one year (citing that the staff that promised it didn't work there anymore, and that even if we used it, they'd still charge us $150 for a cleaning), but they said it took them four hours to clean it (there was absolutely nothing left to clean). When we applied at our new place, the woman Kelly at the front (so, so rude our whole two years) reported that we let our dog off leash, had smoke damage in the kitchen, and that we were late with the rent three times. Luckily our new property managers are wonderful, and saw it was unsubstantiated. \nThey also sued a neighboring resident whose dryer vent was clogged (outside maintenance's responsibility)--it caught fire, they lost everything, and ended up getting slapped with a $10,000 debt to this place. All of this, and yet they never did a thing about the drug dealers that lived everywhere throughout the complex. \nSave yourself a huge headache, don't rent from them, your rent skyrockets (went from $735 to $810/month for a 2-bed in 1-1/2 years), and they will do absolutely everything to withhold every cent of your deposit.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 13,
  "adjusted_average_rating": 3.15,
  "summary": "<article class='review-summary'>  <section>    <header>      <h2>Disclaimer</h2>    </header>    <p>This article is generated by ChatGPT and is only intended to be a tool to help individuals find a property management company or rental property. The summary provided here reflects a synthesis of user reviews for Evergreen Ridge Apartments and does not represent the views of the company itself. This article's intent is to deliver a balanced overview through categorized perspectives based on user reviews.</p>  </section>  <section>    <header>      <h2>The Good</h2>    </header>    <p>The bright spots at Evergreen Ridge Apartments are noted by several residents who have shared positive experiences. A number of positive user reviews laud the onsite management with descriptions such as \"attentive,\" \"caring,\" and \"professional,\" often highlighting an eagerness to assist with any resident concerns and ensuring a welcoming atmosphere. Such commendations suggest a strong sense of community and a responsive managerial staff.</p>    <p>Furthermore, the apartments have been praised for their cleanliness and maintenance. Long-term residents are particularly satisfied, feeling their needs are addressed promptly and effectively by the maintenance staff. Amenities and the property’s condition are often mentioned with satisfaction, with a nod to the aesthetic appeal and the sense of safety provided by adherence to the rules and regulations of the lease agreement.</p>  </section>  <section>    <header>      <h2>The Great</h2>    </header>    <p>The location of Evergreen Ridge Apartments stands out as a significant boon according to user reviews. Residents appreciate the proximity to shopping centers, restaurants, post offices, and movie theaters, complimenting the convenience of the location. The pet-friendly environment is another factor that has been mentioned, which adds to the comfortable living conditions for many tenants.</p>    <p>Additionally, the property management's efforts in holding apartments during uncertain times and the strict observance of lease terms provide residents with assurance and transparency. These actions indicate a potential for a high-quality living experience and a management team that prioritizes tenant satisfaction and clarity in their policies.</p>  </section>  <section>    <header>      <h2>The Bad</h2>    </header>    <p>Despite the positive aspects, there are grievances among a section of the reviewers. Issues such as severe rent hikes without sufficient explanation have been reported, which raises concerns about affordability and fairness. Some residents expressed distress about alleged neglect regarding apartment maintenance, specifically addressing problems like mold from water damage that proved to be persistent and unresolved.</p>    <p>Another common complaint concerns poor communication and a lack of transparency from the management team. Instances of unreturned phone calls, and perceived rudeness from the property managers, have led to frustration among some residents. These issues point to areas where the property management's service could improve to meet resident expectations and enhance their overall satisfaction.</p>  </section>  <section>    <header>      <h2>The Ugly</h2>    </header>    <p>The ugliest part of the reviews for Evergreen Ridge Apartments includes alarming claims of mismanagement and neglect of serious issues. There are accusations of mishandling situations such as flooding from the failure of outdated expansion tanks, which implies negligence in the proper servicing of appliances. Furthermore, the follow-up response to these incidents, including dealing with damaged property and potential health hazards, appears to be inadequate, amplifying distress among affected tenants.</p>    <p>Concerns regarding deposit returns and cleanliness upon move-out have been raised, casting a shadow on the trustworthiness of the property management's policies. Allegations of false damage claims and unjust charges upon tenants' departure can erode the community's confidence in the fairness of the property's administrative practices. These distressing accounts, although isolated, are particularly damaging to the reputation of the property management company and may require urgent attention and resolution.</p>  </section></article>"
}