{
  "name": "Fairhaven Park Apartments",
  "slug": "fairhaven-park-apartments",
  "company_type": "Property",
  "address": "1900 20th St, Bellingham, WA 98225",
  "review_count": 17,
  "average_rating": 3.35,
  "reviews": {
    "google_reviews": [
      {
        "author": "K R",
        "rating": 5,
        "review": "This apartment complex is tucked in between the woods of the Hundred Acres Park.  Cary, the new property manager, showed me around. She is professional, patient and addressed each of my requirements until I found something that I liked. While I was moving around with her it was clear that the place has a community feeling. There are some negative reviews here but they are in the past. But after meeting with Cary, one can assured that there would be a responsive and competent property manager on site.",
        "owner_response": null
      },
      {
        "author": "Rita 803",
        "rating": 5,
        "review": "It's only been a few months, but so far it's been great. Management has been helpful, as well as maintenance. The location is perfect with many trails leading out from the property. Rent is a bit high, but to me it's worth it, just the location alone. The complex overall is pretty quiet too, which is a bonus.\nUpdate: it's been two years now and I'm very satisfied with this management company, they are extremely responsive with maintenance issues and keep up the grounds on a regular basis. I may be here a while.",
        "owner_response": null
      },
      {
        "author": "Jillian Jolie",
        "rating": 1,
        "review": "Do not rent a unit from Fairhaven Park Apts.  The buildings have serious leaks that are left unfixed for years and no insulation in the walls.....this has led to horrible horrible mold-multiple and aggressive types.  My furniture and clothing was ruined in under 3 months.  My pets both had a mysterious fungal infection that developed within the 3 months.  My neighbors have a major leak that's been left unrepaired for a year and they still rent units to new tenants knowing the building is not livable.  They don't give a damn about putting people in dangerously toxic units and will lie to you without any hesitation.  They will be nice until you move in.  STAY AWAY and don't trust Megan or Jennifer or anyone in maintenance.",
        "owner_response": null
      },
      {
        "author": "Brandon Heald",
        "rating": 4,
        "review": "Not as bad as people say. I personally love the location of these apartments. Very close to so many beautiful trails. Everywhere in Bham is super expensive and most places don't allow you to smoke on the balcony.",
        "owner_response": null
      },
      {
        "author": "Katie-Gray Landham",
        "rating": 5,
        "review": "Our family has lived here for three years. We love the location, the neighbors, the pool, the woodsThis place is great! Management has always been helpful and responsive. Love love love!!",
        "owner_response": null
      },
      {
        "author": "Dwight Mann",
        "rating": 1,
        "review": "This used to be a nice place to live. Then around 2009 or so things started going downhill. Since then they try to jack up your rent to the max every year. On top of the rent increases they find other sneaky ways to squeeze more and more money out of you. The way they treat long time tenants is truly despicable.",
        "owner_response": null
      },
      {
        "author": "Timothy Benson",
        "rating": 2,
        "review": "Just had management come to my door informing me that I could not smoke outside on my private patio... My reaction was okay wont happen but I was misinformed and your policy does not specify that but instead states it is a smoke free community. I then tell them that that is misleading and that they need to change the policy to specify what that means.  The response I got was ... \" Oh move somewhere else then.\" I have not caused any problems nor do I feel I broke any rule seeing how they failed to have this in their policies.  That level of disrespect and rudeness is horrid and no one deserves to be treated like that.",
        "owner_response": null
      },
      {
        "author": "Michael W",
        "rating": 5,
        "review": "Love the look of the place its so cool",
        "owner_response": null
      },
      {
        "author": "Jeff",
        "rating": 5,
        "review": "Great spot",
        "owner_response": null
      },
      {
        "author": "johnnylukey",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Molly",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Britney B.",
        "rating": 5,
        "review": "Loved living at these apartments. Always super nice and friendly at the front. Lived here for 2 years and never had a problem. They allowed us to have our dog in the newly renovated apartment. Location is great - the Interurban trail goes right through the complex. Has a dog park, nice pool and gym, sauna! Everything you could want. Only thing missing, laundry was not in unit but you get used to it (or pay more money to have an in unit washer/dryer). Maintenance was always quick. Would definitely live here again if I had a need for an apartment.",
        "owner_response": null
      },
      {
        "author": "Lauren D.",
        "rating": 1,
        "review": "This is the worst place I've ever rented from. They gave me 10 incorrect copies of my lease with move in costs ranging from $1300-$2700. \n\nThey told me I was renting a 2 bedroom sight unseen unit for the first 3 weeks and then a week before I was supposed to move in they told me \"whoops, it's actually a 1 bedroom\" which they were about to charge me a 2 bedroom price for. This error caused me to spend more money and I ended up having to move my office and my apartment in the same weekend because it pushed out my move in date one full week.\n\nThey lost my paperwork and application in the portal and put the lease under my ex husbands name instead of mine. Why? I have now been waiting for my deposit check to be returned to me which is 3 weeks late and I have been told 3 times it is in the mail (all different dates). I am still waiting. Don't rent from them if you have other options available!",
        "owner_response": null
      },
      {
        "author": "Jon O.",
        "rating": 5,
        "review": "I have lived at Fairhaven Park Apartments for 21 years and moving here was one of the best decisions I have ever made. The buildings are spaced far from each other which you don't find in modern complexes. When I need service on the unit, they often respond in the same day and always in one day. The grounds are professionally maintained and always cared for. The walls might be made of concrete. I am not sure but I would never know from sounds that I wasn't completely alone here. I cannot say enough about the staff. They are really good people. You can't do better in Bellingham.",
        "owner_response": {
          "text": "Thank you so much for your recommendation, Jon! Were pleased that you recognized our efforts in making Fairhaven Park a place you can call home. We look forward to continuing to provide the same high-quality service for years to come!\n\nThe Fairhaven Park Team"
        }
      },
      {
        "author": "A C.",
        "rating": 1,
        "review": "Like other reviewers have stated, GET EVERYTHING IN DETAILED WRITING. We paid a deposit for what we were told was a 2-bedroom apartment about six weeks in advance. First, we were given the wrong apartment number. After that was straightened out, the managers were super insistent on not letting us see the apartment before signing the lease. It didn't seem right so we held off on signing the lease early. Two weeks before our move-in date, we found out it was only a 1-bedroom apartment even though our lease had the price of a 2-bedroom apartment listed. I don't know that management had any intention of voluntarily telling us it was a 1-bedroom before the day we moved in because I had to prod them for the information after I spoke to one of the neighbors who told me it was a 1-bedroom. Lucky for us, the apartment wasn't ready by our expected move-in date so the RCW states we get our money back. We ended up using Windermere Property Management and found a MUCH better place that we're super happy with. I'm a newbie to the area and if you have the time to look around, there are better apartments in Bellingham and the surrounding areas for about the same price (or less!) that INCLUDE washer/dryers and mircowaves in their units. \nIt's now been three weeks and we still haven't seen the return of our deposit. Calls and emails to Suhrco (the property management company) go unanswered. I'll update the review if this lands in small claims court.",
        "owner_response": null
      },
      {
        "author": "Kelsey M.",
        "rating": 1,
        "review": "If I could give this NO STARS I would. My husband was a property manager back in his day, so we have lived in MANY places and this is BY FAR THE WORST. I have story after story of not just my own experience but friends' stories also. The management of this property is unprofessional, unreliable, and offers terrible customer service. They have their own \"interpretations\" of the lease after it's signed. Meghan is a co-manager of this property- DON'T TRUST ANYTHING SHE SAYS. Do not live here. It's a great location, but IT'S NOT WORTH IT. You will get screwed in the end.",
        "owner_response": null
      },
      {
        "author": "NotHappy 1.",
        "rating": 1,
        "review": "I moved here because I liked the location and I could not find a cheaper rental in the area. I never planned on staying for long but they raise the rent every year making it impossible for me to save money and now I am paying as much for my apartment as I would for a nice home. Whenever neighbors move out and new flooring is installed in my neighboring apartments I am suffocated and probably harmed by the toxic floor glue fumes and off gassing that persists for weeks. I am using albuterol at higher doses than my doctor recommended just to sleep through the night. It is the worst in the bathroom where the fumes likely come through the ceiling fan vent. The first time it happened I taped plastic over the bathroom fan and left all my windows cracked open so I could breath. The second time it happened, I explained the situation and I asked a maintenance guy if he would please leave the windows open and tape plastic over the bathroom fan in the apartment where they were installing the flooring. He said \"I'm not going to do that.\" Besides that, I have been woken up many times by maintenance work right on the other side of the wall and it seems there is always a reason they need to disturb residents. Chainsaw work, hammering, hammer drill right outside my bedroom, leaf blowers, etc. I work from home and originally thought this seemed like a quiet out of the way place to get work done but it is not quiet. On top of that there is black mold in the walls and ceiling the grows through several times a year and all maintenance dose is add another layer of paint over the mold which is not a solution. I had read other reviews about mold so I asked specifically about that when I was considering renting here and was assured by the office staff and maintenance guy that there had never been mold in my apartment but I could not inspect it myself prior to signing a lease. When I got the keys I was very upset to discover all of the areas of fresh paint in the corners of the bedrooms that I guessed were covering up mold. As soon as the fall rain arrived the mold grew out through those spots and maintenance swore that was the first time it had grown there. Liars. I have other grievances but that's enough of a rant. Don't rent here",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 15,
  "adjusted_average_rating": 3.13,
  "distribution": {
    "1": 6,
    "2": 1,
    "3": 0,
    "4": 1,
    "5": 9
  },
  "summary": {
    "created_timestamp": 1739205462,
    "text": "<section id=\"good\"><h2>Good</h2><p>Fairhaven Park Apartments certainly offers some positive aspects as highlighted by multiple user reviews. Tenants frequently mention the picturesque location surrounded by wooded trails and proximity to recreational paths like the Interurban Trail. Several renters appreciated the community amenities, including a pool, gym, and proximity to nature, which make it an attractive choice for outdoor enthusiasts. Additionally, some residents have found the property management to be responsive and helpful, especially under new management, where one tenant noted an improved sense of community and management's attentiveness. Reviews also touch on the quiet atmosphere of the complex, with few disturbances from the surrounding environment or neighbors, making it an appealing location for those seeking tranquility.</p><p>Some tenants expressed contentment with the assistance provided by property management and maintenance staff, praising their responsiveness to issues and upkeep of the property grounds. There is a recurring theme of appreciation for the sense of community fostered by the friendly neighborhood and the availability of pet-friendly policies, adding to the complex's charm. Moreover, certain long-term residents have highly endorsed the living experience, emphasizing that the apartment's combination of spatial design and greenery is unparalleled in the region.</p></section><section id=\"great\"><h2>Great</h2><p>Delving into what makes Fairhaven Park Apartments stand out, several user reviews emphasize the remarkable service received from the property management. Recent changes in management appear to have brought about a significant improvement in the overall living experience, with new managers being described as patient, professional, and responsive. This level of care and attention from management has reassured tenants that their needs and concerns are addressed effectively, which fosters a positive living environment. Furthermore, living at Fairhaven Park is touted as a decision well made by some residents, who cannot praise enough about the responsive service, especially for its swift maintenance responses and overall staff professionalism.</p><p>One resident has cherished the decision to reside at Fairhaven Park for over two decades, highlighting how the quality of service and dedication from the staff have made it a long-term home. The spaciousness and modern layout of the apartments are commended by some users, who feel that it is hard to beat such standards in the region. Additionally, the amenity offerings, which include a pool, gym, and sauna, have been somewhat heralded, adding a touch of luxury to everyday life at the complex. These aspects contribute to the perception that Fairhaven Park Apartments provide more than just a place to live, but rather a comfortable and satisfying lifestyle.</p></section><section id=\"bad\"><h2>Bad</h2><p>While there are positive elements, Fairhaven Park Apartments have received several critiques from tenants that raise concerns. One notable complaint is the steep and seemingly frequent rent increases, which some tenants feel are unjustified and burdensome. These increases may deter long-term residents and create frustration among those wanting to stay in the area. Additionally, some residents have been dissatisfied with the lack of clear communication from management, particularly concerning policies like those about smoking – leading to misunderstandings and discomfort among tenants. This has been amplified by the perception of inflexibility from management when questions or concerns are raised.</p><p>Another point of contention is the inefficiency and inaccuracies some tenants experienced during lease agreement signing, including instances of incorrect lease paperwork and unexpected changes in apartment availability that were not communicated promptly. Such issues can lead to significant stress and financial inconvenience for prospective and current tenants. The management's handling of bonds and security deposit returns has been criticized, with claims of delayed refunds or lack of communication concerning financial transactions further overshadowing the positives of the complex.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most severe grievances in user reviews about Fairhaven Park Apartments involve maintenance issues that impact tenant health and safety, specifically complaints about mold and structural problems. Multiple reviews report serious mold problems that have not been adequately addressed, leading to potential health risks, ruined personal property, and additional stress for tenants. Some claim that maintenance only provides temporary fixes by painting over mold rather than resolving underlying issues. These unresolved problems have resulted in negative impacts on tenant well-being, including illnesses attributed to mold exposure and associated damages to personal belongings. Moreover, allegations of dishonesty from management, regarding apartment conditions and leasing terms, have strained tenant trust in the company. Many reviews cite mismanagement and deceit, such as inconsistent information about apartment details and a lack of transparency in communications concerning lease agreements and refunds. Such experiences have undeniably contributed to a fractured relationship between management and some of the tenant community, urging potential renters to proceed with caution.</p></section>"
  }
}