{
  "name": "Fairhaven Harbor",
  "slug": "fairhaven-harbor",
  "company_type": "Property",
  "address": "1310 9th St, Bellingham, WA 98225",
  "review_count": 15,
  "average_rating": 4.6,
  "reviews": {
    "google_reviews": [
      {
        "author": "Chris Glatz",
        "rating": 5,
        "review": "I have called Fairhaven Harbor Apts home for the past 3 years. I use the word Home seriously. It is a great place to live and the management is amazing as is the building, security and amenities. I will miss many things about not living there. I highly recommend it.",
        "owner_response": null
      },
      {
        "author": "Ellie Wylie",
        "rating": 5,
        "review": "I love living here so much! The units are beautiful and very spacious. High ceilings and very nice finishes. The building is very quiet and clean. Management and maintenance are great. Favorite apartment Ive had by far.\nHighly recommend !",
        "owner_response": null
      },
      {
        "author": "Susan Zanol",
        "rating": 5,
        "review": "I have lived at Fairhaven Harbor Apartments for nearly 18 months. I have owned free standing homes for many years. I can honestly say that if any of the apartments I lived in prior to owning were as wonderful as Fairhaven Harbor, I would never have purchased a house. The owner and management team are professional, very efficient, super customer centered, and just plain nice. This place has it all, including a perfect central location which is very walkable. The apartments are modern, attractive, roomy, comfortable and quiet. The common areas are spotless and the entire building is very well maintained. The views from the tastefully furnished rooftop deck are breathtaking, especially at sunset. I love that parking is assigned with much of it under the building. There are lots of other well thought out extras included in the rent. I have looked at most of the other rental options in this area. Fairhaven Harbor Apartments is by far the best in my opinion. This is home.",
        "owner_response": null
      },
      {
        "author": "Ginger Walters",
        "rating": 5,
        "review": "This is the perfect place for us to rent. The apartment is spacious and lots of light. Great location for walking around, going to the coffee shop, grocery store within walking distance. We love Fairhaven. Lots of delicious restaurants very close by. Manager Jackie is very accommodating and kind, she answered all of our questions. No complaints at all.",
        "owner_response": {
          "text": "Thankyou!  We believe the location is the best as well, next to Bellingham Bay, walking trails, yet adjacent to Fairhaven!"
        }
      },
      {
        "author": "Jackie H",
        "rating": 5,
        "review": "Hi Rita,\nThis is Jackie, the Property Manager for Fairhaven Harbor Apartments.\nI'm sorry you didn't feel good about the phone conversation we had the other day.\nPlease know my first priorities are to the tenants, the tenants that are moving in and the people who have applied and are moving in between now and May 1st.\nI am very busy as I mentioned to you. The apartments are going fast!\nThat is why I told you it would not be a good use of our time to show you apartments that would not be available in June or July\nGood luck in your search!",
        "owner_response": null
      },
      {
        "author": "Lucia Hough",
        "rating": 3,
        "review": "The apartments are okay. Great location, but the construction just isn't there. I was in a unit above the gym for about a year and was woken up after 11 PM and at 5:30 AM due to the sounds of the treadmill below me. It was completely nerve wracking to get some sleep or try to cook dinner and be disturbed by someone working out. Thankfully Dawnah and team were awesome and allowed me to move to a different apartment high up in the building.\n\nA couple weeks after moving in to the new unit I got a note underneath my door from my new downstairs neighbor asking me to keep it down / walk lighter. I haven't been doing anything crazy in my apartment. I walk around, cook, play with my dog, and when I do workouts I skip the jumping etc. I understand though. The gym was my biggest distraction in the other apartment but I could still hear my upstairs neighbor flushing his toilet or chopping vegetables. Truly frustrating.\n\nThe reason I moved into this complex was I thought it would be well built and quiet after having a terrific experience at a new build in Seattle from 2016 - 2018. Neither have proven to be the case.",
        "owner_response": null
      },
      {
        "author": "Rita Caufield",
        "rating": 2,
        "review": "I have been helping a friend start the apartment search in Bellingham since her lease is up at the end of August and she would be willing to sign a lease for June or July because she understands the market. We actually both work in property management with student housing, so we do understand the process. She has been living in downtown Bellingham for almost two years and is wanting a change, so I have been searching around Fairhaven for her. I came across Fairhaven Harbor Apartments and gave them a call since they did not have prices listed. I spoke to a women named Jackie and at first she was very helpful and knowledge about her property, but as soon as I asked if she had any showings available she seemed very busy in her schedule since she is currently pre-leasing. She gave me prices of two one-bedroom apartments that are available and what is included. I then proceeded to set up a time for a showing. I also wanted to let her know that my friend's current lease is up at the end of August, but is starting the hunt for a new place because she understands how hard Bellingham can be at times. By stating that I also said that she is willing to sign in June or July. I understand completely if two units are available now that they would not hold a spot at all especially since I work in Student Housing. As soon as I started to wrap up our conversation and said our date and time for a showing would work for us, the women Jackie said \"that would be a waste of our time.\" I immediately said thank you and appreciated her time. But as soon as I got off the phone I started to laugh because the lack of customer services was beyond disbelief. I hate to have this taint my impression of this property, but it has and unfortunately we will not be calling in the summer to see their availability.",
        "owner_response": null
      },
      {
        "author": "Brian Gass",
        "rating": 5,
        "review": "Property maagement is easy to work with and very responsive. Great building and close to everything in Fairhaven! Units are well built.",
        "owner_response": null
      },
      {
        "author": "Stacie Pratschner",
        "rating": 5,
        "review": "We're so happy to be living at Fairhaven Harbor!  Beautiful apartments, the best neighborhood, and great management and staff.  ",
        "owner_response": {
          "text": "Thanks for your comments.  We are very fortunate to have a great management team!  Thanks for the nice comments!"
        }
      },
      {
        "author": "Heather F",
        "rating": 5,
        "review": "Beautiful apartments, excellent amenities, and a great management team. Highly recommend renting here!!",
        "owner_response": null
      },
      {
        "author": "Bill Duffy",
        "rating": 5,
        "review": "Better then most gas stations for price in the area.",
        "owner_response": null
      },
      {
        "author": "mark aarstol",
        "rating": 5,
        "review": "A beautiful new building snuggled across from the bay in fairhaven.",
        "owner_response": null
      },
      {
        "author": "Donna Wilburn",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Ivy Giroux",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Brian Toohey",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "We love 5 stars Brian!!"
        }
      }
    ]
  },
  "adjusted_review_count": 12,
  "adjusted_average_rating": 4.58,
  "distribution": {
    "1": 0,
    "2": 1,
    "3": 1,
    "4": 1,
    "5": 12
  },
  "summary": {
    "created_timestamp": 1739095036,
    "text": "<section id=\"good\"><h2>Good</h2><p>Fairhaven Harbor Apartments has garnered a majority of positive feedback from users, highlighting an overall satisfying living experience. Many tenants find the apartments to be spacious, well-maintained, and located in an attractive neighborhood. The security and amenities offered, alongside the beautiful views from the rooftop deck, have been frequently appreciated. One user noted that the management team is highly professional and customer-focused, which significantly enhances the overall experience of residing in the building.</p><p>Another common theme in user reviews is the quality of construction and the quiet environment within the apartments. Residents feel that the units provide a comfortable living space with high ceilings and modern finishes. Many exclaim their love for the building and praise the surrounding area, citing its proximity to local restaurants, shops, and beautiful walking trails. Overall, many tenants express a strong sense of contentment and belonging while living at Fairhaven Harbor.</p></section><section id=\"great\"><h2>Great</h2><p>In this article, the feedback from users also indicates that Fairhaven Harbor Apartments boasts a commendable property management team. Several tenants commented on the responsiveness and helpfulness of the management, noting that they often felt supported and valued. One tenant shared their experience of an efficient move to a quieter unit in response to noise complaints, showcasing the management’s willingness to accommodate tenant needs. Such actions are crucial in maintaining tenant satisfaction and trust in the management team.</p><p>User reviews reflected well on the management's communication and professionalism, with multiple residents expressing their appreciation for the support they received. Moreover, the overall atmosphere of the property is often described as pleasant, contributing to the sense of community within the complex. The positive interactions with management and staff seem to enhance the living experience, marking Fairhaven Harbor as a desirable place for renters.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the many positive aspects of Fairhaven Harbor, there are some negative sentiments shared by a few users. One review documents a frustrating experience involving poor communication and a lack of customer service from the property management during an inquiry about showings. The reviewer felt dismissed, saying their attempt to secure a showing was deemed a \"waste of time,\" which left a negative impression of the overall service. This suggests that while many tenants have a positive relationship with management, there are occasional lapses in service that can mar the experience.</p><p>Additionally, another review highlighted issues related to noise, particularly for tenants living above shared spaces like the gym. Noise disturbances from late-night and early-morning workouts led to difficulties in maintaining a peaceful environment. Although some management strategies were implemented to address these concerns, the experience reflects that not all apartments are soundproof, which could be a deterrent for some potential residents.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most troubling feedback surrounding Fairhaven Harbor is related to the issues of tenant experiences that reflect a significant gap in communication and responsiveness from management. While the majority of reviews are positive, the few negative accounts indicate that not all tenants feel equally valued or heard. In particular, the experience of one user highlighted their frustration with an interaction where they felt their inquiries were not treated with the seriousness they deserved, which could lead to widespread dissatisfaction if unaddressed.</p><p>This type of negative experience suggests a need for management to focus on training and improving communication skills among staff members. Such instances may deter potential renters from choosing Fairhaven Harbor, emphasizing the importance of maintaining high standards not just in building quality, but also in tenant relations and satisfaction. It's crucial for management to take note of these experiences to improve their overall service and maintain their good reputation.</p></section>"
  }
}