{
  "name": "Fairhaven Park Apartments",
  "slug": "fairhaven-park-apartments",
  "company_type": "property",
  "address": "1900 20th St, Bellingham, WA 98225",
  "review_count": 15,
  "average_rating": 3.13,
  "reviews": {
    "google_reviews": [
      {
        "author": "Rita 803",
        "rating": 5.0,
        "review": "It's only been a few months, but so far it's been great. Management has been helpful, as well as maintenance. The location is perfect with many trails leading out from the property. Rent is a bit high, but to me it's worth it, just the location alone. The complex overall is pretty quiet too, which is a bonus.\nUpdate: it's been two years now and I'm very satisfied with this management company, they are extremely responsive with maintenance issues and keep up the grounds on a regular basis. I may be here a while.",
        "ownerResponse": null
      },
      {
        "author": "Katie-Gray Landham",
        "rating": 5.0,
        "review": "Our family has lived here for three years. We love the location, the neighbors, the pool, the woodsThis place is great! Management has always been helpful and responsive. Love love love!!",
        "ownerResponse": null
      },
      {
        "author": "Jillian Jolie",
        "rating": 1.0,
        "review": "Do not rent a unit from Fairhaven Park Apts.  The buildings have serious leaks that are left unfixed for years and no insulation in the walls.....this has led to horrible horrible mold-multiple and aggressive types.  My furniture and clothing was ruined in under 3 months.  My pets both had a mysterious fungal infection that developed within the 3 months.  My neighbors have a major leak that's been left unrepaired for a year and they still rent units to new tenants knowing the building is not livable.  They don't give a damn about putting people in dangerously toxic units and will lie to you without any hesitation.  They will be nice until you move in.  STAY AWAY and don't trust Megan or Jennifer or anyone in maintenance.",
        "ownerResponse": null
      },
      {
        "author": "Brandon Heald",
        "rating": 4.0,
        "review": "Not as bad as people say. I personally love the location of these apartments. Very close to so many beautiful trails. Everywhere in Bham is super expensive and most places don't allow you to smoke on the balcony.",
        "ownerResponse": null
      },
      {
        "author": "Dwight Mann",
        "rating": 1.0,
        "review": "This used to be a nice place to live. Then around 2009 or so things started going downhill. Since then they try to jack up your rent to the max every year. On top of the rent increases they find other sneaky ways to squeeze more and more money out of you. The way they treat long time tenants is truly despicable.",
        "ownerResponse": null
      },
      {
        "author": "Timothy Benson",
        "rating": 2.0,
        "review": "Just had management come to my door informing me that I could not smoke outside on my private patio... My reaction was okay wont happen but I was misinformed and your policy does not specify that but instead states it is a smoke free community. I then tell them that that is misleading and that they need to change the policy to specify what that means.  The response I got was ... \" Oh move somewhere else then.\" I have not caused any problems nor do I feel I broke any rule seeing how they failed to have this in their policies.  That level of disrespect and rudeness is horrid and no one deserves to be treated like that.",
        "ownerResponse": null
      },
      {
        "author": "Michael W",
        "rating": 5.0,
        "review": "Love the look of the place its so cool",
        "ownerResponse": null
      },
      {
        "author": "Jeff",
        "rating": 5.0,
        "review": "Great spot",
        "ownerResponse": null
      },
      {
        "author": "johnnylukey",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Molly",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Lauren D.",
        "rating": 1,
        "review": "This is the worst place I've ever rented from. They gave me 10 incorrect copies of my lease with move in costs ranging from $1300-$2700. \n\nThey told me I was renting a 2 bedroom sight unseen unit for the first 3 weeks and then a week before I was supposed to move in they told me \"whoops, it's actually a 1 bedroom\" which they were about to charge me a 2 bedroom price for. This error caused me to spend more money and I ended up having to move my office and my apartment in the same weekend because it pushed out my move in date one full week.\n\nThey lost my paperwork and application in the portal and put the lease under my ex husbands name instead of mine. Why? I have now been waiting for my deposit check to be returned to me which is 3 weeks late and I have been told 3 times it is in the mail (all different dates). I am still waiting. Don't rent from them if you have other options available!",
        "ownerResponse": null
      },
      {
        "author": "Britney B.",
        "rating": 5,
        "review": "Loved living at these apartments. Always super nice and friendly at the front. Lived here for 2 years and never had a problem. They allowed us to have our dog in the newly renovated apartment. Location is great - the Interurban trail goes right through the complex. Has a dog park, nice pool and gym, sauna! Everything you could want. Only thing missing, laundry was not in unit but you get used to it (or pay more money to have an in unit washer/dryer). Maintenance was always quick. Would definitely live here again if I had a need for an apartment.",
        "ownerResponse": null
      },
      {
        "author": "A C.",
        "rating": 1,
        "review": "Like other reviewers have stated, GET EVERYTHING IN DETAILED WRITING. We paid a deposit for what we were told was a 2-bedroom apartment about six weeks in advance. First, we were given the wrong apartment number. After that was straightened out, the managers were super insistent on not letting us see the apartment before signing the lease. It didn't seem right so we held off on signing the lease early. Two weeks before our move-in date, we found out it was only a 1-bedroom apartment even though our lease had the price of a 2-bedroom apartment listed. I don't know that management had any intention of voluntarily telling us it was a 1-bedroom before the day we moved in because I had to prod them for the information after I spoke to one of the neighbors who told me it was a 1-bedroom. Lucky for us, the apartment wasn't ready by our expected move-in date so the RCW states we get our money back. We ended up using Windermere Property Management and found a MUCH better place that we're super happy with. I'm a newbie to the area and if you have the time to look around, there are better apartments in Bellingham and the surrounding areas for about the same price (or less!) that INCLUDE washer/dryers and mircowaves in their units. \nIt's now been three weeks and we still haven't seen the return of our deposit. Calls and emails to Suhrco (the property management company) go unanswered. I'll update the review if this lands in small claims court.",
        "ownerResponse": null
      },
      {
        "author": "Kelsey M.",
        "rating": 1,
        "review": "If I could give this NO STARS I would. My husband was a property manager back in his day, so we have lived in MANY places and this is BY FAR THE WORST. I have story after story of not just my own experience but friends' stories also. The management of this property is unprofessional, unreliable, and offers terrible customer service. They have their own \"interpretations\" of the lease after it's signed. Meghan is a co-manager of this property- DON'T TRUST ANYTHING SHE SAYS. Do not live here. It's a great location, but IT'S NOT WORTH IT. You will get screwed in the end.",
        "ownerResponse": null
      },
      {
        "author": "NotHappy 1.",
        "rating": 1,
        "review": "I moved here because I liked the location and I could not find a cheaper rental in the area. I never planned on staying for long but they raise the rent every year making it impossible for me to save money and now I am paying as much for my apartment as I would for a nice home. Whenever neighbors move out and new flooring is installed in my neighboring apartments I am suffocated and probably harmed by the toxic floor glue fumes and off gassing that persists for weeks. I am using albuterol at higher doses than my doctor recommended just to sleep through the night. It is the worst in the bathroom where the fumes likely come through the ceiling fan vent. The first time it happened I taped plastic over the bathroom fan and left all my windows cracked open so I could breath. The second time it happened, I explained the situation and I asked a maintenance guy if he would please leave the windows open and tape plastic over the bathroom fan in the apartment where they were installing the flooring. He said \"I'm not going to do that.\" Besides that, I have been woken up many times by maintenance work right on the other side of the wall and it seems there is always a reason they need to disturb residents. Chainsaw work, hammering, hammer drill right outside my bedroom, leaf blowers, etc. I work from home and originally thought this seemed like a quiet out of the way place to get work done but it is not quiet. On top of that there is black mold in the walls and ceiling the grows through several times a year and all maintenance dose is add another layer of paint over the mold which is not a solution. I had read other reviews about mold so I asked specifically about that when I was considering renting here and was assured by the office staff and maintenance guy that there had never been mold in my apartment but I could not inspect it myself prior to signing a lease. When I got the keys I was very upset to discover all of the areas of fresh paint in the corners of the bedrooms that I guessed were covering up mold. As soon as the fall rain arrived the mold grew out through those spots and maintenance swore that was the first time it had grown there. Liars. I have other grievances but that's enough of a rant. Don't rent here",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 13,
  "adjusted_average_rating": 2.85,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is a summary generated by ChatGPT and is intended to be a tool to help potential tenants gain insights into Fairhaven Park Apartments. The opinions expressed in this article reflect those found in user reviews and do not represent those of the property management company. This article's intent is to provide a balanced summary based on user reviews without exposing personal information.</p>  </section>  <section>    <heading><h2>Good</h2></heading>    <p>Some residents of Fairhaven Park Apartments have reported positive experiences, highlighting the helpfulness of management and the efficiency of the maintenance team. The property's location is frequently mentioned as a standout feature, with numerous trails leading from the property which provide a serene atmosphere alongside the many reported benefits of the surrounding area. Moreover, the complex is appreciated for its quiet environment, making it a beneficial place to live for those seeking a peaceful home.</p>    <p>In addition, long-term tenants have expressed satisfaction with how the property has been managed over the years, noting that issues are addressed with prompt responses. These reviews often mention the property's upkeep, suggesting that the management invests in regular maintenance of the grounds, contributing to the complex's overall value for its residents.</p>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>Enthusiastic praise is given for certain amenities, such as the pool and the pet-friendly policies, which enhance the living experience. A number of reviews have spotlighted the positive atmosphere created by a welcoming and friendly management team. Residents enjoy the added luxuries such as proximity to trails, with one user review conveying a sense of community fostered by the property and indicating a warm neighborhood feel.</p>    <p>The physical appearance of Fairhaven Park Apartments is often described favorably, with some reviews expressing love for the look and design of the establishment. The appreciation extends to administrative interactions, with mentions of a pleasant front office that contribute to a stress-free experience for at least a portion of the residents during their tenure in the apartments.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>Nonetheless, critiques emerge with some reviews pointing to issues such as unexpected rent hikes, which may burden long-term tenants financially. There’s a sentiment among some users that the property has seen better days, with a downward spiral in terms of rental policies, possibly indicating a trend towards maximizing profit at the expense of tenant satisfaction. Additionally, instances of miscommunication regarding the policies, particularly related to the restrictions on smoking areas, have caused discontent among certain residents.</p>    <p>Moreover, administrative challenges have been noted by some reviewers, including allegedly lost paperwork, poor communication resulting in rent discrepancies, and delays in the return of security deposits. Such experiences have resulted in a level of frustration for those residents who expected a more seamless and professional approach from the management team at Fairhaven Park Apartments.</p>  </section>  <section>    <heading><h2>Ugly</h2></heading>    <p>Serious concerns arise from accounts of health and safety issues due to mold and potential toxicity within the apartments. Residents recount adverse effects on personal belongings, health troubles for both humans and pets, and an overall sense of neglect when it comes to addressing these significant hazards. Furthermore, allegations of deceit by the management in renting out unlivable units suggest deep-seated issues that may warrant concern for prospective tenants.</p>    <p>Other complaints detail pervasive noise disruptions from maintenance work and intrusive odors from renovation materials, which detract from the overall livability. Certain reviewers are vocal about their grievances, using stark language to advise against renting at Fairhaven Park Apartments. This article's research suggests common themes of neglect in addressing maintenance concerns, difficulty in communications, and a general impression among some tenants that the management does not prioritize the well-being of its residents.</p>  </section></article>"
}