{
  "name": "Fairhaven Harbor",
  "slug": "fairhaven-harbor",
  "company_type": "property",
  "address": "1310 9th St, Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 4.54,
  "reviews": {
    "google_reviews": [
      {
        "author": "Susan Zanol",
        "rating": 5.0,
        "review": "I have lived at Fairhaven Harbor Apartments for nearly 18 months. I have owned free standing homes for many years. I can honestly say that if any of the apartments I lived in prior to owning were as wonderful as Fairhaven Harbor, I would never have purchased a house. The owner and management team are professional, very efficient, super customer centered, and just plain nice. This place has it all, including a perfect central location which is very walkable. The apartments are modern, attractive, roomy, comfortable and quiet. The common areas are spotless and the entire building is very well maintained. The views from the tastefully furnished rooftop deck are breathtaking, especially at sunset. I love that parking is assigned with much of it under the building. There are lots of other well thought out extras included in the rent. I have looked at most of the other rental options in this area. Fairhaven Harbor Apartments is by far the best in my opinion. This is home.",
        "ownerResponse": null
      },
      {
        "author": "Ginger Walters",
        "rating": 5.0,
        "review": "This is the perfect place for us to rent. The apartment is spacious and lots of light. Great location for walking around, going to the coffee shop, grocery store within walking distance. We love Fairhaven. Lots of delicious restaurants very close by. Manager Jackie is very accommodating and kind, she answered all of our questions. No complaints at all.",
        "ownerResponse": {
          "text": "Thankyou!  We believe the location is the best as well, next to Bellingham Bay, walking trails, yet adjacent to Fairhaven!"
        }
      },
      {
        "author": "Jacqueline Hall",
        "rating": 5.0,
        "review": "Hi Rita,\nThis is Jackie, the Property Manager for Fairhaven Harbor Apartments.\nI'm sorry you didn't feel good about the phone conversation we had the other day.\nPlease know my first priorities are to the tenants, the tenants that are moving in and the people who have applied and are moving in between now and May 1st.\nI am very busy as I mentioned to you. The apartments are going fast!\nThat is why I told you it would not be a good use of our time to show you apartments that would not be available in June or July\nGood luck in your search!",
        "ownerResponse": null
      },
      {
        "author": "Lucia Hough",
        "rating": 3.0,
        "review": "The apartments are okay. Great location, but the construction just isn't there. I was in a unit above the gym for about a year and was woken up after 11 PM and at 5:30 AM due to the sounds of the treadmill below me. It was completely nerve wracking to get some sleep or try to cook dinner and be disturbed by someone working out. Thankfully Dawnah and team were awesome and allowed me to move to a different apartment high up in the building.\n\nA couple weeks after moving in to the new unit I got a note underneath my door from my new downstairs neighbor asking me to keep it down / walk lighter. I haven't been doing anything crazy in my apartment. I walk around, cook, play with my dog, and when I do workouts I skip the jumping etc. I understand though. The gym was my biggest distraction in the other apartment but I could still hear my upstairs neighbor flushing his toilet or chopping vegetables. Truly frustrating.\n\nThe reason I moved into this complex was I thought it would be well built and quiet after having a terrific experience at a new build in Seattle from 2016 - 2018. Neither have proven to be the case.",
        "ownerResponse": null
      },
      {
        "author": "Rita Caufield",
        "rating": 2.0,
        "review": "I have been helping a friend start the apartment search in Bellingham since her lease is up at the end of August and she would be willing to sign a lease for June or July because she understands the market. We actually both work in property management with student housing, so we do understand the process. She has been living in downtown Bellingham for almost two years and is wanting a change, so I have been searching around Fairhaven for her. I came across Fairhaven Harbor Apartments and gave them a call since they did not have prices listed. I spoke to a women named Jackie and at first she was very helpful and knowledge about her property, but as soon as I asked if she had any showings available she seemed very busy in her schedule since she is currently pre-leasing. She gave me prices of two one-bedroom apartments that are available and what is included. I then proceeded to set up a time for a showing. I also wanted to let her know that my friend's current lease is up at the end of August, but is starting the hunt for a new place because she understands how hard Bellingham can be at times. By stating that I also said that she is willing to sign in June or July. I understand completely if two units are available now that they would not hold a spot at all especially since I work in Student Housing. As soon as I started to wrap up our conversation and said our date and time for a showing would work for us, the women Jackie said \"that would be a waste of our time.\" I immediately said thank you and appreciated her time. But as soon as I got off the phone I started to laugh because the lack of customer services was beyond disbelief. I hate to have this taint my impression of this property, but it has and unfortunately we will not be calling in the summer to see their availability.",
        "ownerResponse": null
      },
      {
        "author": "Brian Gass",
        "rating": 5.0,
        "review": "Property maagement is easy to work with and very responsive. Great building and close to everything in Fairhaven! Units are well built.",
        "ownerResponse": null
      },
      {
        "author": "Stacie Pratschner",
        "rating": 5.0,
        "review": "We're so happy to be living at Fairhaven Harbor!  Beautiful apartments, the best neighborhood, and great management and staff.  ",
        "ownerResponse": {
          "text": "Thanks for your comments.  We are very fortunate to have a great management team!  Thanks for the nice comments!"
        }
      },
      {
        "author": "Heather F",
        "rating": 5.0,
        "review": "Beautiful apartments, excellent amenities, and a great management team. Highly recommend renting here!!",
        "ownerResponse": null
      },
      {
        "author": "Bill Duffy",
        "rating": 5.0,
        "review": "Better then most gas stations for price in the area.",
        "ownerResponse": null
      },
      {
        "author": "mark aarstol",
        "rating": 5.0,
        "review": "A beautiful new building snuggled across from the bay in fairhaven.",
        "ownerResponse": null
      },
      {
        "author": "Donna Wilburn",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ivy Giroux",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brian Toohey",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We love 5 stars Brian!!"
        }
      }
    ]
  },
  "adjusted_review_count": 10,
  "adjusted_average_rating": 4.5,
  "summary": "<article>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT and is intended to be a tool to help individuals find a property management company or rental property. The summary below reflects sentiments derived from user reviews of Fairhaven Harbor and does not include any identifiable information about the reviewers. This article's intent is to collate these reviews into a balanced perspective, highlighting both the positive and negative aspects as expressed by users.</p>  </section>  <section>    <heading><h2>Good</h2></heading>    <p>Residents of Fairhaven Harbor praise the property for its prime location, which is highly walkable and close to amenities like coffee shops, grocery stores, and restaurants. The appeal of Fairhaven is often highlighted, along with the convenience of having assigned parking, often sheltered within the building itself. These features have been particularly appreciated by those who enjoy the lifestyle and convenience offered in the Fairhaven area.</p>    <p>The management team at Fairhaven Harbor, including the manager named Jackie, has been described as accommodating, knowledgeable, and kind. Many users noted that their questions were answered to their satisfaction. Additionally, the apartments themselves receive compliments for being modern, attractive, and comfortable, with the added appeal of common areas that are kept spotless and well-maintained.</p>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>The construction quality and amenities at Fairhaven Harbor are often cited as standouts, with some users describing the property as well-built and the management as very responsive. Residents enjoy the premium feel of their living spaces, and some have had positive experiences with the available facilities, such as a gym and rooftop deck. The views offered, particularly sunsets from communal areas, have been mentioned as breathtaking.</p>    <p>Additionally, the high level of customer service and professionalism displayed by the owner and management team is a recurrent theme among reviews. This has helped current tenants to feel valued and well-cared-for, which is a significant draw for potential renters. The response rate from the management to user reviews shows a commitment to engagement, as evidenced by owner replies to positive feedback.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>Despite many positive remarks, there are criticisms concerning the sound insulation of the apartments. Some residents have experienced disturbances from noise within the building, such as being able to hear neighbors' activities or sounds from the gym at odd hours. This indicates that while the construction is generally lauded, there may be room for improvement in terms of noise control to ensure that all residents can enjoy a peaceful and quiet living environment.</p>    <p>The frustration around this issue is palpable in some user reviews, where the disruption has affected their daily lives. Residents expecting a certain standard of quietness based on their experiences with newly constructed properties elsewhere have felt let down in this aspect at Fairhaven Harbor.</p>  </section>  <section>    <heading><h2>Ugly</h2></heading>    <p>One particularly negative experience that stands out in the user reviews involves the perception of poor customer service encountered during initial inquiries. A user described a conversation with a property manager that ended abruptly with the sentiment that pursuing a potential showing would be a 'waste of our time,' leaving the reviewer with a tainted impression of the property and its management. Such experiences, though not reflective of the overall trend, are significant as they can deter potential renters and tarnish Fairhaven Harbor's reputation for customer care.</p>    <p>There's also an indication that the pre-leasing process may be hectic, and the staff might appear overburdened, which could lead to miscommunications or unsatisfactory interactions with prospective tenants. Although this is only mentioned in a minority of the user reviews, it's a concern that potential renters may want to consider when reaching out to Fairhaven Harbor's management team.</p>  </section></article>"
}