{
  "name": "Foothills Apartments",
  "slug": "foothills-apartments",
  "company_type": "property",
  "address": "1320 Lakeway Dr, Bellingham, WA 98229",
  "review_count": 26,
  "average_rating": 2.88,
  "reviews": {
    "google_reviews": [
      {
        "author": "Paula",
        "rating": 1.0,
        "review": "I was a resident of the Foothills property for 3 years, during which I had many unfortunate interactions with the Royce Group management. I was targeted for a few dead plants at the end of season while allowing other properties to look disorderly with no resolution. I believe this was largely based on my age (in my 60s). They aggressively targeted me for things that were not even my property without asking like a civilized adult. They assumed that a TV left in the parking area was mine and threatened to fine me for its disposal. At the time, I didnt even own a TV.\nThey Impounded my car and lied about it. Despite knowing exactly where I lived, they placed a sticker on my car facing away from where it would be easily noticeable over the weekend. When confronted they said that it was towed because it was inoperable (a lie as I had driven it out of impound). They then tried to lie saying it was because the tabs were expired (also NOT the case). They did not make any attempt to call me, knock on my door, or show any good faith attempt to resolve the issue before towing. Only reason I did not sue was because my daughter found a technicality in the lease stating that they could do that if the vehicle had any disrepair ( one of my windows did not roll up all the way and my bumper had some tape on it). All of this while allowing multiple other vehicles to remain on the property without having been moved for months. This was definitely an act of aggression based on impoverished appearances. They show disdain for people of lower income. Despite that, they themselves do not keep up their own property.\nFailure to light pathways caused me to fall showing that they did not care about the safety of their tenants  as well as car damaging pot holes that they were informed of multiple times and did nothing for the entire duration of my tenancy. They continuously raised the rent despite not investing it in making their property a nice place to live for the price. They also offered a swimming pool in their advertisement which remained empty for the majority of my tenancy then was filled in with dirt (false advertising amenities). The maintenance staff were incredibly courteous and went out of their way to help. They deserve more professional employers. The dwelling itself was alright, nice storage. The place has a lot of potential to be very nice if it werent for the deplorable behaviors of their management team.",
        "ownerResponse": null
      },
      {
        "author": "LCL Blonde",
        "rating": 1.0,
        "review": "I have a good friend who has lived at the Foothills for 10 years. She is nearly 70 years old and has a 34 year old mentally ill son she cares for 24 hours a day. He has schizophrenia and sometimes talks out loud to the voices in his head. He is a sweet young man when stabilized and totally harmless. A new neighbor heard him carrying on a conversation with himself and got frightened. She complained to the office and they are now in the process of being evicted.\nLast October, her upstairs hot water heater exploded and flooded the upstairs bathroom and the kitchen on lower level. There is no flooring or sink in upstairs bathroom, and no kitchen sink, cupboards, or counter in the kitchen. They provided her a small wash basin to do dishes. She has continued to pay rent and continued living in these terrible conditions for 5 months.\nShe is soon to be homeless, as she can not find a place to rent. This entire situation is atrocious and should be illegal.",
        "ownerResponse": null
      },
      {
        "author": "Tia Vick-Teachman",
        "rating": 4.0,
        "review": "I have close friends who live there. The rent has been raised excessively every year and the only amenity is a coin operated washer and dryer, the walls are thin so you can hear the neighbors and the units are difficult to heat. (What he says). They seem nice to me.",
        "ownerResponse": null
      },
      {
        "author": "Monica Briones",
        "rating": 1.0,
        "review": "Theyre old. Really old. And they dont warn you about the horrible theft problem they have. My boyfriend has his vehicle stolen in broad daylight. Neighbors watched and everything. Apartment managers dont seem to concerned.",
        "ownerResponse": null
      },
      {
        "author": "Monika Sami",
        "rating": 1.0,
        "review": "Ive had the worst experience with this property management. My car has be involved in two accidents! One was a hit and run and now someone keyed my car! There is no one who will contact you for months to any type of compliant to corporate. The rent is cheap and I have two kids and they expect an income three times the amount of the rent! Horrible horrible horrible!!!",
        "ownerResponse": null
      },
      {
        "author": "Melissa Garcia",
        "rating": 1.0,
        "review": "Nestled behind a busted up 7/11, this complex is the brain child of a meth addict who saw the musical Cats one too many times. What's that in the woods, is that a friendly elf? Why no, it's a hobo holding a lawn gnome shouting racist slurs.",
        "ownerResponse": null
      },
      {
        "author": "Diva Azia",
        "rating": 1.0,
        "review": "The managment of this facility is racist and biased. They gave a combated veteran an eviction notice over a BLM sign which he had in his window for over 2 years but residents with #ImpeachTrumpNow stickers didnt receive a thing.",
        "ownerResponse": null
      },
      {
        "author": "Shaun S",
        "rating": 1.0,
        "review": "The owners are jerks that love to give tickets. Maintenance is great tho. What's up with the dirt filled pool?!",
        "ownerResponse": null
      },
      {
        "author": "Destinee Hardenbrook",
        "rating": 3.0,
        "review": "I've lived there not bad could be better but ya nice neighbors pets allowed dogs over one year though.",
        "ownerResponse": null
      },
      {
        "author": "Robert Gora",
        "rating": 4.0,
        "review": "Really quiet and very elegant believe it or not",
        "ownerResponse": null
      },
      {
        "author": "Zoe Cruz",
        "rating": 1.0,
        "review": "TERRIBLE PLACE TO LIVE!!!",
        "ownerResponse": null
      },
      {
        "author": "A Hues",
        "rating": 5.0,
        "review": "Cute",
        "ownerResponse": null
      },
      {
        "author": "David PJ Tye",
        "rating": 4.0,
        "review": "Decent",
        "ownerResponse": null
      },
      {
        "author": "matthew chapanar",
        "rating": 3.0,
        "review": "People are annoying",
        "ownerResponse": null
      },
      {
        "author": "David Tye",
        "rating": 5.0,
        "review": "Person bisimess",
        "ownerResponse": null
      },
      {
        "author": "Azhmaliyyih Teal",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Change Anderson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Elizabeth Liz Elsesser",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mary Giles",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "D S",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Nathan Mattly",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "C W (CeeDubs)",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Natalja Savicka",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Miranda Levine",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Dykezilla Danimal",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Seraphim V.",
        "rating": 1,
        "review": "The foothills apartments give me dirty crack den vibes. I've been living here for the past year with my significant other and we're ACTIVELY trying to find anywhere else to live but what I can call the lowest end dumps in the deepest depths of hell itself. We pay 915 for a one bedroom but come a few months from now, our place will be 1050 a month. We have walls so thin I doubt paper would be a good analogy for how gaunt the walls are. We don't have any sort of dishwasher in our place and we have disruptive neighbors who play piano at odd hours and take long noisy showers also at odd hours. Our bedroom and living room will be freezing cold if we don't keep our heaters on at all hours of the day, that jacks up our electric bill quite a bit as well. The pot holes are atrocious and I'm sure they keep f'ing up the brakes of our vehicle. They claim to have a swimming pool but it's always covered and actually FILLED WITH DIRT. So, they lie, we have a leak in the ceiling and I have called the royce group about it but they haven't called back or tried to send a maintenance guy over to patch it up. The water here goes cold within minutes so you better like taking speedy showers. Oh, and our power just shuts off because the breakers get overloaded by a lamp. Most of the switches and outlets are dead in our apartment so getting things to power up is scarce to say the least. They also overcharged us to move in. 915 a month for rent but I paid nearly 3200 bucks to get a place here. Quite a rip-off and I'm concerned I'll be not able to move out since I'm straddling the poverty line. I cannot recommend these dirt bags to anyone. Hope I don't get evicted for this review!",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 16,
  "adjusted_average_rating": 2.31,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This summary is generated by ChatGPT and is only intended to be a tool to help find a property management company or rental property. Please note that the opinions and experiences described in this article are derived from user reviews and do not necessarily reflect the views of the company in question.</p>  </section>  <section>    <h2>The Good</h2>    <p>Some residents have voiced that Foothills Apartments have qualities worth mentioning. A number of user reviews mention the maintenance staff positively, with tenants finding them to be courteous and eager to assist, providing service with a level of professionalism that is appreciated. The living spaces are also described by some as satisfactory, noting nice storage and a quiet atmosphere in some parts of the complex.</p>    <p>The affordability of the apartments comes up a couple of times as a positive aspect, with mentions of reasonable rent for the accommodations provided. Pets being allowed and having nice neighbors are additional good points noted by a few reviewers. A sentiment of potential for the Foothills Apartments to be a very nice place to live is mentioned when considering these favorable factors.</p>  </section>  <section>    <h2>The Great</h2>    <p>While many reviews are critical, there are those who have had more positive experiences. Certain tenants mention the quiet and elegance of the apartments, and a few reviews from people visiting friends at the complex have left with positive impressions, citing aspects like good management and decent living conditions.</p>    <fact><p>Overall, a handful of reviews express satisfaction with their experience, emphasizing the tranquility and potential for a comfortable community at Foothills Apartments. The higher ratings suggest that for a select group of individuals, the Foothills Apartments provide a living experience that goes beyond the basic requirements and offers a peaceful home environment.</p>  </section>  <section>    <h2>The Bad</h2>    <p>Several residents have expressed dissatisfaction with experiences at Foothills Apartments related to property maintenance concerns. Reports of issues such as dangerous potholes in the parking area, lack of action regarding vehicle theft, and inadequately maintained common areas were frequently mentioned. Additionally, a problem with poor lighting on pathways leading to a fall suggests a neglect for tenant safety and overall maintenance of the property.</p>    <p>Communication with management appears to be a recurring problem, as indicated by complaints of unanswered calls or delayed responses to various concerns, including blatant disregard for severe complaints and inconsistencies in policy enforcement. The absence of outreach from the property management even in the face of serious issues paints a picture of inefficiency and apathy towards tenant welfare and contentment.</p>  </section>  <section>    <h2>The Ugly</h2>    <p>The most distressing concerns raised by tenants relate to alleged mistreatment and prejudice by management. Accusations range from unfairly aggressive enforcement of rules to outright discriminatory behaviors such as targeting marginalized individuals. There are alarming accounts of eviction threats over personal items on display and implied bias against tenants who are elderly or have illnesses.</p>    <p>Financial grievances have also surfaced, with residents feeling exploited due to sharp and consistent rent increases without corresponding improvements to amenities or living conditions. The prospect of untenable rent hikes, alongside unsettling descriptions of the apartment complex invoking images of decay and neglect, contributes to the indignation expressed in several user reviews. This has led to strong language used by disgruntails who associate their living experience with the lowest quality of rental accommodation.</p>  </section></article>"
}