{
  "name": "Forest Park Apartments",
  "slug": "forest-park-apartments",
  "company_type": "Property",
  "address": "2605 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 15,
  "average_rating": 3.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Grace Blesch",
        "rating": 5,
        "review": "Sarah  and the whole team have been so helpful relocating my son and I after a less than favorable situation at another complex. Communication and planning have been on point  and they do their absolute best to keep me informed on any concerns or changes happening in our quiet community.  The apartment was pristine when we moved in and any work orders Ive entered have been taken care of the very next day! Including a new fridge at the first sign of thaw! Im extremely impressed with the Suhrco work ethic and you can tell everyone really cares about their residents and about equity throughout.\nFriends and family that have visited also can see themselves living here and have all commented at the quiet and calmness of the property.\n5 stars\n\nWould recommend 100%",
        "owner_response": null
      },
      {
        "author": "Halfkin Rainbolt",
        "rating": 4,
        "review": "I moved in,  early 2022, shortly after the business was bought by a new company. I have had a wonderful experience with the management and no problems to speak of. The maintenance is good, prompt and friendly. I recommend this to others. Recently, 2024, the management has put a lot of effort into improvements! New decks, and new heating systems that will also serve as air conditioners in summer.",
        "owner_response": {
          "text": "Thank for you the wonderful review we really enjoy having you and your family as part of our community"
        }
      },
      {
        "author": "Andrew Davis",
        "rating": 5,
        "review": "Recently tenents have been complaining about high rent increassess at Forest park apartments.  It appears to me this is primarily the result of the high inflation, nationally.  SUHRCO is the new company managing Forest Park apartments.  To their credit, they have done  some very expensive and necessary repairs to the apartment complex. Including extensive water damage to two of the apartments,  broken windows and parking lot lighting fixtures. I do appreciate the expensive repairs that they have done, lately.\n\nAndrew Davis     6-2-2022",
        "owner_response": null
      },
      {
        "author": "Mesake Tudrau",
        "rating": 1,
        "review": "It's  an old apartment with high rent. I suppose to get a refund back but it seems like they don't bother. A stubborn officer with not very friendly approach in the ofgice.",
        "owner_response": null
      },
      {
        "author": "Lynda Galbraith",
        "rating": 4,
        "review": "We delivered to a nice lady here. The one bedroom was nice size. Nice inside. Seems quiet",
        "owner_response": null
      },
      {
        "author": "Tasha Beckham",
        "rating": 1,
        "review": "We needed a new washer and they brought over a used dirty one and it started spitting all this dirty and stuff but now my kids blankets smell so bad and have stuff all over it smh",
        "owner_response": null
      },
      {
        "author": "make America great again",
        "rating": 1,
        "review": "They fail to tell you that a methadone clinic is across the street.",
        "owner_response": null
      },
      {
        "author": "Lacey Evans",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "M B",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Lisa's World",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Julie B.",
        "rating": 5,
        "review": "What a wonderful place to live. I have watched the new company that bought Forest Park update and the apartments are beautiful.",
        "owner_response": null
      },
      {
        "author": "Malcolm B.",
        "rating": 1,
        "review": "0 stars\nMaintenance work around property took years to fix, didn't feel safe cause fence was broken, wires hanging out of working street light post. Zero stars for new management .  Spent 4-6 hours cleaning after move out, unit was spotless, didn't even get back full deposit.",
        "owner_response": null
      },
      {
        "author": "Cari J.",
        "rating": 5,
        "review": "Our ADA apartment was flooded by the unit above us. My mother has been a resident for 20+ years And the new management, terminated the lease due to health and safety reason. The new property managers immediately offered, on their \"dime\" and during this very serious displacement paid for an Airbnb and stored all of the apartments contents in Uhaul pods for a 28 day period and also, Sarah and Mac (The on site manager) were helpful and compassionate to our physical disabilities and Prepared a new apartment within the same complex after and fortunately for us, let us know that this was a temporary displacement as tenants were vacating this other ADA apartment and now we are in the new unit. We are still unpacking but and to make this long story short, the new management team SURCHO (hope I spelled that right) property management and especially Sarah and Mac were our \"saving grace\" ...Basically, they did everything to keep us from becoming homeless...I am grateful that this new company came and bought Forest Park as the last several managers throughout Covid couldn't get us several screens for the windows ...Their excuse Covid....They did a lot of up keep by chip sealing the parking lot, cleaning the moss off the tops of apartment roofs and re-striping the parking lot but couldn't get us two screens for our windows (Which by the way could have been put on without entrance to our unit)...The old management gave grief to a retired marine that was struggling to pay his rent due to his stipends...He was willing to do free maintenance in exchange for missed rent during Covid...The apartments looked like they got a face lift with the old management team and the rent kept going up BUT took the tenants requests for work orders in disregard \"DUE TO COVID\"...It's in a way quite humerous because xfinity or unless it was an emergent health and safety issue...old management and poorly lit parking lots even led to 7 (seven) car thefts in a matter of weeks...New managers came in and made the \"wood hood\" parking lot safe at night by LED lighting doorways and parking lots...Like I said old management cared about the outside of the apartments and raised rent---New management actually cares about the residents that live there and they are on site all day and their door is alwayss open 6 days a week...I just want to thank them for a very necessary change that we haven't had in decades...Its nice to know our requests or just to meet their residents and actually have a conversation with management...Sarah and Mac don't hide in their offlces...They actually get to know us and take our requests seriously and get on a work order immediately:...\n\nNice to know that they care not just about the outside of  a their property but also about the health and wellness of the inside as well.\n\nThanks SURCHO\n\n(Especially Sarah and Mac)\n-**You Rock\"\"",
        "owner_response": null
      },
      {
        "author": "Sue M.",
        "rating": 1,
        "review": "I have been a tenant at Forest Park Apts for over 20 years.  I have never paid my rent late except for this month - I was 2 days late because I simply forgot.  They put a late notice on my door for the rent plus a $50 late fee.  I immediately went to the office and dropped off my check and a letter indicating that I didn't believe I deserved to pay the late fee considering my record and long tenancy.  Royce Group sent me a letter stating I still owed $50 so I called them (Michelle Saab) thinking that perhaps they didn't get my letter begging off the late fee.  That was not the case.  She did get my letter but didn't care.  She said 30 other people were late, too.  I replied that I know for a fact no one has lived there longer than me - not even close - and that maybe I should consider giving my notice.  Her reply was \"okay.\"  \n\nA Complete lack of respect and loyalty to a very long time tenant that has never paid rent late!  Really??\n\n\nSHAME ON YOU!!",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 3.0,
  "distribution": {
    "1": 7,
    "2": 0,
    "3": 0,
    "4": 2,
    "5": 6
  },
  "summary": {
    "created_timestamp": 1739095045,
    "text": "<section id=\"good\"><h2>Good</h2><p>Forest Park Apartments has received positive feedback from several users who highlight the helpfulness of the management team, particularly after a recent transition to new management. Many residents have reported timely communication and an efficient handling of maintenance requests, with one user noting that their work orders were addressed the very next day. The property has also seen improvements such as new decks and heating systems, which residents appreciate, emphasizing that management is making a concerted effort to enhance the living environment.</p><p>Further glowing reviews describe the community's atmosphere as calm and the units as pristine upon move-in. Tenants have expressed satisfaction with the upkeep of common areas, praising the management’s commitment to addressing significant repairs like water damage and broken fixtures. A notable example was the compassionate handling of a flooding incident where management provided temporary housing and ensured a smooth transition to a new unit, showcasing their dedication to resident welfare.</p></section><section id=\"great\"><h2>Great</h2><p>Users have shown a generally favorable attitude towards Forest Park’s new management, led by the company SUHRCO. Many reviews reflect a shift in operational practices that prioritize resident needs, with on-site managers who are described as approachable and committed. Comments include positive remarks about the renovations undertaken to improve the aesthetics and safety of the property, making it an appealing place for families and individuals alike.</p><pMoreover, residents have felt more secure as management has taken steps to upgrade lighting in parking areas, making them safer during overnight hours. Reports of successful community engagement efforts from management have also been noted, where staff frequently interacts with residents to gather feedback and implement necessary changes. Such initiatives contribute to a more pleasant living experience and strengthen community ties.</p></section><section id=\"bad\"><h2>Bad</h2><p>However, not all feedback regarding Forest Park Apartments is entirely positive. Several user reviews express frustration, particularly concerning maintenance and operational transparency. Issues with maintenance delays have been highlighted, with one tenant mentioning that work orders took an unreasonably long time to address, fostering dissatisfaction with the level of service. Additionally, the experience of a long-time tenant who faced a late fee despite an exemplary payment record has raised concerns about management's consistency in handling tenant relations.</p><pMoreover, complaints about hidden details regarding the neighborhood’s reputation, such as the presence of a methadone clinic nearby, indicate a lack of proactive communication from management. This transparency issue can lead potential residents to feel misled regarding the environment surrounding their home, affecting their overall impression of the community. While there are commendable aspects, these concerns should be addressed to improve tenant satisfaction going forward.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThe most problematic experiences stem from serious complaints regarding the condition of supplied appliances and the lack of appropriate customer service. One user reported receiving a dirty, used washer that left their children's blankets in unsatisfactory condition, which highlights a troubling oversight in maintenance quality. Such experiences can lead to a significant decrease in trust toward management's ability to deliver vital, functioning amenities, forcing residents to cope with unnecessary inconveniences.</p><pAnother startling review detailed a long-term tenant's dissatisfaction with how their tenure was disregarded when a late fee was imposed after a brief oversight in payment. Such treatment reflects poorly on management's appreciation for loyal tenants and their lengthy commitment to the property. The sheer number of negative reviews compared to a handful of positives suggests a need for critical changes in operational standards and tenant relations to restore confidence among current and prospective residents.</p></section>"
  }
}