{
  "name": "Forest Hill Apartments",
  "slug": "forest-hill-apartments",
  "company_type": "property",
  "address": "701 N Forest St, Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 1.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Indaris Nerothan",
        "rating": 1.0,
        "review": "This place is owned by PLTA Property Management. Please read the reviews for their company before renting here. Theyre awful people and will try to scam you.\n\nThis apartment complex is over 100 years old. Maintanence staff told me that there's so much wrong with the building, that it needs to be completely rennovated. All drainage is slow, hot water doesn't last long. Units are in awful condition and are falling apart.\n\nI've met a couple of my neighbors, they all got a unit that was completely different from the listing photos. All of them said they'll never rent from PLTA again.",
        "ownerResponse": null
      },
      {
        "author": "Em Sanders",
        "rating": 1.0,
        "review": "I just moved out so I feel safe writing a review without PTLA retaliating against me. They're a filthy bunch of rats in human skin.\nThe rent is cheaper here for a reason... This place is AWFUL! Do not rent here. This building is so neglected, it should be condemned, salted, and burned to the ground.\n\nMy 1 bed 1 bath looked nothing like the photos on PLTA's website. It was run-down, dirty, had a giant, ugly water pipe running through my entire unit. They had me pay deposit and sign the lease before seeing the place...what a mistake.\nI tried to get a refund - they refused and ignored me.\nI tried to put in maintenance requests and asked for the place to be cleaned before I moved in - they ignored me.\nThey don't respond to any of my emails or phone calls - they know who I am and they try to hide from me. Cowards.\n\nThey're nothing but dirty dog scammers. How can anyone work for this company!? Am I expecting to get my deposit back? Nope. I expect them to take every cent because they're greedy sons of Lucifer.\n\nI will never rent from then AGAIN. And you, person who is reading this review, take my advice. Hide yo kids, hide yo money from PLTA. Find a better place to live. Don't rent from them no matter how desperate you are. I'd rather be HOMELESS then rent with PLTA. Best of luck with your apartment searching ~ ",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 1.0,
  "summary": "<article>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT and is solely intended to provide a summarized review of Forest Hill Apartments. The purpose of this article is to serve as a tool to help individuals in their search for a property management company or rental property. It is based on user reviews and reflects the perspective and experiences of those users without additional independent verification.</p>  </section>    <section>    <heading><h2>Good</h2></heading>    <p>When it comes to Forest Hill Apartments, tenants have spoken favorably about the affordability of the units. A common theme among user reviews is that the rental rates tend to be on the lower side when compared to other local options, which can be a relief for those looking for budget-friendly housing solutions. This aspect of affordability is a positive note in an otherwise challenging rental market.</p>    <p>Though the reviews are harsh in many respects, it is worth noting that there are some individuals who have managed to create a home within these apartments. In instances where less attention is required from property management or the specific unit does not exhibit as many issues, tenants can utilize the space to suit their needs while benefiting from the lower cost of rent.</right>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>There's a scarcity of reviews that shed light on the 'great' aspects of Forest Hill Apartments. Considering this, it is challenging to highlight exceptional experiences from the property management's performance. The scarcity of positive remarks indicates a potential area for improvement that could foster more appreciative feedback from residents.</p>    <p>As for the property itself, though the building is described as being old, it does offer a sense of historical character that could be appealing to some. Potential tenants interested in such attributes might find this worth considering, given that the apartments may carry an old-world charm that often comes with buildings of considerable age.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>The maintenance of Forest Hill Apartments is a commonly expressed concern from tenants. User reviews specifically mention how the apartments have various issues, such as slow drainage and a lack of lasting hot water, hinting at underlying plumbing problems. These maintenance troubles seem to persistently plague the tenants, with repeated mentions of units being in 'awful condition' and 'falling apart.'</p>    <p>Another topic of dissatisfaction comes from the condition of the units upon move-in, which is often in stark contrast to the listing photos. Users express their dismay and frustration at receiving apartments that did not meet their expectations, leaving them feeling misled. The disparity between advertised presentation and actual living spaces has been a source of significant tenant dissatisfaction.</p>  </section>  <section>    <heading><h2>Ugly</h2></heading>    <p>Indeed, the most striking issues arise with claims of deceitful practices and appalling customer service from the property management—PLTA, which administers Forest Hill Apartments. Descriptions such as 'scammers' and 'cowardly' behavior reflect deep discontent with the way the management handles deposit refunds, fails to respond to maintenance requests, and neglects communication with tenants.</p>    <p>Relationships between tenants and PLTA seem to deteriorate to the point where one reviewer suggests avoidance to the extent of preferring homelessness over dealing with the property management. Such statements paint a daunting picture of the distrust and frustration tenants feel toward the company, indicating that users believe their expectations have been severely mishandled by PLTA.</p>  </section></article>"
}