{
  "name": "Forest Park Apartments",
  "slug": "forest-park-apartments",
  "company_type": "Property",
  "address": "2605 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 15,
  "average_rating": 3.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Grace Blesch",
        "rating": 5,
        "review": "Sarah  and the whole team have been so helpful relocating my son and I after a less than favorable situation at another complex. Communication and planning have been on point  and they do their absolute best to keep me informed on any concerns or changes happening in our quiet community.  The apartment was pristine when we moved in and any work orders Ive entered have been taken care of the very next day! Including a new fridge at the first sign of thaw! Im extremely impressed with the Suhrco work ethic and you can tell everyone really cares about their residents and about equity throughout.\nFriends and family that have visited also can see themselves living here and have all commented at the quiet and calmness of the property.\n5 stars\n\nWould recommend 100%",
        "owner_response": null
      },
      {
        "author": "Halfkin Rainbolt",
        "rating": 4,
        "review": "I moved in,  early 2022, shortly after the business was bought by a new company. I have had a wonderful experience with the management and no problems to speak of. The maintenance is good, prompt and friendly. I recommend this to others. Recently, 2024, the management has put a lot of effort into improvements! New decks, and new heating systems that will also serve as air conditioners in summer.",
        "owner_response": {
          "text": "Thank for you the wonderful review we really enjoy having you and your family as part of our community"
        }
      },
      {
        "author": "Andrew Davis",
        "rating": 5,
        "review": "Recently tenents have been complaining about high rent increassess at Forest park apartments.  It appears to me this is primarily the result of the high inflation, nationally.  SUHRCO is the new company managing Forest Park apartments.  To their credit, they have done  some very expensive and necessary repairs to the apartment complex. Including extensive water damage to two of the apartments,  broken windows and parking lot lighting fixtures. I do appreciate the expensive repairs that they have done, lately.\n\nAndrew Davis     6-2-2022",
        "owner_response": null
      },
      {
        "author": "Mesake Tudrau",
        "rating": 1,
        "review": "It's  an old apartment with high rent. I suppose to get a refund back but it seems like they don't bother. A stubborn officer with not very friendly approach in the ofgice.",
        "owner_response": null
      },
      {
        "author": "Lynda Galbraith",
        "rating": 4,
        "review": "We delivered to a nice lady here. The one bedroom was nice size. Nice inside. Seems quiet",
        "owner_response": null
      },
      {
        "author": "Tasha Beckham",
        "rating": 1,
        "review": "We needed a new washer and they brought over a used dirty one and it started spitting all this dirty and stuff but now my kids blankets smell so bad and have stuff all over it smh",
        "owner_response": null
      },
      {
        "author": "make America great again",
        "rating": 1,
        "review": "They fail to tell you that a methadone clinic is across the street.",
        "owner_response": null
      },
      {
        "author": "Lacey Evans",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "M B",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Lisa's World",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Julie B.",
        "rating": 5,
        "review": "What a wonderful place to live. I have watched the new company that bought Forest Park update and the apartments are beautiful.",
        "owner_response": null
      },
      {
        "author": "Malcolm B.",
        "rating": 1,
        "review": "0 stars\nMaintenance work around property took years to fix, didn't feel safe cause fence was broken, wires hanging out of working street light post. Zero stars for new management .  Spent 4-6 hours cleaning after move out, unit was spotless, didn't even get back full deposit.",
        "owner_response": null
      },
      {
        "author": "Cari J.",
        "rating": 5,
        "review": "Our ADA apartment was flooded by the unit above us. My mother has been a resident for 20+ years And the new management, terminated the lease due to health and safety reason. The new property managers immediately offered, on their \"dime\" and during this very serious displacement paid for an Airbnb and stored all of the apartments contents in Uhaul pods for a 28 day period and also, Sarah and Mac (The on site manager) were helpful and compassionate to our physical disabilities and Prepared a new apartment within the same complex after and fortunately for us, let us know that this was a temporary displacement as tenants were vacating this other ADA apartment and now we are in the new unit. We are still unpacking but and to make this long story short, the new management team SURCHO (hope I spelled that right) property management and especially Sarah and Mac were our \"saving grace\" ...Basically, they did everything to keep us from becoming homeless...I am grateful that this new company came and bought Forest Park as the last several managers throughout Covid couldn't get us several screens for the windows ...Their excuse Covid....They did a lot of up keep by chip sealing the parking lot, cleaning the moss off the tops of apartment roofs and re-striping the parking lot but couldn't get us two screens for our windows (Which by the way could have been put on without entrance to our unit)...The old management gave grief to a retired marine that was struggling to pay his rent due to his stipends...He was willing to do free maintenance in exchange for missed rent during Covid...The apartments looked like they got a face lift with the old management team and the rent kept going up BUT took the tenants requests for work orders in disregard \"DUE TO COVID\"...It's in a way quite humerous because xfinity or unless it was an emergent health and safety issue...old management and poorly lit parking lots even led to 7 (seven) car thefts in a matter of weeks...New managers came in and made the \"wood hood\" parking lot safe at night by LED lighting doorways and parking lots...Like I said old management cared about the outside of the apartments and raised rent---New management actually cares about the residents that live there and they are on site all day and their door is alwayss open 6 days a week...I just want to thank them for a very necessary change that we haven't had in decades...Its nice to know our requests or just to meet their residents and actually have a conversation with management...Sarah and Mac don't hide in their offlces...They actually get to know us and take our requests seriously and get on a work order immediately:...\n\nNice to know that they care not just about the outside of  a their property but also about the health and wellness of the inside as well.\n\nThanks SURCHO\n\n(Especially Sarah and Mac)\n-**You Rock\"\"",
        "owner_response": null
      },
      {
        "author": "Sue M.",
        "rating": 1,
        "review": "I have been a tenant at Forest Park Apts for over 20 years.  I have never paid my rent late except for this month - I was 2 days late because I simply forgot.  They put a late notice on my door for the rent plus a $50 late fee.  I immediately went to the office and dropped off my check and a letter indicating that I didn't believe I deserved to pay the late fee considering my record and long tenancy.  Royce Group sent me a letter stating I still owed $50 so I called them (Michelle Saab) thinking that perhaps they didn't get my letter begging off the late fee.  That was not the case.  She did get my letter but didn't care.  She said 30 other people were late, too.  I replied that I know for a fact no one has lived there longer than me - not even close - and that maybe I should consider giving my notice.  Her reply was \"okay.\"  \n\nA Complete lack of respect and loyalty to a very long time tenant that has never paid rent late!  Really??\n\n\nSHAME ON YOU!!",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 3.0,
  "distribution": {
    "1": 7,
    "2": 0,
    "3": 0,
    "4": 2,
    "5": 6
  },
  "summary": {
    "created_timestamp": 1739205454,
    "text": "<section id=\"good\"><h2>Good</h2><p>Forest Park Apartments has been praised by several residents for its welcoming management team and quiet community atmosphere. Notably, one resident expressed satisfaction with the management’s communication and thoroughness in handling relocations, praising the pristine condition of their apartment upon move-in. Additionally, the apartment complex was highlighted for its prompt maintenance response, with a new fridge provided immediately when a concern arose. Tenants have also noted the peaceful and calm environment of the property, which is often commented on by visitors. Overall, the initial impression of Forest Park Apartments is one of attentiveness and efficiency, leaving a positive impact on many residents.</p></section><section id=\"great\"><h2>Great</h2><p>A few residents have remarked on significant improvements under the new management team, which has taken great strides in upgrading the facilities at Forest Park Apartments. One detailed account described how necessary repairs, such as addressing extensive water damage and enhancing lighting, have been managed efficiently. Another story highlighted the exceptional support provided during a property incident, involving serious flood damage that displaced a resident's family temporarily. The management took immediate action, covering temporary accommodations and relocating them within the same complex promptly. This proactive and compassionate response showcases the management’s commitment to enhancing tenant satisfaction and demonstrates their exceptional care for residents. The community improvements and personalized service have left a lasting impression.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite many praises, some residents have had less favorable experiences at Forest Park Apartments, particularly concerning outdated facilities and high rental costs. A couple of reviews have pointed out the negative aspects, such as receiving a used and dirty washer that left clothes in poor condition and the office's perceived lack of friendliness and assistance. Another common critique is related to returning security deposits, where residents have faced difficulty and felt disregarded in their requests. The perception of high rent costs exacerbates this sentiment, with some residents questioning the value given the age and condition of some apartments.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Unfortunately, some experiences at Forest Park Apartments have been particularly unpleasant and have left residents discontented. Several have reported that essential maintenance was delayed significantly, with one tenant noting safety hazards like broken fences and exposed wires. This neglect resulted in an unsafe feeling in the neighborhood and disappointment in management’s response. Additionally, the handling of a long-term tenant's late fee sparked outrage, as management insisted on the fee despite the resident’s flawless 20-year payment history, illustrating a pointed lack of tenant respect and loyalty. These instances have contributed to a perception of inconsiderate management practices among some tenants.</p></section>"
  }
}