{
  "name": "Hammer Properties NW, Inc.",
  "slug": "hammer-properties-nw-inc",
  "company_type": "Company",
  "address": "1111 N Forest St, Bellingham, WA 98225",
  "review_count": 80,
  "average_rating": 2.7,
  "reviews": {
    "google_reviews": [
      {
        "author": "Jessa Richards",
        "rating": 3,
        "review": "Hammer manages 1125 Billy Frank jr. Street where I live, and overall its been a good experience. The apartment gets quite cold and damp due to thin wall and poor window seals, so a dehumidifier is a must. Only other issue Ive run into is plumbing. Ive had to submit numerous maintenance requests, but the property manager Jena Curry is always very responsive and helps maintenance happen as quickly as possible. As far as property managers go, this building has a winner.",
        "owner_response": null
      },
      {
        "author": "Kristin Lowell",
        "rating": 2,
        "review": "I was going to be a cosigner on my daughters (student at WWU) lease in an old home in Bellingham. In the beginning this company was not straightforward and did not give me what I thought was due process as a cosigner.  As a co-signer I should have been provided all documents my daughter was provided to assure it is an acceptable deal to all parties involved. She is 20 and this would be her first house. Signing a legal contractual agreement was something she knew nothing about.\n\nWhen I went to tour the house with my daughter I was appalled at the rundown condition of the home.  This was not anywhere near the impression that was given to me by the property manager at  Hammer when I called upset that my daughter had signed the lease before I was able to see the house nor had I been given a copy of the lease by the company.   She led me to believe the property was in wonderful condition and the owners took very seriously that it was kept up well. I understand college houses are not in pristine condition, however, there were bigger issues with the house that I wasnt comfortable signing onto without thorough knowledge of the lease and what I was getting into.\n\nThe lease when I finally got a copy of it gave me some heartburn.  I am not a lawyer so I thought it was fair to ask them to put in writing that nothing in the lease supersedes the Washington Landlord Tenant Act (RCW 59.18).  The property manager adamantly refused to put anything in writing and said Im not going to jump through that hoop for you. She explained they have the lease agreement reviewed by lawyers and of course it would be consistent with the law. Then why is it such a big deal to email me and put in writing that their contractual agreement (lease) does not supersede the law that protects the tenant?\n\nFortunately, she let my daughter back out of the deal. What a relief not to have gotten into a potentially bad deal. That is the only good thing I can say about this company.\n\nThe victim in the wake of this interchange was the poor girl trying to move to California and get out of the lease herself.",
        "owner_response": null
      },
      {
        "author": "Theo Lewis",
        "rating": 4,
        "review": "For a property real-estate company with a monopoly on the city (typically crooked and theiving) hammer is actually ok. Our maintenance requests have been fulfilled pretty quickly and easily. They made a mistake with our deposit refund this year but luckily I had been diligent when we moved in and took pictures to record the state of the place. I called the new manager and she was great about refunding the rest of the money we were owed. I will say, they do raise the rent way too much annually for a company that doesn't allow leases linger than 1 year. We have not been able to stay in the same place for more than 2 years because of this. Once again, this is expected for a property management company that has a monopoly but still disappointing. Hoping to be able to stay in our current place for longer this time around but not likely. Both my roommate and I use different names than our legal ones and we have had mixed results with that. I am aware that legally they have to put our legal names on the lease but it is nice to not be addressed by a deadname. A couple of our past managers were NOT respectful of this but so far Daisy and Jena have been great! It really makes all the difference to be treated like a human as much as is allowed with this flawed system. I WANT TO BE VERY CLEAR I DO NOT SUPPORT THE FACT THAT PROPERTY MANAGEMENT COMPANIES ARE ALLOWED TO EXIST IN MONOPOLIES AND FORCE PEOPLE TO MOVE EVERY YEAR, however since we are trapped on this corrupt system and there are very few options hammer seems to be the only way. I have never had a problem with their online system (they do charge a $10 fee every time you pay rent which sucks but I get) and me, my roommate, and our dog (esa) plan on continuing with hammer.",
        "owner_response": null
      },
      {
        "author": "Jean Flynn",
        "rating": 2,
        "review": "We left the apartment in much better shape than received and were charged for \"deep cleaning\" despite our before and after pictures, checklists and move in issues.  At the time we took the apartment there were many things broken and not attended to by the property management company.  The Mansion apartments have an appeal but the Mansion is falling apart and not being cared for at all yet charges very high rents.",
        "owner_response": null
      },
      {
        "author": "Jack Kruman",
        "rating": 5,
        "review": "Nikki Quinn hands down was the best property manager I've had. She continued to advocate for us and kept us in the loop, quickly setting up maintenance calls and was flexible with lease dates. She is working to restore the reputation of landlords across America.\n\nDisclaimer: I have only heard bad things about Hammer but was extremely lucky that Nikki Quinn took great care of us. Our property was taken over by Hammer just before move-in, so I was not excited about that, but she made sure to take great care of us.",
        "owner_response": null
      },
      {
        "author": "Kim Ormsby",
        "rating": 1,
        "review": "Absolutely horrendous. We moved our son here two years ago. The first Hammer property, a brand new apartment complex, had water poor into his bedroom behind the floor trim. It took months for Hammer to come assess and fix the leaking and then they simply never replaced the wall trim.\n\nHe moved out of that apartment into a house on Grant street. I cannot believe they can legally house people and charge rent in this house. There is absolutely no way it is to code for so many reasons.\n\nCome to find out Hammer buys up almost all the properties near the college and downtown and has an absolute monopoly on renting for young adults. It is awful.",
        "owner_response": null
      },
      {
        "author": "Maddie Genger",
        "rating": 5,
        "review": "Hammer Properties has been nothing but lovely to rent from. Every time  we have submitted a maintenance request, we have been contacted quickly to resolve the issue. Often coming within the hour of submitting the request. Nikki is extremely friendly and always available to assist or answer any questions that we have. Highly recommend renting from them.",
        "owner_response": null
      },
      {
        "author": "Sebastian Forenza",
        "rating": 5,
        "review": "Nikki is the nicest and most understanding property manager ever. She has helped us every step of the way and had been very patient with our house. Thanks Nikki!!!",
        "owner_response": null
      },
      {
        "author": "nolan rodda",
        "rating": 1,
        "review": "Future college students looking to rent from Hammer: Beware! I lived in a house \"managed\" by Hammer properties for 2 years 2018-2020. Joe was our landlord. Throughout my experience they proved to be exploitive and unresponsive, preying on college students who neither have the money nor means to stand up to this property management. They didn't respond to several of our maintenance requests, even when our roof was leaking into our house! And the few times maintenance was done, there was no prior notice and contractors came UNANNOUNCED! They took over a $1,000 of our security deposit, stating that they had hired a cleaning service for 12 + hours?!?! even though we had already cleaned and left the place in great shape! Mold and mildew tests that proved to be at dangerous levels were shrugged off by Joe the landlord and he said if it bothered us we could move. Not to mention, the vast majority of WWU college students that have rented from Hammer will tell you a similar story. Scroll through the other reviews and decide for yourself, but these property management company is criminal.",
        "owner_response": null
      },
      {
        "author": "Alex Weingart",
        "rating": 5,
        "review": "I've lived in Bellingham for over a decade. I've lived in many different places all over town, many with different property managers. I can say, beyond a shadow of a doubt, that Hammer is the best I've worked with. My experience with them has been positive overall, and I don't feel they have ever been unreasonable with me.\n\nWe recently got a new kitchen faucet and washing machine when our old ones stopped working. Maintenance crew deserves a shout out for being great as well.\n\nOverall, if you pay your rent, and don't cause issues, Hammer is a great rental agency to work with.",
        "owner_response": {
          "text": "Alex, thank you for the great review! We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Brad Anderson",
        "rating": 5,
        "review": "I understand that all rental companies have their downsides, but Hammer really nailed it when they hired Lisa Meagher. She is by FAR the best property manager I have ever had and I've had a lot of them. She was kind, patient, responsive and professional. The space we moved into was really clean and we stayed there for 2 years. Anytime there were maintenance requests, we had people at the place in a day. I'm gonna say her name again: Lisa Meagher. If you rent through Hammer and you have Lisa as your property manager, you are in very good hands.\nWhen we moved out, we were conned into a terrible and falsely advertised house from Lakeway Rental. We had finally got our money back and had to search for a new place quickly. Lisa would immediately respond to companies for all of our rental verifications/applications and was incredibly patient as we tried to find a new home.\nI can't recommend her enough\nThanks Lisa",
        "owner_response": {
          "text": "Brad, thank you for the great review. We really appreciate you taking the time out to share your rental experience with us  and we agree, Lisa is truly a gem to have on our team!"
        }
      },
      {
        "author": "Jayden Requena",
        "rating": 5,
        "review": "Hammer Properties provides excellent housing near to WWU campus. Mike, the owner, was always pleasant and prompt. I lived in my apartment for 2 years and have no complaints. My emotional animal is a 60lb pit bull mix; if your animal is truly serviced or needed for emotional support, you will have no issues. My partner and I made sure the house was clean and in good condition before we moved out and were happy to receive our entire deposit back in full. I think this property management may unfairly get a bad reputation because majority of properties are rented out to college students whom may not have a lot of patience when it comes to issues being resolved. So long as you are able to communicate your needs and be a decent human being, you will enjoy Hammer Properties.",
        "owner_response": {
          "text": "Thank you. We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Sarah T",
        "rating": 1,
        "review": "Listen to the other reviews. I rented from these guys 2014-2017; Joe tried to take my entire deposit plus double to replace all carpeting with no evidence of our doing or proof of age of the carpets. Took him to small claims and the judge laughed in his face. Mold everywhere too btw, and our water heater flooded the garage took days for them to come out. Im surprised hes not yet learned his lesson. Sad they have a monopoly and that the city hasnt shut them down yet for illegal practices. Posting this warning for all the students: know your rights and dont skimp on taking these guys to court ;) Its worth your time and benefits not only yourself, but the community.",
        "owner_response": null
      },
      {
        "author": "John B",
        "rating": 1,
        "review": "I have literally never written a review of anything online but I feel obligated to at this point.\n\nInattentive, unresponsive, and negligent of issues clearly violating the (legally binding) WA state tenants rights, our rental agent left for the weekend after theyd been made aware of a problem over 36 hours previously and having had a direct conversation with a tenant stating they would follow up by the end of the day.\n\nDidnt fix multiple issues raised before occupying the unit, did not follow up on those requests. I cant personally verify this because Ive ended up fixing everything myself or ignoring it, but I have it on good authority that they take maintenance costs out of your security deposit (illegal)\n\nSo non-communicative its almost impressive, if my job were to sit at a desk and answer emails and phone calls all day I would be embarrassed to be so absent.\n\nIf at all possible DO NOT rent a hammer property.",
        "owner_response": null
      },
      {
        "author": "Jason D",
        "rating": 1,
        "review": "Joe Tedro stole my $1000 deposit after I rented a house in 2018 and had to move out after 7 days because of homeless people living in the property and refusing to leave. I'd recommend staying away from these crooks AT ALL COSTS.",
        "owner_response": null
      },
      {
        "author": "Tracy Morgan",
        "rating": 1,
        "review": "They put up \"for rent\" signs all over Bellingham on houses/properties that are NOT AVAILABLE FOR RENT or coming available for rent anytime soon just for marketing purposes. The renters are in long-term leases (not moving next month or anything). Very dangerous practice for their renters. Prospective renters obviously think the property is available or they think the renter in the home is the homeowner, so they knock on the door to ask questions about the house or walk the property and look in windows. Just a matter of time before they are sued.",
        "owner_response": null
      },
      {
        "author": "Austins Challenges",
        "rating": 1,
        "review": "This was a good company when we first started renting but have increasingly had problems through them. Had no heat or hat water for almost a month and there was little to no communication. Was told we would be getting rent credit and have had to fight for over a month to get it and had all messages ignored. There is lots of rental options in Bellingham and I would recommend against this one.",
        "owner_response": null
      },
      {
        "author": "Nate Bayer",
        "rating": 1,
        "review": "This is not a respectable business. Upon my arrival to a property that I would rent for the following year, there were numerous safety issues already plaguing the house before I even set foot in it. Serious problems like black mold, exposed wiring, rat infestations etc. Mike is not a pleasant man to correspond with. He has very little empathy for his tenants and will go to great lengths to keep damage deposits and levee fines. I don't know how they haven't had enough legal troubles to put them out of business because they are incredibly sleazy",
        "owner_response": null
      },
      {
        "author": "Tanner Chilcote",
        "rating": 5,
        "review": "Had a unfortunate event with the property, no ones personal fault.\n\nThe employees helped with anything they could and offered solutions and kept good communication.\n\nIf you have issues communicate them and they will help.\n\nMike was quick to find and solve the issue when reported.",
        "owner_response": null
      },
      {
        "author": "Kirstyn McElroy",
        "rating": 1,
        "review": "One star is too high. This company allowed us to move into a rental where we had to literally scrape gum off the floors. The place looked like a crack house (for lack of a better term) They made us pay for the carpets to be cleaned before moving in and after seeing the state of things we cleaned the carpets ourselves and the water was literally black. On multiple occasions we caught the landlord looking in our windows. They cut off a lock on the basement door that we put on for safety without telling us defacing our property. After leaving the place better than we left it (gum off floors, new light fixtures, and clean carpets all with our own money) they still had the audacity to take a third of our security deposit without giving us a reason as to why they took our money. DO NOT RENT through hammer properties.",
        "owner_response": {
          "text": "Thanks for sharing your feedback."
        }
      },
      {
        "author": "kai oppelt",
        "rating": 1,
        "review": "By far the worst rental company in the country!! They give the absolute bare minimum notice to enter your house. The property is extremely over price and with never having missed a payment and paying so much, you'd imagine they'd respond to any of our service request. Nope. Not for three months. I seriously warm future renters to steer clear of this company.",
        "owner_response": null
      },
      {
        "author": "Dalton Ranson",
        "rating": 5,
        "review": "I rented a property off of Waschke rd from hammer properties they have been very easy to work with and helpful whenever needed. Its not often your landlord shows a genuine interest in your happiness with the property. I have already recommended them to friends.\n\nIve had several property managers, landlords and rented all over Whatcom county. If you pay your rent and treat the place youre living with care and respect you will have no issue.",
        "owner_response": {
          "text": "Hi Dalton, We appreciate the good feedback!"
        }
      },
      {
        "author": "Anon Ymous",
        "rating": 1,
        "review": "We moved in to a extensively damaged house that wasn't cleaned before we moved in. Mold/Mildew in the windows, terryaki stains on the blinds, all the cabinets and cupboards were sticky with some residue, stains and weed marks all over the place, graffiti on doors, on and on. We spent quite a few hours cleaning the place and made sure to document it on move in form. We were told as long as we documented it, we would have no problems getting our refund back BY MULTIPLE PEOPLE AT HAMMER! We got charged a large portion of our deposit when moving out and they said we didn't really document that it was dirty. We left the place in way better condition than we found it, and got dinged for doing so. I would never rent from Hammer ever again!",
        "owner_response": null
      },
      {
        "author": "Jason Dapree",
        "rating": 1,
        "review": "ZERO STAR REVIEW\n\nI rented a house with Joe Tedro through hammer property management. (1330 Grant Street) The house lease was for one year but I was only able to live on the property for 14 days because i was assaulted by one of the roommates and had a restraining order put into place. Since the restraining order was put into place the other roommates because hostile towards me as well so I moved. Joe used that against me and said that I'll never be able to rent with Hammer Properties because of the bad experience together. He mainly shamed me about the cops being called out to the address when I was assaulted and had to recieve medical attention from the EMS. Truly unprofessional set of people here.",
        "owner_response": null
      },
      {
        "author": "Jared de Guzman",
        "rating": 1,
        "review": "This is just an honest review: Treat their tenants like trash, enter without giving notice, don't respond to maintenance requests (ever), fine for whatever arbitrary reason they can,  try to take the majority of security despot without giving good reason (especially considering they barely clean or repair their houses before tenants move in), and outright take advantage of students. They have a few decent landlords like Joe and Lisa, but the owner and the company as a whole are awful. Sadly, there's not many options for north campus living since they hold the majority of the properties, but avoid them if you can.",
        "owner_response": null
      },
      {
        "author": "Melinda Nascimbeni",
        "rating": 5,
        "review": "My son, a student at WWU, rented his first apartment this fall from Lisa Meagher at Hammer Properties. Communication with Lisa before move in was great - very responsive and professional to all our many questions. The terms of the lease were fair and straightforward. Move in went smoothly - the apartment was ready on time, it was clean and many updates had been made which was a pleasant surprise. Paying rent was easy and the utilities, which were split between all the apartments in the house was fair. Lisa went the extra mile when my son decided to transfer from WWU and sublet his apartment. Since his leave was unexpected and we live out of state it was a bit tricky for us to clean and show the apartment, and So Lisa graciously helped us get a tenant and transfer the lease. She was responsive to my emails and helped smooth out some bumps with the prospective tenant.\nAfter reading so many negative reviews, I was reluctant to rent with Hammer, but we had a great experience and I  could not have asked for a better property manager!",
        "owner_response": {
          "text": "Theres nothing like seeing a great review on our page, Thank you for the kind words Melinda!"
        }
      },
      {
        "author": "Bruce P Hawley",
        "rating": 5,
        "review": "Mike Hays of Hammer Properties NW is incredible!  Professional and responsive (not to mention friendly) all the way, and went way above and beyond the call of duty to be of service with my specific task outside of regular business hours.  If you have such needs as rental in the Bellingham area, you do not have to look further--I daresay you will not go wrong!  You will get fair and quality attention and service.",
        "owner_response": {
          "text": "Thanks for the awesome review, Bruce! We work hard to meet expectations like yours, and were happy to hear we hit the mark for you."
        }
      },
      {
        "author": "Caitlin Hanson",
        "rating": 1,
        "review": "I have been a renter in Bellingham for six years and this is by far the worst property management company I have ever worked with. In addition to arriving at the property unannounced, there was a flat out disrespect of the tenants need for problems to be fixed promptly. Upon moving out and receiving a deposit return, there were flat out lies about damages accrued over the single year the space was rented. Would rather be without a place to live than rent from these scumbags.",
        "owner_response": null
      },
      {
        "author": "Courtney Lemos",
        "rating": 1,
        "review": "I wish I could give negative stars. I've never had a worse experience with a property manager. I deal with Mike and it's been hell. We've had a leak in our basement apartment for 3 months and they cut a hole in our ceiling 3 weeks ago without telling me and haven't bothered to do anything since. Still leaking when it's damp outside. I pay $790 for a 100 year old studio and honestly you couldn't pay me enough to resign with Hammer.",
        "owner_response": null
      },
      {
        "author": "Matthew S",
        "rating": 1,
        "review": "By far the WORST company every to rent from in Bellingham. I have had countless problems and they never stop. I have never seen or experienced a company with such little regard for the quality of the product they offer. If there is no other option except for Hammer, then I just feel legitimately sorry for you.",
        "owner_response": null
      },
      {
        "author": "Tanner Bivins",
        "rating": 5,
        "review": "My experience with hammer has been extremely favorable. They've been accommodating for returning customers, fair with rent, and very helpful with repairs. Plan on renting with them until I graduate.",
        "owner_response": {
          "text": "Hi Tanner, Thanks or the feedback and 5 stars!"
        }
      },
      {
        "author": "Sarah Hoffer",
        "rating": 5,
        "review": "I had a great experience with Hammer. My roommates and I had no issues whatsoever. Any questions/concerns we had were dealt with in a reasonable and efficient manner. I would definitely recommend Hammer Properties to anyone.",
        "owner_response": null
      },
      {
        "author": "Walter Haugen",
        "rating": 1,
        "review": "We just had an exasperating experience with a realtor from Hammer NW named Joe Tedrow. He was representing a couple of buyers who made an offer on our property. We countered with a higher offer and they accepted quickly. Then we passed the septic inspection and Joe took a drinking water sample, which he bungled. Our realtor took another sample which we passed. Okay, so on to the house inspection right? Nope. This idiot then tries to run us through the ringer on whether the buyers can get Comcast or not. This was not part of the original agreement by the way. We have wireless and it is fast enough for us. Why we are supposed to agree on an add-on is beyond me. Joe finally said we had to agree to a \"feasability study\" or they would back out of the deal. So we said, \"Okay, you're done.\" It should be obvious that: 1) the buyers just wanted out of the deal or 2) Joe was trying to scam us into lowering our price. At any rate, this was not ethical behavior. Shame on you, Joe!\n\nNow our farm is back on the market and the potential buyers  missed out on a nice property. We don't have a rigid timeline so we can afford to wait and the real estate market in Whatcom County is still going up. So for those of you contemplating doing business with Hammer NW, my advice is to look elsewhere.",
        "owner_response": null
      },
      {
        "author": "Alec Hoffman",
        "rating": 1,
        "review": "They never give a notice and they will just walk into your home. Did not mention a black mold problem, still not fixed. And they did not fix a window which was brought up as a problem at the start of the lease. Poor communication.",
        "owner_response": null
      },
      {
        "author": "Stephanie Andrade",
        "rating": 1,
        "review": "They request you earn 4x the rent",
        "owner_response": null
      },
      {
        "author": "Teemo Satan",
        "rating": 1,
        "review": "Do not trust these people. Worst experience I've ever had. Took our full deposit and then threatened with a lawsuit for more money on top of that. Especially the \"manager\" Mike. Once we paid they wouldn't respond to one call. It's worth it to find another house or apartment. Trust me!",
        "owner_response": null
      },
      {
        "author": "Cycle Punk",
        "rating": 1,
        "review": "Sooo many issues with these guys. EG, they will steal your security deposit. Insist on a final walk-through, take pictures, and make them document any issues in writing on the spot--otherwise, they'll stick you for hours of cleaning regardless of how you left the place.",
        "owner_response": null
      },
      {
        "author": "Jennifer Ann",
        "rating": 1,
        "review": "Both of my college age children have rented from Hammer. Their homes are poorly maintained, drafty, dirty, and unlivable. There is water damage, broken appliances, leaks, and mold. Hammer seems to be profiting off of a captive audience of college students looking for rentals close to campus. Hammer should be put out of business!",
        "owner_response": null
      },
      {
        "author": "ominix 881",
        "rating": 1,
        "review": "Greedy company who will overcharge you for bogus damage fees. Don't ever rent from here. Mike Hays is definitely a sad excuse for a manager like someone else said.",
        "owner_response": {
          "text": "Hi Ominix, Thanks for your feedback we are sorry to hear about your bad experience with us. If you would like to reach out to us to help us do better in the future give us a call (360)-756-6500."
        }
      },
      {
        "author": "Timothy Lipson",
        "rating": 5,
        "review": "I dont really understand all of the bad reviews. Hammer Properties (shout out to Lisa M.) have been really great to us! Just renewed another 12m lease.",
        "owner_response": {
          "text": "Thank you. We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Sydelle Denman",
        "rating": 5,
        "review": "Moving out experience and checking in keys super easy. Thanks ladies.",
        "owner_response": null
      },
      {
        "author": "Summer Harkness",
        "rating": 5,
        "review": "Amazing staff. Very responsive and friendly. Mike Hays is one of the most down to earth real estate guys I've ever come across.",
        "owner_response": {
          "text": "Thank you. We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Anna Miller",
        "rating": 5,
        "review": "Ive had several excellent experiences with this property manager over the past few years . The staff is excellent and conciencous and his repair staff are good and kind also . Very professional upfront group .",
        "owner_response": {
          "text": "Hi Anna, Thanks for the 5 star review and nice words!"
        }
      },
      {
        "author": "Crystal Edwards",
        "rating": 5,
        "review": "Hammer Property's is so awesome!!!! Sarah there accountant lady is the sweetest, most kindest lady ",
        "owner_response": {
          "text": "Hi Crystal, Thank you for the kind words and amazing feedback!"
        }
      },
      {
        "author": "E David Engst",
        "rating": 5,
        "review": "There was a mechanical problem. It was a rainy Friday evening.  Mike showed up promptly, had the needed tools and fixed everything.  Very satisfied.",
        "owner_response": {
          "text": "Thank you so much for your kind words, E David . Were happy to hear you were satisfied! We really appreciate you taking the time out to share your experience with us."
        }
      },
      {
        "author": "Xavier Rodriguez",
        "rating": 1,
        "review": "These people are thief's DO NOT RENT WITH THEM IF YOU WANT YOUR DEPOSIT BACK!\nRidiculous charges that are completely false taking advantage of college student tenet's.",
        "owner_response": null
      },
      {
        "author": "john williams",
        "rating": 1,
        "review": "first to call and schedule a visit. when I showed up , Lisa was already showing the house to someone . wasted our time and was very rude/unprofessional.",
        "owner_response": {
          "text": "Hi john, Thanks for the feedback, We often schedule tours with groups of people. We apologize for any confusion!"
        }
      },
      {
        "author": "Theo Radke",
        "rating": 5,
        "review": "Im grateful for hammers understanding and compassion for our situation and their willingness to work with us in our time of struggle. If you find yourself in a similar situation just be communicative!!",
        "owner_response": {
          "text": "Hi Theo, Thanks for the 5 stars and nice review!"
        }
      },
      {
        "author": "Sharon Dalessandro",
        "rating": 1,
        "review": "The rents have become so high that nobody can afford to rent rental companies  are lead by greed!",
        "owner_response": null
      },
      {
        "author": "Casaundra May",
        "rating": 1,
        "review": "They were discriminatory toward my daughter who is a person of color & is in the process of filing a discrimination complaint with fair housing.",
        "owner_response": null
      },
      {
        "author": "leo sanchez",
        "rating": 1,
        "review": "Homies just put up their for rent sign on our property  ",
        "owner_response": {
          "text": "Hi Leo, \nWe are sorry for the inconvenience. The third-party sign installation company was contacted immediately about their error and will have the sign removed. Thank you for your understanding. \n\nBest Wishes, \nHammer Properties NW "
        }
      },
      {
        "author": "Mago Torres",
        "rating": 5,
        "review": "Bob professional friendly and very specific and buy it on my questions that I asked it",
        "owner_response": null
      },
      {
        "author": "Tye Higgins",
        "rating": 5,
        "review": "1st year as a tenant as so far it has been a pleasant experience",
        "owner_response": {
          "text": "Thank you so much for your kind words, Tye. We really appreciate you taking the time out to share your experience with us."
        }
      },
      {
        "author": "Lauren Kramer",
        "rating": 5,
        "review": "Mike Hayes and Hammer Properties NW are super-helpful. This company is a great resource and can be relied on for help, advice and great, consistent service.",
        "owner_response": {
          "text": "Hi Lauren, Thanks for the kind words and good feedback!"
        }
      },
      {
        "author": "Misty Walker",
        "rating": 1,
        "review": "Website under construction was message it showed when trying to look at properties",
        "owner_response": null
      },
      {
        "author": "damien bassett",
        "rating": 1,
        "review": "These people love sucking money out of college students",
        "owner_response": null
      },
      {
        "author": "Esrom Robiel",
        "rating": 1,
        "review": "No need to be here that is all Im going to say.",
        "owner_response": null
      },
      {
        "author": "Jos",
        "rating": 1,
        "review": "THE WORST PROPERTY MANAGEMENT EVER.",
        "owner_response": null
      },
      {
        "author": "Dik Keithley",
        "rating": 3,
        "review": "Houses",
        "owner_response": null
      },
      {
        "author": "Alexis Newmark",
        "rating": 4,
        "review": "Sarah is great",
        "owner_response": {
          "text": "Thank you! We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "jay dutt",
        "rating": 5,
        "review": "Awesome management",
        "owner_response": {
          "text": "Thank you. We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Karma Swislow",
        "rating": 5,
        "review": "Work with you",
        "owner_response": {
          "text": "Hi Karma, Thanks for the 5 stars!"
        }
      },
      {
        "author": "Jack McGee",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Pablo Larrain",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Whitney M",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Peter Maclean",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Daniel Crutchfield",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kristen Strickland",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Nicole Fortier",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi Nicole, Thank you for your feedback."
        }
      },
      {
        "author": "Illustris Artifex",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you. We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Aurora Kingslight",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi Aurora, Thanks for your feedback. If you would like to reach out to us to help us do better in the future give us a call (360)-756-6500."
        }
      },
      {
        "author": "Emmett O'Neill",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi Emmett, Thanks for your feedback. If you would like to reach out to us to help us do better in the future give us a call (360)-756-6500."
        }
      },
      {
        "author": "Erik Lanning",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi Erik, Thanks for your feedback. If you would like to reach out to us to help us do better in the future give us a call (360)-756-6500."
        }
      },
      {
        "author": "Ian Mcinnis",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi Ian, Thanks for your feedback. If you would like to reach out to us to help us do better in the future give us a call (360)-756-6500."
        }
      },
      {
        "author": "Julianna Stoker",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Julianna, Thanks for the 5 stars!"
        }
      },
      {
        "author": "Alec Hayton",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Bart Klein",
        "rating": 4,
        "review": "",
        "owner_response": {
          "text": "Hi Bart, Thanks for the 4 stars!"
        }
      },
      {
        "author": "Chris Vazquez",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "We really appreciate you taking the time out to rate your experience with us!"
        }
      },
      {
        "author": "Gollo Moreno",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "karletto fonzi",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 62,
  "adjusted_average_rating": 2.74,
  "distribution": {
    "1": 42,
    "2": 3,
    "3": 2,
    "4": 3,
    "5": 30
  },
  "summary": {
    "created_timestamp": 1739205476,
    "text": "<section id=\"good\"><h2>Good</h2><p>Hammer Properties NW has been recognized by some users for their professionalism and promptness in responding to maintenance requests. In particular, Nikki Quinn and Lisa Meagher have been frequently commended for their exceptional customer service, always ensuring that tenants are well-informed and that maintenance issues are resolved swiftly. One user highlighted how Nikki not only advocated for them during the tenancy but also maintained flexibility with lease terms, contributing to a positive renting experience. Similarly, another reviewer praised Lisa’s dedication to facilitating the rental process and providing fair lease agreements, making her a standout property manager. However, while some tenants have had positive interactions, these accounts appear selective and not uniformly experienced by all renters under Hammer Properties.</p></section><section id=\"great\"><h2>Great</h2><p>In this article, we look at the high praise Hammer Properties NW receives, particularly for their competent and understanding property managers. For instance, one tenant mentioned that despite hearing negative things initially about the company, their experience was vastly improved thanks to Nikki Quinn's management. Nikki received accolades for her quick response to maintenance issues and for advocating for tenants, reversing a previously negative perception. Another tenant admired how Hammer Properties, when managed by attentive individuals like Lisa Meagher, created a supportive environment by ensuring the rental spaces are clean and lease terms are clear, which left a lasting impression. These experiences suggest that specific managers play a crucial role in elevating tenant satisfaction, with some significantly exceeding expectations in their roles.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positive feedback, Hammer Properties NW encounters criticism in terms of transparency and maintenance response times. Issues such as delayed maintenance interventions and oversight have been repeatedly cited by tenants. For example, several users noted scenarios where essential maintenance took too long, with a particular case of a new apartment suffering water leaks, which took months to address. Furthermore, concerns over the clarity and legality of lease agreements were highlighted, with some cosigners feeling neglected and misled about property conditions. This inconsistency in experience highlights the need for improved communication and promptness in addressing tenant concerns, as a way to enhance overall satisfaction with their management services.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Echoing harsher sentiments, numerous user reviews harshly criticize Hammer Properties NW for exploitative practices, particularly towards college students relying on affordable rentals. Disheartening accounts of maintenance neglect, such as unchecked mold and leaks, have left tenants feeling shortchanged and mistreated. Accusations of wrongful deposit deductions and avoidant communication further compound frustrations, leading to legal action in some instances. The overarching complaint of a monopoly in renting spaces near the college adds to the narrative of dissatisfaction and disenchantment. These experiences paint a stark contrast to the positive anecdotes, underscoring significant areas for improvement within the company to regain trust and accountability.</p></section>"
  }
}