{
  "name": "Hansen Group Real Estate",
  "slug": "hansen-group-real-estate",
  "company_type": null,
  "address": "1001 E Maple St, Bellingham, WA 98225",
  "review_count": 16,
  "average_rating": 4.56,
  "reviews": {
    "google_reviews": [
      {
        "author": "Beth McGinty",
        "rating": 5,
        "review": "Jon and Ashleigh are highly responsive, patient and brutally honest with you during your home buying experience. I have purchased three homes and sold one. They gave me the best experience that I've ever had in real estate. They showed me house after house after house, all the while continuously narrowing the search to exactly what I wanted. I felt well represented, even before Jon knew that I was approved. Jon's knowledge of Whatcom county was invaluable as a newcomer to this part of the country. I can't say enough good things about this team!",
        "owner_response": {
          "text": "Welcome to Bellingham, Beth!  We are so happy you and your family have settled in so nicely."
        }
      },
      {
        "author": "Joshua Perry",
        "rating": 5,
        "review": "We've bought two properties with Jon.\nHis decades of experience and market insights make every conversation helpful. That, along with world-class negotiating skills make him an ideal agent to have in your corner. He's been very attentive to our needs and desires, even recommending we not pursue properties that didn't line up. Highly recommend Jon and his team! He will help you accomplish your goals.",
        "owner_response": null
      },
      {
        "author": "Sheila LaRose",
        "rating": 5,
        "review": "Jon and his team did a tremendous job selling my father's home.  My father and mother had relished living in their Victorian house for decades.  It was a difficult decision to sell the home.  Jon and Cody understood the meaning of the home to my father.  They \"got\" the feeling and architecture of the house.  When faced with a challenge Jon continued his work with a practical and positive approach.  His team (thanks Katie!) were supportive, prompt and detail oriented.  If you are considering selling your home you will be well served by Jon.  Can't say enough.  Thanks Jon, Katie and Cody!\n\nSheila LaRose",
        "owner_response": null
      },
      {
        "author": "Patrick Neher",
        "rating": 5,
        "review": "Jon and Katie were super cooperative about our house, buying it sight-unseen. Video conferencing, telephone calls at odd hours, and loads of pics. When an issue was discovered, Jon fixed it without argument, always considerate of the people behind the transaction - even months after the closing. The Hansen Group is trustworthy and compassionate!",
        "owner_response": {
          "text": "Wow!  Thanks Patrick.  Congrats on landing the right house.  WELCOME TO BELLINGHAM!!!"
        }
      },
      {
        "author": "Krishnaraj Raj Mahal Jayarama",
        "rating": 5,
        "review": "Jons Team were exceptional. They were able to price my house exactly and it was sold with an offer within two days Exactly what we wanted. Theyre kind friendly and easy to contact. They even came to check on our cats when we were away in the house need to be shown. All in all an exceptional team",
        "owner_response": null
      },
      {
        "author": "Jani Snell",
        "rating": 5,
        "review": "We worked with Jon and Ashleigh after we felt pressured to purchase a horrible fixer-upper by a previous realtor. With the market being so competitive, we were wary that we were going to be pushed again to put down an offer on a home that didnt meet all our expectations. That was far from what happened. Jon and Ashleigh walked through the buying process at our pace. Our journey took a year, and throughout that time, we felt nothing but support and encouragement. They validated or concerns, presented different options, and put us in the drivers seat. Once we found the perfect home, Ashleighs drive and expertise helped us get the winning bid. We couldnt be happier with our new home and neighborhood!",
        "owner_response": {
          "text": "Congrats Jani!  Your new home is awesome."
        }
      },
      {
        "author": "Chelsie Clark",
        "rating": 5,
        "review": "Jon Hansen is a true pleasure to work with! He is knowledgeable, resourceful, kind, and caring. As a first time buyer, he put all my nerves to rest and is currently helping make our dream a reality. Look no further, Jon is the guy you want on your team! He will make this a wonderful experience for you.",
        "owner_response": {
          "text": "Thanks Chelsie,  Looking forward to having you in our community!"
        }
      },
      {
        "author": "Adrienne Renz",
        "rating": 2,
        "review": "I am choosing 2 stars for my interaction with Jon Hanson, because really it was Meh.  And I have experienced better.  Jon was not our agent, but rather called on a property we were listing.  He called my line to schedule a viewing of the house for his clients and treated me like his personal secretary requesting I take a message for him for our listing agent.  When I let him know he would be better to call the agent directly he insisted I take a message.  Honestly I was not impressed and when it came time to review offers not only did he have his clients on an obscene escalation, which wasted money, but I found that his general attitude was not helpful to his clients in making the winning bid. When faced with two very similar bids do you pick the offer tinged with arrogance or the other?  The choice was clear for us.\n\nIn a sellers market I would advice that you look for an agent that will not only work hard for you, but also show that they can negotiate and engage with prospective sellers respectfully. I would hate to see a family miss out on the home of their dreams over agent communication issues.",
        "owner_response": {
          "text": "You stated, \"Jon was not our agent.\"\nI am sorry that you feel I did not represent my clients well. They loved my representation and ended up purchasing a house with me."
        }
      },
      {
        "author": "barcode house",
        "rating": 5,
        "review": "We worked with Ashleigh on this , our 4th home.  Ashleigh is an amazing agent.  She is patient and not afraid to walk away from the wrong deal for her clients.  She seemed to know all the right people and her sales approach is top notch.  I highly recommend Ashleigh Abhold and her team at Hansen Group.",
        "owner_response": null
      },
      {
        "author": "Mike Maxwell",
        "rating": 5,
        "review": "Jon Hansen and his team are the BEST!   They performed flawlessly for me, accomplishing everything they promised. His sales assistant, Molly, his closing assistant, Katie, and his photographer, Chris, are OUTSTANDING!",
        "owner_response": {
          "text": "Thanks Mike! You were a pleasure to work with and your house was AMAZING!!!"
        }
      },
      {
        "author": "Brent Bullard",
        "rating": 5,
        "review": "Jon and his staff are very knowledgeable and make the whole transaction from start to finish smooth! I would recommend Jon and his team for your real estate needs whether it be purchasing or selling.",
        "owner_response": null
      },
      {
        "author": "Mandi George",
        "rating": 5,
        "review": "Working with Ashleigh has been wonderful! She's super friendly, responsive, knows her \"stuff\", great customer services skills, and just all around a joy to work with.",
        "owner_response": null
      },
      {
        "author": "Katie Pulver",
        "rating": 5,
        "review": "Excellent real estate advisor.  Says it like it is.  Very fun to work with as well. I can see why his clients have so much success.",
        "owner_response": null
      },
      {
        "author": "Mike Morgan",
        "rating": 5,
        "review": "great experience all around",
        "owner_response": null
      },
      {
        "author": "Ken Herman",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cedar Maxfield",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 14,
  "adjusted_average_rating": 4.79,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 14
  },
  "summary": {
    "created_timestamp": 1739095051,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Hansen Group Real Estate has garnered positive sentiment from many users, particularly praising the team for their responsiveness and expertise during the buying and selling process. Users frequently mention the attentiveness of agents like Jon and Ashleigh, who take the time to listen to clients' needs and preferences. Their ability to guide clients through complex transactions while providing valuable market insights has left a lasting impression on many, as evidenced by multiple users recommending the agency for its dedication and supportive approach.</p><p>Agents are often described as knowledgeable and approachable, making the home buying experience smoother and more enjoyable. For example, one client noted that even with the market being competitive, they felt supported throughout the lengthy buying process, ultimately leading to a successful purchase of a new home. The high degree of satisfaction evident in user reviews is reflected in the company's strong average rating, reinforcing the idea that they have built a reputable foundation in the local real estate market.</p></section><section id=\"great\"><h2>Great</h2><p>In addition to their commendable customer service, the Hansen Group is recognized for their efficient processing and smooth transactions. Several users highlighted the success in selling properties quickly and at desirable prices, with one client mentioning that their house sold within two days of being listed. This exceptional performance has made them a top choice for many homebuyers and sellers in the area, as evidenced by their long-standing relationships with repeat clients.</p><pFurthermore, the team's commitment to the emotional aspect of real estate transactions is noteworthy. One user emphasized how Jon and his team understood the sentimental value of a family home, treating the selling process with great care and sensitivity. Such dedication to clients' emotional states during potentially stressful transactions showcases a commendable level of professionalism that this company brings to the table.</p></section><section id=\"bad\"><h2>Bad</h2><pWhile the majority of user reviews are positive, there are a few critical voices that highlight areas for improvement. One reviewer expressed disappointment with Jon's communication skills, describing an encounter where he was condescending and failed to engage effectively regarding property offers. This user felt that Jon's approach could potentially jeopardize a buyer's chances of securing their ideal home, suggesting that future clients may want to consider interpersonal dynamics when choosing representation.</p><pThis feedback indicates that not every client experiences the same level of service. Moreover, another user rated their experience as average and noted that the interaction did not align with their expectations, hinting that consistency in approach and communication could enhance the overall experience for future clients. Such critical feedback is essential for the company to address to maintain and improve its reputable standing.</p></section><section id=\"ugly\"><h2>Ugly</h2><pDespite the generally favorable reviews, a couple of users expressed displeasure regarding particularly negative interactions, which may overshadow their overall positive experiences. One reviewer gave a poor rating without providing specific details, which raises concerns about the consistency of service quality. Though neither the review nor the response contained actionable insights, this illustrates that there could be undisclosed issues affecting some clients’ experiences.</p><pMoreover, the lack of detailed feedback in some negative reviews makes it difficult to understand the root of their dissatisfaction. The company must remain vigilant and proactive in addressing any complaints, as unresolved issues can tarnish their otherwise stellar reputation in the community. Continuous improvement and engagement with every client are critical to minimizing the “ugly” aspects of feedback that can arise in the real estate sector.</p></section>"
  }
}