{
  "name": "Harvard Suites",
  "slug": "harvard-suites",
  "company_type": "Property",
  "address": "705-709 32nd St, Bellingham, WA 98225",
  "review_count": 3,
  "average_rating": 2.33,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tristin Day",
        "rating": 1.0,
        "review": "some of the loudest neighbors i have ever lived with one of them plays the drums  and another dude plays basketball in the morning both usually in the am",
        "ownerResponse": null
      },
      {
        "author": "David Sisson",
        "rating": 1.0,
        "review": "8 months later and still havent got my security deposit back :/ reached out several times via phone, email, and renter portal.",
        "ownerResponse": null
      },
      {
        "author": "Bim S",
        "rating": 5.0,
        "review": "Nice looking! Would love to see the inside and curious about the price.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 2.33,
  "summary": {
    "text": "<section><h2>Good</h2><p>The property of Harvard Suites has, among its limited reviews, commendations for its aesthetic appeal. One user review highlights the property's visual charm, expressing an eager curiosity to see the interior and learn more about the pricing. This singular positive sentiment suggests that at first glance, Harvard Suites holds potential as an appealing residence for prospective tenants seeking a pleasant-looking living space.</p></section><section><h2>Great</h2><p>Despite the limited number of reviews, Harvard Suites does not have enough positive feedback to create a 'Great' section in this article. Without additional and more detailed positive experiences from users to report, it isn’t possible to expand upon what makes Harvard Suites extraordinary beyond its initial visual impression.</p></section><section><h2>Bad</h2><p>The downside to Harvard Suites, as expressed in user reviews, includes considerable noise disturbances from neighbors. One tenant has reported experiencing some of the loudest neighbors they've ever lived with, detailing issues such as one playing the drums and another playing basketball, predominately in the morning hours. Such noise can significantly disrupt daily life and rest, indicating a potential oversight in the management's enforcement of community quiet hours or soundproofing measures.</p></section><section><h2>Ugly</h2><p>Amongst the grievances noted, the handling of security deposits by Harvard Suites appears to be at the forefront. A user review recounts an ongoing struggle to have their security deposit returned even 8 months post tenancy, with the former tenant having taken multiple attempts to contact the property management via phone, email, and the renter's portal, all to no avail. This issue points to severe deficiencies in financial administration and responsiveness from Harvard Suites' property management, leaving former tenants frustrated and financially inconvenienced.</p></section>"
  },
  "created_timestamp": 1725642000
}