{
  "name": "Hideaway Apartments",
  "slug": "hideaway-apartments",
  "company_type": "property",
  "address": "1213 Whatcom St #96, Bellingham, WA 98229",
  "review_count": 8,
  "average_rating": 2.38,
  "reviews": {
    "google_reviews": [
      {
        "author": "Katya",
        "rating": 4.0,
        "review": "They cleaned out apartment so well before moving in. Everything was spotless and new carpet. The office workers are really nice. We can hardly ever hear neighbors or upstairs, there's a nice big grassy area to walk a dog and the price is really good for the quality and size. Main downside, in my opinion, is the dated interior, which included a bathroom with consistent mold issues, but it was manageable with regular cleaning of the ceiling.",
        "ownerResponse": null
      },
      {
        "author": "Kate Ortiz",
        "rating": 4.0,
        "review": "Affordable, close to town, bus route, and other services. Month to month so good for students. I moved here because it was one of the few affordable places i could have my cats and have easy bus access to school. I've been here for two and a half years and have been very content. Quiet and warm too - hardly ever any big parties because there's not many students. Office responds to concerns quickly. Spacious. I have no complaints. Some people complain that you have to pay for laundry but it's about half the price of the Bellingham Cleaning Center nearby and it saves a ton on the electric bill. Plus you can do three loads at once! anyway, really great place to live.",
        "ownerResponse": null
      },
      {
        "author": "Tiona",
        "rating": 1.0,
        "review": "DO NOT MOVE HERE! I lived here for years and there is black mold in every wall(they clean the exterior when you do inspection of unit so it doesn't show up until a few weeks after move in). The often \"misplace\" packages. There are drug addicts EVERYWHERE. Constant garbage on ground of premises. They will take your entire deposit(we even paid for cleaners on move out and they still took entire deposit) AND charge you over your rental amount.",
        "ownerResponse": null
      },
      {
        "author": "Aj ang",
        "rating": 1.0,
        "review": "I had to move when I saw someone in the parking lot using with the car door open, they didn't even live there. No response to problems, condoms and even needles found around the property. They have a security camera which one of the workers told me, it doesn't work, it's just for looks. A lot of neighbors complained of theft of of their cars. Theft from the laundry rooms. A bunch of bums and users stay in the little wooded area right by some of the parking spaces. Not worth it!!",
        "ownerResponse": null
      },
      {
        "author": "Kat Man",
        "rating": 2.0,
        "review": "It was a nice apartment when I first moved in it was clean and nice but got silver fish and in summer we got black ants and I talked to neighbors and they get them too and I hate the laundry room they never sanitize the washing machines and dryers one of the neighbors throws away mattresses like no other and I noticed one of the mattresses tossed and bed bug stains and it scares me and honestly the only positive thing is it's close to my work",
        "ownerResponse": null
      },
      {
        "author": "Cori Robinson",
        "rating": 1.0,
        "review": "100% not worth the rent they charge.",
        "ownerResponse": null
      },
      {
        "author": "Benjamin Allen",
        "rating": 4.0,
        "review": "Reminds me of the 90s.",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Becky C.",
        "rating": 2,
        "review": "Honestly, they were okay-ish. \n\nWen I first moved in around spring 2012, it was a shitshow and the cops had to be called all the time things broke and they raised rent way too often.\n\nOnly reason they got two stars is because management was nice to me. But ask my neighbors to remove their sign because you are racist? Nope. They did nothing wrong and were delightful people.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 2.38,
  "summary": "<article>  <section id=\"disclaimer\">    <heading><h2>Disclaimer</h2></heading>    <p>This summary has been generated by ChatGPT and is intended to serve as a tool to help individuals find a property management company or rental property. It is not a comprehensive review and should be used in conjunction with other resources. This article does not reflect the views of any specific individual or entity.</p>  </section>  <section id=\"good\">    <heading><h2>Good</h2></heading>    <p>Hideaway Apartments seems to make a positive first impression for some tenants, as illustrated in the user reviews that praise the cleanliness of the apartments upon move-in. Users noted that the apartments were well-prepared for new residents, with everything from spotless interiors to brand new carpets, which suggests a commendable attention to detail by the property management prior to tenant occupancy. Additionally, the office workers at Hideaway Apartments are described as really nice, potentially indicating a friendly and welcoming administrative staff.</p>    <p>Another highlight that comes through in reviews is the affordability and convenience of Hideaway Apartments. Tenants who have budget constraints or those who are students find the pricing to be reasonable, especially given the inclusive amenities such as access to a grassy area for pet walking. Furthermore, the proximity to town, bus routes, and other services is another detail that has left certain tenants content with their living arrangement. People appreciate the quiet environment, decently spacious rooms, and the prompt response from the office to tenant concerns.</p>  </section>  <section id=\"great\">    <heading><h2>Great</h2></heading>    <p>Some tenants find the location of Hideaway Apartments to be particularly advantageous, especially those who rely on public transportation, as it's situated close to a bus route that facilitates easy access to school and other necessities. This is further amplified by the fact that the apartments offer month-to-month leases, which is ideal for students and individuals not looking for a long-term commitment. Residents also highlight the quietness and warmth of the apartments, suggesting that the community is generally peaceful with limited disturbances from neighbors or noisy gatherings.</p>    <p>The overall value for money is appreciated by some tenants, who noted that the cost of on-site laundry services was lower compared to nearby facilities, and that the option to do multiple loads simultaneously was a plus. Reviews also indicate that the larger grassy areas are not just an aesthetic touch but also functional, allowing for a comfortable space for residents to walk pets or enjoy outdoor activities. The overall sense of a great living space for the price comes across in the reviews from satisfied tenants.</p>  </section>  <section id=\"bad\">    <heading><h2>Bad</h2></heading>    <p>Despite some positive insights, Hideaway Apartments also faces criticism from certain tenants who have had less than satisfactory experiences. In user reviews, a recurring theme involves the dated interiors of the apartments, including issues such as mold in bathrooms that seems difficult to manage even with regular cleaning. Moreover, a few tenants expressed concerns over pests like silverfish and ants during certain seasons, which points to potential shortcomings in the property's pest control measures. These issues can contribute to an uncomfortable living environment for some residents.</p>    <p>Additionally, there are complaints regarding the building's upkeep, particularly the communal laundry facilities which some tenants find are not maintained to a high standard of cleanliness. Concerns about bed bug sightings also add to the unease of living in the complex. Such issues appear not only inconvenient but could pose health risks, raising questions about the diligence of the property management's maintenance practices.</p>  </section>  <section id=\"ugly\">    <heading><h2>Ugly</h2></heading>    <p>The user reviews unearth some alarming opinions about aspects of life at Hideaway Apartments. One grave concern voiced by tenants is the presence of drug activity on the property, leading to uncomfortable and potentially unsafe encounters in common areas, including the parking lot. Users also allude to inefficacious security measures, citing non-functional security cameras, which could compound the feeling of insecurity among residents. Another worrisome factor is the report of repeated theft incidents from cars and laundry rooms, suggesting a significant issue with property security.</p>    <p>Frustrations are further amplified by claims of the management mishandling deposits and overcharging upon move-out, with tenants asserting that their deposits were not returned despite the hiring of professional cleaners. Such practices contribute to a sense of distrust and financial dissatisfaction among some residents. The accumulation of negative factors, from maintenance to safety issues, paints a challenging picture of life at Hideaway Apartments for a segment of the tenant population.</p>  </section></article>"
}