{
  "name": "Hilda Lane Apartments",
  "slug": "hilda-lane-apartments",
  "company_type": "property",
  "address": "2700 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 2.64,
  "reviews": {
    "google_reviews": [
      {
        "author": "Juliana Ruiz",
        "rating": 1.0,
        "review": "Nothing against apex, but the owner is a HORRIBLE person. Harassing tenants to the point we had to put cameras in the apartment scared he was gonna come in while no one was home. Also, the house is so cheaply made its already falling apart. Maplewood is a sketchy ass street, theres absolutely no parking and the place is way overpriced. We moved (thank goodness) less than a mile away to a place $400 cheaper and 400x better.",
        "ownerResponse": null
      },
      {
        "author": "Koby",
        "rating": 1.0,
        "review": "This is a horrible living experience if you have an animal. I myself have an ESA, which I forgot to add onto my application and had to put on after I moved in. The owner harrassed me about it, telling me that he didn't think I really needed it, didn't need me \"parading it around\" when I took her on a walk, and wanted me \"to stay in the corner where you live\".\nParking is also a joke, as nobody at APEX seems to take parking seriously. They let cars park there with no permits with no punishments, occassionally making the RESIDENTS park off-street.\nWish I was able to rate lower.",
        "ownerResponse": null
      },
      {
        "author": "Joshua",
        "rating": 4.0,
        "review": "Cheap rent for ikea-quality housing. Hardwood floors and new appliances are great but there is very little privacy and not much attention to detail in construction.\n\nHonestly a great price for what you get, and the units are all brand new",
        "ownerResponse": null
      },
      {
        "author": "Rudy Cruz",
        "rating": 3.0,
        "review": "Yumm.",
        "ownerResponse": null
      },
      {
        "author": "Alicia Kelley",
        "rating": 3.0,
        "review": "Grounds are filthy",
        "ownerResponse": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mary Giles",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "robert angelotti",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Paul Thornton",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Etilet Maipi",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tony Chunks Donatello",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.4,
  "summary": "<article class='review-summary'>    <section>        <heading><h2>Disclaimer</h2></heading>        <p>This summary has been generated by ChatGPT as a helpful tool intended to assist individuals in finding a property management company or rental property. The article synthesizes user reviews without revealing identifiable information and strives to provide a well-rounded perspective on the companies reviewed. Please note that this article is based on historical data and might not fully represent the latest status of the companies.</p>    </section>    <section>        <heading><h2>Good</h2></heading>        <p>Some users of Hilda Lane Apartments have expressed positive feedback regarding the price point, finding the rent to be budget-friendly. They appreciate the inclusion of new appliances and hardwood floors, which add to the value of the living experience. It is noted that the units are updated, which suggests that the management company is investing in keeping the property attractive and modern.</p>        <p>The sentiment among those with favorable reviews points to a relative satisfaction with the fresh and updated feel of their units, despite some concerns. The allure of affordable living, especially considering the quality of inclusions like new appliances, shines through in these user reviews. These highlights paint a picture of a property that does offer some redeeming features that are acknowledged and valued by its residents.</p>    </section>    <section>        <heading><h2>Great</h2></heading>        <p>Comments on the overall affordability of the apartments in comparison to the market suggest that for some, Hilda Lane Apartments stand out as a 'great' place to live financially. A particular review gives a nod to the competitive rental rates, deeming them cheap for what is provided, which could be seen as a significant upside for budget-conscious renters.</p>        <p>There is an absence of additional detailed enthusiastic endorsements; however, the fact that a reviewer mentions the alluring price and the newness of the units could imply an underlying sense of appreciation among certain tenants. This suggests that the property has the potential to be seen as a good find within the market, especially for those looking to maximize value.</p>    </section>    <section>        <heading><h2>Bad</h2></heading>        <p>Several users point out there is a lack of privacy and note that construction details seem to be overlooked, which hints at a potential for improvement in the quality of the accommodations. Complaints about the grounds being filthy suggest a need for better exterior maintenance and a more robust cleaning schedule to keep shared spaces in a more inviting condition.</p>        <p>Issues with parking are also prominent among the critiques, with residents expressing frustration over the lack of enforcement of parking regulations. This troublesome aspect can be a daily inconvenience for tenants, emphasizing a gap in effective property management and oversight concerning parking facilities and policies.</p>    </section>    <section>        <heading><h2>Ugly</h2></heading>        <p>The 'ugly' aspects of Hilda Lane Apartments, based on user reviews, consist largely of interactions with the property ownership and management that leave much to be desired. Claims of harassment and a lack of respect towards tenants, particularly those with animals or emotional support animals, cast a shadow over the living experience and suggest a potentially hostile environment that could deter prospective residents and concern current ones.</p>        <p>In addition to the alleged interpersonal issues, the structural integrity of the housing is called into question with mentions of cheaply-made construction that is \"falling apart.\" This declining physical state of the apartments, coupled with reports of sketchy neighborhood surroundings, contribute to a pretty grim picture of what some renters have experienced at Hilda Lane Apartments. These serious accusations point to substantial shortcomings that need to be addressed earnestly by the property management company.</p>    </section></article>"
}