{
  "name": "Hilda Lane Apartments",
  "slug": "hilda-lane-apartments",
  "company_type": "Property",
  "address": "2700 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 2.64,
  "reviews": {
    "google_reviews": [
      {
        "author": "Juliana Ruiz",
        "rating": 1.0,
        "review": "Nothing against apex, but the owner is a HORRIBLE person. Harassing tenants to the point we had to put cameras in the apartment scared he was gonna come in while no one was home. Also, the house is so cheaply made its already falling apart. Maplewood is a sketchy ass street, theres absolutely no parking and the place is way overpriced. We moved (thank goodness) less than a mile away to a place $400 cheaper and 400x better.",
        "ownerResponse": null
      },
      {
        "author": "Koby",
        "rating": 1.0,
        "review": "This is a horrible living experience if you have an animal. I myself have an ESA, which I forgot to add onto my application and had to put on after I moved in. The owner harrassed me about it, telling me that he didn't think I really needed it, didn't need me \"parading it around\" when I took her on a walk, and wanted me \"to stay in the corner where you live\".\nParking is also a joke, as nobody at APEX seems to take parking seriously. They let cars park there with no permits with no punishments, occassionally making the RESIDENTS park off-street.\nWish I was able to rate lower.",
        "ownerResponse": null
      },
      {
        "author": "Joshua",
        "rating": 4.0,
        "review": "Cheap rent for ikea-quality housing. Hardwood floors and new appliances are great but there is very little privacy and not much attention to detail in construction.\n\nHonestly a great price for what you get, and the units are all brand new",
        "ownerResponse": null
      },
      {
        "author": "Rudy Cruz",
        "rating": 3.0,
        "review": "Yumm.",
        "ownerResponse": null
      },
      {
        "author": "Alicia Kelley",
        "rating": 3.0,
        "review": "Grounds are filthy",
        "ownerResponse": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mary Giles",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "robert angelotti",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Paul Thornton",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Etilet Maipi",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tony Chunks Donatello",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.4,
  "summary": {
    "text": "<section><h2>Good</h2><p>The Hilda Lane Apartments offer certain benefits according to user reviews. One tenant mentioned hardwood floors and new appliances as noteworthy positives, suggesting the units were outfitted with modern conveniences. Additionally, the affordability of the apartments came up in discussions, with a user citing the rent as being reasonable for the offered amenities despite recognizing the building's quality as comparable to that of a well-known furniture retailer.</p><p>Furthermore, the accessible location of Hilda Lane Apartments is a boon to many residents, providing them with a variety of logistical advantages. Although not directly mentioned in reviews, properties in this area of Bellingham often benefit from proximity to local stores, public transport, and other facilities that tenants may appreciate.</p></section><section><h2>Great</h2><p>It appears from the user reviews there isn't a consensus on standout experiences that would fall into the 'great' category for Hilda Lane Apartments. While some reviews are positive, detailing acceptable living conditions, there's a lack of specific praise or exceptional stories that would indicate tenants finding their experiences above and beyond ordinary expectations.</p><p>That being said, it's worth acknowledging that some tenants have had satisfactory stays without notable issues, as indicated by middle-ground ratings. These indicate that while not exceptional, the accommodations have met the basic needs and expectations of some residents during their tenancy.</p></section><section><h2>Bad</h2><p>Negative aspects of Hilda Lane Apartments are evident in user reviews, highlighting maintenance and construction concerns. One tenant described the building as \"cheaply made\" and already falling apart, indicating a lack of durability and attention to quality during construction. Additionally, cleanliness seems to be an issue, with a comment pointing out that the grounds are filthy, signaling neglect in the upkeep of common areas.</p><p>Parking also seems to be a significant pain point for residents. Users have expressed frustration with the parking situation, describing it as \"a joke\" and criticizing the property management company for not enforcing parking rules. This has occasionally resulted in residents having to park off-street, which can be both inconvenient and unsafe.</p></section><section><h2>Ugly</h2><p>Some of the harshest criticisms of Hilda Lane Apartments come from statements concerning harassment and disrespect. In user reviews, the owner has been characterized as harassing tenants, to the extent that one felt the need to install cameras for safety concerns. Another resident with an emotional support animal reported inappropriate comments and pressure from the owner, which negatively impacted their living experience substantially.</p><priority high><p>As per the data provided, there are no instances where the company has responded to user reviews. This lack of engagement might suggest insufficient communication between the property management and tenants, exacerbating tensions and potentially leaving negative sentiments unresolved. The culmination of these factors paints a rather unsettling picture for prospective and current tenants.</priority high></section>"
  },
  "timestamp": "September 7 2024"
}