{
  "name": "Integra Condominium Association Management",
  "slug": "integra-condominium-association-management",
  "company_type": "company",
  "address": "2183 Alpine Way Bellingham, WA 98226",
  "review_count": 44,
  "average_rating": 2.39,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Condo O.",
        "rating": 1,
        "review": "Integra has been managing our condo association for about 3 years.  I am disappointed at their idea of increasing the sales appeal of our units by hiding the costs to new buyers who want to live here.  They are aware that high HOA fees are a deterrence to buyers so they suggest to the board lower HOA fees paired with regular annual assessments to fill the reserve funding.  This seems like bait and switch to me, but our board doesn't see this as an act of deception. \n\nIf you are buying a condo make sure you ask if there have been any recent assessments in addition to the HOA fees which are usually published so you understand the actual cost of living in the unit you are considering.",
        "ownerResponse": null
      },
      {
        "author": "Michael P.",
        "rating": 1,
        "review": "Where do I start?\nMy Wife and I purchased a Townhouse at Bay Rim Condo's on Birch Bay almost 4 years ago and we thought we'd be there through our retirement but....\nIntegra ruined a good thing!!!\nWorst Property Management Company EVER!!!!\nAnd that's being nice!\nCindy Rae acts like she owns the Property and uses the the HOA Board to start trouble.\nShe is a very Unlikeable person who has a SERIOUS attitude!!\nShe forgets that she works for the people at Bay Rim and I had a few words with her and we decided we were going to move... which we did!\nWorst experience of our lives!!!!\nIf you need a company to manage your Property...find someone else!!!\nThey charge you for EVERYTHING!!\nMove In fees...Move Out fees....total BS if you ask me!\nI've worked in Property Management and this is NOT how you handle a Portfolio!!!\nDo yourselves a favor and stay clear on Integra!!!!!!\nIf I could give NO Stars I would",
        "ownerResponse": null
      },
      {
        "author": "Linda D.",
        "rating": 1,
        "review": "(If I could give no stars I would.)\n\nDo yourself a favor and run a very long way away from this company. Their rudeness is only exceeded by their questionable ethics. \n\nYou will find better rental and property management companies in the area. These people are the absolute worst.",
        "ownerResponse": null
      },
      {
        "author": "Jasmine M.",
        "rating": 1,
        "review": "I lived in an apartment under their business for a year.\nIt's awful. Unprofessional. \nStaffs are rude and unfriendly.\nWhen things happen, they do nothing even it's their responsibility.",
        "ownerResponse": null
      },
      {
        "author": "Nanette J.",
        "rating": 1,
        "review": "I spoke with a woman today named Peggy. She was probably the rudest person I have had to encounter in a long time. I regret that I may have to talk to her again in the future but I can tell you that I will refuse to talk to her. She is definitely a very unhappy person and in the wrong line of work. She tried to belittle me over the phone and that is just not going to happen again. I feel sorry for this company that has this person as their first point of contact.",
        "ownerResponse": null
      },
      {
        "author": "Bob D.",
        "rating": 1,
        "review": "This is the worst rental management company I have ever had to deal with.  \n\nThey will steal your application fee. They take application fees to apartments they know they will not be renting to you, and refuse to refund you your money.\n\nTheir customer service is terrible. They will not let you know important information. They will not contact you when there is information you should know about your lease. They charge you for every little thing they can, don't give any of your security deposit back, and charge you fines until you have paid an extra $200/month in fees. \n\nThere was no reason for them to treat me this way. I consistently turned in my rent on time, paid all of my bills and was a quiet and respectful tenant. \n\nI can only hope this stops people from using them as a property management company or from renting from them. It is not worth it.",
        "ownerResponse": null
      },
      {
        "author": "Jenn X.",
        "rating": 5,
        "review": "We have had nothing but amazing service from Integra during our 6 years with them! I wish they could take over the rest of our condo association!!!\nMy admiration of them went up even more recently when they took over and handeled everything for us when our tenants abandoned the unit. They're AMAZING!!!!!!!",
        "ownerResponse": null
      },
      {
        "author": "R F.",
        "rating": 1,
        "review": "Haven't even bought the condo under their management yet and I already don't like them. I called to ask questions and Tess could not have been less helpful. She just kept saying \"did you read the certificate?\" Yes. I did. It is a legal doc and I just wanted quick clarification because, Hey, Tess, this is your area of expertise, not mine! I think you could do with a course in customer service skills because that is my area and you would be fired! I am buying a condo and can't wait to recommend that Integra be replaced!",
        "ownerResponse": null
      },
      {
        "author": "C H.",
        "rating": 1,
        "review": "I hope this prevents another person from applying for a rental from Integra.  They are the worst landlord company in Bellingham.  They will take your application fee knowing a listing has already been promised to a different tenant.  It's really akin to theft.  They are rude and unresponsive.  Yuck!  Stay away from this landlord!!!  If I could have given them 0 stars, I would have.",
        "ownerResponse": null
      },
      {
        "author": "Nicholas E.",
        "rating": 1,
        "review": "Not sure how Jenn X. could rate this company five stars? Maybe she is a friend of the company or didn't have many real encounters with them. I wouldn't even give the 1 star if I could. I echo the sentiments exactly of all the other 1 star reviews. I wanna thank these people for leaving these reviews because this company is downright unethical. Terrible service, rude, they will lie and make up stories and do just about anything to get out of taking care of the things they are supposed to take care of. Definitely my worst experience ever with a property management company. You know when so many reviews in a row are one star and all say the same thing you should steer clear. Stay away. Also look at the Google reviews online, same horror stories. I could tell my whole story but just look at all the 1 star reviews before me and you will know my story, exactly the same as what they say. Very dishonest unethical company.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Jennifer Craig",
        "rating": 5.0,
        "review": "I have been a tenant under Integra for over a year and a half now, they have been seamless to work with, respond promptly if I need maintainence, always keep me in the loop on anything happening in my building. After dealing with other property management companies who were not responsive to maintainence requests, among other things, Integra is the breath of fresh air I truly needed. Thank you so much, Integra!",
        "ownerResponse": {
          "text": "Thank you for the kind words!!"
        }
      },
      {
        "author": "Michele M.",
        "rating": 5.0,
        "review": "Our 55+ community in Bellingham had two previous property management companies before Integra. Our HOA Board was very dissatisfied with those two previous companies; and very satisfied with Integra. As an owner, I have been impressed by Integra's excellent service, both from their office staff and the two owners (Tess & Cindy). They have always answered my questions quickly and efficiently. When I have attended Board meetings, I always observed the broad expertise, financial acumen, wide range of tradesmen contacts and overall professionalism of Integra's Tess as she helps our HOA Board work their way through their many duties, looking after our community. At our annual general meetings, Tess and Cindy have also demonstrated their understanding of owners' concerns; and Tess and Cindy's tact in dealing with a wide variety of owner personalities. I highly recommend Integra.",
        "ownerResponse": {
          "text": "Thank you for your kind words."
        }
      },
      {
        "author": "OnTheRoadAgain",
        "rating": 1.0,
        "review": "Yes, yes, yes! Sadie Sullivan, the absolute most unprofessional of the bunch. No clue how to speak to homeowners. Thank you so much to all of the other reviewers who are posting about their negative experiences with this company. I am thinking these reviews should be sent to the better business bureau.  I could tell my entire story but it would be the exact same as every one of you. Worst customer service ever, they try their hardest not to fix anything or spend money in any way even when it's their legal responsibility. My experience with the maintenance guy they were using to respond to any repairs (Mike) was an absolute nightmare, and then rather than apologizing for everything, they defended him and blamed me! The worst experience I have ever had with a prop management company. I may have to file a homeowners insurance claim for something that is their responsibility to fix because they seem to be refusing to fix it. They are rude and belittling over the phone and email, even seem like they don't want to help you in person. I echo the sentiments of another reviewer who said they don't even want to give 1 star.",
        "ownerResponse": null
      },
      {
        "author": "Mareyoko Butler",
        "rating": 1.0,
        "review": "I rented a condo in birch bay through Integra years ago and had the WORST experience I have EVER had with any kind of business of that kind. I always look back on it and laugh at the irony of their name. From my experience they are completely lacking in integrity. They did not inform me about the home owners association fees until I had already paid a down payment and i felt like I was surprised by other extra costs I was not originally informed about. The people I dealt with were rude. I got out of that lease as soon as I could. They did NOT make that easy and I lost a lot of money. That part is understandable except for the way it was handled was very bad. It is my belief they made it more difficult than need be out of spite (even though they were already making a profit off the extra fines and deposits, they also did not lose any rent). But I was not comfortable living under a management company like this. Losing some money was better than living under their thumb.\n\nYou would be wise to listen to your fellows and look elsewhere for a living situation.",
        "ownerResponse": null
      },
      {
        "author": "Kat DeVaney",
        "rating": 1.0,
        "review": "We have had multiple interactions with Integra in which they have lost keys, blamed us for it, yelled at us and then told US that we were unprofessional, incorrectly identified who the owners of the property were, and generally have been very unpleasant to deal with.\n\nEdit: September 2020. Cindy and Tess have threatened to drop our HOA as a client if I was elected to the board, and told our current board members Good Luck finding another property management company to take you. How much more unprofessional can you get?\nThey also took 6 months to resolve a simple ceiling tile that fell onto our walkway.",
        "ownerResponse": {
          "text": "It is unfortunate that you lost your keys.  As we tried to explain, we have never had keys to your unit as it was on the master system and we had no need of them.  A key for you was located with the Board of Directors, of which you were already aware.\n\nThe Owners of the unit were correctly identified and are concurrent with those on the recorded title.  We cannot just add names to the account unless such is supported by legally recorded documents.\n\nUnfortunately when your significant other was in our office, none of these answers were satisfactory for him.  He made his displeasure loudly known while exiting.\n\nIn response to your recent post about INTEGRA dropping the Association if you were on the Board, this is VERY interesting as you WERE on the 2019 ballot for the Board and the MEMBERSHIP rejected you NOT INTEGRA."
        }
      },
      {
        "author": "NJ GP",
        "rating": 5.0,
        "review": "I have had very good experiences with the Integra office over 3+ years .Have called 3-4 times about issues which were handled effectively, promptly and well. The latest rate of response was-same day-impressive.\nI like the office staff, find their efficiency easy to take- gets good results!",
        "ownerResponse": null
      },
      {
        "author": "Dee Brown",
        "rating": 1.0,
        "review": "Awful company. I couldn't agree more with the previous reviewers.\n\nI deal with Integra as a tenant. They have threatened to evict me and have also threatened me otherwise - for no good reason. I am a solid tenant. My rent is always paid on time and take exemplary care of the property I inhabit.\n\nUnfortunately, the damage has been done and my rating likely won't go much higher than this. After a horrible couple of days dealing with Tiffany and Tess, the owner, Cindyrae stepped in and we were able to find some common ground.\n\nAvoid this place.",
        "ownerResponse": null
      },
      {
        "author": "Ed DeVaney",
        "rating": 1.0,
        "review": "In response to Integra's response to Kat DeVaney:\nYour response is simply false. It is plain you have no problem being dishonest with your customers. At your company's request, to accommodate fire inspections for which we would not be present, we have dropped off no fewer than three keys with your company, two of which you have no record of. These were handed to the secretary who promised to keep them on file, which never happened.\nRegarding changing the owners of the property, it makes sense that someone would need to change the record in person. That is a reasonable request, and not the issue we had with your company. The problem we had was with Tess and Cindyrae, the owners of Integra. Your secretary and staff were fine, and looked embarrassed to be involved with this situation. Property management companies have a history of being falsely maligned. In this case your impatience in explaining the situation, the fact that you did not stay in the room to continue the conversation, instead choosing to scream names at me from the other room, and your unwillingness to even talk to me because my name was not on the document, instead making me call my mother-in-law (whose name was on the document), then refusing to talk to her once she was on the line; all of these issues are why we gave you a negative review.\nInstead of taking responsibility for your actions as owners of the company, you choose to disparage your customers. This is why we call you unprofessional and rude.\nI made my displeasure known calmly, without raising my voice. I told you I was frustrated, that I did not appreciate being yelled at from other rooms, and that I expected an apology. Apparently you interpret this as being loud. When no apology was forthcoming, I left.",
        "ownerResponse": null
      },
      {
        "author": "Pres Play",
        "rating": 5.0,
        "review": "I'll preface by saying, based on my recent encounter with Integra I was quite shocked to see all the negative reviews. I can only presume that my positive experience with Integra is perhaps a result of that feedback and reflection on how a company should engage with it's customers or it's customer's customers.\nRecently I had learned that my HOA had changed brokers, I also realized my HOA fees had not been getting deducted because of the change (technically my fault). I called Integra and the lady I spoke with gave me some good advice on options. About 20 minutes later I drive to their location and spoke with Sadie to determine the next steps of resolving my \"faux pas\"!  Sadie explained to me what I needed to do to get my account up to date. She was helpful, respectful and considerate of my situation. I had accumulated late fees due to the confusion and she explained to me the steps to take to request resolution without penalty from the HOA Board. I felt she went above and beyond in my situation, even facilitating the communication to the Board rather me having to write a letter and sending it in the mail. (way inconvenient!!! )\n\nAnyway not to negate others experiences and frustrations, I feel its important for people to have a platform to express their dissatisfaction. I also think its important to give credit where credit is due, so Saide.....thank you very much for your help, I truly appreciated it.",
        "ownerResponse": null
      },
      {
        "author": "Ms Down to earth",
        "rating": 1.0,
        "review": "I talked with Tess on the phone because I am in the process of buying a condo under her management. She was rude and seemed to resent answering my questions. Finally she told me she gets paid for answering questions. My mortgage broker contacted her and found she wants $250.00 for filling out a questionnaire that I have to have. The attitude Tess displayed just makes this already stressful process more so. I hope they are fired soon.",
        "ownerResponse": null
      },
      {
        "author": "Erin Smith",
        "rating": 1.0,
        "review": "I couldn't agree more with the other reviews!  This company has the absolute worst customer service I have ever experienced.  They don't seem to understand who the customer is and how they get paid.  They are horribly rude on the phone when you call for any reason, which would be fine if they could at least manage the simple task of processing our dues payments correctly.  I will be talking to our HOA about finding a new property management company.",
        "ownerResponse": null
      },
      {
        "author": "Scott Brown",
        "rating": 5.0,
        "review": "I am a long term Board Member of an HOA in Blaine Wa. I and our association have been associated with Integra and Tess and Cindy Rae for more than 10 years as our Property Managers. We  have always found them to be very professional, extremely helpful and experts in providing the oversite and planning we require.",
        "ownerResponse": null
      },
      {
        "author": "Taf Kama",
        "rating": 2.0,
        "review": "My experience with Integra has been awful. Their front desk desk staff members are rude and full of excuses. They have no real interest in helping condo owners and instead will look for any opportunity to deflect responsibility away from themselves. If you are considering buying a condo in Bellingham be sure to check the management company first. My suggestion is that you AVOID any building managed by this company.",
        "ownerResponse": null
      },
      {
        "author": "caleb young",
        "rating": 1.0,
        "review": "I don't even want to give them a star!  And after reading their 'mission statement' I wonder what they are supposed to do for us, unless being super disrespectful is one of their tenets. Someone at the company  told us to do something, then 'the owner' charged us a large fee for doing that exact thing. And then she spoke to us as if we were trying to steal something from her. Maybe she just felt like picking on someone today, and we drew the short straw! Or maybe it's time to look at all these negative reviews and realize that you suck at what you do.",
        "ownerResponse": null
      },
      {
        "author": "Zach Dugan",
        "rating": 1.0,
        "review": "I have never felt so awful about customer service than I have with this company. In particular one person Sadie Sullivan, the way I was treated by her was incomprehensible. I was simply trying to resolve an issue and she consistently talked down to me and even raised her voice towards me. STAY AWAY",
        "ownerResponse": null
      },
      {
        "author": "Jesfer Mikesell",
        "rating": 1.0,
        "review": "worst experience renting through them... dealt with numerous package thefts and car break ins. Never respond or do anything about these types of incidents.",
        "ownerResponse": {
          "text": "We would be happy to assist you, however you are not listed as a resident at any of our managed properties."
        }
      },
      {
        "author": "Joann Childs",
        "rating": 5.0,
        "review": "Efficient process ascertaining knowledge regarding my dues.",
        "ownerResponse": {
          "text": "Thank you.  We are always happy to assist anyway we can."
        }
      },
      {
        "author": "Richard Huizenga",
        "rating": 5.0,
        "review": "Over the years Integra and I have worked together. All experiences with the staff have been professional, ethical and organized. They are great people and skilled at there services.",
        "ownerResponse": null
      },
      {
        "author": "Michael Bell",
        "rating": 1.0,
        "review": "Read the other reviews, they are all 100% on point. How does it reflect on an HOA that every single review of their organization is scathingly negative?\n\nStay away; consumer BEWARE.",
        "ownerResponse": null
      },
      {
        "author": "Tim Heredia",
        "rating": 1.0,
        "review": "I have tried to contact manager several times within the past two years,  left my phone number requesting call back , she has not returned any of my calls , receptionist always states she is out to lunch or in a meeting , called this time due to fire issue , no return call again , not very professional of this management company .",
        "ownerResponse": null
      },
      {
        "author": "Jenna Ruud",
        "rating": 5.0,
        "review": "The women here were lovely and helpful. And very cool office, too",
        "ownerResponse": {
          "text": "Thank you!!  Always happy to help!"
        }
      },
      {
        "author": "Jasmine Munro",
        "rating": 1.0,
        "review": "Sorry to say this, but don't do any business with them. Don't trust their websites because it's not true.\nThe stuffs are rude on the phone/in person. Unprofessional.\nMy advice is be far away from them.",
        "ownerResponse": null
      },
      {
        "author": "Samuel Conrad",
        "rating": 5.0,
        "review": "Have rented from them for 3 years now, easy to deal with.",
        "ownerResponse": null
      },
      {
        "author": "Tim Adkins",
        "rating": 1.0,
        "review": "Be very careful before doing any business with this company. Ironically named.",
        "ownerResponse": null
      },
      {
        "author": "Max Archer",
        "rating": 5.0,
        "review": "Great management company.",
        "ownerResponse": null
      },
      {
        "author": "Koopa Paratroopa",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Can you please explain the reason for your displeasure.  We would welcome the opportunity to improve your impression of our company."
        }
      },
      {
        "author": "John Hess",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you!!"
        }
      },
      {
        "author": "jess mcnutt",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jessyca Murphy",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Rob Miranda",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Julie B",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Julia B",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Zach Dugan",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Audrey Miller",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 35,
  "adjusted_average_rating": 2.29,
  "summary": {
    "text": "<section><h2>Good</h2><p>In this article's \"Good\" section, we showcase the positives noted in the user reviews for Integra Condominium Association Management. Tenants who had pleasing experiences praise the company's quick responsiveness to maintenance requests and their ability to keep tenants informed about events occurring within their buildings. One user detailed a seamless experience with the staff, finding them efficient and appreciative of the office's overall professionalism, noting their quick response time as impressive. Another mentioned that Integra was a refreshing change from their past experiences with property management companies, indicating a notable level of satisfaction with the services received.</p></section><section><h2>Great</h2><p>The \"Great\" section of this article recognizes exceptional service that goes beyond the basics. Board members of associations managed by Integra have expressed a high degree of satisfaction with the company's professionalism and expertise in overseeing and planning necessary management tasks. Users commended the owners for their deep understanding of the concerns of homeowners and their effective facilitation of annual general meetings. Integra's handling of long-term relationships with some clients has also been noted as very professional, suggesting a solid track record of consistent service provision with certain clientele.</p></section><section><h2>Bad</h2><p>Turning to the \"Bad\" aspects, several user reviews pointed to Integra's inadequate attention to tenant and homeowner issues. Complaints include miscommunication and unresponsiveness to maintenance requests, as well as rudeness from staff members. One reviewer felt the company's practices were dishonest, citing a situation where application fees were collected for an apartment the potential tenant was never actually considered for. Moreover, many users reported a failure to return security deposits and the imposition of fines that accumulated to significantly higher expenses, suggesting a pattern of financial mismanagement that can burden tenants and homeowners alike.</p></section><section><h2>U Let's continue to the \"Ugly\" subsection of the article. Unfortunately, some of the user reviews for Integra Condominium Association Management reflect alarming dissatisfaction. One user felt that Integra's tactic of disguising high HOA fees with regular assessments was deceptive and misleading to potential buyers. Another troubling allegation involved a property manager's attitude, described as making tenants feel like they were deceiving the company when raising legitimate concerns. The culmination of numerous negative experiences shared in user reviews paints a picture of a company that may neglect its duties, struggle with poor communication, and display questionable ethics.</p></section>"
  }
}