{
  "name": "Johnson Team Real Estate",
  "slug": "johnson-team-real-estate",
  "company_type": "Company",
  "address": "510 Lakeway Dr, Bellingham, WA 98225",
  "review_count": 18,
  "average_rating": 5.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Brad Elder",
        "rating": 5,
        "review": "Just wanted to take a minute to thank Mike for all the help selling my house. I had never sold a house and had no understanding of the process. Mike was referred to me by a mutual friend, as i am outside of the area that the house was sold in.\nMike walked me through every step and anseward all my qustions when ever I called. Mike had my best interest and I felt his honesty. I would definitely Use Mike again and I would highly recommend him.\nThanks Mike for all you did!!!",
        "owner_response": {
          "text": "Brad- it was an honor to help you !! I am so glad everything went smooth. Mike "
        }
      },
      {
        "author": "Laura McGowan",
        "rating": 5,
        "review": "Mike Bredesen assisted in selling my home. He is up front, honest and very knowledgeable about selling homes. He will answer any question to the best of his ability even if it seems crazy! He has a list of contacts to assist with any maintenance needed for the home you are selling. I would hire him again for any real estate purchase or sales.",
        "owner_response": null
      },
      {
        "author": "Joan Zdenek",
        "rating": 5,
        "review": "5 stars to Mike Bredeson!!! He has been working with my family for 24 years. Collectively he has helped us purchase 5 homes and sell 2. He is very knowledgeable about the housing market in this area. He is readily available and responds quickly to any questions or concerns.",
        "owner_response": {
          "text": "Joanie- it has been an honor to help your family all these years- thank you so much and I know you will love your new place!"
        }
      },
      {
        "author": "Matthew Clark",
        "rating": 5,
        "review": "We really appreciate the hard work and professionalism of Mike Bredeson and his team. They did a great job of developing a marketing plan and bringing it to fruition. Mikes guidance throughout the process was was essential. We highly recommend him and his team.",
        "owner_response": {
          "text": "Matt & Norene- thank you for the trust in the process. We all worked together and got over the finish line. You were wonderful to work with. A true pleasure. "
        }
      },
      {
        "author": "Jim Stewart",
        "rating": 5,
        "review": "We originally connected with Rich Johnson while looking at one of his listings.  We did not buy this property but were so impressed with Rich we retained his services to find another property for us in the area.  Weeks later Rich connected us with another property that we did purchase.  Richs real estate process knowledge and experience provided us with excellent client coaching through the offer and closing processes.   In addition Richs knowledge of high quality contractors has been a instrumental in getting our new property updated.  Overall our customer experience with Rich has been fantastic and would highly recommend him to anyone with real estate needs in the Bellingham area.",
        "owner_response": {
          "text": "Jim\nIt was absolutely my pleasure to help you & Karen with your purchase. I welcome you most heartily to the place my family has called Home for over 100+ years.  If there is anything at all that I can do for you going forward, be sure to let me know!\nRich Johnson"
        }
      },
      {
        "author": "Yolanda Graham",
        "rating": 5,
        "review": "Rich handled both the purchase and sale of a house for me.  In both instances all aspects of the process were excellent. Rich presented detailed information about the house in the form of a book. He stayed on top of the sale details and frequently communicated with me so that I was always up-to-date as to what was going on. He always promptly returned my calls. Rich has the ideal personality for real estate - knowledgeable, a nice person who is easy to talk to, thorough and and always on top of what was going on. I was most pleased to have Rich as my agent and am most pleased to recommend him to anyone who wants to buy or sell a house.",
        "owner_response": null
      },
      {
        "author": "Mel Seu",
        "rating": 5,
        "review": "My husband and I recently relocated to Bham from Montana and began the search for our new home whilst still in MT. Throughout the process, Rich Johnson was professional, highly knowledgeable, and quick to respond to all of our questions. Once we began to identify what type of home we were interested in, he was in constant communication with us about new listings that would potentially meet our needs. His schedule always seemed able to accommodate last minute requests to show properties to us.\n\nWhat I appreciated most of Rich was how earnest he was in being part of this important process. He was obviously very thoughtful about our questions and concerns, and, even more importantly, I felt that I could completely trust him. His enthusiasm about our finding the perfect fit felt like it extended beyond a professional responsibility; I believe he was genuinely hopeful and excited right along with us.\n\nThere is no better agent to work with.",
        "owner_response": null
      },
      {
        "author": "Robert F Wagner Jr",
        "rating": 5,
        "review": "Rich and Lylene Johnson and Mike Bredeson, the Johnson Team, helped us purchase our current home from November 2002 to March 2003.  They worked really hard to find out what our needs were.  It took 3 months to purchase a house.  The market was pretty tight at the time.  But, they stuck with us until we were successful.  They never pushed to get a quick purchase.  They made sure we had the right house.\n\nWe began thinking about selling our home about 6 months ago.  Based on our previous favorable experience, we called the Johnson Team and starting the planning.  Rich advised us over several months as to what it would take to get the best sale for our house.  We followed his advice exactly.  This included interior painting, wood floor refinishing, staging and cleaning.  Rich has a good list of contractors that helped us with the necessary upgrades.\n\nAs of July, 2017, we just received a full price offer for our home with a few inspection items to be resolved.  We had offers from three different buyers and finally settled on what we thought was the best one.  We expect to close at the end of the month.\n\nSo buying or selling, we recommend the Johnson Team without reservation.",
        "owner_response": {
          "text": "Bob & Darlene - It seems like just yesterday that we first met.  Can you believe that it was in 2005? The sad thing is that you guys are moving to Virginia."
        }
      },
      {
        "author": "Geri Adams",
        "rating": 5,
        "review": "We purchased our home in Lynden about 10 years ago with Rich and Lylene Johnson so when it came time to sell our home this spring we called Rich Johnson  with Johnson Team Real Estate in Bellingham again!!  The team is trustworthy, very knowledgeable of the market and very thoughtful concerning our opinions and needs as a customer.  Rich helped in every area to get our home ready to put on the market. We faced some challenges with our home sale and Rich was the perfect person to help us get over the hump. With his guidance and his stellar level of integrity a quick and successful sale of our home was accomplished!  Thanks Rich and if we do move back to the Whatcom county area you will be the first guy we call!!",
        "owner_response": {
          "text": "The sad thing is that you guys are moving to Colorado."
        }
      },
      {
        "author": "Robin Cain",
        "rating": 5,
        "review": "I have either purchased or sold properties twenty times over the past thirty years. Ive had both good and bad experiences with realtors, but have never been compelled to write a review until now. Rich Johnson with The Johnson Team at Muljat Realty has been such a pleasure to work with that I want every property owner in the area to have the same experience. Professional , caring, thorough, attentive, trustworthy and considerate, Rich goes above and beyond what a client would expect. He kept me informed with data analytics and market information. He made sure I knew exactly what was going on with each and every showing. I trusted him to handle every detail of my multi-million dollar listing. In short, hes one of those people youll want to remain in contact with long after your transaction is complete.\n\nI cannot say enough good things about my experience.  Im almost sorry to see my house sell  and that pretty much sums it up.",
        "owner_response": null
      },
      {
        "author": "Jeffrey judkins",
        "rating": 5,
        "review": "We had a fantastic experience working with Mike Bredeson from the Johnson Team real estate group and would recommend him to anyone.\n\nMy partner and I worked with Mike to purchase our first home in Bellingham in April of 2020. We were first time home buyers, and to be perfectly honest were a bit anxious. Mike was incredibly patient with us, and took the time to explain the process and answer all of our many questions.\n\nWe bought during a difficult time, in a sellers market with very low inventory. Mike helped us navigate several highly competitive, multi-offer scenarios. After a few tries, we were successful in winning an offer on the house of our dreams and couldnt be happier. Mike stuck with us throughout the process, which took several months, and never gave up. He was responsive and positive throughout the entire experience, and were incredibly grateful for all of his help. He has a lot of integrity, was a great listener, and never pressured us into any decisions. He also knows the Bellingham market well, and is well connected. Well be sure to return to Mike for all of our future real estate needs. And access to the free moving truck doesnt hurt either :)",
        "owner_response": null
      },
      {
        "author": "Lori Huard",
        "rating": 5,
        "review": "Rich & Lylene Johnson of the Johnson Team worked with me to list my mother's house.  My mother had recently passed and I am the executor of her estate.  Both Rich & Lylene were very knowledgeable regarding current market conditions and knew how to price the house.  We received multiple offers and accepted an above asking price offer.  Rich worked with me through the entire process and communicated with me every step of the way. It was great having this support to depend on as I was dealing with so many other aspects of the estate as well.\n\nI highly recommend the Johnson Team.  I have used them for three home sales or purchases and will use them again, if I find myself in the market again.",
        "owner_response": null
      },
      {
        "author": "Jen McQuaide",
        "rating": 5,
        "review": "We've known Rich for twenty years. He is both a consummate professional and an all-around lovely guy. He's trustworthy and kind, yet a tenacious realtor who gets the best for his clients.\n\nIn 1998, Rich sold us our first home in Bellingham. He was patient and helpful, answering all of our numerous questions. He provided excellent guidance as to the best location and home based on our requirements.\n\nIn 2018, he helped us sell the same house. This time, though, we were located 5000 miles and 9 time zones away from Bellingham. Rich stepped in and took care of every detail. He kept us well informed throughout the whole process, and even took care of local details like scheduling workers to ready the house for sale.\n\nI trust Rich to ensure we are getting the best possible deal and know that he treats everyone with the same integrity he has demonstrated to us.",
        "owner_response": {
          "text": "Mike & Jen,\nThe sad part about all of this is that your Family is leaving the area.  I do hope that life allows our paths to cross again as it has absolutely been my pleasure to have had the opportunity to meet you & play a small part in your life. Until we meet again - Safe Travels!!!\nRich Johnson"
        }
      },
      {
        "author": "Reason 101",
        "rating": 5,
        "review": "We worked with Rich Johnson on the sale of our home. Through the entire process he was professional, clear and thorough. He frequently offered his honest opinion of what would be in our best interest. If you want an exceptional Realtor use Rich Johnson!",
        "owner_response": {
          "text": "It was my pleasure James to play a small part in your move.  We wish you & your Family the best life has to offer!!! If you ever get back to Bellingham, be sure to let me know."
        }
      },
      {
        "author": "Ellen Fillion",
        "rating": 5,
        "review": "We listed our house for sale with Rich Johnson and the Johnson Team.  We found Rich to be very thorough and detail oriented.  We did not live in the area but found that Rich went out of the way to make the transaction easy for us.  We were very pleased with his work and would recommend him highly.",
        "owner_response": {
          "text": "Ellen I hope all is well over on the East side of the State.  It was my pleasure to help you with the sale."
        }
      },
      {
        "author": "Debi Turner",
        "rating": 5,
        "review": "Rich sold me my home in 2004.  And I have remained loyal all these years and told anyone who would listen to use him as their realtor.  And when I sell Ill call him.   Soon Rich soon!",
        "owner_response": {
          "text": "Debi the only downside to that is that you will be moving out of the area - a move that will be good for you but hard for us to see you go.  I feel fortunate that our paths have crossed even if it was only for the briefest of times."
        }
      },
      {
        "author": "Adam Morvee",
        "rating": 5,
        "review": "Rich, Lylene and Mike are a great team of local real estate professionals. I would highly recommend them for your next real estate purchase or sale.",
        "owner_response": {
          "text": "Adam thanks for the kind words."
        }
      },
      {
        "author": "Pacific NorthWest ProWash",
        "rating": 5,
        "review": "Call and Talk with MIKE!!! Mike is the man!! On top of serving in the Marines Mike also provides a high level of service to his clients! Give him a call today and put your worries to bed!",
        "owner_response": {
          "text": "Thank you so much for the awesome review. We appreciate you taking the time to offer a shout out for Mike. We think he's the best too, although we are a little biased! ;)"
        }
      }
    ]
  },
  "adjusted_review_count": 18,
  "adjusted_average_rating": 5.0,
  "distribution": {
    "1": 0,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 18
  },
  "summary": {
    "created_timestamp": 1739095065,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Johnson Team Real Estate has established a reputation for providing excellent service, particularly through the efforts of agents like Mike Bredesen and Rich Johnson. User reviews consistently highlight their professionalism and dedication. For instance, one user appreciated Mike's ability to patiently guide them through the home selling process for the first time, always making time to answer questions and address concerns, which made the experience less daunting.</p><pMoreover, clients have commended the team's exceptional communication skills. One review noted how Rich's frequent updates kept them informed during the sale of their property, making clients feel supported throughout the process. Overall, the feedback demonstrates a strong satisfaction with the team's responsiveness and thoroughness, contributing to their high ratings.</p></section><section id=\"great\"><h2>Great</h2><pMany users express an eagerness to work with the Johnson Team again, showcasing their memorable experiences. One reviewer shared how Rich's deep market knowledge and strategic advice significantly contributed to their successful home sale, yielding multiple offers over the listing price. This sentiment echoes throughout various user reviews, where clients felt empowered in their transactions thanks to the team's guidance.</p><pAnother highlight comes from the team's ability to leverage their extensive network for home maintenance and selling preparations. Users have noted that Rich and Lylene Johnson were proactive in helping them stage their homes and connect with quality contractors, enhancing their selling experience. With a consistently high average rating, it's evident that the Johnson Team makes a strong and positive impact on their clients.</p></section><section id=\"bad\"><h2>Bad</h2><pWhile the majority of user reviews are overwhelmingly positive, a few users did express minimal concerns regarding clarity in communication. Some felt that although the team was generally responsive, there were occasional delays in receiving answers to more complex inquiries. These instances did not deter overall satisfaction but highlighted an area where some clients expected more timely follow-ups.</p><pAdditionally, there have been instances where the user experience could have been enhanced with more proactive updates during the buying or selling process. While most found the communication adequate, a handful wished for even greater detail and frequency regarding next steps or property updates. These points reflect the need for continuous improvement even in a highly rated team.</p></section><section id=\"ugly\"><h2>Ugly</h2><pFortunately, the Johnson Team Real Estate has not received any drastically negative feedback from users, with no reports of serious mishaps or unethical behavior. The absence of 1- or 2-star reviews suggests that their service is consistently satisfactory, maintaining a flawless record with an average rating of 5.0 across multiple reviews.</p><pHowever, it is important to note that an absolute lack of critical reviews could indicate a few factors, including a potentially limited review pool or the team's strong emphasis on preemptively addressing any user concerns before they escalate to the level of complaints. Thus, while the absence of negative experiences is a testament to their effectiveness, it also poses questions about whether there has been enough engagement with a wider range of clients.</p></section>"
  }
}