{
  "name": "Julian & Company",
  "slug": "julian-company",
  "company_type": "Company",
  "address": "952 N State St, Bellingham, WA 98225",
  "review_count": 117,
  "average_rating": 5.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tanya Zboya (Enlight Creative Inc.)",
        "rating": 5,
        "review": "Julian & Co. Real Estate Team was instrumental in selling our new build in Sudden Valley. We received an offer within 10 days for full asking price!\n\nThey assisted us throughout the entire real estate process with construction delays, staging and inspection items that came up. We would have never closed without Julian working tirelessly with the buyers to ensure they were informed and comfortable every step of the way.\n\nThank you Julian & Co. Real Estate Team for all your hard work!",
        "owner_response": {
          "text": "Tanya, working with you two on the sale of this home was really fun! I know there were some challenges with construction timelines etc... but you handled the entire process with grace! I'm grateful for your business and to call you both friends! Wishing you all the best! -Julian"
        }
      },
      {
        "author": "Lisa League",
        "rating": 5,
        "review": "We had a great experience with Julian and the team, who helped us find the perfect unique property and worked with us through a complicated closing. Where they really shine is in the follow-through  working with the builders on the punch list or making adjustments and even handling deliveries for us while we were out of town. Highly recommend.",
        "owner_response": {
          "text": "Lisa,\n\nWe really enjoyed supporting you on your home buying journey in Bellingham! The location on South Hill that we secured is truly special and I hope that it is a hub for amazing memories and epic sunsets. Wishing you both good health and abundance in the years to come!"
        }
      },
      {
        "author": "Jim Steele",
        "rating": 5,
        "review": "I was impressed with how this team worked together. I really appreciated Hudson's eye for detail while we were looking at houses - he was really good at figuring out what was going to work for me. Kailee handled all the paperwork and did an excellent job keeping everything on track. And Julian handled the negotiation and got me to what seemed like a fair price even though another offer came in at the same time. He had good advice and perspective. Thanks to all of you!",
        "owner_response": {
          "text": "We had such a pleasant experience working with you to find the perfect home! The entire team looked forward to every interaction. Thanks for choosing Julian & Company to help you in this important transition. Wishing you good health and happiness! -Juian\n"
        }
      },
      {
        "author": "Jackie Guthrie",
        "rating": 5,
        "review": "We recently used Jerry at Julian & Company to list our home and help us find our new forever home. Jerry was friendly, professional and great at communicating with us. When the first offer on our house fell through Jerry was on top of communicating with previous interested parties and had the house relisted quickly. We appreciated Jerrys willingness to show us houses we were interested in and listen as we weighed pros and cons. We highly recommend Jerry!",
        "owner_response": null
      },
      {
        "author": "Betsy Becker",
        "rating": 5,
        "review": "Julian is a top-tier agent for a reason. His remarkable acumen for the local market, combined with a sharp, professional approach, makes him a master at sealing the deal. In just 72 hours after signing with him, we had our dream home, and we couldn't be happier. Beyond his expertise, what sets him apart is his genuine care for his clients and his community alike. He's personable, attentive, and a stellar communicator. Julian's support team is equally impressiveservice-driven and eager to assist at every turn. We want to thank Hudson, Kailee, and Julian for taking such good care of us. Simply, if you're looking for the best, you can find it in Julian.",
        "owner_response": {
          "text": "Wow!!! Thank you for the incredibly kind words!! Im so happy to help you land your dream home in Edgemoor so quickly! Although, you and your family were such a blast to work with that I would have loved some more time. Fortunately, we get to be friends now!! Looking forward to celebrating with you and Ben soon! "
        }
      },
      {
        "author": "Vance Hunt",
        "rating": 5,
        "review": "Working with Julian and his team was a dream. We have had a lot of previous experience working with other realtors, but Julian and his team really exceeded our expectations. We especially appreciated the cooperative effort of everyone on the team to help set our goals and execute them quickly and flawlessly. From the time we decided to sell to the cleaning and staging and final listing, everyone on his team was involved and very helpful. They enabled us exceed our pricing and timing goals and we are super grateful to everyone involved. He really knows how to create a quality team and we would definitely use him again.",
        "owner_response": {
          "text": "Vance,\n\nThis was such a great team effort all around! With your help, we were able to execute our marketing plan flawlessly and secure 3 amazing offers and $110k over our asking price! As you know, this is quite rare for homes over $2 million! You are both so deserving of this result! Wishing you all the best on your next adventure!! -Julian"
        }
      },
      {
        "author": "Steve Graney",
        "rating": 5,
        "review": "We interviewed 5 realtors and selected Julian. He was the only realtor willing to take on the job of listing the sale price significantly above appraised value.  We knew it was a unique opportunity and wanted to give it a shot.  All the other realtors wanted the quick sale and quick commission and werent willing to go to work. Julian and his team were a pleasure to work with. We closed before our goal and the journey was simple.",
        "owner_response": {
          "text": "Steve, \n\nIt was an honor to help you and your family pass on this beautiful lake property that had been the center of so many memories over the last half century! I thoroughly enjoyed our conversations and cant thank you enough for working with me! Wishing you all good health and happiness in the years to come!"
        }
      },
      {
        "author": "J B",
        "rating": 5,
        "review": "Julian and his team are hands down the best realtors weve ever worked with! Great attentiveness, insights into properties we wouldnt have thought of, and unparalleled knowledge of the area. We are new to Bellingham and Julian and his team went beyond helping us purchase a property. They gave excellent advice and helped us negotiate a good deal on our dream home. Highly recommend!",
        "owner_response": {
          "text": "You two were an absolute delight to serve! I had such a great time driving you around and sharing my love of this beautiful area! The mid-century home you purchased in Edgemoor is one of my favorites and a really wise choice as well! I'm sure you will find the location to be quite convenient and based on my experience, the Southside residents make incredible neighbors! I'm really excited for you two! -Julian"
        }
      },
      {
        "author": "Richard Steinberg",
        "rating": 5,
        "review": "Julian & co. did an excellent job in selling our home in South Hill.  His team was outstandingly helpful throughout the process.  Julian knows the Bellingham market and although he does not list himself as a 'luxury agent' or 'South Hill specialist,' he, Hudson & Kailee did a great job.  We sold our house in a week after listing it, for a fair price. I can't say enough thanks to Hudson who helped us unload a lot of stuff.  Julian could not have done more or better to market our home.  I highly recommend him as a seller's or buyer's agent.",
        "owner_response": {
          "text": "Richard, It was a pleasure helping you two sell your beautiful home on 13th St! Spending much of my youth growing up on South Hill, helping buyers and sellers like yourself brings me great joy! I'm trilled that we were able to get you over asking and under contract in the first week! Wishing you and your family good health and happiness in the years to come! -Julian"
        }
      },
      {
        "author": "Dave Robinson",
        "rating": 5,
        "review": "My wife and I recently began the journey to home ownership, one people often describe as stressful, scary, and arduous. But that was not our experience.\n\nWe went into this with a small nest egg, but knew that our target price would be modest and we went in without a lot of expectations.\n\nWorking with Nathan Lowe at Julian & Co. made the process so much easier for us. After looking at a few houses we came upon 'the one' for us. And Nathan offered us some great words of wisdom and guidance in putting together a masterfully crafted winning offer that got us accepted! It's the little touches in negotiations that propel a good offer to a great one.\n\nI am so thankful that we got a chance to work with Nathan through this amazing journey, because he really goes the extra mile for his clients. I have no doubt that if we should ever be in the market for a new property our first call will be to Nathan to find us that perfect home.",
        "owner_response": {
          "text": "David and Ariana, Thank you so much for putting your trust in me to win you this sweet home! You were such a pleasure to work with, and I know we will work together again; that home in your dream location is on the horizon. Together we will make that happen; Dream, believe, and receive! Reach out to me any time for any help with your home.\nCheers, Nathan"
        }
      },
      {
        "author": "Patricia Oriti",
        "rating": 5,
        "review": "Our agent, Josh Silverman, did a fantastic job from initial contact through closing, and sold my house in one month from listing it to the closing. He was supportive and prompt in all communication, and patient when I needed things explained multiple times. He was knowledgeable about the market and made the selling process as straightforward as possible. I am very satisfied with the selling price and highly recommend Josh, and Julian & Company.",
        "owner_response": {
          "text": "Patricia, \nThank you so much for entrusting us to list your long-time family home. I'm thrilled we were able to get you the price you were looking for and it was a pleasure to serve you and your family! \n-Josh"
        }
      },
      {
        "author": "lorendavis1",
        "rating": 5,
        "review": "We recently listed and closed on the sale of our home in Edgemoor with Julian. After selecting him over other top agents, he quickly got down to business and did an excellent job in marketing and staging. Professional, personable and thorough, he and his team were the right choice. Outstanding assistance provided by team members Hudson and Kailee.",
        "owner_response": {
          "text": "Loren, \n\nI will be forever grateful for the opportunity to work with you and your family on selling your parents magnificent estate. It was my favorite home I've ever sold for a number of reasons including its virtually untouched, mid-century perfection and the graceful and collaborative nature of your approach to the sale. My entire team had such a fun time and I can't thank you enough! Wishing you and your loved ones good health and happiness in the years to come. Looking forward to our next encounter!"
        }
      },
      {
        "author": "Ed Dorame",
        "rating": 5,
        "review": "Julian Friedman and his team did an outstanding job in selling our home in the Edgemoor neighborhood of Bellingham.  We have owned many homes throughout our lives and Julian is definitely one of the best Real Estate agents we have worked with.  We highly recommend him.  We had interviewed two other top Whatcom county Realtors, but ultimately decided on Julian.  From our first interview with Julian to close, his professionalism, attentiveness, excellent communication, patience, and in-depth knowledge of our local real estate market, gave us confidence we had made the right choice.  He truly had our best interests at heart through every stage of the selling process. He found us the right buyer for our home. He listened to our needs, developed a selling strategy and implemented it successfully.  We will always be grateful and thankful to Julian and his team.  Ed Dorame and Stephen Clifton",
        "owner_response": {
          "text": "Ed & Stephen,\nWe sure made a great team! From our first meeting, I could tell that this was going to be one of my favorite transactions! The timing worked out perfectly and I know this next leg of your journey will be filled with joy and adventure! I'm excited to stay friends and looking forward to dinner next week!"
        }
      },
      {
        "author": "Joshua Major",
        "rating": 5,
        "review": "Julian and team were fantastic. Our house sold fast and at value. They were responsive and willing to help with things I wouldn't normally expect a realtor to get involved with. Highly recommend.",
        "owner_response": {
          "text": "Josh, you were an absolute pleasure to work with. I'm looking forward to meeting you in person sometime! -Julian"
        }
      },
      {
        "author": "Brian Jacobson",
        "rating": 5,
        "review": "Julian and his entire team are truly fantastic. Ive bought a number of homes, in a few different cities, and this was definitely the most enjoyable experience - which is a bit shocking given how competitive the market in Bellingham and Whatcom County are right now. Julian knows the market, knows the terms that other buyers will be offering, and ultimately what its going to take to be in the winning position. We couldnt be happier with the home we bought, and I highly doubt we would have had the winning offer without Julians coaching throughout the process. I couldnt recommend his team any more highly!",
        "owner_response": {
          "text": "Brain,\n\nThank you for trusting me with this huge decision. Purchasing a home on South Hill can be very difficult and even more challenging when you are buying sight unseen. It was a tough negotiation with multiple offers and you were a pleasure to consult and advocate for. Thank you for your business and becoming a friend! Our whole team is excited to have you two in Bellingham!\n"
        }
      },
      {
        "author": "Thomas Malone",
        "rating": 5,
        "review": "Julian Friedman is the best real estate agent in Bellingham!! After interviewing several of the top luxury agents in town, I decided that Julian & Company were the best choice for listing my lakefront property on Lake Whatcom. They showed impressive  energy and enthusiasm, and promised services and marketing strategies that were significantly more than others so I felt that they would do the best job representing me with the sale of my home. Hudson was remarkably helpful and was available any time, from jumping in preparing my home for sale, to hiring the right contractors, staging and countless other tasks, he delivered much needed support each step of the way! We listed on a Tuesday and I had a full price cash offer the following Monday with a 5 day close!!! It was a dream come true! Im glad I selected Julian. He marketed my property perfectly and negotiated the exact result that I had hoped for. If you are selling a home in Bellingham, I recommend that you hire Julian & Company!",
        "owner_response": {
          "text": "Thomas,\n\nWe had such a great time representing you on the sale of your beautiful home! My whole team put so much into the marketing and presentation of this listing and Im over the moon excited that we were able to deliver such amazing results so quickly! Im excited to stay in touch and hear about how your sailing adventures go! Ill leave you with the one of my late fathers favorite quotes by Mark Twain Twenty years from now you will be more disappointed by the things you didn't do than by the ones you did. So throw off the bowlines, sail away from the safe harbor. Catch the trade winds in your sails."
        }
      },
      {
        "author": "Mercedes Converse",
        "rating": 5,
        "review": "Julian was very helpful throughout the entire process. It was an emotional time selling and preparing my fathers house after he passed and he helped with every part of the process to get the house ready to sell. He was even able to be flexible with last minute changes in plans and limited budget for projects before selling the house. He made this process smooth and quick, and his advice lead to selling the house for much higher than we thought we could get for it. We are very grateful for his expertise and help with this whole process. I would highly recommend him.",
        "owner_response": {
          "text": "It was such a honor to assist you and your siblings with the sale of your fathers beautiful South Hill home. Having lost my father as well this year, it made this transaction extra special and heartfelt. Thank you for trusting in my advice and expertise. Im thrilled that we were able to get you more than 17% over the asking price! Wishing you and your loved ones good health and happiness!"
        }
      },
      {
        "author": "A X",
        "rating": 5,
        "review": "Selling my house was a daunting prospect for me, but Julian made the whole process super easy and stress free.\nI would definitely use Julian and his team again.",
        "owner_response": {
          "text": "Thanks for trusting us to help with the sale of your Sunnyland home! The process was smooth and enjoyable through and through! Looking forward to lunch whenever youre back in town. \n-Julian"
        }
      },
      {
        "author": "Jewel Nelson",
        "rating": 5,
        "review": "Before deciding on an agent, I interviewed between 20-30 candidates . After thorough consideration, I chose to list with Julian and his team. In my opinion, Julian is one of the top agents in Bellingham and beyond! I cant recommend Julian Friedman and his team at Julian and Company enough! ",
        "owner_response": {
          "text": "Joy,\n\nThanks for trusting in me to help with the sale of your home! You put so much love into this project and it means the world to me that you decided to choose me as your Realtor! I'm always here for you!"
        }
      },
      {
        "author": "clara gutierrez",
        "rating": 5,
        "review": "Julian's team!!! what a great job. There knowledge, confidence and honexty give us the courage we needed to made such a big decision. We were not familiar with this area, therefore it was very important to work with a team that knew the town. After a quick interview they understood what we were looking for and didn't waste our time. The minute a house that met our requirements got on the market Julian will comunicate with us, after he did a quick inspection his shelf and let us know if was or not worthy to rush a visit (we are from out of town). Julian congratulations on your great team, Hudson was honest, intelligent and so sweet. Capable beyond his years. Kailee, very responsive and accessible. Perfect team. - Clara CARROLL",
        "owner_response": {
          "text": "Clara,\n\nThis was such a fantastic experience from top to bottom! I'm trilled that we were able to secure you a perfect home on South Hill despite a highly competitive situation with multiple offers. Thanks for placing your trust in me and I look forward to celebrating with you soon!"
        }
      },
      {
        "author": "Dakota C",
        "rating": 5,
        "review": "Julian and his team were a pleasure to have sell our home. Julian is hands on and goes above and beyond to ensure the his clients needs are met. They will make you feel as if you are the only home on the market and top priority. I would highly recommend working with Julian as a seller or a buyer. We look forward to working with him again in the near future.",
        "owner_response": {
          "text": "What a great experience! You and Nate were a dream to work with in every regard. Your responsiveness and level of commitment to ensuring that the home was brought to market in the best way possible is so appreciated!! Watching your family grow and getting to be involved with this major move was a pleasure! I look forward to staying connected and helping in the future with anything you ever need. Wishing you good health and happiness "
        }
      },
      {
        "author": "Dave Donohoe",
        "rating": 5,
        "review": "We highly recommend Julian and his team based on our experience with Julian selling our property in Bellingham. We live outside of Bellingham and as such it was very important for us to have a realtor that we could trust. Julian knows the market, has great business insights and was always collaborative with us in all the decisions. Julian was in constant communications with us giving us the peace of mind that our precious asset was receiving the attention that every owner would like to have. Julian was also positive, fun and made the whole experience less stressful. We also received our targeted price so all in all..... nice work Julian!",
        "owner_response": {
          "text": "Dave,\n\nThank you so much for the glowing review! I deeply appreciate your trust in timing and strategy. With your support, we were able to get an unbelievable price for your investment property! Every conversation with you two was a joy and I feel grateful that I had the opportunity to be your agent. Looking forward to connecting next time I'm up in Vancouver! Wish you both good health and happiness! "
        }
      },
      {
        "author": "Mark Wade",
        "rating": 5,
        "review": "Julian is an exceptional real estate agent who helped us find a great home in a neighborhood we thought might be out of our reach. He made the entire process of buying a home run smoothly. We were impressed with his professionalism and his ability to make us feel at ease throughout the process. We would highly recommend Julian to anyone looking for a real estate agent in Bellingham. Thank you, Julian and team, for all your hard work!",
        "owner_response": {
          "text": "Mark,\n\nI had the best time working with you and Jody to find the perfect South Hill home to meet your needs. Your enthusiasm and positivity made the whole process smooth and enjoyable! Im excited to stay in touch and see you at our parties!! Wishing you both good health and happiness "
        }
      },
      {
        "author": "Jess Cobb",
        "rating": 5,
        "review": "Julian is like the best friend you never had. Honest, caring, trustworthy, and direct. If it wasn't for Julian and his team I would have had nowhere to go. He had my back during a very difficult and stressful time in my life. His entire team worked very hard to brighten the skies. I would highly recommend Julian and company",
        "owner_response": {
          "text": "Jess, your enthusiasm and appreciation for all of our efforts made this difficult situation so enjoyable! Im so grateful that I had the opportunity to serve you and hope  we get a chance to celebrate soon! Wishing you and your family the very best!!!"
        }
      },
      {
        "author": "Leslie Spurr",
        "rating": 5,
        "review": "Working with Julian was easy and fun. We met with him in October just to become familiar with the different Bellingham neighborhoods. Julian drove us all around and was able to understand our tastes and could steer us in the right direction in terms of neighborhoods and prices. When we were ready to buy in July, Julians negotiating skills helped us obtain the house we really wanted. His whole staff is professional, friendly and patient. I would highly recommend working with Julian to anyone buying in the Bellingham area.",
        "owner_response": {
          "text": "Leslie,\n\nWorking with you two was pure joy! I really enjoyed the time that we spent together. I'm so glad that we found you the perfect place so quickly! Looking forward to hiving you in town and hanging out again soon!"
        }
      },
      {
        "author": "Ross Olason",
        "rating": 5,
        "review": "We had a great experience buying our home with Julian! He was very knowledgeable about the entire Bellingham area and its neighborhoods. He took all of our wish list into account and found us the perfect home in a neighborhood we hadnt even considered before his suggestion, but it was exactly what we were looking for! Julian was also very responsive through the entire process and was always easy to talk to and discuss the home buying process.",
        "owner_response": {
          "text": "Thanks for selecting me as your agent and helping you and your beautiful family land in Bellingham. Im sure that your children will thank you when theyre older for making this major move!  "
        }
      },
      {
        "author": "Scott Bigler",
        "rating": 5,
        "review": "Julian Friedman has been an absolutely outstanding agent to work with for finding a home; as well as being a welcoming presence to the Bellingham area.\n\nWe worked with Julian prior to moving to the Bellingham area to set an agenda so that we could work expediently and strategically when we arrived after the start of the year. Knowing that getting into a home quickly was a priority, Julian had everything set for us when we arrived in Bellingham. We started looking at homes on a Thursday, had a signed agreement by Sunday, and closed on the following Friday. 8 days! All the while, my wife and I never felt pressured to rushed into any decisions. Julian helped us to accomplish exactly what we wanted to do and landed us in a great home. We looked at a lot of homes in a few short days and we actually ended up in the first one that Julian recommended to us.\n\nJulian and his entire team have gone above and beyond what you would expect. They are genuinely kind people and great ambassadors for the area. The team is knowledgeable of the region, know the advantages and pitfalls of each section of the city, and are a great resource for finding excellent local assistance for other aspects of moving to a new city.\n\nI cannot recommend Julian Friedman highly enough. The team is great and Julian will guide you through the entire home buying process. You will end up in the right home for a fair (or better) price. This is a competitive market, but Julian came through for us and we couldnt be happier.",
        "owner_response": {
          "text": "Scott, \n\nThe only downside to finding and closing in the perfect home so quickly was that we didnt get to spend as much time together. You were both so much fun and completely in step the whole time. I also appreciate that you took the time to research and interview the best real estate agent in Bellingham for you. With so many options, it feels really good that such kind and intelligent people like yourself, would choose me to be their agent.Im excited to have you come to our parties and make some new friends!"
        }
      },
      {
        "author": "Melissa D",
        "rating": 5,
        "review": "Julian is a king of a realtor. You won't know customer service or attentiveness until you hire Julian & his crew. No b.s. - this dude went above and beyond before, during, and after the sale. You could not be in better hands.",
        "owner_response": {
          "text": "Melissa,\n\nYou and Rocco are so awesome and easy going! I really enjoyed showing you all those homes remotely. It speaks volumes that you trusted me to help you purchase remotely without ever seeing the home. I wish you both good health, happiness and bundles of joy on your new adventure!"
        }
      },
      {
        "author": "Jon Miksch",
        "rating": 5,
        "review": "Julian and the entire staff are fantastic. All questions were answered promptly and professionally. They researched properties thoroughly and gave fantastic advice. The purchase of our 2 bedroom condo was smooth. Julian negotiated $20k off the original asking price.\n\nI highly recommend them for all real estate needs.",
        "owner_response": {
          "text": "Jon,\n\nEvery moment helping you was a blast! I love your humor and the unwavering trust that you put in me and Im thrilled to know that we held up to your expectations. I know this place is for your daughter but should you ever decide to move up this way, Id be ecstatic! We could use another awesome human!! Wishing you and your loved ones good health and happiness."
        }
      },
      {
        "author": "Heesun Park",
        "rating": 5,
        "review": "We moved from Atlanta looking for a change of environment in the  Bellingham area. As any out of state move would entail, we had a good share of anxiety whether we would be able find a home that we would enjoy in a completely new environment and finding a realtor seemed like the most important step in relieving that stress. My husband and I are so grateful that we were able to work with Julian and his team.\n\nJulian recommended a home/neighborhood that I did not consider at first, but after going over the pros & cons, I realized that he knew exactly what we wanted more than we did ourselves. I am thrilled to say I was wrong and he was right after we moved in and settled down.\n\nIf you are looking for a realtor who will put 100% out there for your interest, easy to work with, dedicated, considerate, dont look anywhere else.\n\nOh, I must also add how fantastic the entire team is. Everyone in the office are the nicest people you will ever meet with genuine interest and care with whatever agenda you approach them with. Truly hospitable people.\n\nI feel like Bellingham extended a warm welcome to us by connecting us to Julian and his amazing team.",
        "owner_response": {
          "text": "Heesun!\n\nIt was a great honor getting to support you two in finding the perfect place! Furthermore, sharing my love of the area with clients who were so excited and ready to soak up all of info that I can offer! It was so much fun! Thanks for choosing me to help you with this huge moment in your life!"
        }
      },
      {
        "author": "Lacey Postlewait",
        "rating": 5,
        "review": "Julian helped my husband and I purchase our first home. We found our dream home before it was on the market and within 48 hours of our initial conversation with Julian, we were able to see the home and get under contract. He was extremely helpful and walked us through the entire process, so we knew exactly what to expect. He is professional and amazing at what he does. He is also friendly and easy-going. Julian was very easy to stay in contact with through text and phone calls which made us feel like he was invested in our buying process. We couldnt be happier with our new home or the service he provided.",
        "owner_response": {
          "text": "Lacey, it was an absolute pleasure to represent you and your growing family on this major purchase! The fact that you work for one of the most incredible lenders in our area and decided to choose me to be your agent, means the world to me! I wish you all the world and will always be there for you!"
        }
      },
      {
        "author": "David E",
        "rating": 5,
        "review": "Julian Friedman is a go-getter, just the kind of agent we needed in Bellinghams tight market with a limited inventory of mid-priced condos. Because we had a limited time-frame, we wanted an agent who could aggressively help us with our search and who was well-connected in the real estate business. Julian fit both. In short order, he identified an off-market condo that was perfect for us. He lined up an inspector immediately and worked with the buyers agent to get us HOA documents quickly. When our offer was accepted, Julian identified a closer who could close in a week. He was good at explaining aspects of the transaction we didnt understand and followed up on loose ends right up to closing. It was an amazing and ultimately very satisfying experience.\n\nJulians team is a pleasure to work with. In particular, Kailee Rose, executive assistant, has that rare quality of being both energetic and patient. Shes efficient and conscientious, and persevered in ensuring all logistical tasks were accomplished in a timely manner. Like Julian, she was good at explaining the details of the process that we didnt understand.\n\nIn short, I would highly recommend Julian and his team. They get the job done, and theyre a pleasure to work with along the way!",
        "owner_response": {
          "text": "David, \n\nGetting to meet you two and identify an off market opportunity that worked perfectly for your need on the same day was such a dream. Its wild that from the moment you walked into our office for the first time, to closing on your condo was only 8 days! It was such a joy to serve you and I look forward to staying in touch. Thanks for choosing me to help you with finding the perfect place! "
        }
      },
      {
        "author": "Libera Geller",
        "rating": 5,
        "review": "Julian and his team went above and beyond for my husband and I as first-time home buyers. He was patient and understanding as we searched for the perfect home for over five years! Julian was incredibly knowledgeable about the local neighborhoods, parcel classifications, taxes, home appliances, construction quality, and all of the rules and regulations. He was also very helpful in helping us navigate the move to the area from California, and even offered to help us with things like accepting deliveries and checking in on the house after we closed to when we moved in.\n\nIn addition to his team's exceptional knowledge of the local real estate market, Julian provided us with excellent communication via text, email, and phone calls every step of the way. He was always responsive to our questions and concerns and always seemed to be going the extra mile. When we visited Bellingham, he spent an entire afternoon with my husband and me, driving us around the city, getting lunch, and just giving us the in-depth details. He was incredibly generous with his time! We were VERY picky, and I am sure very annoying at times, lol, but Julian was always so helpful.\n\nJulian did an excellent job at negotiating on our behalf, helping us to get the best possible deal on our dream home. We closed at 16% below asking, and helped us avoid negotiation pitfalls.\n\nHe also helped us line up a loan, insurance, an inspection guy, and more. SOOOO helpful. I thought a realtors job was more straight forward, but I was totally wrong.\n\nI would highly recommend Julian and his team to anyone looking to buy a home in the Bellingham area. They love their careers, and it shows. They exceeded our expectations in every way, and we couldn't be happier with the results. They are experts in their field and made sure that we were not just satisfied but thrilled with our home purchase experience. We also feel like we found a great friend... which is rare :)",
        "owner_response": {
          "text": "Libera,\n\nI had a blast taking you three around and getting to know you. I'm eager to welcome you to town and help familiarize you with all of the things that I love about our wonderful community. Thanks for your kind words! It means the world to me that you took the time to express you feelings and experience in such detail. "
        }
      },
      {
        "author": "Josh Geller",
        "rating": 5,
        "review": "Just bought our first home with Julian's help!\n\nJulian displayed genuine empathy and understanding from the start. He actively listened to our concerns, anxieties, and desires, ensuring that we felt heard and validated. His support made a world of difference in navigating the emotional ups and downs of buying a home.\n\nBeyond his emotional support, Julian demonstrated extensive knowledge of the local real estate market. His insights and expert advice proved invaluable in making informed decisions and successfully navigating the complexities of the buying process.\n\nHighly recommended!",
        "owner_response": {
          "text": "Thanks Josh! It was so much fun helping your whole company find homes in the area! Even better, I got some awesome new friends! I'm excited to share some great memories with you all this summer!"
        }
      },
      {
        "author": "Cassandra Bemish",
        "rating": 5,
        "review": "Julian was a huge help in buying our home. He gave my husband and I great pointers in what we should offer and helped us with our love letter. We also werent pre-approved for a loan before finding the house we wanted to buy, but Julian referred us to Nicole and she got us approved quickly. Theyre a great team to work with. We decided we wantedi to move on Monday, viewed the house on Tuesday, and our offer was accepted on Friday. Definitely would work with them again.",
        "owner_response": {
          "text": "Cassandra, it was such a joy to work with you and your beautiful family!I am beyond pleased that we were able to get your first offer accepted on the first home that you fell in love with! We love being able to provide these types of results for our clients. Enjoy making wonderful memories in your new home. Wishing you and your loved ones good health and happiness! -Julian"
        }
      },
      {
        "author": "Brent Erickson",
        "rating": 5,
        "review": "Julian was a great partner in helping us purchase our property. We approached him with a property in mind and he helped us seal the deal. He was very responsive throughout the entire buying process and provided valuable insights on both the property and the surrounding areas.  Overall, we had an efficient and pain free transaction! We would recommend Julian and his team!",
        "owner_response": {
          "text": "Brent, \nIt was such a great experience working with you and Elizabeth! I really appreciate your thoughtfulness and calm resolve throughout the entire process. Thanks for the Kraken tickets! I'm heading down to Seattle shortly to enjoy the game with my son! I look forward to staying in touch and seeing you at our client parties!\n-Julian"
        }
      },
      {
        "author": "tcmauer",
        "rating": 5,
        "review": "Jerry helped me close on a home in less than two months, which is remarkable in the Bellingham housing market.  He was quick to respond to all my messages and requests to tour homes, worked around my schedule so viewings could be done timely, and was ready to to submit an offer on a day's notice.  He even worked with me during his vacation time with his family (boundaries, Jerry!).  During the negotiation process, he was able to secure the maximum amount of seller credits I was asking for, and then secured additional credits and benefits upon closing.  He is knowledgeable, friendly, well-connected, and talented at what he does.  This was my first home purchase, and I will use him for any of my future real estate needs.  I'd also recommend him to any of my family and friends.  Thank you so much, Jerry!",
        "owner_response": {
          "text": "Thanks for the kind words Tom! But truly the credit must go to you. You stayed positive during the struggles of losing bidding wars and kept true to your good nature and patience. I'm a firm believe that attitude dictates success in many walks of life and you really displayed a great attitude throughout this process. It was a pleasure to work with you and we had fun seeing all the different places before walking into \"the one\". I'm so happy for you and I can't wait to get the invite to the first BBQ in that beautiful yard and deck! - Jerry"
        }
      },
      {
        "author": "Katie Armbruster",
        "rating": 5,
        "review": "My husband and I were first time home buyers in the Bellingham area.  We were lucky enough to connect with Julian and his team through Zillow.  Julian was very prompt in identifying the properties that we were/might be interested in and securing both virtual and in-person showings for us.  Julian made us feel at ease when viewing properties but was also sure to inform us when quick action was necessary in the interest of securing a deal.  Julians knowledge of the area and prior experience with local builders were invaluable in helping us to determine a good fit for our family.\n\nWhen it came time to put in an offer, Julian was quick to get started on the paperwork, despite it being a holiday and a Sunday afternoon.  Julian invited us back to his office and personally drew up the contract, taking the time to explain the whole process top-to-bottom and answering all the questions we had.  Julian (and his cute pup) made us feel very comfortable during what was a very important moment in our lives.  My husband and I never felt hurried or rushed, and we really appreciated that.  Thankfully, the sellers agreed to a mutual contract later that same evening, and Julian was quick to call Ben and I to congratulate us, even though he was having dinner with his own family at the time.\nThe very next business day, Julians executive assistant, Kailee, contacted us to break down the transaction timeline.  Kailee was extremely responsive throughout the homebuying process, and her constant communications kept us on track and assured.  Kailee helped to facilitate communication with all necessary parties, including the lender, title company, inspector, and home insurers.  The home inspector that was recommended, Brad Oppedal, was very thorough and provided a detailed inspection report.  We were unable to be physically present during the inspection, but Kailee was good enough to be present in our stead and video conferenced us in with the inspector.  Kailee also did a virtual final walkthrough for us before closing to make sure everything looked in order.\n\nWhile the sale is now complete, Julian has encouraged us to reach out to him and his team if we ever need anything else.  Julians services come with our highest recommendation and we are very grateful to Julian and Kailee for helping us purchase our very first home.",
        "owner_response": {
          "text": "KatieThanks for for such a thoughtful review and detailed description of your experience working with us! It was a real pleasure serving you two and helping you land in your first home!!I look forward to staying in touch and hope to see you at some of our parties and events!"
        }
      },
      {
        "author": "Danna Zelenka",
        "rating": 5,
        "review": "Julian assisted us every step of the way! He was very professional, cordial and kind. Hes knowledgeable, and was able to give us clear options, as we moved through the process of purchasing our home. He responded right away to our texts and calls and helped us stay informed. We could depend on him without reservation. Julian works for his clients with their best interest at heart. Hes a skillful negotiator which can make an enormous difference in a home purchase. He advocates for his clients. I recommend Julian for a seller or buyer as he will ease the challenge of buying or selling a home, or both!\nD.Z.",
        "owner_response": {
          "text": "Danna, this was truly a fairytale transaction. Im still buzzing from all the good energy and excitement that was sustained through the entire process. You were the right couple for this house and it is obvious! When the seller accepted your offer over another that was WAAAAY above, I knew. Things fell into place in such a beautiful way! Infinite gratitude!! -Julian"
        }
      },
      {
        "author": "Jillian Hendershot",
        "rating": 5,
        "review": "Julian was our realtor before we were even serious about buying a new home. Even when we were just looking casually he made himself available to show us homes on our schedule. He grew up in the Bellingham area so his knowledge of this area is expansive and he has an obvious passion for what he does.\n\nWhen WE were finally ready to sell our old home and buy a new one, Julian was ALSO ready for prime time. He had our home staged and photographed with dazzling results. Our home sold quickly and he was able to negotiate to our benefit.\n\nJulian is a very hard working, passionate realtor who strives (and succeeds) in giving his clients a wonderful experience. We couldn't be happier with his work and friendship throughout the process.",
        "owner_response": {
          "text": "Jill,\n\nI am so grateful to have had the pleasure of working with you and your beautiful family on this momentous move! Having the privilege of seeing your family grow was really special to me. I know you and Tim said that you would be terrible clients , but it really was a lot of fun to work with you. When it came time to get down to business, you both helped make the process smooth and successful! Thanks again for your trust and friendship!"
        }
      },
      {
        "author": "Tim Thompson",
        "rating": 5,
        "review": "Hudson made the process of preparing and selling my house amazing. His attention to detail and knowledge of real estate resources landed me a quick and profitable sale. I would recommend Hudson to anyone looking for a change in residence.",
        "owner_response": {
          "text": "Tim,\n\nWe had such a great time working for you and are so thrilled that we could help generate the perfect cash offer to make you transition to Vegas as smooth as possible! Wishing you and your loved ones good health and happiness!"
        }
      },
      {
        "author": "Luke Lenentine",
        "rating": 5,
        "review": "Julian wants me to be happy with finding my true dream home. He spends the time it takes to help me understand permitting and zoning restrictions and he asks all the right questions for stuff I should be thinking about that hadn't even occurred to me. His knowledge of the real estate landscape surpasses anyone I've worked with in the past, to where Julian is asking questions about how I intend to build on the property, or combine my property with neighboring properties in the future, or to divide the property into parcels that maximize potential for my long-term plans. I feel safe purchasing land through Julian & Company because I know they care about my short-term and long-term dream life.",
        "owner_response": {
          "text": "Luke, I love chatting with you and helping navigate your rather unique and challenging questions. Thanks for working with me and please send my love to your lovely wife:)"
        }
      },
      {
        "author": "Amie Wise",
        "rating": 5,
        "review": "Julian and his team were AMAZING!!!  When I got to Seattle to start the process of dealing with my Grandfathers house it was a Saturday afternoon and I had not even spoken to a real estate agent.  My fianc made some phone calls and Julian made arrangements to meet us at the house the next day.   He was extremely professional and helpful and put my very very worried mind at ease that he was going to be there to walk me through the whole process step by step and navigate the muddy waters with me.  See the house was not in the best condition and we knew that is was going to be a tough sell.    After meeting another agent that day I was quick to go with Julian and his team.  Julian was quick to get to work and made everything as smooth a journey as possible even once I had left Seattle and gone back to Louisiana.  We had some bumps along the way and the sale was rough as we had expected BUT Julian hung in there with me and always gave it to me straight! I appreciate things not being sugar coated!  Needless to say if I was ever going to be dealing with real estate in Seattle again Julian would be my first call!! No questions asked!  Thank you for making the process of selling a house from thousands of mile away easy!!!",
        "owner_response": {
          "text": "Amie, it was such a privilege to represent you in selling your grandfathers home. I know that being out of state made things a bit more complicated and am so thrilled that I could be of value throughout the process. Wishing you good health and happiness in the years to come!"
        }
      },
      {
        "author": "Matt Geller",
        "rating": 5,
        "review": "Julian and his team were excellent real estate agents for my wife and I as first-time home buyers. They were patient, knowledgeable and always responsive to our questions and concerns. They exceeded our expectations and helped us find our dream home in Bellingham. Julian was very helpful in navigating the entire process and made sure our best interests were always at heart. He even helped us with things like accepting deliveries and checking in on the house after we closed.\n\nHe also helped us line up a loan, insurance, an inspection guy, and more. SOOOO helpful. I thought a realtors job was more basic, but man, I was totally wrong.\n\nWe closed at 16% below asking which was a big deal for us financially.\n\nWe would highly recommend Julian and his team to anyone looking to buy a home in the Bellingham area.",
        "owner_response": {
          "text": "Matt,\n\nWhat a fun and rewarding experience it was to work with you and your lovely family! I'm so grateful to have had the opportunity to support you with your first purchase and am even more excited to welcome you to our community and build a deeper friendship. I'm always a phone call away!"
        }
      },
      {
        "author": "Gary Peak",
        "rating": 5,
        "review": "Julian helped my wife and me with both sides of successful sell/buy transactions.  We both appreciated Julians extremely fast response rate, his professionalism, thorough knowledge of arcane nuances of the numerous steps involved in completing home sales and purchases, and superior integrity.  If Julian commits to do something, he honors his word.  It also doesnt hurt that hes quite pleasant.  We highly recommend Julian to anyone in need of a residential real estate agent.",
        "owner_response": {
          "text": "Gary, helping on your contingent purchase and the sale of your home was quite the marathon! Both you and Deb were so incredibly helpful and an absolute pleasure to serve! I'm thrilled to have assisted with this transition. I will always be here for you! Enjoy your gorgeous new home!"
        }
      },
      {
        "author": "Tannia Hecht ComuniCabo Cleft Palate Speech Therapy",
        "rating": 5,
        "review": "We hired Julian Freedman to help us list a condo in Bellingham this past month. He is  charming, fun,  as well as very professional.\n\nHe gave us great  advice  on  pricing through  his thorough research and\nknowledge of the local market. He  staged the Condo beautifully  and  and listed within a  week and sold it the next week. it was a great experience!\n\nWe were very happy with his assistance at all the  different stages of the sale. There was a legal glitch during the closing period which Julian solved by finding the paperwork needed in order to close on time. we highly recommend Julian for any real estate dealing you are considering.",
        "owner_response": {
          "text": "Where do I start?\n\nRepresenting you and your family on this transaction meant the world to me. As an established family with strong ties to the community, you know so many capable and qualified agents in Bellingham. The fact that you you chose me to list this very important property was one of the greatest honors of my career.\n\nThank you for your trust and incredible communication throughout the entire process. You helped make my efforts enjoyable and effective. I will always be here for you and your family as a friend and confidant! Wishing you good health and happiness into the future!"
        }
      },
      {
        "author": "Joe Micech",
        "rating": 5,
        "review": "Julian & Company were awesome and very  professional. Julian went to the property and did a video visit walk through for us because we could not be there. Above and beyond made the process of buying property easy and pain free. We are so grateful that Julian was referred to us. What a great, professional, efficient team! Joe & Danna Micech",
        "owner_response": {
          "text": "Joe,\nServing you and Danna was so much fun! The stars aligned! Searching for the right property and closing on it within 3 weeks of our first conversation! I am always here for you and look forward to celebrating on your big win soon!\n"
        }
      },
      {
        "author": "Heidi Giles",
        "rating": 5,
        "review": "Julian & Company were amazing to work with. We didn't necessarily represent an \"easy case.\" We lived across the country (Washington, DC), knew that we wanted to move to Washington State (in the North Sound area....we thought), and were reluctant to purchase anything we hadn't laid eyes on ourselves. Julian's team worked with us over two visits/vacations, showing us homes from Camano Island to just south of the Canadian border. In all, from initial visit to closing on our new home, Julian's team invested 13 months in working with us. They even guided us through a purchase outside of their \"normal territory\" - we ended up buying in Gig Harbor. And as icing on the cake, Julian provided us with tips to help sell our house in Washington, DC. Throughout, Julian and his team were professional, dedicated, and even fun to be with. They made the undeniably stressful process of house-hunting and purchasing a great deal easier and more pleasant than we could have imagined. We are very thankful to have worked with them - we highly recommend them.",
        "owner_response": {
          "text": "It was an honor to represent you and build such a strong connection with you and your lovely family! It brings me great joy to be a part of such a big moment Im your life! I know moving across the country was a huge decision. Every moment working with you was a pleasure and I wish you many years of love and laughter in your new home! Thanks for making the process so enjoyable ."
        }
      },
      {
        "author": "Amber Wagner",
        "rating": 5,
        "review": "Julian was extremely patient and helpful in finding our new dream home. His response time was exceptional and I was always able to reach him. When we were looking at homes, Julian was clear and direct on his assessment of each house. This helped my husband and I feel like the choice we made was sound.",
        "owner_response": {
          "text": "Amber, it was a blast supporting you and your family with this important move! Its always a nice surprise finding the perfect home on the first day of searching. Since we didnt get to spend much time looking at houses together, I hope you can come to our events and hang!! All the best! -Julian"
        }
      },
      {
        "author": "rice ontheroad",
        "rating": 5,
        "review": "Julian was great at listening to what we were looking for, excellent market knowledge, fantastic responsiveness, great strategy advice, and amazing support through our entire home purchase. We would definitely recommend Julian to anyone looking for a home in the amazing Bellingham area.",
        "owner_response": {
          "text": "Every step of the way you two were an absolute pleasure to work with! It was a true team effort! Thanks for taking my advice and working so diligently to get the job done! Im beyond grateful  Looking forward to celebrating with you at your new home! "
        }
      },
      {
        "author": "john m marshall",
        "rating": 5,
        "review": "Julian's professionalism and knowledge of Real Estate has exceeded all my expectations.\nI reached out to Julian not about purchasing property but with a question about Real Estate in general.\nJulian truly has the heart of a teacher, he took his time and answered all my questions and left the door open for me to return with more questions if anything else should come up.\nI would definitely recommend Julian & Company.",
        "owner_response": {
          "text": "John, it was such a pleasure spending some time, sharing my experience with you. This industry is all about collaboration and I am happy to continue to be a resource for you as you get established."
        }
      },
      {
        "author": "Emily Hazlip",
        "rating": 5,
        "review": "We truly could not be any happier with everything Peyton did for us. She went above and beyond to make sure we were getting exactly what we wanted. Being new to this area, she and Julian took the time to help us get acquainted with each neighborhood. Without their help, it would have taken us MUCH longer to figure out what we really wanted. Once we made our decision, the buying process was a breeze. We felt very well informed every step of the way; the buying process can be an extremely stressful experience, but, because of Peyton's help, it truly could not have been easier. We absolutely love our new home and feel so welcomed into this community. We are so happy that we chose the Muljat Group!",
        "owner_response": {
          "text": "Thank you for your kind words. We are so honored you chose us to help you find your perfect place in Bellingham. Please know that we are always here to help with finding connections for contractors, restaurants, outdoor fun, and more. We hope you will continue to stay connected with us on social media and that we can share a true Bellingham adventure together once COVID restrictions lift. In the mean time, please reach out any time with your questions about the community and we welcome you to this amazing place we are lucky enough to call home."
        }
      },
      {
        "author": "Becca Seim",
        "rating": 5,
        "review": "Julian walked us through the entire process of selling our home. Selling can be stressful in itself, but selling when you aren't 100% prepared for it due to life changes just adds to that. Julian helped us prioritize what was most important to get done before selling to yield the best investment for us. Listening to him paid off. We ended up closing over our asking price and actually for the most in our area for price per square foot. It was incredible and life changing for us. He was very understanding and patient with me during this stressful time and always made me feel like I could pick up the phone and call him with questions or concerns. He always made time. I will continue to work with Julian on our next adventure of finding a new home. I would recommend him to anyone if you're looking for a supportive agent.",
        "owner_response": {
          "text": "Becca, working with you and Toby was incredible! I am grateful for your trust through this transaction and Im so pleased that we were able to get a record breaking price on the sale of your lovely home!"
        }
      },
      {
        "author": "Steven Davis",
        "rating": 5,
        "review": "We moved to the Bellingham area in September. I had spoken with Julian throughout the summer while our home was on the market. Julian sent us information so that we could familiarize ourselves with the area. When we received an offer on our Tennessee home Julian even offered us assistance! Upon our arrival in Bellingham Julian had rental properties lined up for us. Once we began searching he was available whenever we needed him, lined up numerous properties and refined the search. We found a lot we wished to build on and Julian took it from there. Builder, Mortgage assistance....everything. The absolute best realtor experience we have ever had.",
        "owner_response": {
          "text": "Steven, I couldn't have dreamed up better clients than you and Nancy! It was an honor to help with finding you the perfect place and helping in your transition to Whatcom County. I am always available and look forward to celebrating with you soon!"
        }
      },
      {
        "author": "Joy Makdisi",
        "rating": 5,
        "review": "Working with Julian was a great experience--I cannot recommend him highly enough. He is personable, knowledgeable, and as native of Bellingham he is a fountain of knowledge about different neighborhoods, parks, local businesses, and anything you might want to know about the area. He took the time to get to know our priorities, and with every listing we looked at with him, he asked us detailed questions about or likes or dislikes, so he could tailor his future recommendations to fit our needs. He was never pushy, and let us take our time to feel out many homes and neighborhoods. He advocated for us in this tough market and gave us realistic expectations when making offers. He has great relationships with many local businesses and other agents which was also really helpful. We closed on our new home this week and without Julian's help, we would not have made it happen!",
        "owner_response": {
          "text": "Joy, it was such a great experience working with you two! I am trilled to be able to help land you one of the most competitive multiple offer situations ever! Thanks for your positive attitude and efforts as we went through the process of identifying the perfect home. I'm looking forward to visiting once you get settled!"
        }
      },
      {
        "author": "Alex Crooks",
        "rating": 5,
        "review": "We are new to Bellingham and Julian helped us to find and negotiate the purchase of our new home. It is a hot market right now and therefore speed was paramount. Julians responses were always very fast, thorough and efficient. His knowledge of the local market and including city regulations was superb. We never felt pushed or pressured either. Julian wants nothing more than to make sure his clients are happy in a home of their dreams.",
        "owner_response": {
          "text": "Thank you Alexandria Crooks for allowing me to be a part of your home buying process. I wish you many years of happiness in your new home. Please don't ever hesitate to reach out if you have questions about your home or the community, need a name for a local service provider, or are just looking for a suggestion for a nearby adventure/activity or a great place to go eat. I thank you again for taking me on your journey and look forward to connecting again soon!"
        }
      },
      {
        "author": "doug hooks",
        "rating": 5,
        "review": "Julian was referred to me through a good friend and he did not disappoint.  I had mixed feelings about selling my home and Julian and his team made the process so much simpler than I could have imagined.  The entire process, from 1st communication to closing was slightly over a month.\nTheir local knowledge and experience really paid off and I was very pleased with the outcomes of their negotiations.  Thanks!",
        "owner_response": {
          "text": "Doug, what an honor it was to assist in listing your home! You were amazing to work for and I am so pleased that we were able to sell your home for 25% above list price! Wishing you good health and happiness in the years to come and looking forward to staying in touch!"
        }
      },
      {
        "author": "Leif Jones",
        "rating": 5,
        "review": "Julian worked diligently to ensure the smoothest real estate transactions as a buyer and seller on 2 single family homes and 1 commercial property, I would highly recommend his services. I've interfaced with countless agents and he is by far the best real estate agent in bellingham!",
        "owner_response": {
          "text": "Leif,\n\nIt's been a pleasure helping you over the years! Fining your first investment property off market a few years ago was a huge win! Selling your beautiful estate on Chuckanut and then helping you buy in Edgemoor was also an honor! I've enjoyed all of our time together and deeply appreciate your friendship!"
        }
      },
      {
        "author": "Matt Goodwin",
        "rating": 5,
        "review": "Julian is exactly who you need in a crazy market like this one. He put together a competitive offer while taking into account what we were comfortable moving forward with. He walked us through each step, and stayed in constant contact every step of the way to make sure we knew what was happening, and if there was anything more we could do. He coached us on our offer and our cover letter, and in the end, got us the house! Great experience, would definitely recommend him to anyone looking to buy!",
        "owner_response": {
          "text": "Matt! We did it! First try nonetheless!! Your both were such a blessing to work with and Im so excited that you have escaped Seattle and found your dream county property! Come by the office for a beer something soon!"
        }
      },
      {
        "author": "Ashley Meadows",
        "rating": 5,
        "review": "Julian made a seemingly impossible process absolutely possible. When faced with 2-3 months to find a new home after a rental contract ended, I knew we needed someone we could trust with our future and such a monumental decision. Julian was the person for that. Full disclosure, I've known Julian for 10 years but that only strengthens my recommendation. He's one of the most trustworthy and ambitious individuals I have met and knows and loves the areas we want to live in. He was honest about the difficulties we could face in our budget in such a sparse market. Somehow, he seemed to find house after house and get us in to see them. He connected us with a bank that worked as quickly as we needed in a time crunch, and made all the connections so that we could focus on making the decision of which home we loved the most. He would have offers written the same day we looked at a place and that is paramount in a market where homes are gone in hours. He kept us on our toes and made sure we followed through with every little thing. I always felt like I had someone to turn to if I had questions.  I don't know if I would have been willing to make such a big decision on such a short timeline with any other agent. I highly recommend Julian to anyone.",
        "owner_response": {
          "text": "Ashley,  Thank you for your kind words and strong vote of confidence. It was a fun whirlwind to navigate together and I am so glad we got to your end goal. I look forward to connecting again and hearing how things are going. Please reach out any time, and thank you for trusting me with your home buying process."
        }
      },
      {
        "author": "Jordan Goff",
        "rating": 5,
        "review": "Julian's team was absolutely phenomenal to work with! Julian is such a wealth of knowledge, and coached us perfectly to lock down the first home we put an offer on. We also worked with Summer, who is an amazing individual and really took the time to get to know our situation and help us find exactly what we were looking for. Highly suggest this wonderful team for anyone looking into this area, and we will definitely be using them again (if we ever move from this house haha)",
        "owner_response": {
          "text": "Im so pumped that we were able to assist you in finding the perfect place! I know the process can be stressful and am beyond pleased that we were able to help make it smooth and enjoyable. Wishing you the world!!  "
        }
      },
      {
        "author": "J Hansen",
        "rating": 5,
        "review": "We had a great experience with Julian as our realtor.  We were looking for a retirement/vacation home and spouses were on 2 different pages about what we wanted.  Julian was patient, helpful and knowledgeable in showing us a variety of places until we found the perfect one.  We'd recommend him immediately and would use him again if and when we need.",
        "owner_response": {
          "text": "Jan, working with you and your husband was an honor! I had such a blast and really enjoyed your homemade cookies :). Thanks again for giving me the privilege of being your Realtor! Enjoy your new home on Lake Whatcom! -Julian"
        }
      },
      {
        "author": "Katie Beden",
        "rating": 5,
        "review": "Julians attention to detail and daily drive were invaluable assets to my first home buying experience. Within 10 days of deciding to buy after 16 years of renting, he showed me the full range of my options and after seeing many homes that would work, he secured a home beyond my wildest dreams for an amazing price in this market! I would highly recommend him for anyone looking to buy or sell. Thank Julian, I couldnt be happier a month into homeownership!!",
        "owner_response": {
          "text": "Katie, the entire process with you was incredible! The grace and resolve you showed when loosing on your first offer was inspiring! And guess what, you got a lake house instead! They say good things come to those that wait. It was definitely worth the wait!  "
        }
      },
      {
        "author": "Andy Meadows",
        "rating": 5,
        "review": "This was our first home buying experience and we couldn't have done it without Julian.\nWe found out less than three months ago that we would have to move with no plans on buying for a few more years.\nWithin that time Julian helped us find a good loan and a great home in an ultra-competitive market that isn't too friendly to the middle class. And we have time to spare!\nJulian was proactive and responsive through the entire process. The stress of buying a house is indescribable but with Julian's help, we got our keys today and still have some sanity left!\nThank you for everything!",
        "owner_response": {
          "text": "Andy,  I am so glad I was able to help you navigate the home buying process. It can be crazy without the right support, so I am glad I was there to take some of that off your plate. Thank you for your kind words and support. It means a lot when clients let me know they appreciate my services. I am always here if you need anything or just want to connect. Be well and enjoy your new home!"
        }
      },
      {
        "author": "Sarah Kafer",
        "rating": 5,
        "review": "Julian and his associates were amazing to work with! They made the whole process easy and were knowledgeable about Bellingham! Would recommend 100000%",
        "owner_response": {
          "text": "Sarah,\n\nYou and Matt were so much fun!! The house you landed is literally the best one we saw and not the most expensive! I'm beyond thrilled to have you both in town and look forward to our next encounter! "
        }
      },
      {
        "author": "Chris Horne",
        "rating": 5,
        "review": "We found Jerry on a whim after doing some\nGoogle searches for the best realtors in the Bellingham area. Our experience with Jerry was nothing short of fantastic, right from the get go he was knowledgeable, confident and was able to put in multiple offers in a short amount of time. Jerry has excellent communication skills and made the process easy and stress free. With how the market is these days you need a realtor that can represent you and put in competitive offers quickly, and Jerry is the guy for that! The whole team at Julian and Company is amazing and I cant thank them enough for all they did for us at the end to make our dream home possible! I can not recommend Jerry enough to be your next realtor!",
        "owner_response": {
          "text": "Chris it was my pleasure to work with you and your partner to find the family a place to call home up here in the PNW. Us both being from Texas gave us some common ground to start on and really helped us understand one another from the start. Working together was a great experience and we were able to land a property in a very competitive market! -Jerry"
        }
      },
      {
        "author": "Dr. Marci Hardy, PhD, MA",
        "rating": 5,
        "review": "Julian has a drive and dedication to his clients that is unparalleled. We appreciated all his support and energy as we worked together to sell our home. He got the job done and offered so much energy and support along the way to make it happen. We are now in the process of looking for a home to buy with Julian. We are grateful to Julian for always bringing energy and out of the box ideas to get the job at hand accomplished! He doesnt rest until the goal is achieved!",
        "owner_response": {
          "text": "Marci, I am so glad we were able to get your home sold and find a great property for you to buy as well. I appreciate you trusting me with both sides of your transaction and I have enjoyed getting to know your whole crew. I wish you all the happiness as you settle in at your new spot. Please, reach out any time if you ever have any questions or just want to connect. Be safe and well!"
        }
      },
      {
        "author": "Mark Christophersen",
        "rating": 5,
        "review": "Peyton is an incredible realtor; enthusiastic, friendly, and positive. We worked with Peyton for over eight months in a competitive market and she always went above and beyond helping us. She was flexible and available with scheduling tours and answering our many questions before closing. Her recommendations were excellent. We felt like she was really rooting for us and really caring about us. She and her team supported our home buying process diligently. We love our new home and are grateful to have enjoyed working with Peyton.",
        "owner_response": {
          "text": "What an honor it was working with you and Christine on the purchase of your first home! And the home you had your first child in!! Thank you so much for the kind words and your trust in me throughout the process. Wishing you and your family good health and happiness"
        }
      },
      {
        "author": "Carl Weiseth",
        "rating": 5,
        "review": "Julian made finding and purchasing a home in the Bellingham-area an been an absolute pleasure!\n\nAs first time home-buyers, this was a completely new experience for us -- and navigating the intricacies of searching for available properties, accurately assessing their value, evaluating if they were a good fit for our needs, generating and placing bids, securing financing, completing the mountains of paperwork... WHEW!  We were *really* glad to have him (and his office-team) in our corner!\n\nThrough Julian's professional network, he was able to find us several houses that hadn't even formally hit the market yet - which felt pretty remarkable, and allowed us the opportunity to place bids on locations that no other buyers yet had access to.\n\nAdditionally, well... We just genuinely ENJOYED spending time with Julian!  Given the amount of time and interaction required to push a first-time home purchase all the way through to completion, it was fun to connect with someone who'd grown up in the area, and was trying to coach us towards wise long-term decisions, rather than just the highest-priced options..\nIt became increasingly apparent over time that Julian was genuinely invested in our best interests, and even after closing the deal, he has reached out twice just to make sure we continue to be happy with our decision, and to offer his help integrating with the broader Bellingham community.",
        "owner_response": {
          "text": "Carl Weiseth, I am so glad you had a great experience and hope you are settling into your new neighborhood. It was an absolute pleasure working with you and thank you for your glowing recommendation. Please don't ever hesitate to reach out for suggestions for service providers, a great place to eat or enjoy the nightlife, or even a recommendation for a trail to explore or great photo spot. I always look forward to connecting with my clients and hearing how things are going.  I hope your new home exceeds your expectations and please reach out any time."
        }
      },
      {
        "author": "Blake Hudson",
        "rating": 5,
        "review": "What an absolute pleasure to work with them on our high end sale in Edgemoore. It was a challenging endeavor that he completely took the stress out of, very thankful. Julian is the best real estate agent in a Bellingham! And every family member I have referred has had a great experience and glowing reviews!",
        "owner_response": {
          "text": "Blake, \n\nit was an honor to help you and your lovely family sell and then buy! I'm glad we were able to get you such a great price for your Edgemoor home and help you land back on South Hill! I loved spending time playing with your son and showing you all of the amazing Southside homes! Wishing you all good health and happiness!"
        }
      },
      {
        "author": "Katrina Hilpert",
        "rating": 5,
        "review": "We decided to move more seriously into homebuying last year and started to look for a realtor. We wanted a realtor who brought a team to the table, so we looked at realtors that advertised as one. Our thought was that it takes a village to do MOST things well nowadays; buying/selling a home is no different. We also looked at client reviews to gauge a realtors depth. We chose Julian because of his experience, local knowledge, strategy, client connection/experience, and perspective. And, he did not disappoint! His team was wonderful to work with (Kailee & Jerry), many times proving our village theory. Julian also brought local contractors and knowledge to the table when there was a question/need; he was able to get immediate feedback for us in all scenarios. He was responsive to our needs, provided insight where we had doubt, and incredibly pleasant to be around. You can tell he loves all aspects of what he does, which is important from a client perspective; I want someone who is invested in my homebuying as it is a very personal and expensive decision. End story? We just closed on the first house we put an offer in for, amazingly smooth. We are so excited about our next chapter with our new home! Thanks Julian (and team)!!",
        "owner_response": {
          "text": "Katrina, I knew from our first meeting that you and AJ would be a pleasure to work with! It is always such an honor when a client finds us organically, while searching for the best real estate agent to fit their needs. Thanks for your trust and commitment throughout the entire process! Im looking forward to seeing you both at our next party!!"
        }
      },
      {
        "author": "Lauren Saunders-Klapp",
        "rating": 5,
        "review": "Julian is a realtor that does it all. Not only was he there every step of the way, answer every single question for us, but he went to bat for us and got us well over asking. He advised us on where to spend our money in updates and it absolutely paid off, he knows his stuff. He helped us find the right contractors and anything else we needed. Heck, he even staged our house! There are lots of realtors to choose from in Bellingham, but I truly believe youll get the best service, thats honest and personable with Julian.",
        "owner_response": {
          "text": "I am so thankful Lauren Saunders-Klapp for your entrusting me with the sale of your home. I am glad you felt supported along the way, as going above and beyond is a goal I have for with every transaction. Please reach out if you ever need anything, or even just want to connect. It was a pleasure to help you and I wish you much happiness ahead!"
        }
      },
      {
        "author": "Teo Crider",
        "rating": 5,
        "review": "I grew up in the Pacific Northwest, and have lived in Washington State for over 30 years. I arrived in Bellingham in the summer of 2010, thinking that it would be a short stop along a series of travels and new destinations, as I was an artist and a musician, often on tour. Instead, I fell in love with a city uniquely its own, making lifelong friends while exploring the surrounding wilderness and islands, and embracing the lifestyle Bellingham afforded me. I began putting down my roots.\n\nI started searching for a home in Bellingham about 6 years ago, which in a roundabout way led me to Julian Friedman of Julian & Company, who I reached out to after having heard glowing reviews around town. Seeing as I am not an investor, not a moneyed California transplant, and not the recipient of a trust fund or inheritance, I always figured buying my first home would be one of the most stressful and daunting things I'd ever do. Working with Julian & Company was the complete opposite: they made this process so streamlined, exciting, and enjoyable.\n\nIn my initial phone call, Julian and I discussed my house needs and house wants, which helped us set a budget, timeframe, and realistic expectations. Julian got to work immediately and was able to quickly narrow down the search to a handful of promising options. During this process, he was readily available to bounce questions and ideas back and forth, and patiently answered a myriad of questions about all things housing and financing. Within a month, we looked at three dream houses, and we made one offer on a beautiful craftsman in the Sunnyland neighborhood. Our first offer beat out dozens of other potential buyers, many of them offering tens of thousands of dollars above mine, and landed me in my first home. And the house appraised over what I got it for, and I still got to have an inspection in an increasingly competitive market while securing a historically low interest rate. I have no doubt all of this is because of Julian and his team's combination of intuition, experience, hard work, and care - and it happened so quickly and effortlessly, my only regret was that I didn't approach them sooner.\n\nAll of this is to say, thanks to Julian Friedman and his team, I now own my first home, and I am thankful for all the joys, large and small, that come with it: we've since made many amazing meals in the remodeled kitchen, played badminton in the backyard, enjoyed sunsets from the deck, and had game nights and movie marathons with friends. Last spring, I planted a garden with my dad, which provided fruits and vegetables all summer. I still see Julian around town, and he always checks in and asks me how I am and how my house is coming along. Last year, Julien delivered sugar cookies to my door, and this winter, he brought me a pie for the holidays. Julian & Company, thank you all so much, sincerely. I am grateful we crossed paths, and continue to do so.",
        "owner_response": {
          "text": "Teo,\n\nIm blown away by this glowing review! Your creative efforts in Bellingham have been something that I have admired for years and was honored that you chose me to help you on this major life decision. Every step of the journey with you was an absolute pleasure and it brings me such joy to help facilitate you getting such a great deal and the perfect home for you to make memories in.\n\nYou are so deserving of everything good that comes to you and Im proud to call you a friend and past client! Im always here for you!"
        }
      },
      {
        "author": "Paul T",
        "rating": 5,
        "review": "I have had the pleasure of getting to know Julian over the last year. He immediately impressed me with his ultra quick responsiveness and sincere desire to help. Julian always goes the extra mile to ensure he is providing elite-level of service for my family. I highly recommend Julian for your real estate needs and will continue to send referrals his way. Thank you Julian!",
        "owner_response": {
          "text": "Paul, serving your family has been an honor! I can't thank you enough for your trust as we find you your dream property!"
        }
      },
      {
        "author": "Ryan Davis",
        "rating": 5,
        "review": "Julian was excellent start to finish.  He was dedicated to finding my wife and I a property that would suite both our needs.  On top of that he was extremely communicative, positive, and helpful during the entire process. In the end we found a fantastic house that was perfect for the whole family.  Thanks Julian!",
        "owner_response": {
          "text": "Im so pleased that I was able to line you up with this incredible home! This was such a fantastic experience in so many ways! Im grateful to call you my friend and cant thank you enough for trusting in me to be your Realtor!!"
        }
      },
      {
        "author": "Eric Phaneuf",
        "rating": 5,
        "review": "I can't say enough good things about Julian and Peyton. Peyton is an awesome buyers agent, and really knows the market in Bellingham and what it takes to actually land the house you want. Both were super supportive throughout the entire process and are always available to answer any questions that may come up. They are also very well connected with the entire real estate industry in the area and can help introduce you to all of the other people you will need while going through a home purchase. They will definitely be my real estate team for any future needs as well!",
        "owner_response": {
          "text": "Eric & Kelly-Jo, thank you so much for the kind words and for being such a breeze to work with. It was such an honor to represent you two on your purchase, Bellingham is lucky to have you two added to our community! Wishing you and your loved ones health and happiness - Peyton"
        }
      },
      {
        "author": "Iris Fu",
        "rating": 5,
        "review": "Julian is the first agent we contacted when looking for a home in Bellingham and we purchased the first home he showed us (he listened to our needs) in less than two weeks. It was purchased under the listing price. He's busy but very responsive. You can count on him not only on finding you a home but also for home services, activities or down to the best sandwich place in town.  He's also very familiar with the surrounding areas, not only Bellingham. He's not only our buying agent  but also our selling agent now. Kailee, the Executive Assistant, has been very helpful to help us settle in.  We're thankful Julian found us our dream home and we moved in less than a month.  Highly recommend Julian & Company and his team!",
        "owner_response": {
          "text": "Iris, you and Aaron are such a warm and amazing couple. Im trilled to help welcome you to Bellingham! Im so pleased that we were able to find you the perfect home on the first day of searching! The first house we looked at, nonetheless. Im always here for you as your agent and friend! -Julian"
        }
      },
      {
        "author": "Jenny Schiffner",
        "rating": 5,
        "review": "Jerry got me exactly what I wanted in this super-competitive market!  He was quickly available to show me the many houses that I wanted to see and  took time to help me decide if I wanted to make an offer.\n\nJerry developed a great rapport with the seller's agent.  He skillfully negotiated my deal to get it accepted.  I believe it was Jerry's ability to form that relationship that made a difference.\n\nIf you want a thoughtful, knowledgeable agent who will give you his full attention to get what you want, I can't recommend him enough!",
        "owner_response": {
          "text": "Thanks Jenny! We might have toured 1/2 of Whatcom county but every tour brought us closer to the perfect home for you and your family. Also your easy-going personality and willingness to flex and adjust our strategy was what allowed us to be so ahead of the market and we landed the perfect home for an amazing deal at the time. We made a great team and our success proved that. Thanks for allowing me to share that experience with you and your family!"
        }
      },
      {
        "author": "Ryan Porterhawk",
        "rating": 5,
        "review": "We worked with Peyton, with a couple conversations with Julian himself as well. Peyton listened to our wants and needs for our family, tried to understand our priorities, and was knowledgeable every step of the way. Any time she didn't have an answer for us, she went to find it, and kept us informed of options without pushing us on any issue. Our sale was challenging, like any sale is. Peyton made that sale smoother, easier, and less stressful and she worked non-stop for us. I recommend working with her 100%!",
        "owner_response": {
          "text": "It's so much fun helping a close friend with the sale of their home and the purchase of their new home! It's such a joy to be a part of you and Tina's life and to have been a part of such a monumental moment in it. Thank you for your kind words and support over the years!"
        }
      },
      {
        "author": "Royce Cardwell",
        "rating": 5,
        "review": "Julian was a huge help in both buying my home and selling my old one. He knows what it takes to get you in your dream home. He is an aggressive advocate for what his clients want and worked his butt off to make sales happen. He even staged our 3bdr house all by himself at no extra cost. The dude goes the extra mile. 10/10 would recommend to a friend or stranger.",
        "owner_response": {
          "text": "Royce, Im so pumped that we were able to make all of this happen so quickly! You guys were amazing to work with and Im looking forward to coming by with dinner and meeting the baby soon!  Thanks again for working with us! -Julian"
        }
      },
      {
        "author": "Anthony Ponce De Leon",
        "rating": 5,
        "review": "I cant stress enough how important it is to work with an agent that comes with a true insiders perspective on the city. I have worked with agents in the past, but Julian has been the best real estate agent I could imagine. Talking to someone thats knows the community inside and out was incredibly helpful. Julian helped us find a home in the right part of town & for the right price. I couldn't be happier Im excited to recommend his services to anyone looking for a Bellingham Real estate agent.",
        "owner_response": {
          "text": "Anthony, I love helping artists like you reach their real estate goals! Its been such a pleasure getting to know you and I cant say enough about how incredible your work is! Wishing you good health and happiness in the years to come!"
        }
      },
      {
        "author": "Jess Hartzog",
        "rating": 5,
        "review": "Best home-buying experience EVER! Jerry checks all the obvious boxes, of course: super friendly, responsive, and knowledgeable. The real treat here is how Jerry was able to help us problem-solve on the fly - he consistently went above and beyond to make sure we ended up with the best possible outcome. We were lucky to have been connected with him, I wholeheartedly recommend him for real estate services at any level, and I'm happy to call him a new friend.",
        "owner_response": {
          "text": "Hi Jess! What an amazing experience. From day one we knew we'd get along with our backgrounds and technical understanding of processes. It was a pleasure working with you and Josh through this whole process. It was long and we got tested a number of times but we pushed forward unwaveringly and prevailed. I'm so happy to call you and the family friends now and can't wait to play with those pups!!"
        }
      },
      {
        "author": "Nikki Anderson",
        "rating": 5,
        "review": "This market is outrageous and daunting for first-time homebuyers.  Summer & Julian are the kind of people you want in markets like this:  local, knowledgeable, professional, honest & up-front, super responsive to last-minute requests, and incredibly shrewd when putting together an offer (we learned SO MUCH about that, in this process).  We started our house/land hunt in October, with broad interests in mind, and with low winter inventory available.  We lead Summer and Julian to some pretty interesting developed and undeveloped properties for many, many rainy winter months, in search of the right spot.  Summer was super quick to respond to texts and phone calls, and quickly set up showings at various properties, from Bellingham all the way down to Mount Vernon.  Her calm and cheerful demeanor, eagerness to understand what we were looking for, quick communication, and willingness to go the extra mile to get us information, made this an incredibly smooth and fun process.  When we finally decided to go for a more traditional house, she and Julian were there every step of the way, helping us to create a competitive offer and keeping the communication lines open between buyer, seller, and lender throughout.  They understand this game, they are a blast to work with, and we would love to work with them again.",
        "owner_response": {
          "text": "Thank you Nikki for trusting me with helping you find your dream home! It was fun for me too to get to see you and your partner refine your search as we went through the process, and I am so happy about the home you got. Such a gorgeous piece of property, patience paid off.\nLooking forward to coming to visit soon!"
        }
      },
      {
        "author": "Dylan Walsh",
        "rating": 5,
        "review": "Julian and his team are amazing!! They were so helpful through the whole process of selling my property. Really easy team to work with; knowledgeable and quick to respond to any questions. Great experience!",
        "owner_response": {
          "text": "Dylan, the pleasure was all mine! I'm thrilled that we were able to get such a great price on your property and wish you and yours good health and happiness in the years to come!\n-Julian"
        }
      },
      {
        "author": "Luke Holland",
        "rating": 5,
        "review": "Julian is a fantastic realtor. As a home inspector I have worked with him on a handful of inspections and I am always impressed by his professionalism and level of care for his clients. Hes never afraid of information I give because he is always looking out for the clients best interest and wants to ensure each home is the right fit for their needs and family. 5 stars all day!",
        "owner_response": {
          "text": "Luke, it has always been a breeze working with you! My clients have always been pleased with your service and friendly attitude!"
        }
      },
      {
        "author": "Mike",
        "rating": 5,
        "review": "Every now and then, someone steps into our lives without warning and enables great change!  Summer Huntington has proven to be that most recent person for my wife and me.  She came to us by referral, as we were initially trying to find a lot to have a site-built net-zero home built.  We found that such lots are difficult at best to find around Bellingham, but the owner of that construction company referred us to Summer.  The Real Estate business has a mix of companies, in terms of ethics, and we were lucky beyond measure to find Summer and her brokerage, Julian & Company!  My wife and I had a very clear vision of what we wanted for our next home, intended to be our last move.  Because of our age, we wanted a single story home, and in Whatcom County, that right away eliminates the vast majority of candidates.  We also told Summer that while we were in a 1-year lease, it would revert to month-to-month, so we asked her for patience, and patience seems to be a natural state for her!  After a number of viewings, she understood very well what we wanted, and her attitude of calm support was very much appreciated!  She assured us that our future home was out there and searching for us!  One day, it happened.  She referred us to a listing, and while there was to be an open house on the following Sunday, we reserved a private showing on that Saturday.  After we went through this house, my wife turned to Summer and said You have to get me this house!  We met with her and Julian and put together a unique offer, very advantageous to the seller, and our offer prevailed over (I believe) six others!  The fact that it was NOT the high offer illustrates how cleverly it was constructed, and while it was the first home for which we made an offer, we could not be happier with the result!  We love the home, and we appreciate how much contact we have had with Summer after the fact!  We recommend Summer Huntington and her broker, Julian & Company without qualification.  They are the BEST!!!",
        "owner_response": {
          "text": "Thank you for sharing your story, and I am over the moon about how well it worked out for you and your wife. Wow, your house literally had so many of your boxes checked and is such a beautiful home! I feel grateful to have gotten to know you both during that time, and look forward to staying in touch.\nThanks again  for making my job so enjoyable !"
        }
      },
      {
        "author": "Jabez Richard",
        "rating": 5,
        "review": "We were in a terrible situation with an uncooperative mortgage company, when Julian and his team patiently helped us navigate these difficult waters and brought us out on the other side with a sold house and enough money to make a nice down payment on the next. These kind folks display knowledgable professionalism and will persevere for as long as it takes to get your house sold. And they have tasty kombucha in the office, too!",
        "owner_response": {
          "text": "Jabez, its been a great honor to help you and your family through this challenging time. Thanks for giving me the opportunity to serve!"
        }
      },
      {
        "author": "Lee Huffman",
        "rating": 5,
        "review": "Julian was aware of my impending move from what was my current primary residence into a new property I had recently purchased. He reached out with clients that were potentially interested on a Monday morning. We exchanged notes & numbers, a walkthrough and subsequent inspection were scheduled, and we were under contract at my asking price by Friday evening.\n\nClosed as scheduled with zero surprises. Good, honest business with both sides of the transaction more than pleased.",
        "owner_response": {
          "text": "You were incredible to work with and I really appreciate all of your efforts in this transaction! I'm looking forward to working with you again in the future."
        }
      },
      {
        "author": "Amanda Kerzman",
        "rating": 5,
        "review": "My husband and I worked with Peyton to buy our first house, and had a wonderful experience. First, Peyton is kind, upbeat, and enjoyable to be around! She is extremely knowledgeable about real estate and the market, which we found so helpful as first time homebuyers. Peyton was happy to always promptly answer our questions, and patient to walk us through any confusing topics. On several occasions she went above and beyond to get more information or advocate for us. She is a go-getter and competitive, which is so necessary in this market! We are so glad we worked with Peyton to find our first home, and I highly recommend giving her a call if youre looking to sell or buy.",
        "owner_response": {
          "text": "Thanks so much for the kind words! You two go getters were awesome to work with and a pleasure to represent! It brings me so mych joy to watch you two settle into your beautiful home. Thank you for your trust, referrals and time! Cheers to you and Tom."
        }
      },
      {
        "author": "Nathan B",
        "rating": 5,
        "review": "To start things off this was my very first home buying experience.\n\nTo start things off from the very first conversation (which was a chance encounter) with Julian Friedman everything was all that I was looking for.\n\nI lived in approximately 2 hours each way from Julian's main operating area (and  where he lives). I thought that he would just be giving me a consult but without asking for any signed agreement more then willing made the long drive to come search for houses with me. He graciously and diligently  spent days beforehand on his own time finding very personalized listings to match my exact criteria.\n\nOnce the day came about for us to go house searching we had 3 promising options in mind (didn't even make it to the 3rd). Once I stepped through the front doors I knew this place is for me.\n\nThat day (which was a Saturday) Julian was able to get me pre approved (my original mortgage broker dropped the ball). His contacts are incredible, communicating every step of the way with constant updates and texts throughout the entire process\n\nJulian Friedman knows how to talk with the other team, keeping me updated on any negotiations so I am not waiting in panic, his contacts were unbelievable, setting me up with brokers and firms that had the same work ethic and pride that Julian has himself\n\nThis being my first home buying process, I can't imagine how it would have gone going with anyone else, he more then willing held my hand throughout the entire process with equal excitement for my joy of now being in my FIRST TIME PERFECT HOME\n\nThank you Julian Friedman, you were a life saver and will always be appreciated and definitely passed along to others.",
        "owner_response": {
          "text": "Nathan, working with you was an absolute pleasure! The journey of a first time home buyer can be challenging and stressful. Your excitement and steadiness through the entire process was amazing! I'm thrilled that we were able to identify, negotiate and execute on the perfect place for you! I am always available for anything you need moving forward. Thanks for trusting in me as your Realtor!"
        }
      },
      {
        "author": "Ken Johnsen",
        "rating": 5,
        "review": "We were totally happy with Julian and his firm, we moved from selling decision to closing in a month.  His communication and follow through were fantastic throughout the process, we highly recommend him!",
        "owner_response": {
          "text": "Thanks for trusting in me to deliver the best possible results for you two! $225k over asking price with no contingencies was exactly what I had hoped for. It was an honor to work for you and I am so pleased that I had your support to get the job of selling your beautiful south hill home done quickly and effectively! The entire process was a dream! Wishing you and your family good health and happiness "
        }
      },
      {
        "author": "Guy smith",
        "rating": 5,
        "review": "The best part I enjoyed with Julian and his team is that it appeared that they read me and catered their service to my needs.  they made me feel like I was their only customer",
        "owner_response": {
          "text": "Guy, \nI really enjoyed our time together and fell privileged to have the opportunity to serve you as your agent. We really got a lot done over the weekend that you were here from the east coast and glad we were able to identify the perfect place for you two to relocate to. We are always here for you!"
        }
      },
      {
        "author": "Kristin Henderson",
        "rating": 5,
        "review": "Im so thankful we lucked out with Julian as our realtor. If you are looking in Bellingham this is your guy! Not only did he get our offer accepted over other offers by working his realtor magic, he gave us a truly amazing home buying experience and welcome to Bellingham. His knowledge of the area and people really made the difference for us as we considered this move! I couldnt be happier with our new home and location",
        "owner_response": {
          "text": "Kristin Henderson, it was a true pleasure to connect with you and assist you with your home buying journey. I am always happy to answer any questions you have about the community and offer up my favorite trails to explore and places to grab a bite to eat. Welcome to Bellingham and I hope you create many amazing memories in your new home. I look forward to connecting again soon and hearing how you are settling in!"
        }
      },
      {
        "author": "Michael Warren",
        "rating": 5,
        "review": "Jerry was very supportive during extended negotiations for our property.  He also followed up when the seller was slow to complete promised work.  In addition, Jerry is a very positive guy, and a pleasure to work with.",
        "owner_response": {
          "text": "Thank you for the kind words Michael! It was such a pleasire getting to know you and your wife. I absolutely loved our adventures around Skagit and I am so grateful I got to to have y'all as clients and now call you friends. Thank you for being wonderful humans! \n- Jerry "
        }
      },
      {
        "author": "Kyle Sanderson",
        "rating": 5,
        "review": "Julian has always been a great connector. Makes sense he would create a team of excellent people! With his intimate knowledge of Bellingham and surrounding areas I endorse and highly recommend them for any of your real estate needs!",
        "owner_response": {
          "text": "Thanks for the kind words! Working with you has always been a pleasure!"
        }
      },
      {
        "author": "Nancy Brown",
        "rating": 5,
        "review": "When we first starting looking for a home in Washington we came across a nice young lady Named Peyton Voelker. We could not believe how much she bended over backwards to help us find the right home. well after a couple of months of looking we finally made a trip up to actually look at some properties and Peyton was always on the spot to help in any way possible. She even helped us get connected with a local mortgage company. we finally found our dream home and all thanks to the hard work and extra effort Peyton had  contributed. I would recommend her to assist with anybody in their search for their dream home.\nNancy and Harry Brown\nSanta Rosa Ca",
        "owner_response": {
          "text": "Nancy, I am so thrilled to have met you and Harry and to have been a part of such a monumental moment in your lives! I am so excited to have you both move up to bellingham next year. Wishing you and Harry health and happiness. I'll see you soon!"
        }
      },
      {
        "author": "Marianne Casasanta",
        "rating": 5,
        "review": "Jerry is an awesome person to work with.  He is one of those rare, down to earth people, that make it easy to connect to, yet professional, knowledgeable, and a great sense of humor to boot!!   My mom came out to visit me and fell in love with the PNW!!  She got connected with Jerry when she inquired about one of his listings.  He was always available and indeed the sense of reason and calm, making the purchase of my mom's dream home 'Bham-bay view' a reality!!  Thank you Jerry,  your the best!!",
        "owner_response": {
          "text": "Hey Marianne & Mom! What a fun experience to share with you two! From touring homes with driveways as steep as mountains to homes with yards WAY too big to take care of we really saw it all. Thank you for trusting me and having such a great attitude during the whole process! I appreciate you both so much."
        }
      },
      {
        "author": "Katy Moran",
        "rating": 5,
        "review": "Love the passionate team over at Julian and Co! This group is made up of individuals who have your best interest in mind and will work hard to provide you with the best experience and result possible. I feel Im in capable and trustworthy hands. Highly recommend!",
        "owner_response": {
          "text": "Thanks Katy! We absolutely love your photography and really appreciate the work you have done in our community! Wishing you all the best!"
        }
      },
      {
        "author": "Kelli Burhans, LMT",
        "rating": 5,
        "review": "We worked with Peyton Voelker, and she is a fantastic agent.  She was genuinely supportive of our goals and decisions while at the same time telling us what we needed to hear, not just what we wanted to hear.  She is smart, knowledgeable about Bellingham and the surrounding areas, direct and honest, enthusiastic about helping us, super kind, and great with our kids too!  We cant say enough about the quality of an agent that she is.",
        "owner_response": {
          "text": "Thank you for working with us on this move! We will always be here for you and are incredibly grateful for you!"
        }
      },
      {
        "author": "Jonny Kingman",
        "rating": 5,
        "review": "Julians extensive knowledge of the area, coupled with being very well-versed in the real estate and lending industry, made for a tremendously enriching experience. I look to Julian for guidance, insight and perspective on all things involving real estate and finance - highly recommend!",
        "owner_response": {
          "text": "Jonny, as a fellow professional, it gives me great joy knowing that someone of your caliber is confident in referring and utilizing our services. I am always available and happy to help in any way :)"
        }
      },
      {
        "author": "Connor low",
        "rating": 5,
        "review": "Great experience with Julian, very prompt and professional throughout the whole experience!  We were selling a home living on the other side of the country and Julian made it very smooth!  Would definitely recommend to anyone!!",
        "owner_response": {
          "text": "You both were dream clients! It was such a joy to help in listing your property. The communication and trust that we have is truly appreciated. Im always available and hope to see you when you make it back to the area!"
        }
      },
      {
        "author": "Jane Hyatt",
        "rating": 5,
        "review": "We had the best experience buying our home with Jerry at the helm. He was fun, pleasant and helpful, and since we were buying from out of state, he often helped us by stopping by the home and doing a video walk thru.  Thanks so much Jerry!",
        "owner_response": {
          "text": "Hey Jane! It was an adventure indeed! Thanks for always trusting me and allowing me to do the best I could for you and your husband! We went through the gauntlet and bested the process despite our needs and high expectations. We did it! Happy to help such cool people."
        }
      },
      {
        "author": "Asher Friedman",
        "rating": 5,
        "review": "Julian Friedman (my brother) is a natural born super communicator and community organizer which makes him a terrific choice for anyone looking for representation in selling property, investing in their dream home, building wealth through re-estate means or just simply some sound and heartfelt advice with any of the above. He has been an essential proponent in my life and growth as well as countless others.  My name is Asher Isaac Friedman and I endorse this message/man.",
        "owner_response": {
          "text": "I love you brother! Thanks for your kind words. You are an incredible person and I love watching you grow!"
        }
      },
      {
        "author": "Jeff Roper",
        "rating": 5,
        "review": "Man, can't say enough good things about this guy. Helped to guide me through the entire process of BOTH buying and selling a house, both of which went off flawlessly, even in this crazy market. He was professional and personal and was a joy to work with through a very exhausting and difficult process. He really helped to figure out exactly what I wanted and how to get it.\n\nHe went through huge lengths to impress me as a client, and to help stage and professional show the home we were selling and got it sold quickly and without any issues.  Can't reccommend him enough!",
        "owner_response": {
          "text": "Jeff, you were such a pleasure to serve!! Purchasing a home in this environment can be challenging. I am so pleased that we were able to get your offer accepted on one of the most competitive listings to date! 22 offers and they chose yours! What makes me even more excited is that you werent the highest bid! Im thrilled to have a new friend and look forward to seeing what you do with the space!"
        }
      },
      {
        "author": "Andrew Howard",
        "rating": 5,
        "review": "What a great inspiration! In a time when it is difficult to find a home, Jerry Spraggins pulled through. I was at first hesitant about trying to find a place of my own. Jerry helped me through every step, especially when it came to understanding the process. It was exciting to walk through every open house and seeing the potential of my future space. I wouldn't want to use anyone else in the future. Happy hunting!",
        "owner_response": {
          "text": "As my first transaction for a close personal friend this was such a rewarding experience. We toured so many homes and I even talked you out of a few that I didn't think would work for you long term. However, you trusted me that I would find the right one and we did. I'm so happy to see your growth over the last 1/2 decade and excited to see where you go. Thanks for trusting me and our team! -Jerry"
        }
      },
      {
        "author": "jhschmitty",
        "rating": 5,
        "review": "Julian has always been on my side like a brother showing my potential properties. He has always been very patient and knowledgeable about the local and national market and goes above and beyond his call of duty.",
        "owner_response": {
          "text": "You are such an incredible guy and have always been someone that I deeply respect. Thank you for trusting in me to be your Realtor!"
        }
      },
      {
        "author": "ian charboneau",
        "rating": 5,
        "review": "I was looking for the perfect house in Bellingham this spring and Julian was a tremendous help throughout the process. His level of courtesy and  attention to detail made the entire process much simpler and worry free.",
        "owner_response": {
          "text": "Thanks for sharing your experience!! Im honored to have been a part of your journey and will always be there as your friend and agent!"
        }
      },
      {
        "author": "Orion Lekos",
        "rating": 5,
        "review": "Julian and his team were great to work with every step of the way.  He helped me negotiate a deal that I didnt think was possible.",
        "owner_response": {
          "text": "Thanks for working with us! In this changing market, it's a pleasure to work out creative solutions to help make dreams come true! Thank you so much for choosing to work with us on your purchase. \n-Julian"
        }
      },
      {
        "author": "Megan Williams",
        "rating": 5,
        "review": "Julian was so efficient and gave us prompt service and negotiated our perfect house for under our budget! We couldnt have been more happy with our experience and home purchase!",
        "owner_response": {
          "text": "Meg, you and Brian and such incredible people. It was an honor to represent you and your family for such an important move! Should you ever need anything, please reach out. I look forward to being an advisor for all of you real estate related questions or needs. Enjoy your new home!"
        }
      },
      {
        "author": "Brayden Hubbard",
        "rating": 5,
        "review": "Julian was very professional and handled himself very well when he was selling my home and he sold my house for more than I anticipated so that was a plus as well.",
        "owner_response": {
          "text": "I had such a great time listing your home and wish you all the success in the world with your big move! It was really great getting to know you and hopefully you make it back to Whatcom County someday!"
        }
      },
      {
        "author": "Jeff Orso-Richmond",
        "rating": 5,
        "review": "Expedient, professional work, and they got me 35% over asking. 10/10 would use again! Thanks guys!!!",
        "owner_response": {
          "text": "Thanks for trusting in us with this sale!!  Its always my goal to beat our clients expectations and you are so deserving of good things . All the best!\n\n-Julian "
        }
      },
      {
        "author": "eashie angelstorm",
        "rating": 5,
        "review": "Jerry was amazing  and helpful, helping us find a place here, while we were in Colorado.   It all went very smoothly with no surprises.  Thank you again for an easy transition.",
        "owner_response": {
          "text": "It was such a fun experience searching for the purrfect condo that allowed your animals to join you. We had a few hurdles to overcome but we stayed the course and we made it happen! Thanks for making it a great experience."
        }
      },
      {
        "author": "Campbell Bryson",
        "rating": 5,
        "review": "Friendly, knowledgeable, professional. Julian and Peyton were a treat to work with. Highly recommend them to anyone!",
        "owner_response": {
          "text": "Thanks for trusting us to be your Realtors! We have really enjoyed our time together and look forward to seeing you next month at our quarterly party!"
        }
      },
      {
        "author": "Travis Unema",
        "rating": 5,
        "review": "Personable, easy to communicate with, knowledgeable with local contacts for lenders and managers. Quick responses to questions, emails texts and calls. Great service and honest!",
        "owner_response": {
          "text": "Thanks for choosing us to help you with this purchase! Looking forward to seeing you at our next client event!"
        }
      },
      {
        "author": "Steph D",
        "rating": 5,
        "review": "Jerry is great! Very professional, positive, and responsive. Would recommend him to anyone looking in the Bellingham area!!",
        "owner_response": {
          "text": "Thanks Steph! I appreciate the recommendation! Thanks for talking the time to share your feedback!"
        }
      },
      {
        "author": "Mattie Stewart",
        "rating": 5,
        "review": "The communication with the entire team was efficient, professional, and friendly. Jerry Spraggins is an amazing g human!",
        "owner_response": {
          "text": "Mattie! Meeting your entire family was the best part of our getting to know one another. You have an AMAZING family and everyone is so unique in their own ways. I had such a blast with you and we saw A TON of cool properties, secret rooms, insane kitchens, and some amazing yardscapes to boot! To say y'all were a blast is an understatement. Thank you so much for working with me and I can't wait to do it again!"
        }
      },
      {
        "author": "Robert Knode",
        "rating": 5,
        "review": "Great team to help you sell or buy!",
        "owner_response": {
          "text": "Thanks Rob!!"
        }
      }
    ]
  },
  "adjusted_review_count": 117,
  "adjusted_average_rating": 5.0,
  "distribution": {
    "1": 0,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 117
  },
  "summary": {
    "created_timestamp": 1739205507,
    "text": "<section id=\"good\"><h2>Good</h2><p>Julian & Company has garnered a stellar reputation for their unwavering commitment to excellence. Many user reviews highlight the team's ability to secure highly competitive deals in brisk markets. Clients have praised the personalized attention and effective communication, as exemplified by one reviewer who mentioned how Julian's team guided them seamlessly through a challenging mortgage process. The constant updates and assured handling of offers have left clients feeling supported and informed throughout their real estate journeys. Numerous clients felt that Julian's profound knowledge of the Bellingham area empowered them to make informed decisions, enhancing the overall buying and selling experience under his stewardship.</p><p>Julian & Company's team is widely recognized for their adaptability and resourcefulness. A noteworthy mention is of how the team went above the typical realtor duties to ensure clients' needs were met, such as handling unexpected project changes and offering logistical support for out-of-state buyers. This attentiveness and willingness to go the extra mile, described in several user reviews, instilled confidence in clients, helping them navigate complex transactions smoothly. Julian's team not only focuses on transactional success but also on creating lasting relationships, marking them as significantly reliable in the Bellingham real estate sector.</p></section><section id=\"great\"><h2>Great</h2><p>In this article, Julian & Company stands out as a remarkable entity in the realm of real estate, celebrated for their exemplary service delivery and exceptional business ethos. Clients consistently rave about how Julian and his team closed deals efficiently, often above listing prices, showcasing their adept negotiation skills. As reflected in user reviews, several clients mentioned how they achieved prices notably above expectations due to Julian's strategic approach, with particular emphasis on how homes were staged and marketed to perfection. Such outstanding results were frequent and included seamlessly handling of both buying and selling transactions.</p><p>Beyond their professional capabilities, Julian & Company are commended for cultivating a client-first approach that extends beyond standard real estate transactions. They have been described as highly personable, with Julian forming meaningful connections, making clients feel valued and heard, regardless of the circumstances. As demonstrated by reviews, their dedication to follow-up ensures clients transition into their new homes comfortably, with ongoing support for community integration. Julian's team consistently earns high praise for their enthusiastic attitudes and commitment to both client satisfaction and community involvement in the Bellingham region.</p></section><section id=\"bad\"><h2>Bad</h2><p>This article, upon reviewing available data, finds no explicit negative user reviews for Julian & Company. Every single review included in the dataset expresses high satisfaction, with nowhere below a perfect 5-star rating being reported. This suggests a strong pattern of consistent excellence in service and client interaction. Users have shown unwavering approval of Julian and his team, reflecting a deeply positive consensus. Despite diligent searching, no evidence suggests dissatisfaction or concerns about their real estate services from their client base. Such overwhelming positivity is rare and noteworthy in the sector.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>In keeping with the Good and Bad sections, this article reveals no ugly facets regarding Julian & Company. The firm holds a pristine record with zero reported grievances or alarming incidents in any user review. User reviews consistently repeat themes of gratitude and positive life changes facilitated by their real estate transactions. Without a single negative rating, as corroborated by the uniformly glowing feedback, no basis exists to categorize any aspect of Julian & Company's service as ugly. Their reputation stands unblemished, with each interaction seemingly fostering positive outcomes and strong relationships.</p></section>"
  }
}