{
  "name": "Kerf Apartments",
  "slug": "kerf-apartments",
  "company_type": "Property",
  "address": "208 N Samish Way, Bellingham, WA 98225",
  "review_count": 62,
  "average_rating": 4.85,
  "reviews": {
    "google_reviews": [
      {
        "author": "Brant Satala",
        "rating": 3,
        "review": "Nice building in a slightly sketchy part of town.  Kiara and John are great property management/maint. people, super friendly and helpful.  Anywhere you rent is going to have some sort of issue(s) at some point, and Kerf is no exception.  But those issues have been more in the common area on the first floor, and with the gate to the parking lot. I have to be honest, the gate has been broken for most of the months I've lived here (on and off), and there has been NO discount on the $75/month parking fee despite requesting some kind of break because of the sloth-paced repairs.  However, when you sign the lease, Blanton-Turner states they are not responsible for security.  So when the gate breaks, and a car gets broken into, your $75 is not paying for peace of mind of a security gate that works. Mgmt has told us we are responsible for security, and not to let people follow us through the parking gate. Huh?  In a sketchy neighborhood, that's messed up.\nIt's too bad because it could be so much better here with some easy system improvements and security repairs.\nSeems to be a good diversity of people, and also seems like a lot of students.  Personally, I think Kerf is a decent intermediate place to live for 6 months to a year.  I'd really love to give this place 5 stars because there are a couple super people who work here, and some super cool neighbors.  But I can't.\nBut with the current issues, I wouldn't want to stay for more than that though.",
        "owner_response": null
      },
      {
        "author": "Megan Beal",
        "rating": 5,
        "review": "Everyone here at Kerf have been amazing and wonderful. John who handles maintenance was super nice and very helpful! He answered all my questions and addressed my concerns. I appreciate him and his time! I have had nothing but positive things from being here so far!",
        "owner_response": null
      },
      {
        "author": "James Booth",
        "rating": 4,
        "review": "I'm a current tenant here and in several months I've had zero issues with my apartment. Appliances are great and all work without issue, staff are friendly, very professional, and easy to get ahold of when necessary. Perhaps it is my unit but there hasn't been much noise and this is a community of around 200 people. Considering the very poor quality of many other apartments, and the generally good upkeep of Kerf, I think you're going to have a hard time finding somewhere better. Also the area isn't too bad, is close to many bus lines, and I've generally felt safe in and outside the apartment. The rent is high but high is the going rate in Bellingham and considering that things are largely intact, function as they should, and are clean it's far from the worst bargain you're going to find.\n\nThe only real problem that has occurred is a broken parking gate which I think is currently being repaired. That is an issue that has more to do with levels of management far above the on site staff and it is unfair to fault them for it.",
        "owner_response": null
      },
      {
        "author": "Macala Rose",
        "rating": 5,
        "review": "Absolutely amazing building. Professionally managed, great location and over the top amenities. Highly recommended.",
        "owner_response": null
      },
      {
        "author": "Regina Reid",
        "rating": 5,
        "review": "Kerf Apartments brings an outdoor feel indoors, but you can also leave the outside rush and feel at home inside. The staff is extremely efficient, helpful, and friendly. The amenities are designed for me-time as well as community. And the modern features are a sustainable business model.",
        "owner_response": null
      },
      {
        "author": "Adam House",
        "rating": 5,
        "review": "I've lived in nine states, apartments in most of them, and this is the best building I've come across. The location is great and walkable. Just over a mile to downtown might be a little long for some people, but it's doable, and everything else you need (Walgreens, a few chain restaurants, a few local restaurants, a grocery store, a hardware store, a UPS store, and more) is within a half mile walking distance on Samish Way, which is a bit loud to walk on but not too bad, and it has nice wide sidewalks, bus stops going both directions, and good pedestrian crossings.\n\nAs for the building itself, the staff at Kerf is fantastic. Joshua, Caitlin and Kiara are all very friendly, courteous, and helpful. Management seems good and the online community & payments portal is good. Digital access works well. The only thing to note is that there is no guest parking, but Bellingham is small and when I have a guest, I've been fine with reimbursing a quick Uber or picking them up myself or whatever. Apartments are well built and the units are well soundproofed. Shared amenities are great too. The gym is stocked really well compared to many apartment gyms as well, and feels spacious because it has a second level. You can tell Blanton Turner (the management company) credibly cares about the wellbeing of their residents and about getting the details right.\n\nOverall this building is a gemmy favorite I've lived at in my adult life!and I am excited for it to be my home for years to come.",
        "owner_response": null
      },
      {
        "author": "Jay James",
        "rating": 5,
        "review": "I highly recommend The Kerf Apartments! I had a fantastic tour and was impressed by the excellent amenities at this apartment building. The manager, Joshua, was incredibly kind and always had a smile on his face. The proximity to downtown is definitely a major plus.",
        "owner_response": null
      },
      {
        "author": "Grace Leddige",
        "rating": 5,
        "review": "Im obsessed with this place! Everyones been so nice and welcoming. Management is the best and theyre always on top of everything/whatever is needed. The amenities are soooo fun! Ive saved money every month by not going out and just using the amenities here. The gym has everything you need, the golf simulation has more than just golf (the zombie dodge ball is personally my favorite with friends), the roof top bbq is gorgeous. Ive lived in a lot of apartment complexes, but this is by far the best one . I highly highly recommend this place to any/everyone.",
        "owner_response": null
      },
      {
        "author": "Le Derppz",
        "rating": 1,
        "review": "The Parking  garage gate has been broken for almost a month leaving it open to vandalism,  walls are thin, weed smell.  Bikes stolen from Bike rooms, car break ins. Management will not repair things.  Stay away at all costs.  There is a bribing process for the reviews, they will give you a beanie if you review it well.",
        "owner_response": null
      },
      {
        "author": "Sharlaine LaClair",
        "rating": 4,
        "review": "This place is so beautiful! It has all the amenities, and amazing place for remote work or studying,  plus it's pet friendly. The units are spacious and have high end finishes. Love it!\nThe only downside is parking. There is no visitor parking and if you want a parking space its one per tenant which you have to pay $75/month for. Managements hands are tied though with limited parking spaces. There are 5-6 free curbside public parking spots that fill up quickly, and other public parking and/or monthly parking areas are not within walking distance.",
        "owner_response": null
      },
      {
        "author": "John Mitchell (Juda)",
        "rating": 5,
        "review": "Incredibly unique space with beautiful PNW inspired touches throughout. Tons of space to stretch out with amenity spaces and large floor plans. The aesthetic speaks for itself. Caitlin has been amazing and hospitable. If youre exploring Bellingham as home, Id definitely check out this community.",
        "owner_response": null
      },
      {
        "author": "Bobbi Smith",
        "rating": 5,
        "review": "We love our new apartment. Friendly responsive management and maintenance team that are on site. The recreational areas and apartment grounds are stunning. This is also a very secure property that is close to amenities and walkable to downtown.",
        "owner_response": null
      },
      {
        "author": "Valerie McMillan",
        "rating": 5,
        "review": "I love my apartment! The amenities are great, and my view is wonderful.  Joshua is always so helpful whenever I need help with something.",
        "owner_response": null
      },
      {
        "author": "Happy Tails Happy Homes",
        "rating": 5,
        "review": "Kerf apartments is an amazing place for any pet and pet parent to live! They have absolutely no breed or size restriction. Kerf has a pet spa with self washing station and is very conveniently located to many dog friendly trails and parks.  As a non profit dog rescue we 100% support  Kerf and love what they do to support the pets in our community!",
        "owner_response": null
      },
      {
        "author": "Gary Vittoz",
        "rating": 5,
        "review": "Everything is great. The only problem I had was getting my WiFi functioning. Xfinity repairman came and quickly identified and fixed the issue with the modem/router in my apartment. I took him down to explain it to Josh as it may be an issue with numerous apartments. Security seems quite robust and the new facility is very nice.",
        "owner_response": null
      },
      {
        "author": "T. Christon-Stewart",
        "rating": 5,
        "review": "Beautiful property, with lush spaces and the most friendly hosts!! Looking forward to seeing all this place had to offer over the coming days. Perfect location to downtown fun. Can't miss and stop in!!",
        "owner_response": null
      },
      {
        "author": "Ashlyn",
        "rating": 5,
        "review": "Kiara has been exceptional to work with! I have been looking at places to rent that have all the amenities I desire and am moving out of state so dont have the luxury to view in person. She did a FaceTime with me and went above and beyond showing me every unit I had questions on (which were a few, sorry and thank you!!).\n\nI also was able to see all the common areas/amenities. While theres still some kinks to work out, shes made me feel confident they will deliver on what they promote. Everything is brand new and Im so excited to call this place home in a month with my two pups!  Im big on reviews, **especially** when looking at apartments/property mgmt companies and even more so when out of stateso I hope this helps someone else take the plunge bc trust that I will update this review to keep potential neighbors informed if anything becomes a major issue! Thank you ",
        "owner_response": null
      },
      {
        "author": "Anthony Vicari",
        "rating": 5,
        "review": "Love it so far...I'll let you know as time goes by.",
        "owner_response": null
      },
      {
        "author": "BasinAsian",
        "rating": 4,
        "review": "Very good place to live, rent is crazy everywhere so it's pretty fair for the price and very friendly neighbors!",
        "owner_response": null
      },
      {
        "author": "Baekhyun's Bacon",
        "rating": 5,
        "review": "Best comfortable living space ever! I love how inviting they are and Im never bored this is a nice space for creativity or just to chill and drink some coffee!",
        "owner_response": null
      },
      {
        "author": "d2pGoon",
        "rating": 5,
        "review": "So far so good living here! Awesome staff, everyone is really nice. Also love being so close to everything, great location!",
        "owner_response": null
      },
      {
        "author": "Kenny Reed",
        "rating": 5,
        "review": "Great vibes, quality building, super receptive staff Property manager Joshua is awesome. Great beanies too.",
        "owner_response": null
      },
      {
        "author": "Tyler Purvines",
        "rating": 5,
        "review": "Kerfs staff is full of amazing people that are incredibly responsive, helpful, and friendly. They made my relocation to Washington a delight.",
        "owner_response": null
      },
      {
        "author": "Keith Soltman",
        "rating": 5,
        "review": "The apartments are gorgeous! The willingness to throw a super awesome opening party also shows a company who cares.",
        "owner_response": null
      },
      {
        "author": "Ijad Njad",
        "rating": 5,
        "review": "Caitlin is great, and the Kerf units are beautiful.",
        "owner_response": null
      },
      {
        "author": "Denise Baclawski",
        "rating": 5,
        "review": "John responded quickly and did a nice job.",
        "owner_response": null
      },
      {
        "author": "Justin Lopez",
        "rating": 5,
        "review": "Pet friendly and super chill place to chill. No buzzkill :P",
        "owner_response": null
      },
      {
        "author": "pete mack",
        "rating": 5,
        "review": "Caitlin is awesome!! Beautiful designs.\nConvenient ovation.",
        "owner_response": null
      },
      {
        "author": "Janet Bauer",
        "rating": 5,
        "review": "Such a beautiful space and love all the wood details. Wish I lived in the area!",
        "owner_response": null
      },
      {
        "author": "HelloHappyDaze",
        "rating": 5,
        "review": "Beautiful property with friendly staff! Close to the college campus and shopping and food options",
        "owner_response": null
      },
      {
        "author": "Sarah Mendosa",
        "rating": 5,
        "review": "We love our apartment and the neighbors!",
        "owner_response": null
      },
      {
        "author": "Amy Doll",
        "rating": 5,
        "review": "Fun energy knowledgeable staff enjoyed the afternoon would recommend to friends.",
        "owner_response": null
      },
      {
        "author": "Monica Bell",
        "rating": 5,
        "review": "Very cool place, Caitlin was a fabulous tour guide",
        "owner_response": null
      },
      {
        "author": "* flippythewondercat *",
        "rating": 5,
        "review": "The lounge is amazing, so classy and comfy!",
        "owner_response": null
      },
      {
        "author": "Audrey Campbell",
        "rating": 5,
        "review": "everyone is so kind which is a rarity in the bellingham area. highly recommend!",
        "owner_response": null
      },
      {
        "author": "Tana Rode",
        "rating": 5,
        "review": "Great experience and a beautiful place to live!",
        "owner_response": null
      },
      {
        "author": "Soph Bell",
        "rating": 5,
        "review": "Very gorgeous building with very nice people :)",
        "owner_response": null
      },
      {
        "author": "Thain Struhsaker",
        "rating": 5,
        "review": "Everyone has been very helpful while moving in thank you.",
        "owner_response": null
      },
      {
        "author": "Benjamin Jofre",
        "rating": 5,
        "review": "Kim is so awesome. Ill be back for sure.",
        "owner_response": null
      },
      {
        "author": "Colton Chism",
        "rating": 5,
        "review": "Beautiful apartments and amazing staff!",
        "owner_response": null
      },
      {
        "author": "SPJFA Treasurer",
        "rating": 5,
        "review": "What an amazing building! Amenities are phenomenal!",
        "owner_response": null
      },
      {
        "author": "Alex Shorty",
        "rating": 5,
        "review": "Friendly staff and amazing apartments",
        "owner_response": null
      },
      {
        "author": "Glen Erickson",
        "rating": 5,
        "review": "Beautiful building great staff",
        "owner_response": null
      },
      {
        "author": "latasha fletcher",
        "rating": 5,
        "review": "Friendly staff amazing apartments",
        "owner_response": null
      },
      {
        "author": "Kennedy Wisbey",
        "rating": 5,
        "review": "Dog friendly and fun",
        "owner_response": null
      },
      {
        "author": "Hailey Bell",
        "rating": 5,
        "review": "Awesome!",
        "owner_response": null
      },
      {
        "author": "Ike B",
        "rating": 5,
        "review": "Incredible pizza",
        "owner_response": null
      },
      {
        "author": "Erin Sanchez",
        "rating": 5,
        "review": "Love the amenities",
        "owner_response": null
      },
      {
        "author": "Jesse Chasson",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "robert",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Abbas Ahh",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Eva Frolov",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Carmen D",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Tehya Richmond",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Ignacio Ibarra",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kira Bailey",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Miriam Hernandez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Veronica Mergen",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Henry White",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Robert Fisher",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Patty Hagar",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jake Coto",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 48,
  "adjusted_average_rating": 4.81,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 1,
    "4": 3,
    "5": 57
  },
  "summary": {
    "created_timestamp": 1739095068,
    "text": "<section id=\"good\"><h2>Good</h2><p>The sentiment surrounding Kerf Apartments is largely positive, with many users praising the friendly and responsive management staff. Several reviews highlight staff members like John and Joshua, who have been described as incredibly helpful and welcoming. Residents appreciate the building's quality, spacious layouts, and various amenities that contribute to a comfortable living experience.</p><pMoreover, the community aspect is often noted positively, as many users mention friendly neighbors and a good mix of residents, including students and professionals. The location is also a plus, being within walking distance to several amenities such as grocery stores and restaurants, which enhances the appeal of living at Kerf Apartments.</p></section><section id=\"great\"><h2>Great</h2><pUsers express high satisfaction with the overall management and upkeep of the property, noting that maintenance requests are attended to efficiently. Many reviews commend the apartment's modern features, spacious designs, and the variety of amenities available, including a gym and common areas for socializing. Residents seem to take advantage of the recreational facilities, which offer options like a rooftop BBQ and gaming areas that fit various lifestyles.</p><pThe property has received strong endorsements for its pet-friendliness, which is an attractive feature for many tenants. Residents appreciate the unique aesthetic of the apartments, designed with PNW-inspired touches, and the welcoming atmosphere nurtured by management. These factors strongly contribute to the positive reputation of Kerf Apartments.</p></section><section id=\"bad\"><h2>Bad</h2><pDespite the overwhelmingly positive feedback, some users have raised concerns about specific issues such as parking and maintenance. Several reviews point out that the parking garage gate has frequently been broken, leading to security concerns. Despite paying a monthly fee for parking, the lack of functionality regarding this feature has led to disappointment among some residents.</p><pAdditionally, limited visitor parking has been noted as a downside, which can cause inconvenience for renters who wish to host guests. While some residents feel that these issues are being handled, the dissatisfaction regarding the management's ability to address these concerns arises in various reviews, indicating a need for improvement in communication and responsiveness regarding maintenance issues.</p></section><section id=\"ugly\"><h2>Ugly</h2><pA few reviews express significant dissatisfaction with aspects of living at Kerf Apartments, emphasizing security concerns due to the recurring issues with the parking gate. One user vividly describes a host of problems including break-ins and vandalism resulting from inadequate security measures. This sentiment suggests a lack of trust in the management's ability to maintain safety in an area perceived as sketchy.</p><pThe complaints also extend to the management practices, with accusations of incentivizing positive reviews through gifts, which raises ethical questions about transparency and genuine feedback from residents. Although many tenants enjoy their living experience at Kerf, these negative aspects highlight serious concerns that could deter potential renters looking for a safe and secure living environment.</p></section>"
  }
}