{
  "name": "Kerf Apartments",
  "slug": "kerf-apartments",
  "company_type": "Property",
  "address": "208 N Samish Way, Bellingham, WA 98225",
  "review_count": 37,
  "average_rating": 5.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Happy Tails Happy Homes",
        "rating": 5.0,
        "review": "Kerf apartments is an amazing place for any pet and pet parent to live! They have absolutely no breed or size restriction. Kerf has a pet spa with self washing station and is very conveniently located to many dog friendly trails and parks.  As a non profit dog rescue we 100% support  Kerf and love what they do to support the pets in our community!",
        "ownerResponse": null
      },
      {
        "author": "T. Christon-Stewart",
        "rating": 5.0,
        "review": "Beautiful property, with lush spaces and the most friendly hosts!! Looking forward to seeing all this place had to offer over the coming days. Perfect location to downtown fun. Can't miss and stop in!!",
        "ownerResponse": null
      },
      {
        "author": "Sharlaine LaClair",
        "rating": 5.0,
        "review": "This place is so beautiful! It has all the amenities, and amazing place for remote work or studying,  plus it's pet friendly. The units are spacious and have high end finishes. Love it!",
        "ownerResponse": null
      },
      {
        "author": "Gary Vittoz",
        "rating": 5.0,
        "review": "Everything is great. The only problem I had was getting my WiFi functioning. Xfinity repairman came and quickly identified and fixed the issue with the modem/router in my apartment. I took him down to explain it to Josh as it may be an issue with numerous apartments. Security seems quite robust and the new facility is very nice.",
        "ownerResponse": null
      },
      {
        "author": "Felia Moresca",
        "rating": 5.0,
        "review": "I applied site unseen, and I love living here. The amenities are beautiful, within walking distance from restaurants, grocery stores, WWU, and I love that it's a very dog friendly environment for my little chihuahua to run around  ",
        "ownerResponse": null
      },
      {
        "author": "Ashlyn",
        "rating": 5.0,
        "review": "Kiara has been exceptional to work with! I have been looking at places to rent that have all the amenities I desire and am moving out of state so dont have the luxury to view in person. She did a FaceTime with me and went above and beyond showing me every unit I had questions on (which were a few, sorry and thank you!!).\n\nI also was able to see all the common areas/amenities. While theres still some kinks to work out, shes made me feel confident they will deliver on what they promote. Everything is brand new and Im so excited to call this place home in a month with my two pups!  Im big on reviews, **especially** when looking at apartments/property mgmt companies and even more so when out of stateso I hope this helps someone else take the plunge bc trust that I will update this review to keep potential neighbors informed if anything becomes a major issue! Thank you ",
        "ownerResponse": null
      },
      {
        "author": "d2pGoon",
        "rating": 5.0,
        "review": "So far so good living here! Awesome staff, everyone is really nice. Also love being so close to everything, great location!",
        "ownerResponse": null
      },
      {
        "author": "Baekhyun's Bacon",
        "rating": 5.0,
        "review": "Best comfortable living space ever! I love how inviting they are and Im never bored this is a nice space for creativity or just to chill and drink some coffee!",
        "ownerResponse": null
      },
      {
        "author": "Brant Satala",
        "rating": 5.0,
        "review": "Amazing place, very quiet so far.  Awesome commons area to sit and read it work on computer, or have coffee or tea.  I plan on taking advantage of that space.  Feels very PNW.",
        "ownerResponse": null
      },
      {
        "author": "Kenny Reed",
        "rating": 5.0,
        "review": "Great vibes, quality building, super receptive staff Property manager Joshua is awesome. Great beanies too.",
        "ownerResponse": null
      },
      {
        "author": "Keith Soltman",
        "rating": 5.0,
        "review": "The apartments are gorgeous! The willingness to throw a super awesome opening party also shows a company who cares.",
        "ownerResponse": null
      },
      {
        "author": "Le Derppz",
        "rating": 5.0,
        "review": "Amazing support and help moving ! A really great team that got me moved in and into apartment within 3 days .",
        "ownerResponse": null
      },
      {
        "author": "Mario Zanatta",
        "rating": 5.0,
        "review": "Great apartment  to live at, definitely enjoy the space. Would recommend.  ",
        "ownerResponse": null
      },
      {
        "author": "Janet Bauer",
        "rating": 5.0,
        "review": "Such a beautiful space and love all the wood details. Wish I lived in the area!",
        "ownerResponse": null
      },
      {
        "author": "HelloHappyDaze",
        "rating": 5.0,
        "review": "Beautiful property with friendly staff! Close to the college campus and shopping and food options",
        "ownerResponse": null
      },
      {
        "author": "Thain Struhsaker",
        "rating": 5.0,
        "review": "Everyone has been very helpful while moving in thank you.",
        "ownerResponse": null
      },
      {
        "author": "pete mack",
        "rating": 5.0,
        "review": "Caitlin is awesome!! Beautiful designs.\nConvenient ovation.",
        "ownerResponse": null
      },
      {
        "author": "Amy Doll",
        "rating": 5.0,
        "review": "Fun energy knowledgeable staff enjoyed the afternoon would recommend to friends.",
        "ownerResponse": null
      },
      {
        "author": "Monica Bell",
        "rating": 5.0,
        "review": "Very cool place, Caitlin was a fabulous tour guide",
        "ownerResponse": null
      },
      {
        "author": "Soph Bell",
        "rating": 5.0,
        "review": "Very gorgeous building with very nice people :)",
        "ownerResponse": null
      },
      {
        "author": "Audrey Campbell",
        "rating": 5.0,
        "review": "everyone is so kind which is a rarity in the bellingham area. highly recommend!",
        "ownerResponse": null
      },
      {
        "author": "* flippythewondercat *",
        "rating": 5.0,
        "review": "The lounge is amazing, so classy and comfy!",
        "ownerResponse": null
      },
      {
        "author": "Benjamin Jofre",
        "rating": 5.0,
        "review": "Kim is so awesome. Ill be back for sure.",
        "ownerResponse": null
      },
      {
        "author": "Colton Chism",
        "rating": 5.0,
        "review": "Beautiful apartments and amazing staff!",
        "ownerResponse": null
      },
      {
        "author": "SPJFA Treasurer",
        "rating": 5.0,
        "review": "What an amazing building! Amenities are phenomenal!",
        "ownerResponse": null
      },
      {
        "author": "Alex Shorty",
        "rating": 5.0,
        "review": "Friendly staff and amazing apartments",
        "ownerResponse": null
      },
      {
        "author": "Glen Erickson",
        "rating": 5.0,
        "review": "Beautiful building great staff",
        "ownerResponse": null
      },
      {
        "author": "latasha fletcher",
        "rating": 5.0,
        "review": "Friendly staff amazing apartments",
        "ownerResponse": null
      },
      {
        "author": "Kennedy Wisbey",
        "rating": 5.0,
        "review": "Dog friendly and fun",
        "ownerResponse": null
      },
      {
        "author": "Hailey Bell",
        "rating": 5.0,
        "review": "Awesome!",
        "ownerResponse": null
      },
      {
        "author": "Ike B",
        "rating": 5.0,
        "review": "Incredible pizza",
        "ownerResponse": null
      },
      {
        "author": "Erin Sanchez",
        "rating": 5.0,
        "review": "Love the amenities",
        "ownerResponse": null
      },
      {
        "author": "Veronica Mergen",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Henry White",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Robert Fisher",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "patricia hagar",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jake Coto",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 32,
  "adjusted_average_rating": 5.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>Residents of Kerf Apartments seem to appreciate the pet-friendly policy that imposes no breed or size restrictions, making it an excellent choice for pet owners. Furthermore, a dedicated pet spa with a self-washing station is highly valued among tenants, proving that Kerf Apartments caters to the needs of their four-legged residents as well. The proximity to multiple dog-friendly trails and parks has also been mentioned, demonstrating the apartment’s appeal to the pet community as noted in user reviews.</p><p>Attention to security is a commendable aspect of Kerf Apartments, with reviews noting robust measures in place to ensure resident safety. The newness of the facility was mentioned alongside a positive experience with prompt technical support, as one tenant recounted the swift resolution of a WiFi issue, which suggests that the complex is responsive to maintenance concerns related to its infrastructure.</p></section><section><h2>Great</h2><p>The Kerf Apartments have earned praise for their superb location that offers easy access to downtown activities and establishments, as well as their proximity to college campuses and shopping areas. Users have highlighted the luxury of being close to everything, thus making the location highly desirable. Additionally, the modern amenities available have been called out for enhancing the remote work and study experience for residents, indicating that Kerf Apartments serve the needs of a modern, connected community.</p><p>The design quality and aesthetics of Kerf Apartments have garnered positive comments in user reviews. Tenants describe the apartments as gorgeous, with high-end finishes and spacious layouts that contribute to a comfortable living experience. The presence of aesthetically pleasing common areas where they can read, work, or relax while enjoying a coffee has been singled out as a distinct benefit that adds value to their daily lives.</p></section><section><h2>Bad</h2><p>At the time of compiling this article, user reviews did not reflect significant recurring negative experiences with Kerf Apartments. However, a single tenant did experience an issue with the modem/router in their apartment, which was swiftly rectified. This isolated occurrence might suggest that, despite the overall high quality of the property, there can still be occasional technical pitfalls for new tenants to navigate. The absence of further negative feedback in user reviews suggests that tenants are generally satisfied with their living experience at Kerf Apartments.</p></section><section><h2>Ugly</h2><p>No ugly aspects of Kerf Apartments have been identified in the user reviews at the time this article was created. All reviews provided were overwhelmingly positive, with no harrowing stories or experiences that would merit an entry under this section. The consistent high ratings and absence of notable complaints highlight the property’s commitment to maintaining a positive reputation among its residents.</p></section>"
  }
}