{
  "name": "Lakeway Rentals",
  "slug": "lakeway-rentals",
  "company_type": "company",
  "address": "3547 Lakeway Dr Bellingham, WA 98229",
  "review_count": 151,
  "average_rating": 1.4,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Maya M.",
        "rating": 1,
        "review": "DO NOT RENT FROM LAKEWAY. Their rentals have mold, heating issues, plumbing issues, and pests. They will steal your deposit and charge you ridiculous amounts of money to live in their horrible rentals. 0/10, do not rent from these slumlords.",
        "ownerResponse": null
      },
      {
        "author": "Charles R.",
        "rating": 1,
        "review": "If I could rate ia zero I would.  Lakeway managed a property here in Bellingham that my daughter rented.  It was her first rental as she was attending college here.\n\nSheri, the receptionist, assured me as a father that she was in good hands.  Reality was quite the opposite.  I have heard of slum lords before, but never actually met one until now.\n\nsheri specifically was abusive and childish, yelling at the tenan for requesting repairs, then retaliating against them with rent increases, etc.\n\nupon moving in to the house that Lakeway managed, my daughter realized that there were many things that were not up to code that would allow the house to be rentable.  Her room did not have a source of heat, the floors were rotted, the house was infested with termites, the list goes on and on.\n\nmy daughter went to the city and had the house inspected, and it was woefully short of legal.  The city gave them 30 days to rectify it and a list of repairs that would take hundreds of thousands of dollars to remedy.\n\nthe repair persons we're often showing up without notification, and would be stoned o make inappropirate comments to the college girls who lived there.\n\n\nLakeway sold the house rather than repair it, and at no point in time have the tenants been communicated with or let out of their lease.  The only good thing that has come from this is as a parent I got to see my daughter stand up for her rights as a tenant, and I am proud of her,\n\nI would never recommend Lakeway for any reason.",
        "ownerResponse": null
      },
      {
        "author": "Kendall F.",
        "rating": 1,
        "review": "Lakeway realty is well known as Bellingham slum lords\nWas rented a home not up to code that was leaking water it had a serious mold issue that made me and my roommates very sick. We ended up finding a lawyer,  reporting the home to the city, and upon advice of the lawyer breaking contract and moving out . Now 3 years later lakeway has sent us to collections for things broken when we moved in but made note of on the initial inspection. we were promised multiple rent reductions because the place was trashed when we moved in but that never happened and by renters law the way they handled our whole situation we were due our deposits but that never happened either",
        "ownerResponse": null
      },
      {
        "author": "Harrison W.",
        "rating": 1,
        "review": "Are you considering renting from Lakeway?\n\nYou may be like I was before I signed a lease with them. I thought, \"I'm a responsible adult. People who complain about them are probably irresponsible college kids who aren't getting their deposit back for good reasons. As long as I am clean, respectful, pay my rent on time, and don't do any damage, I will be fine.\"\n\nSpoiler alert - I was a dumb dingus.\n\nAfter I move out they send me a bill telling me I owe them $XXX.XX for a water bill. This doesn't make sense to me so I talk to the water company and they confirm that my balance was totally paid, then Lakeway overpaid by $XXX.XX bringing it to a negative balance. I tried to talk to Lakeway about it because I assumed it was a mistake. This is when their cheery tone turned sour.\n\n\"We don't do disputes in person,\" they said.\n\n\"You have to email us about it,\" they said.\n\nSo I emailed the dispute multiple times and never heard back. A year passes.\n\nI get a call from a collection agency demanding I pay this money. LAKEWAY IS SO SHADY THAT THEIR OWN LOCAL COLLECTION AGENCY GAVE UP THE CASE AFTER I EXPLAINED THE FACTS. But Lakeway is so intent on stealing my money that they just sent it off to some other collection agency in another city. Now I can either submit to this act of extortion, or take a hit to my credit.\n\nEveryone at Lakeway is complicit. They're all slobbering at the trough, waiting desperately for their master to splash more shit water in their face. They want it so bad. They say, \"Daddy, more shit water please!\" Then Mr. Lakeway scams another honest, hardworking person with a real job out of their paycheck and returns to his piggies at the trough.\n\nNow that you are aware of their horrible practices, please have some respect for yourself and never, ever, EVER rent from these disgustingly unethical, slobbering scam artist garbage humans.\n\n#FriendsDon'tLetFriendsRentFromLakeway\n\nP.S. I could write 2 more pages of legit complaints about my time renting from them - this was just the worst of it.",
        "ownerResponse": null
      },
      {
        "author": "Hong C.",
        "rating": 1,
        "review": "They changed the listing details after I made contact with them. I waited 2 days for a video tour, then found out the very next morning it had already been rented. No Communication with me regarding anything. Poor service, if not bait and switch tactics at best.",
        "ownerResponse": null
      },
      {
        "author": "Jason A.",
        "rating": 1,
        "review": "Absolute nightmare to deal with. Plan on them keeping most or all of your deposit for \"Cleaning fees\" even if you leave it cleaner then when you moved in right after it was \"Cleaned\". Their places are pretty horrendous but it's up to you if you want to live in it. I did because it was coming pretty close to our last option near campus but I won't be renting from Lakeway again and I urge everyone to avoid them at all costs. Our bathroom sink became clogged about 6 months in and nothing was working to unclog it, the handyman couldn't even do it because we needed new pipes and said we needed a plumber, even after 20 phone calls throughout the rest of our stay they refused to hire a plumber to fix it so our bathroom sink was nearly unusable.",
        "ownerResponse": null
      },
      {
        "author": "Rebecca F.",
        "rating": 1,
        "review": "Absolutely terrible, please never rent from Lakeway realty. They were slow to contact maintenance, we got maintenances direct number to contact them on our own. The foundation of the house is splitting in half, the house holds so much moisture everything molds in closets and it was not cleaned when we moved in.",
        "ownerResponse": null
      },
      {
        "author": "Natalie M.",
        "rating": 1,
        "review": "Everyone in Bellingham knows-- Lakeway Realty is a bunch of bullshit. They take advantage of the housing market here and rent their shitty properties to young college kids who can't find a decent place. For example, when I moved into my Lakeway house a few months ago, two windows were straight up BROKEN and our oven had an exposed wire hanging inside it that blew the fuse on our whole kitchen when we tried to make a frozen pizza. \nHOWEVER! There are ways to make your experience with Lakeway easier if you are stuck with them:\n\n1. When something is broken, try and fix it yourself first. \n2. If you need a maintenance person's help, call Lakeway and ask for the maintenance person's phone number. DO NOT expect a maintenance report filed by Lakeway to help anytime soon (could be weeks or months until they give the report to the independent contractor they hire). This is mostly since the queen bitch, Cheri, keeps all the independent contractor numbers in her cell phone, and from what I've experienced no one else has the means to call them. \n3. Try to talk to someone other than Cheri. She is unreliable and obviously hates her job and all of you people.\n4. TAKE LOTS OF PICTURES before all your stuff is inside and EMAIL the pictures to Lakeway for reference. This will help when you move out and Lakeway tries to take your entire deposit and then some for repairs they probably won't even make (at least the deposit is only $250). \n5. Lastly, don't expect them to solve your problems. Don't expect much of anything at all. They are a horrible company, but you need to live in their houses so just try and bear with it.\n\nIn conclusion: Lakeway sucks, but they never come by so you both can live in peace if you just pretend like they don't exist. Go through the maintenance people personally and they will help get your stuff fixed faster that way.",
        "ownerResponse": null
      },
      {
        "author": "Janine M.",
        "rating": 1,
        "review": "STAY FAR AWAY FROM THEM ... TENANTS BEWARE!***\n \nMy name is Janine Manchel, and I am the mother of Hannah Manchel -- one of your tenants at 412 Lakeway Drive in Bellingham, WA.  We have faithfully been paying rent on time on our daughters room for just about 1 year now.  She moved in in September, 2016 and immediately discovered leaks and water intrusion in her room, the bathroom upstairs, the bathroom downstairs, the kitchen, among other areas in the home.  How you can justify just re-renting a house that is leaking beyond my understanding.   I'm confident that, according to the Landlord Tenant Act, you are required to offer a home that is habitable -- living in a home with water intrusion and the black mold it causes is far from being habitable.     I flew out to help her clean everything up, and advised all of them to keep after you to address this situation.  It's now June, 2017, and these students are STILL dealing with water intrusion, leaks, black mold and the health issues from being subjected to these conditions for over 9 months!   At one point, a handyman was sent to check it out, but never followed through on this issue.  As were the several other attempts to resolve this problem early on!    I'm attaching the information that was sent to me from the EPA as well ... as her landlord, certainly you are aware that you are required to offer your tenants a clean and healthy place to live and breath!  This home is far from the habitable place that one would expect.   Why you have to be reminded of this basic need constantly is disgusting!  \n \nI will address the water intrusion/leaks again below, but it has come to our attention that my daughter was walked in on in her private bedroom (usually padlocked when she isn't home) when Cheri was showing the place to future potential tenants the other day!  Months and months before their lease is even up!  As a parent in today's crazy world climate, surely you can understand how that would be completely and absolutely unacceptable!  I don't care what the circumstances are, or how many unreceived posts you posted, it is not acceptable to just walk into their private home and certainly into their private bedrooms.  These are young, vulnerable women, and I am stunned that this is how you do business!  To add further insult to injury, Cheri was rude and hung up on me when I called to confront her.  \n \nI have attached pictures I received of your \"attempt\" to email the 5 tenants to tell them of your intent to show.  Please note out of the 5 emails you sent, only 1 is correct.  Hannah NEVER received said email because it wasn't addressed to her correct name/email!  Cheri should have noticed that 4 bounced right back to her.  I have also received a picture of what I assume was posted on their door ... didn't it concern you that not one tenant emailed/called/texted you back to confirm?  \n \nI just had the displeasure of reading your (horrible) reviews on Google Reviews ... all 31 of them, and the theme is always the same!  I'm appalled you stay in business.  Taking advantage of young adults who are in college trying to get an education is not only deplorable, it disgusts me to my very core!  \n \nMoving on ... as I stated in my phone conversation with Cheri, if anyone EVER and I mean EVER enters my daughters private bedroom again without her EXPRESS WRITTEN OR VERBAL CONSENT, you will be hearing back from our family lawyer.  \n \nThe damage this unattended, yet frequently reported water intrusion/leaks has caused our child to have health issues relating to black mold, not to mention anxiety from worrying about these arising issues.  We are seeking reimbursement for deductibles paid out to health care providers for said issues.  \n \nFurther, because of said unattended leaks, I am, effective immediately, giving Hannah Manchel's notice of intent to vacate her room and return home so I can properly attend to the health issues caused by ignored water intrusion.   She will be out by July 1, 2017.  I am seeking hotel reimbursement for her from June 15th until June 30, 2017 as well.     June 1st payment was the last payment you will receive from us because of all these horrible issues you have forced my child to live with.  If there is a problem with this, I will need to know in writing by June 19, 2017.   Otherwise, on advice from our council, we are, effective immediately, putting in our request for early release from her contract with no consequences.  The last month's rent and the deposit we gave at the beginning of this nightmare is requested back as well ... I personally left that house in better shape than when they walked through the doors, and the contractor that helped us out the other day said there was black mold covering the entire home due to ignored water intrusion!  Again, this home is not a habitable occupancy for anyone to live in.  \n\n\nI am anxiously awaiting a reply back from someone other than Cheri by June, 19, 2017 before I take this issue to the next level.",
        "ownerResponse": null
      },
      {
        "author": "Rachel C.",
        "rating": 1,
        "review": "Terrible, terrible company.\n\nMy roommates and I lived in one of their apartments for a year. The dryer broke at one point, and it took them a month and a half to fix it. When we called, asking about the machine, they claimed that it wasn't their responsibility.\n\nThe people who work for Lakeway are consistently rude and arrogant, yet somehow completely incompetent.\n\nAfter we moved out, they contacted us twice on completely made up charges. First, they claimed that we had painted the 2nd floor of the apartment. No...it was just as ugly as when we moved in. They wanted our security deposit for that. And then they claimed that we had an \"unauthorized cat\" in our apartment. At no point did we have a cat. This company is the definition of a slumlord.\n\nRidiculous company. Don't rent from them.",
        "ownerResponse": null
      },
      {
        "author": "gena s.",
        "rating": 5,
        "review": "My two sons have been renting for a year.  First I want to say the property is in no way a place I would live  in, however I really feel like lakeway rentals gets a five star for their efforts.  Any issues the boys had were dealt with quickly and thoroughly.  The staff is ever ready to answer my questions and they are all very professional and kind.  They are making five star efforts to renew their reputation in the community.",
        "ownerResponse": null
      },
      {
        "author": "Stephenie K.",
        "rating": 1,
        "review": "There's probably 100 bad things I could say about lakeway reality. I lived in a large home with 5 other roommates and the house was built very cheap. Upon move in, while installing our internet we noticed a VERY bad flea infestation. So bad the carpet downstairs appeared to be moving. Fleas were jumping all over the hard wood floor, you wouldn't want to see the sticky traps we had to set. HUNDREDS of fleas. Quite interesting to experience this when Lakeway continued to tell us it was flea bombed several times. We had to buy flea bombs and even have an exterminator powder with harsh chemicals. It was almost a month before the flea problem subsided. The house seemed very nice with large spacious rooms and modern touches until you realize you can't even use the dishwasher properly. It would leak and leak on most washes. We had contacted lakeway to have a repair man check it out and they had said they sent someone who interesting enough never arrived. All of the appliances were faulty. The oven took forever to heat, the fridge would leak and the dryer would release moisture into the laundry room. Over all terrible. Not to mention the witch at the front desk was always incredibly rude to us. We were promised a smart TV with sign on to the lease and 3 of us had to call several times about the TV. Only to have an unexpected visit to the house from Cheri with the TV that was a brand none of us had seen and wasn't even Smart so we ended up not using it. We have all moved out and had just received our remainder of our damage deposit and feel we were unfairly returned what we paid. We were charged for smoke and carbon monoxide detectors that worked already, cleaning fees which are understandable and just a bunch of random nonsense which are all probably an excuse. You're all probably better off sleeping on the street before renting from lakeway reality.",
        "ownerResponse": null
      },
      {
        "author": "Stefanie M.",
        "rating": 1,
        "review": "I was honestly appalled by how horrible the customer service in this place is. I was asking simple questions about our lease and every question was answered with an impatient sigh and a roll of the eyes. when we went to pay our rent in $20s (which is what we do every month) the lady told us she could only take big bills. it was obvious that she just didnt want to have to count the $20s. we then brought it up to the other lady when we got back with bigger bills and she said, \"oh, we're changing our policy in september so we're not accepting smaller bills anymore\" \nITS STILL AUGUST. they're lazy and just down right rude. I cant wait til my lease is up and I'll never rent from these people again.",
        "ownerResponse": null
      },
      {
        "author": "Prince M.",
        "rating": 1,
        "review": "If I could rate this company negative stars I would. Horrible customer service, no communication whatsoever, overpriced rent, bad maintenance men (one of them literally said he'd bash my dogs head in for barking at him, called Animal Control on us, and called me and my roommate a b*tch). When we moved in, our house was disgusting and clearly had not been cleaned whatsoever. We put in 20+ maintenance requests the first day we moved in, and we didn't have anyone come to our house to fix anything until 6 months later. When they did come, they did a messy job, didn't fix 90% of the issues we had, and left our bathroom a complete disaster which WE had to clean up after they left. When we moved in, they gave us like 10 keys and only 1 of them worked....? I have no idea how on earth Lakeway is still open, they're a bunch of slumlords who take advantage of you and have no idea what they're doing.",
        "ownerResponse": null
      },
      {
        "author": "Lereana M.",
        "rating": 1,
        "review": "They don't even deserve one star. DO NOT RENT FROM THIS COMPANY. EVER. NO MATTER WHAT. They did nothing to respond to our service requests and complaints/concerns during the lease. Not only that, they charged me and my roommates OBSCENE AMOUNTS for things we were not even responsible for. Our security deposit was $1000 between the 4 of us. Now they are saying we OWE an ADDITIONAL $1213.75. THIS COMPANY MAKES ME SICK. AVOID AT ALL COSTS.",
        "ownerResponse": null
      },
      {
        "author": "Pam G.",
        "rating": 1,
        "review": "Don't do it! We chose Jon Hansen as our realtor came out once to the house for his sales pitch. I'll put you in my real estate magazines I advertise with and on my website I pay big money to be on front and back of magazines and Zillow. Never went thru with anything he talked about. I had to do all the leg work to sell our house. You can't get ahold of him doesn't return calls if it wasn't for his Girls he would be out of business. Sign went up never had any papers in it ever...never a pending or sold sign. Not even a thank you when it closed haven't heard from him since day one. Take our advice and don't do it.\nPam Aarons",
        "ownerResponse": null
      },
      {
        "author": "Maggie R.",
        "rating": 1,
        "review": "The absolute worst rental agency I have ever dealt with....\n\nLast year my boyfriend rented a typical college house over on J street and it was a total mess. As a group of college guys, they were okay with the condition of the house when they moved in but definitely did not anticipate losing the entire deposit. Being as the house was in such a state of disrepair when they moved in and that an agent was present to conduct the move-in checklist, the boys were fairly confident that they had covered all their bases in order to get their deposit back at the end of the lease. \n\nUnfortunately for my boyfriend and his roommates, Lakeway made numerous false statements on their move-out ledger - claiming to have removed truck loads of garbage that were left at the house which was absolutely untrue. My boyfriend and I spend 2 entire days cleaning that house and left it exactly as it was received (if not better). Lakeway also made the boys pay for replacing furnace filters and installing a carbon monoxide detector which was not a part of their lease agreement.\n\nIn addition, the house was vandalized (with spray paint) during their lease. My boyfriend filed a police report and expected Lakeway to pay for the repairs with their own insurance policy. Unfortunately, they charged him for the cleanup regardless of the police report.\n\nAfter 6+ months of threatening legal action and endless unanswered correspondence, we have given up on getting the boys' deposit back. Lakeway and its management is a group of morally corrupt slumlords and I implore you not to rent from them. You will endure uninhabitable living conditions and you'll be extremely lucky to get your deposit back. They have almost nonexistent customer service and will do everything in their power to deny you your deposit. STAY AWAY!!!!!!!",
        "ownerResponse": null
      },
      {
        "author": "Patricia D.",
        "rating": 1,
        "review": "I am now ready to sell my home and I WON'T be calling Lakeway Reality! When I ask them to sell for me two years ago. John Hansen was not putting any effort into it after it was on the market for a month and wouldn't sell it's self!",
        "ownerResponse": null
      },
      {
        "author": "Green H.",
        "rating": 1,
        "review": "Would not use these guys. Realtor's already make unreal commissions for the ridiculous work they do, but these guys take it one step further. Posing in the paper with your Ralph Lauren Polo shirt in front of your boat? Your big Mercedes-Benz, driving your jet skis in our drinking water? I think not, as should everyone else.",
        "ownerResponse": null
      },
      {
        "author": "Erin R.",
        "rating": 1,
        "review": "Avoid renting from these people. Unresponsive, unethical and disorganized. Homes are poorly managed, filthy and even dangerous. Dave Hansen is owner of this company and of Lakeway Realty. He also owns a lot of these properties. If he does his realty business like he does his property management business you're in for a bad experience. As a landlord myself, it's frankly appalling what these people try to get away with.",
        "ownerResponse": null
      },
      {
        "author": "Hannah Z.",
        "rating": 1,
        "review": "By far THE WORST REALITY PLACE EVER!  I took over somebody's lease over and the apartment was shitty, small & disgusting. But I made due because it was the only place I had to go to. I lived here for 8 months and I made the best of it. They didnt clean the apartment out after the tenant before me moved out. It was moldy and gross. There were cabinets broken and never fixed. Carpet was disgusting. I went THREE MONTHS without an oven!!!! They lazied around and wouldn't send me. New one, finally the bitch receptionist go tired or me calling so she sent over a old used gross oven. Shitty deal & I've been waiting three months to get my deposit back and am still waiting! Don't rent from them!",
        "ownerResponse": null
      },
      {
        "author": "Natalie K.",
        "rating": 1,
        "review": "AWFUL company, management and employees. These people are scam artists using first time renters to their advantage. We were not given our deposit back, after our house WAS damaged due to a house fire that was caused by FAULTY wiring that was not up to code (this was not the first house fire at a Lakeway rental for the SAME REASON). We were displaced without anywhere to live because the house was condemned. They offered absolutely zero help to three students who had no idea what they were supposed to do in an situation like this. We tried for months and months after the fire to get our money back, but every time we went in to the office Dave Hansen who apparently is the only person in the whole office that can sign off on a check, was conveniently out of town, sick, at a funeral, I swear every excuse in the book. Right before we left to go home for the summer we thought we should give it one more shot. We signed and intent to vacate form that they demanded we signed even though we DID NOT INTEND TO VACATE and we returned the keys. Sheri, the secretary took the paper work and told us that Dave Hansen would have to think about it. EXCUSE ME THINK ABOUT WHAT?! OUR HOUSE BURNT DOWN.. yeah it was damaged!!!!! The house caught on fire because of Dave Hansen's cheapskate ways by not keeping the 100 year old house up to code. We could have died or been seriously injured due to his negligence. We were fortunate enough to be graced with the presence of Dave Hansen himself that day and he told us that we were not getting the deposit back because he thought WE caused the fire and because he was offended  because I told him that this wasn't the first fire that had happened through Lakeway. (boo-hoo sorry not sorry #FACTS) Then proceeded to tell us that the only way we would be getting our money back is if we took them to court. Honestly felt like a horror movie, all three of those lovely individuals were cornering us in the office  .. these people are crazy and honest to god criminals. \n\nFor your own sanity do not rent from LAKEWAY REALTY.\n\nDO\nNOT!\n\nP.S. Sheri, if you read this learn how to do your job.. it really can't be that hard. There's the door.. there's the door.",
        "ownerResponse": null
      },
      {
        "author": "Nicole L.",
        "rating": 1,
        "review": "If I could give them 0 stars I would. They are the worst.  Their book keeping skills are non existent. They took a month + to fix anything, and I'm talking essentials like a washer, dryer, and dishwasher. And they tried telling the new realty place I'm going through now that I had only lived at the place I had through them for 6 months when it was 18 and also tried to say I was always late on rent. Luckily I keep all receipts and was able to prove that wrong and the new realty place already knew how bad Lakeway is. I will never recommend them to anyone. They shouldn't even be in business.",
        "ownerResponse": null
      },
      {
        "author": "Bruce R.",
        "rating": 1,
        "review": "Agent was supposed to show our house this afternoon.  He never showed up, never called, no nothing.  What a bush league operation!!!!  Will never even consider showing our property to anyone connect with this group!!",
        "ownerResponse": null
      },
      {
        "author": "Taylor R.",
        "rating": 1,
        "review": "DO NOT EVER RENT FROM LAKEWAY REALTY.\n\nLakeway preys on young college students who have never rented before. My advice to the new renter in Bellingham: first of all, DO NOT rent from Lakeway, and secondly, DO NOT settle for a house you don't want early on the year. Houses for rent frequently pop up all around Bellingham from March through August (if you're looking for a July/August/September Lease).\n\nAs for my story: My roommates and I had formerly rented a duplex from Lakeway. Lakeway time after time failed to come to fix the mold growing at our house (we literally called them the first day that we moved in), and when they finally did come, they just had someone PAINT OVER IT. Finally, we got fed up with Lakeway - after the ceiling collapsed in one of the bedrooms (a room which, Dave Hansen, the owner of the realty company, assured as was safe and fixed. The ceiling had collapsed the previous year as well). We terminated our lease.\n\nWe spoke to the tenants in the other half of the duplex we lived in, and they experienced similar, but even more severe problems that Lakeway, again, failed to fix. Along with mold, they experienced a strange stench coming from their house, which Lakeway did not investigate for some time. As it turned out, they dead rats in their walls. The decomposing animals made one of the tenants so sick she was forced to drop a class at Western. This eventually led to them threatening to take legal action, to which Lakeway FINALLY complied.\n\nIf you want more than just anecdotal evidence of Lakeway failing to fix things for their tenants and their overall disregard of safety: http://westernfrontonl...\n\nIf you didn't read the article: their house had faulty electrical wiring (which I wouldn't be surprised if Lakeway knew about and simply didn't fix), and Lakeway failed to fix their smoke detectors. Their house burned to the ground.\n\nI will say that the receptionists at the office are nice. I feel sorry that they have to work for such an awful company. \n\nAgain: do not ever rent from Lakeway! Don't settle for one of their awful houses early in the year if you can't find anything! Houses and apartments will spring up on Craig's List all year!",
        "ownerResponse": null
      },
      {
        "author": "Lisa D.",
        "rating": 1,
        "review": "Do not rent from these people.  They have not returned my daughter's security deposit for weeks now and she gave up calling them.  I've taken over and the check has been \"in the mail\" for 2 weeks even though it should take one day to get here.  They don't seem to think it's important.  They have one young woman who answers the phone who doesn't know anything.  There is never anyone else to talk to.  So I repeat, do not rent from this company.  And spread the word.",
        "ownerResponse": null
      },
      {
        "author": "jeff s.",
        "rating": 1,
        "review": "more of the same...stay away..poor follow up,disorganized ,poor customer service  \nas homeowner they represented we with very poor results.. when all was said and I had the pleasure of an $8,00 0 loss as two tenants absconded  w/o paying rent.   \n.",
        "ownerResponse": null
      },
      {
        "author": "Shelby J.",
        "rating": 1,
        "review": "Absolutely the worst realty company I've ever dealt with, or even heard of. It takes weeks for them to even get back to me about repairs, and on top of that, they are closed saturdays and sundays with NO ANSWERING MACHINE and NO EMERGENCY CONTACT NUMBER. We had a pipe break Friday night and couldn't even get in touch with anyone to let them know until late Monday, when even then they took two days to send a plumber. That's five days with no water. Absolutely insane. Never rent from this company.",
        "ownerResponse": null
      },
      {
        "author": "Johnny C.",
        "rating": 1,
        "review": "The worst experience I have ever had with a property company. Approved all four of our applications, cashed our holding deposit check ($1250), told us we had our house; two months later they call and tell me they \"forgot\" that we had applied and signed the lease with another party. They still have my money and are now claiming we never paid our application fee. We are stuck high and dry for the fall and, unsurprisingly, very upset. These people are scam artists, liars, and crooks. Do not ever deal with these people. This may end up in court...",
        "ownerResponse": null
      },
      {
        "author": "Jared E.",
        "rating": 1,
        "review": "This is the worst realty company in Bellingham, hands down. The employees and manager treat you like a child, the houses they rent to people are falling apart at the seams, and when you have to fix one of these problems it takes a month or two for them to finally send out a repair man. They then try to charge you for things you never agreed to on the lease. Stay away from lakeway realty, period.",
        "ownerResponse": null
      },
      {
        "author": "Deron N.",
        "rating": 1,
        "review": "Man I had an unexpected, dreadful experience with Lakeway Realty. I own a local business and we needed a new place to live since the company is growing and we needed more room. I told them that I have a Doberman and a small dog (less than 10 lbs) during our first encounter (July 10th) and that if that presented a problem then I would move on to another house that I was vetting at the same time as a backup. They told me \"No, that shouldn't be a problem.\" They asked for a deposit check ($1800 including a $600 pet fee) during the aforementioned meeting, cashed it a day later(which was quite unexpected as we had not received a rental agreement or any of the required materials under Washington law), then waited 3 business days to \"process\" our application. They called us around 5pm on July 15th (after two business days of inquiry on our part for a decision) to inform us that our application had been rejected. When my business partner asked why, she said that the owner of the house had denied our application because of my Doberman. My business partner called back to inquire how long until our funds would be returned. She responded with \"It will take 7-10 business days while the funds clear the banks at which point we can mail you a check or you can come pick it up.\" The funds had left our account on Friday, July 11th. He called a third time to ask why they went forward with our application knowing the owner did not like Dobermans and knowing that we had one before the process started. After she put my business partner on hold for about 5 minutes she proceeded to change her story. She said it was not the owner who rejected our application but the rules established by Sudden Valley and that \"his hands were tied.\" She said Sudden Valley rules prohibit Dobermans specifically. This is simply not true. A simple Google search revealed that. I honestly believe they had no intention of renting this property to us. They simply wanted to earn interest on $1800 as long as they could and collect $50 in \"application fees.\" It wasted over a week of our house hunting time and our backup has since been rented. We will be pursuing legal action, if possible, to ensure that this nefarious company cannot take advantage of anyone else.\n\n\nhttp://apps.leg.wa.gov/rcw/default.aspx?cite=59.18.260",
        "ownerResponse": null
      },
      {
        "author": "annabelle l.",
        "rating": 1,
        "review": "Honestly, I am never one to write a review but I feel so strongly about Lakeway Realty that I felt obligated to do so. If you can avoid Lakeway I would highly recommend it. We have an awesome house near sehome haggens but the reason we are moving out is that we are tired of dealing with Lakeway. In the winter our roof started leaking and they sent out a plumber that ripped up the ceiling inside the house, who confirmed it was the roof, not only does it take them months to fix any problem they are rude everytime you call to ask if they could get anybody out to fix it. We had that hole in our ceiling for two months! Not a small whole by any means it was the size of our kitchen and our gas bill quarupled in those two months ($500 bill each month) We had to fight tooth and nail to be reimburst for the gas bills but we never quite got compensated for the entire thing. I had to write and send them a registered letter for them to even get someone out to start fixing the hole in our ceiling which was really annoying. What else? oh lets see we have a major carpenter ant problem they have done nothing about, I have had to buy ant killer and stray multiple times but nothing seems to work well. We are still waiting to hear back from them for that and i refuse to write another letter. In addition, one of sinks in our kitchen is not draining my roomates called numerous times but all they say is that they ll get someone out there and they never do. Well i ll let u decide for urself but if u are thinking about renting from them, think again.",
        "ownerResponse": null
      },
      {
        "author": "Eloise B.",
        "rating": 1,
        "review": "ugh. these people are horrible... our apartment was completely festooned with black mold for 8 months, despite weekly attempts to control it. towards the end of our lease our apartment was entered without permission by one of lakeway's agents.. i was naked and napping when her plus 2 prospective tenants walked into my room. it was incredibly violating and embarassing, and i didn't even get an apology. DO NOT RENT FROM THEM. PUT THESE PEOPLE OUT OF BUSINESS.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Heather D",
        "rating": 1.0,
        "review": "Terrible. One of my friends lost everything when her rental burned down due to an electrical fire that started in the wall and Lakeway tried to sue them. Another friend rented a house from them that had mushrooms growing out of the wall behind the toilet and then when they moved out and left the house in better shape than it was when they started renting, Lakeway tried to keep their deposit and the had to get a lawyer involved to get their money back. The owner guy does not like to talk to women, when I was in with my boyfriend I would ask him questions and he would answer to my boyfriend.",
        "ownerResponse": null
      },
      {
        "author": "Noel Schumacher",
        "rating": 1.0,
        "review": "was just reminiscing, havent lived in a lakeway property for three years. when we moved in, there was rat poop everywhere- i mean everywhere. they said they would send someone, no one ever came. these people are slum lords, whiny, and completely checked out. i hate you guys, from the bottom of my heart.",
        "ownerResponse": null
      },
      {
        "author": "Jose Caceres-Bjorklund",
        "rating": 1.0,
        "review": "It's too bad you can't give zero stars. Absolutely horrible company that has a huge choke hold on a lot of properties in bellingham. They do not care about tenants and will leave you without a working dryer for months. Without heat in the winter. Their organization with finances and payments is terrible. They'll tell you that you haven't paid when you have and they never gave our security deposit back, even though they said they would. They have plenty of people who sue them in small claims and they really just don't care.",
        "ownerResponse": null
      },
      {
        "author": "Liam Myers",
        "rating": 1.0,
        "review": "If I could give them 0 stars I would. Quite literally the most atrocious and abusive rental agency in Bellingham. They WILL take advantage of you at every corner and not do a thing about it.\n\nMaintenance requests are always ignored, the staff act like the tenants are the bad guys, and much more. We had no heat in the middle of the winter while our house was 30, we didnt have a working toilet for 4 days, and we are currently on week 4 of not having a working kitchen sink or dishwasher. And now it is an even bigger issue. They refuse to call contractors (who are actually helpful) and even hang up on tenants on the phone.\n\nWhatever you do. DO NOT RENT FROM LAKEWAY REALTY! Save yourself a year of trouble and live in your car, god knows it is better than renting from them.",
        "ownerResponse": null
      },
      {
        "author": "Forlorn Fantasy",
        "rating": 1.0,
        "review": "I came in to sign a lease and they had told me my rent was 900 then they switched it and said 1200. Then tried to charge me a deposit of 1200 which is illegal here. After fighting with them constantly I was able tl find a molded rotten apartment in disrepair with no washer or dryer and no dishwasher and terrible neighbors all at the price of 1100. When it snowed they refused to clear the snow so disabled people could get out of their homes. It takes a couple months for maintenance requests too. The people there are often rude and even hang up. They have no voicemail or maintenance number and aren't open on the weekend. No on site property management.",
        "ownerResponse": null
      },
      {
        "author": "Benjamin Montoya",
        "rating": 1.0,
        "review": "Rent is expensive. Living standards are terrible. They ignore all work orders until the next tenants come to look at your house. First day we moved in there was a leak from the shower that came into the downstairs living room and it took them two weeks to even come in and look at it. Our dryer has been broken the entire time living here (we put it on the original work order when you first move in/water doesn't exit the house it pours in throughout the house leaving it damp) and has yet to be fixed. STILL. They said they will now because I mentioned it in front of the other tenants. I am beyond frustrated with this company. Also, our house was completely wrecked the first time we moved in, garbage, dust, and bottles of vodka littered the environment telling me that they hadn't even done a walkthrough. The one thing I am glad is Lakeway Realty taught me to do proper research before.",
        "ownerResponse": null
      },
      {
        "author": "Ab McDonald",
        "rating": 1.0,
        "review": "A literal joke of a rental company, raising rent 30%. Have unfortunately rented through them for 2 years. Literally talk to anyone who has had an experience with Lakeway and they will tell you to run.\nServed us eviction papers (scare tactic) for their negligence of fixing power, which we didn't have for over 21 days in November. Power box wasnt up to city code lol so we didn't pay for days we didnt have power.\nCheri is absolutely not professional, will yell at you on the phone while you are being calm and collected, David Hansen (owner of houses) is so senile he has no idea what is going on yet makes final decisions?\n\nMaintenance requests take over a month to complete or constant weekly reminders. Take zero care of their houses.",
        "ownerResponse": null
      },
      {
        "author": "SB",
        "rating": 5.0,
        "review": "I know there are plenty of low ratings for this company, and so I wanted to write one once I was completely done with my move out and my deposit refund. I have received 90 percent of my deposit back (10% from battery replacement, and bulbs etc) with an amount of overpaid rent for that month. I've never had a problem with this company. I was more than pleased with the services provided. Cheri was always on top of my requests, and my concerns were always addressed in a very timely manner (if not almost immediately). I just graduated college so at the time I was a student, and I can honesty say I never felt taken advantage of; however, I will mention that I was very careful to not damage the property, I turned the apt in after a thorough cleaning day, and I had my payments on auto-payments so there would be no question about it. Cheri is a very kind woman, when I signed my lease they were very patient with my paper work, and the only occasion I had an issue with one of my neighbors I felt fully supported by Cheri.\n\nI would simply suggest that you take pictures, and video recordings of before moving in and after you're done packing and cleaning. I feel for anyone who has experienced otherwise, but I said I would give this place a try and write a review once I moved out so here I am. Thank you Lakeway rentals, I enjoyed my time living in Bellingham.",
        "ownerResponse": null
      },
      {
        "author": "Simon",
        "rating": 1.0,
        "review": "Lots of friends renting from these guys.  If you have a choice, avoid them at all costs.  Most houses have atleast one major plumbing issue on top of the lack of proper door knobs/locks.  Mold can be a major issue. One of their roommates window panes fell out last winter and its just been a gaping hole since.  No foul play, just a rotten window frame. They had to take it upon themselves to patch it with plywood because lakeway wouldnt respond with much more than acknowledgment.  Keep an eye on your account too, they have been known to double charge for rent and make it a complete hassle to get your money squared away.  Slumlord doesnt begin to describe their business practices. City should really step up and condemn half their rentals.",
        "ownerResponse": null
      },
      {
        "author": "Katie Donner",
        "rating": 1.0,
        "review": "Its been 5 days since the maintenance guy has gone to Cheri for approval to fix our roof leak (why do they need approval to fix a roof leak?). Its been 3 months since the maintenance guy has gone to the store for supplies to fix our fallen down fence and never returned. Its been 4 months since we moved in and NOTHING on our move in inspection has been repaired, nor have we even been contacted about repairing despite our best efforts to get in touch. It took them 3 months to pay the last tenants overdue water bill, and they only paid after we contacted the city.\n\nTheyve made one thing perfectly clear since moving in: they will be sweet and pleasant until you sign a lease with them, and then you mean less to them than the dirt in the corners of their rental properties. You will be called rude and ungrateful for asking them to do their job. They will call you entitled and then ignore you (for asking to fix holes in the wall). They will lie straight to your face and tell you your unit has been cleaned when they hand you the keys when no one has set foot on the property since the last tenants moved out. I moved in with fake eyelashes left on the windowsills, hair stuck to the shower wall, stains and dog hair on the floor. If you still get roped into renting from them, get used to being treated like youre scum, because you are to Lakeway Reality.",
        "ownerResponse": null
      },
      {
        "author": "Tyler Masterson",
        "rating": 2.0,
        "review": "Cheri, the manager of the company, is an amazing person. She has a caring heart and has always been willing to help us. Dont listen to what others are saying about her. She has a fun sense of humor that you have to understand.\n\nHowever, Jo Anne, the accountant, has no idea how to track rent and she will trick you into paying double your rent. She has gone through our statements multiple times and has come up with different answers every single time. We have our bank statements and everything and she is still accusing us of not paying our rent. On top of this, she threatens to evict us every week with these accusations. She doesnt know how to keep track of rent or who has paid what. She has accused my roommates of owing over $1,000 when we have bank statements showing that we have paid fully for each months rent. I have paid the same amount each month (which is an equal portion of the houses full rent) and she continues to say that I have over paid (when that doesnt make any sense if you look at the records). Beware, she will mess up your charges and threaten you (in all caps).",
        "ownerResponse": null
      },
      {
        "author": "Stephanie Sharp",
        "rating": 1.0,
        "review": "These people care nothing for their rentals or their tenants. Again and again I was treated terribly.\nWhen I first moved in, they claimed the unit had been cleaned, but there was mold in the fridge and freezer and on the window sills.  The bath tub was brown with dirt. The painters had tracked in dirt and crushed berries onto the floor and carpet.  I notified them that this was unacceptable and they told me they would send the cleaners again.  The cleaners did not do anything.\nLater in my stay here, management had put a sign on the laundry room door notifying tenants that they were entering some units on a specified date.  It was not posted individually and I did not see the notice until after the date had passed.\nThe locked mailboxes were in disrepair and were broken into.  The post office held the entire complex's mail, but management did not bother to tell tenants.\nTheir actions are unprofessional and unacceptable.\nWhen I moved out, I left the place cleaner than it had been on my arrival.  I received my deposit about a month after moving out, minus bogus charges for replacing brand new CO2 and fire alarms.  The invoice they attached included the employee complaining about \"traffic to lowe's\" which was across the street from the apartment.  They charged me 69$ to replace the alarms which were in excellent, working condition when I left.  When I emailed and called and requested to speak with the manager, I was treated rudely and dismissed, never being able to speak with him.  They claimed my file was closed and I would not get my money back.",
        "ownerResponse": null
      },
      {
        "author": "Hattie Bakke",
        "rating": 1.0,
        "review": "I would give zero stars if I could. This company is a disgusting excuse of a business that exploits young poor people who cannot afford lawyers. We havent had a working fridge for a month and recently our water shut off (water is included with rent) and they wont respond to our request to fix it. They have broken several Washington tenant laws by refusing to respond. DO NOT RENT FROM HERE. DO NOT GIVE THEM YOUR MONEY.",
        "ownerResponse": null
      },
      {
        "author": "Elly Connett",
        "rating": 1.0,
        "review": "least professional real estate company Ive used in Bellingham. Cheri specifically has messed up so many times on my paperwork that I am now standing outside the office waiting to sign the lease to the house I was supposed to sign in March (it is now JUNE). Their office is boarded up and I and my roommates have had so many frustrating dealings with this company.\n\nI am a student in the pandemic and I have seen nothing but intimidation tactics put together by this company. I have never experienced a more blatant example of predatory housing.\n\nThe homes that Lakeway rents out to college students are in massive disrepair. The office staff is whiny and complacent. Every communication Ive had from this organization has been subpar.",
        "ownerResponse": null
      },
      {
        "author": "Nick A",
        "rating": 1.0,
        "review": "Can I give them 0 stars? By far the worst realty company in Whatcom County. Slum lords to say the least. We had a multitude of issues that were never fixed, we asked to get our plumbing looked at because our shower wasnt working at the time, they proceeded to send a plumber in the following days. We had moved out before the job was done, they then claimed that we cut holes in the wall and tore out the faucet and that we owed them for the damages. I was in a constant game of phone tag for about a year with this company while they told me lies about being 3rd in line for a dispute and that they would put my paperwork on the top of the stack tomorrow morning. Years went by after they said they would not send my bill to collections. Today I got a call that said I have 24 days to pay what I owe or it will affect my credit. Even when the law states that I should receive 60 days notice (besides the point). DO NOT GET INTO BUSINESS WITH THIS COMPANY! It should be criminal what they do.",
        "ownerResponse": null
      },
      {
        "author": "Whitney",
        "rating": 1.0,
        "review": "Cheri (or whatever her name is) frequently yelled at people in the office. She yelled at me once too.  One of the times I was waiting, I heard her talking to someone else who worked there and they were trashing tenants. They also SAID THEY WERE GOING TO TAKE THE WHOLE DEPOSIT BECAUSE THEY FELT LIKE IT.  This is HIGHLY illegal.  If you ever don't get your deposit back, demand to see an itemized list AND receipts of the work done.  They clearly make it up.  If you rent from them, document everything, take tons of photos of the whole unit and mark down every bit of damage when you move in.  Honestly, if everyone did that and banded together, it would be possible yo sur them for all the money they have taken from people.  When I first moved in, they gave me the wrong key for the laundry room 3 different times.  Also, my toilet was missing everything on the inside .... and they knew about it and didn't fix it before letting me move in.  Then, they took 8 hours to fix it.  I kept having to drive to the store to pee.  Also, Cheri was unbelievably disrespectful to my mother, who co-signed for me.  And my mother is the sweetest lady on earth.  I think Cheri hates herself because she has a log shoved so far up her ass that she really is just yelling at people for help to pull it out.",
        "ownerResponse": null
      },
      {
        "author": "Baal Wildhart",
        "rating": 1.0,
        "review": "This place is the absolute worst. Do not trust them. My ceiling was dripping for half a year before they decided to fix it. No reimbursements, then when I moved out and was told I'd be getting my full depositback they deside to change their minds and keep $400. This place is terrible. Choose somewhere else and save yourself the headache.",
        "ownerResponse": null
      },
      {
        "author": "Sara Hansen",
        "rating": 1.0,
        "review": "If I could give 0 stars I would. This managing  'Realtor' has been verbally abusive and very unprofessional. They do not do anything electronically.  We closed a mobile home based on \"approval\" give verbally by the secretary. The 'Realtor'  signed off on a the co-signer then AFTER it closed insisted we get a LOCAL cosigner. A little late...",
        "ownerResponse": null
      },
      {
        "author": "Maddy",
        "rating": 1.0,
        "review": "This company is insane... I know theres not a lot of choice in the bellingham housing game but Jesus, they are so unorganized I actually have no idea how they remain in business. The house itself was fine, but just the most unorganized and incompetent landlords Ive ever dealt with. Make sure to do very careful documentation when you move in (they will not bring it up or do a walk through with you). They took all of our deposit and then some since a walkthrough wasnt done, Ive emailed them twice asking how to pay the remaining balance - to the reply of crickets. I send them a check for it and they SEND IT BACK because they have no records kept? Absolute insanity. No clue how they continue to function. Huge headache.",
        "ownerResponse": null
      },
      {
        "author": "Galen LaPlante",
        "rating": 1.0,
        "review": "If I could give zero stars, I would. This is the worst property management company I have ever dealt with. I stayed in one of their properties from 2016-2017 while going to WWU. They were quite unresponsive with our maintenance requests, often taking weeks to respond. Additionally, they falsified charges (carpet cleaning ever though the house didn't have carpet), added charges 19 months after our move-out date and then sent a debt collector after us without attempting to collect themselves (they have all our contact info). They should not be in business.",
        "ownerResponse": null
      },
      {
        "author": "Stephenie Keenan",
        "rating": 1.0,
        "review": "Theres probably 100 bad things I could say about lakeway reality. I lived in a large home with 5 other roommates and the house was built very cheap. Upon move in, while installing our internet we noticed a VERY bad flea infestation. So bad the carpet downstairs appeared to be moving. Fleas were jumping all over the hard wood floor, you wouldnt want to see the sticky traps we had to set. HUNDREDS of fleas. Quite interesting to experience this when Lakeway continued to tell us it was flea bombed several times. We had to buy flea bombs and even have an exterminator powder with harsh chemicals. It was almost a month before the flea problem subsided. The house seemed very nice with large spacious rooms and modern touches until you realize you cant even use the dishwasher properly. It would leak and leak on most washes. We had contacted lakeway to have a repair man check it out and they had said they sent someone who interesting enough never arrived. All of the appliances were faulty. The oven took forever to heat, the fridge would leak and the dryer would release moisture into the laundry room. Over all terrible. Not to mention the witch at the front desk was always incredibly rude to us. We were promised a smart TV with sign on to the lease and 3 of us had to call several times about the TV. Only to have an unexpected visit to the house from Cheri with the TV that was a brand none of us had seen and wasnt even Smart so we ended up not using it. We have all moved out and had just received our remainder of our damage deposit and feel we were unfairly returned what we paid. We were charged for smoke and carbon monoxide detectors that worked already, cleaning fees which are understandable and just a bunch of random nonsense which are all probably an excuse. Youre all probably better off sleeping on the street before renting from lakeway reality.",
        "ownerResponse": null
      },
      {
        "author": "Grady Haskell",
        "rating": 1.0,
        "review": "Wish I could rate 0 stars\nTo start they changed the rent on me and made me sign an initial agreement that raised my rent by $500 dollars. I was able to correct this but still, very conniving. Then on move out they charged me for about $1000 in fees for different things that I know for a fact were never done to the place as my friends moved into the house and I have been back there frequently since move out. They also falsified documents on my girlfriends house and tried to charge her $3000 14 months after she had moved out of her house. They legally only have 21 days to do this but decided to falsify some documents to make it possible. She also called the collection agency and apparently they did this to over 30 different houses. Luckily my girlfriend took them to court and only ended up paying about $750, but still, incredibly un professional. Also two years ago my friends lived in a house that was having electrical problems and they had asked lakeway to come and fix it numerous times but it was never done. The house burned down from an electrical fire a few weeks later and all of there stuff was destroyed. My friend had to withdraw from his quarter at western which cost him a bunch of money not to mention all of his belongings were destroyed and he was left homeless. Lakeway realty is the worst company I have ever come across in my life by far and they should pay for all of the terrible stuff they have done. Sadly college students dont know or care to deal with it, especially since its their familys money. Also a lot of the time there is no other housing and so they have to go with lakeway.",
        "ownerResponse": null
      },
      {
        "author": "Nicholas Parmley",
        "rating": 1.0,
        "review": "Lakeway Realty is pitiful, they let their properties deteriorate to disrepair then do maintenance on them to just keep them habitable.  My roomates ceiling leaked when it rained for 3 months before any action was taken, to finally get any work done on the ceiling we had to get his lawyer uncle involved.  Also, my ceiling leaked into my closet and got all my stuff wet, we had a carpenter ant infestation and to be out of the house while an exterminator came through, and the sink constantly leaked.  On top of all this they took money out if our deposit because according to them we turned up our hot water heater which is straight up BS.  Never rent from these guys EVER.  They nearly ruined my senior year of college.",
        "ownerResponse": null
      },
      {
        "author": "Kendall Friend",
        "rating": 1.0,
        "review": "Lakeway realty is well known as Bellingham slum lords\nWas rented a home not up to code that was leaking water it had a serious mold issue that made me and my roommates very sick. We ended up finding a lawyer,  reporting the home to the city, and upon advice of the lawyer breaking contract and moving out . Now 3 years later lakeway has sent us to collections for things broken when we moved in but made note of on the initial inspection. we were promised multiple rent reductions because the place was trashed when we moved in but that never happened and by renters law the way they handled our whole situation we were due our deposits but that never happened either",
        "ownerResponse": null
      },
      {
        "author": "Michael Dykstra",
        "rating": 1.0,
        "review": "NEVER RENT FROM LAKEWAY Rentals, you will get sick or hurt and never get your deposit back. CALL ANYONE ELSE!!!!",
        "ownerResponse": null
      },
      {
        "author": "Zander Philips",
        "rating": 1.0,
        "review": "I started renting through Lakeway in a September. The day we moved in me and all the roommates got sick and we soon realized there were squirrels in the attic and walls. That was back in September, but we still have squirrels! We have contacted lakeway every week since we moved in and despite having an infant in the home, they dont seem to care about the infestation at all. I have contacted the city, housing advisors, pest control, housing inspector, and lakeway many times and no one is able to help us unless the landlord wants to help. Well this has been going on for months, and going to court is just about the only thing we havent tried yet. Best advice: avoid Lakeway like the plague their staff is super unprofessional, and they dont care about human beings only a paycheck. It breaks my heart to see people treat others like this, its shameful and grotesque. We have had many problems with the house: mold, water damage, animal feses, old water heater, broken dryer, broken heat, etc. but the squirrels take the cake. I contacted them last week to tell them we suspected they died because house flies showed up, but still they dont care. Lakeway is taking advantage of young people and they NEED TO BE STOPPED.",
        "ownerResponse": null
      },
      {
        "author": "hank armstrong",
        "rating": 1.0,
        "review": "absolutely egregious business. completely unprofessional and fraudulent. dont give this company your business or let them take a year of your life away! piss poor properties that are barely livible and completely neglected when it comes to any sort of basic maintenance. cheri, the front office lady, might actually be the spawn of satan, and will make your life a living hell if you ever have a basic question or need ANY sort of minor assistance. these scummy business owners use scare tactics and a horrificly outdated filing/accounting system to scam young college students out of their money. if you decide to rent through these crooks just know you might be making the worst decision of your young life! i promise you will regret every single one of the 365 days you spend as a tenant to this abomination of a realty company. oh and I almost forgot! they will do everything in their power to try to keep your security deposit from you at the end of the year! i moved out of my rental unit in september 2017 and still have yet to receive my security deposit although ive called and emailed them on multiple occasions. one of the worst businesses in the whole of bellingham.. i suggest gettin a lawyer before dealing with these scoundrels.",
        "ownerResponse": null
      },
      {
        "author": "David Gentry",
        "rating": 1.0,
        "review": "Lakeway is, by far, the least professional landlord/property management company I've had the misfortune of dealing with. Maintenance requests are routinely ignored, communication from them has grammar and spelling issues that frequently make them hard to understand, and typically have a threatening tone. A group of friends signed a lease on a Lakeway house that ended up not having all the interior walls finished.\nSave yourself a considerable amount of stress and avoid Lakeway's rentals like the plague.",
        "ownerResponse": null
      },
      {
        "author": "Connor Jones",
        "rating": 1.0,
        "review": "This company is terrible. We are living in one of their units right now and it has been very poorly kept. There are exposed nails coming from the hardwood, random patches of carpet, wall repairs that havent been painted over, and many other poorly kept areas. Also when we moved in they let us tell them what we wanted fixed and they didnt come to fix it until many months later when they were looking for new renters. Very poorly run company.",
        "ownerResponse": null
      },
      {
        "author": "Emily Sowers",
        "rating": 1.0,
        "review": "They have no regard for their tenants and only care about you when you're late on rent. They will ignore your maintenance requests and then charge you later for it. No matter how many times we had issues with the home our requests went unanswered and we constantly got pushed aside. Recommend you never rent from these people.",
        "ownerResponse": null
      },
      {
        "author": "Michelle Hughes",
        "rating": 1.0,
        "review": "To quote a previous review: This is a horrific, shady, crooked, dirty company! They steal deposits from college students and charge outrageous fees on top of keeping the deposit for things that were documented to need repairs at move-in! Thieves!\n\n^could not have been said better, could not be more true.\nLakeway will look for any way to scam you, they are greedy, unorganized, unprofessional and yes its true; Cheri is freaking RUDE.\n\nPEOPLE IT IS NOT WORTH YOUR TIME, YOUR MONEY, DAYS OF YOUR LIFETO RENT FROM THIS COMPANY.\n\nim putting 1 star here but really should be negative stars.",
        "ownerResponse": null
      },
      {
        "author": "Kevin Willis",
        "rating": 1.0,
        "review": "Rented from them a few years ago. Lost most of my damage deposit due to false claims on their end that we had incurred more damage than we actually had (which was little to none). This was my first apartment and I definitely learned the hard way. Take detailed pictures of any unit you rent from these guys, upon move in, and again upon move out. If you don't, they will make up elaborate stories and you can say goodbye to your deposit. In my case, it was a dented garage door, and claims that someone had fired off a high-powered weapon in the upstairs bedroom, and their repair guy almost fell through the floor because of it. None of this was accurate, but I had not taken pictures.\n\nYou have been warned.",
        "ownerResponse": null
      },
      {
        "author": "janine manchel",
        "rating": 1.0,
        "review": "SENT THIS LETTER 6/14/17 AND SO FAR, IT'S BEEN IGNORED!  RENTERS BEWARE!!!  EDITED FOR CHARACTER SPACES PERMITTED!\n\nShe immediately discovered leaks &water intrusion in her room, the bathroom upstairs, the bathroom downstairs, the kitchen,etc. How u can justify just re-renting a house that is leaking beyond my understanding.   I'm confident that, according to the Landlord Tenant Act, you are required to offer a home that is habitable -- living in a home with water intrusion & the black mold it causes is far from being habitable.  It's now June, 2017, & these students are STILL dealing with water intrusion, leaks, black mold & the health issues from being subjected to these conditions for over 9 months!   At one point, a handyman was sent to check it out, but never followed through on this issue. As were the several other attempts to resolve this problem early on!  As her landlord, certainly u r aware that u r required 2 offer ur tenants a clean & healthy place 2 live/breath!  This home is far from the habitable place that 1 would expect.\n\nI will address the water intrusion/leaks again below, but it has come to our attention that my daughter was walked in on in her private bedroom (usually padlocked when she isn't home) when Cheri was showing the place to future potential tenants the other day!  Months and months before their lease is even up!  As a parent in today's crazy world climate, surely you can understand how that would be completely and absolutely unacceptable!  I don't care what the circumstances are, or how many unreceived posts you posted, it is not acceptable to just walk into their private home and certainly into their private bedrooms.  These are young, vulnerable women, and I am stunned that this is how you do business!  To add further insult to injury, Cheri was rude and hung up on me when I called to confront her.\n\nI just had the displeasure of reading your (horrible) reviews on Google Reviews ... all 31 of them, and the theme is always the same!  I'm appalled you stay in business.  Taking advantage of young adults who are in college trying to get an education is not only deplorable, it disgusts me to my very core!\n\nMoving on ... as I stated in my phone conversation with Cheri, if anyone EVER and I mean EVER enters my daughters private bedroom again without her EXPRESS WRITTEN OR VERBAL CONSENT, you will be hearing back from our family lawyer.\n\nThe damage this unattended, yet frequently reported water intrusion/leaks has caused our child to have health issues relating to black mold, not to mention anxiety from worrying about these arising issues.  We are seeking reimbursement for deductibles paid out to health care providers for said issues.\n\nFurther, because of said unattended leaks, I am, effective immediately, giving Hannah Manchel's notice of intent to vacate her room and return home so I can properly attend to the health issues caused by ignored water intrusion.   She will be out by July 1, 2017.  I am seeking hotel reimbursement for her from June 15th until June 30, 2017 as well.     June 1st payment was the last payment you will receive from us because of all these horrible issues you have forced my child to live with.  If there is a problem with this, I will need to know in writing by June 19, 2017.   Otherwise, on advice from our council, we are, effective immediately, putting in our request for early release from her contract with no consequences.  The last month's rent and the deposit we gave at the beginning of this nightmare is requested back as well ... I personally left that house in better shape than when they walked through the doors, and the contractor that helped us out the other day said there was black mold covering the entire home due to ignored water intrusion!  Again, this home is not a habitable occupancy for anyone to live in.",
        "ownerResponse": null
      },
      {
        "author": "Moira Shick",
        "rating": 1.0,
        "review": "Door had a busted handle and broken frame when we moved in (was later told it had been kicked open before). Now, moving out, the frame is still damaged and they only came and to fix the handle when my husband threatened legal action. Fridge broke down day after moving in, wouldn't fix that either until legal action was threatened. I expect to be unfairly charged for damages that I did not cause and am entirely prepared to go to court over it. Be smart, take a video of the place with a timestamp when you move in to prove that you didn't cause any preexisting problems, because if it's from them, there will be at least a few.",
        "ownerResponse": null
      },
      {
        "author": "Kate",
        "rating": 1.0,
        "review": "I know housing can be tough to find for students but signing with Lakeway is not worth it. Any appointment you make, anything you sign, anything you have put in writing, means nothing to the employees there. If your unit isnt being maintained you are in distress and asking for help they will hang up on you.",
        "ownerResponse": null
      },
      {
        "author": "Isaiah Adams",
        "rating": 1.0,
        "review": "Tried to charge us $4600 after move out. They make up stories in order to pay for the necessary repairs that exist on their frumpy, unkept houses... And all on your \"damage deposit and fee\" dollar. We rented from them again because they have a flippin monopoly on good college housing and were again disappointed with home quality, repair speed, agreement integrity, and overal business practice. A company with no class, and a bad attitude. Do yourself a favor and find a good private landlord.",
        "ownerResponse": null
      },
      {
        "author": "D Queasy",
        "rating": 1.0,
        "review": "I have never been treated so badly in my life. The people who work here are not just rude- they are mean and insulting. Not only that but they rip you off and never clean the units for new people. I moved into a house and the back porch was so unsafe that it was condemned and they didn't tell me anything.",
        "ownerResponse": null
      },
      {
        "author": "Aeniah Frost",
        "rating": 1.0,
        "review": "Told us to not worry about the stained carpet and walls, only to be charged 1600 upon moving out, in addition to losing 1200 in deposit. Delinquent in fixing issues, I had mice in my house because they are useless.",
        "ownerResponse": null
      },
      {
        "author": "Ben Koch",
        "rating": 1.0,
        "review": "Please don't rent from this company. Among countless examples, I had to call three times to have someone come out to remove black mold from our bathroom. Their response, \"You're afraid of mold? You know mold grows on cheese right?\". Perplexing argumentation aside, this is the only negative review I've ever written. I felt compelled, years later, to do my part to let the world know that this company is the worst.",
        "ownerResponse": null
      },
      {
        "author": "Lereana Myers",
        "rating": 1.0,
        "review": "They don't even deserve one star. DO NOT RENT FROM THIS COMPANY. EVER. NO MATTER WHAT. They did nothing to respond to our service requests and complaints/concerns during the lease. Not only that, they charged me and my roommates OBSCENE AMOUNTS for things we were not even responsible for. Our security deposit was $1000 between the 4 of us. Now they are saying we OWE an ADDITIONAL $1213.75. THIS COMPANY MAKES ME SICK. AVOID AT ALL COSTS.",
        "ownerResponse": null
      },
      {
        "author": "Riley Keown",
        "rating": 1.0,
        "review": "These people are slumlords. They refused to pay for repairs, their homes are moldy and falling apart. Cherie at the front desk is incredibly volatile. I have seen her have meltdowns in the office yelling at customers.",
        "ownerResponse": null
      },
      {
        "author": "Flux911",
        "rating": 1.0,
        "review": "Horribly managed. Tried to tell me my furnace was a hot water heater more than twice. Rent raises $100's every year. No communication, can't get a call back from \"Dave.\" (if he even exists)",
        "ownerResponse": null
      },
      {
        "author": "Aaron Schardein",
        "rating": 5.0,
        "review": "It's a good place just old buildings :)",
        "ownerResponse": null
      },
      {
        "author": "Andy Huynh",
        "rating": 1.0,
        "review": "I wish I could give these people 0 stars because I know even 1 star is too much. Their maintenance crew is a joke. Their customers service is a joke. They run their business out of a shanty. If you want them fix anything, you're honestly better off trying to fix it yourself... you will literally have to called them like 15 times to ever get anything fixed. All the reviews about this place are absolutely 100% correct ,these people are scum...",
        "ownerResponse": null
      },
      {
        "author": "Falcon Punch",
        "rating": 1.0,
        "review": "For the love of god, avoid Lakeway Rentals at all cost. Disgusting and unkempt units and a very lazy office staff. It's a nightmare to try and get stuff fixed, especially if they don't deem it necessary. They worst part is is that the units aren't even that affordable.",
        "ownerResponse": null
      },
      {
        "author": "Francine St Laurent",
        "rating": 1.0,
        "review": "Doesn't even need to be said, due to the very evident rating, but worst company I have every interacted with. Avoid like the f***ing plague that they are. Conniving, deceitful and cheap. You will spend immense amounts of energy and time to be treated like a human let alone a customer. AVOID AVOID AVOID. (1 star is required. Zero stars is not an option.)",
        "ownerResponse": null
      },
      {
        "author": "timmyb151",
        "rating": 1.0,
        "review": "Let me start by saying that this rental company is a joke. The people in the office are worthless and about as coherent as a 5 year old. The people who they send out for repairs are almost as bad. Why even fix something if its not going to work? Stupid. These people are losers, liars, and idiots. I don't know how they go about living.",
        "ownerResponse": null
      },
      {
        "author": "Kyle m",
        "rating": 1.0,
        "review": "The main office attendant (Cheri), has gotten into public arguments and has abysmal customer service. In addition, I have needed (and repeatedly asked) for a repair only to have it never be addressed to or come to fruition (this has been a nearly 9 month process).",
        "ownerResponse": null
      },
      {
        "author": "Robert N (BhamRcHampsterCrawlers)",
        "rating": 5.0,
        "review": "You get what you get from a realty company it's about what you put in as a tenant that gets you either ahead in Life or behind in life\nBeen renting from Lakeway properties for over 7 years now and always treated me with respect and to get respect from Lakeway properties show them respect and don't be a selfish disrespectful person and that is how Lakeway properties will treat you the same way you treat them... Cheri, Dave and Tom are very nice people and will treat you with the same respect you give them\n\nThank you Lakeway properties for all you do for me and IM SORRY ALL THE PC COLLEGE KIDS TREAT YOU SO DISRESPECTFUL",
        "ownerResponse": null
      },
      {
        "author": "bridget norton",
        "rating": 1.0,
        "review": "Don't even bother trying to deal with these people. Complete liars over things that don't need to be lied about because they don't want to do their jobs correctly or rent out their properties. Read the rest of the reviews and you'll get what I mean.",
        "ownerResponse": null
      },
      {
        "author": "Noelle Stone",
        "rating": 4.0,
        "review": "Always been quick to respond to any maintenance problems we have had. Just email an official request and call to make sure they received it. Have been with them over a year and have always experienced good customer service.",
        "ownerResponse": null
      },
      {
        "author": "Signs Plus Install",
        "rating": 1.0,
        "review": "Terrible. I feel the term Slum Lord is quite befitting. They do not attend to or complete repairs in a timely manner. Their greed is outstanding.",
        "ownerResponse": null
      },
      {
        "author": "Silja Stanley",
        "rating": 1.0,
        "review": "This is a horrific, shady, crooked, dirty company! They steal deposits from college students and charge outrageous fees on top of keeping the deposit for things that were documented to need repairs at move-in! Thieves!",
        "ownerResponse": null
      },
      {
        "author": "Alex Slagle",
        "rating": 1.0,
        "review": "Terrible. The staff have been unhelpful in fixing leaking floors, and 15 calls later I still wear shoes in the bathroom so my feet dont get wet. I will be pressing legal action. DONT TRUST THIS COMPANY!!!!",
        "ownerResponse": null
      },
      {
        "author": "GodNuggetz",
        "rating": 1.0,
        "review": "Total slumlords if you look at any other reviews it's a ton of horror stories and my experience was no different when myself and my roommates moved in it hadn't been cleaned from the previous tenants and was disgusting, my roommates and I had to get lawyers involved and it was a giant mess for over a year just look at the other reviews or look at pictures of any of their properties literally abysmal how they still operate it is not that hard to find a different place to live and I would suggest you do that.",
        "ownerResponse": null
      },
      {
        "author": "jasmine henderson",
        "rating": 1.0,
        "review": "DO NOT GO THROUGH THEM. They dont care about tennants and weve had nonstop problems with them, they are rude and do not fix problems im very upset with their lack of care.",
        "ownerResponse": null
      },
      {
        "author": "talkswith ray",
        "rating": 1.0,
        "review": "Scummy, sleazy and deceptive. ONLY RENT FROM LAKEWAY IF YOU HAVE NO OTHER OPTIONS. They will scam you and or squeeze you for all the money they can.",
        "ownerResponse": null
      },
      {
        "author": "Zach Dane",
        "rating": 1.0,
        "review": "Pretty simple - DON'T GO WITH GLO - the head realtor at Fairhaven is a Dinosaur and doesn't know her stuff. I wouldn't take any advice from her or that business. Stear clear.",
        "ownerResponse": null
      },
      {
        "author": "carl smith",
        "rating": 1.0,
        "review": "Terribly sleazy business, they don't care about you, and they don't care about the houses they rent.  I think their business model is to prey on incoming college students who haven't heard how awful they are yet.",
        "ownerResponse": null
      },
      {
        "author": "cody sophusson",
        "rating": 1.0,
        "review": "They kinda suck... people next to use smoke pot like no tomorrow and we get blamed for it. We are 24 and pick on us....",
        "ownerResponse": null
      },
      {
        "author": "James Root",
        "rating": 2.0,
        "review": "Good service, but to get in you need first and last months rent, as well as a security deposit which is also another rent, all at once",
        "ownerResponse": null
      },
      {
        "author": "Tom Montanaro",
        "rating": 1.0,
        "review": "These people are a bunch of thugs ripping off anyone and everyone who will walk through their front door. Run away as fast as you can!",
        "ownerResponse": null
      },
      {
        "author": "Becks Kobel",
        "rating": 1.0,
        "review": "This company is 100% unprofessional, rude, cannot seem to understand that they are a business. No one should ever rent from them.",
        "ownerResponse": null
      },
      {
        "author": "Nate Sawyer",
        "rating": 1.0,
        "review": "Disorganized, antagonistic management and barely-maintained properties make this company a poor choice for any well-informed  renter-to-be",
        "ownerResponse": null
      },
      {
        "author": "Jacob Miller",
        "rating": 1.0,
        "review": "Never rent from Lakeway. They're bad business.",
        "ownerResponse": null
      },
      {
        "author": "Stacy Smith",
        "rating": 4.0,
        "review": "We have experienced graciousness and generosity from Lakeway Realty,  true compassionate care.",
        "ownerResponse": null
      },
      {
        "author": "R A",
        "rating": 5.0,
        "review": "These folks, particularly the office ladies, have always been really great to me",
        "ownerResponse": null
      },
      {
        "author": "Xavier P.",
        "rating": 1.0,
        "review": "Communicating via email with them has been painful enough so I won't even bother contacting them further.",
        "ownerResponse": null
      },
      {
        "author": "Kai Simmons",
        "rating": 2.0,
        "review": "Really nice people working there, just took their time on fixing worn down things around the house.",
        "ownerResponse": null
      },
      {
        "author": "Troy Greig",
        "rating": 1.0,
        "review": "Avoid at all costs. One of the agents left a woman in tears while I waited for an appointment.",
        "ownerResponse": null
      },
      {
        "author": "Caitie",
        "rating": 1.0,
        "review": "Rented from lakeway for 2 years and they are basically slumlords. Terrible terrible terrible.",
        "ownerResponse": null
      },
      {
        "author": "Dave Wright",
        "rating": 1.0,
        "review": "Super rude counter lady.  Would hate to try and bargain with that one.",
        "ownerResponse": null
      },
      {
        "author": "Eileen Byrne",
        "rating": 1.0,
        "review": "Crooks! Stay far away from these horrible people.",
        "ownerResponse": null
      },
      {
        "author": "Jamie Winters",
        "rating": 1.0,
        "review": "Do no move into Sunset Studios.",
        "ownerResponse": null
      },
      {
        "author": "Michael Baughn",
        "rating": 1.0,
        "review": "Most unprofessional real estate in business....",
        "ownerResponse": null
      },
      {
        "author": "MM TRC",
        "rating": 1.0,
        "review": "Only go to Lakeway Realty to pay Rent.",
        "ownerResponse": null
      },
      {
        "author": "Brian Shore",
        "rating": 1.0,
        "review": "Worst place in Bellingham to rent from!",
        "ownerResponse": null
      },
      {
        "author": "Colby Adams",
        "rating": 1.0,
        "review": "Terrible. Slum lords of Bellingham.",
        "ownerResponse": null
      },
      {
        "author": "Gloria Wheeler",
        "rating": 1.0,
        "review": "For trying very RUDE COUNTER LADY",
        "ownerResponse": null
      },
      {
        "author": "Matthew Hobbs",
        "rating": 3.0,
        "review": "Alright",
        "ownerResponse": null
      },
      {
        "author": "Sean O'Donnell",
        "rating": 5.0,
        "review": "Cheap housing",
        "ownerResponse": null
      },
      {
        "author": "Brenda",
        "rating": 1.0,
        "review": "The worst.",
        "ownerResponse": null
      },
      {
        "author": "Tiffany Denniston",
        "rating": 1.0,
        "review": "Bad bad",
        "ownerResponse": null
      },
      {
        "author": "emily invernon",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Bri Dague",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jennifer Barton",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Autumn Jordan",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tyler Martinez",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "josarahhh",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Arianne Detroy",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ben Kindlon",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Daniel Groneberg",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Darya Gagliardo",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "H Isham",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tori W",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mack Robertson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Emmett O'Neill",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "River Marijayne",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Rachel",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Daisy",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Heather Driskill",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "trevor healy",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cecilia Espinoza",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Walter Pina",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Michelle Kellogg",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Anne Rupe",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Rachel W",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "KIMBERLEY FOX",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Nathan Mattly",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Grace Joy",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kelly Wiebe",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Travis Geyer",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Malcolm Davis",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jaime Hernandez",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Steve Burrows",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Rachel Connelly",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Lunarspase Base",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "timotheus kester",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 116,
  "adjusted_average_rating": 1.3,
  "summary": "<article class='review-summary'><section><heading><h2>Disclaimer</h2></heading><p>This summary is generated by ChatGPT and aims to present a balanced view based on the collation of multiple local property management company reviews. While every effort has been made to ensure accuracy and provide a well-rounded article, please note that individual experiences with companies can vary. This article is only intended to be a tool to help readers find a property management company or rental property. As such, it should not be the sole factor in any decision-making process.</p></section><section><heading><h3>Good</h3></heading><p>When it comes to positive aspects in the user reviews for Lakeway Rentals, instances of satisfaction seem to be in the minority. A few users noted that occasionally, maintenance issues were dealt with in a timely manner, and there were some interactions where the staff provided helpful customer service. Some users also mentioned that their security deposit was returned with reasonable deductions.</p><p>Another recurring theme within the positive reviews, though sparse, was the company’s efforts to address concerns when problems were escalated. Reports of a quick turnaround for some repair requests imply that, while inconsistent, Lakeway Rentals has the capacity to meet tenant expectations under specific circumstances.</p></section><section><heading><h3>Great</h3></heading><p>Amidst the critical feedback, some reviewers described instances of Lakeway Rentals going above and beyond with their service. Despite the challenges that many tenants faced, the reviews highlight the exceptional moments when the staff was attentive and responsive, pointing out that there is recognition of efforts to renew their reputation within the community. This has made some individuals feel confident the company is making strides to enhance their operational standards.</p><p>Few reviews also commend individual staff members who showed a professional and kind demeanor during interactions. A select few praised the company for their ability to handle inquiries professionally and offer an element of personalized care, suggesting that despite prevailing opinions, Lakeway Rentals has demonstrated potential to deliver quality service. These cases, while not representing the majority, indicate that experiences can vary, and some tenants have had favorable engagements with the company.</p></section><section><heading><h3>Bad</h3></heading><p>Several reviews indicate a pattern of poor customer service, with complaints about unprofessional conduct from the company's staff. Tenants have reported rude interactions, including instances of being ignored or dismissed when raising issues to the company’s attention. The communication from Lakeway Rentals seems to be a mix of delay and negligence, often leaving tenants frustrated and without timely resolution to their maintenance concerns, as seen in the accounts of users who experienced prolonged unavailability of essential services like heating and working appliances.</p><p>Another common complaint among the bad reviews pertains to the conditions of the rental properties themselves. Users have experienced cleanliness issues and pest infestations from the onset of their rental agreements, which speaks to possible oversight or neglect in property upkeep and preparation for new tenants. The grievances extend to what appears to be a lackadaisical attitude towards upkeep and timeliness in addressing evidently significant problems, reflecting a broader issue of maintenance management.</p></section><section><heading><h3>Ugly</h3></heading><p>Quite regrettably, the ugly side of the user reviews for Lakeway Rentals paints a rather distressing picture. Accusations of the company being 'slumlords' permeate through several accounts, where severe negligence has led to dangerous living conditions, such as structures with black mold, water leaks, and outright violations of health and safety standards. Tenants recount harrowing experiences of their homes being practically uninhabitable and the management's apparent indifference to these serious hazards.</p><p>Further exacerbating the negativity are reviews alleging manipulative and deceitful practices regarding security deposits and financial transactions. Tenants have accused Lakeway Rentals of unfair deposit deductions, unfounded charges, and even fraudulent behavior. It is specifically concerning to note the frequency and consistency in reports of Lakeway Rentals not returning security deposits or charging exorbitant fees for normal wear and tear, issues that existed prior to tenancy, or repairs that are the responsibility of the property management company. These negative experiences greatly tarnish the reputation of Lakeway Rentals and highlight the need for serious internal review and potential overhaul of their business practices.</p></section></article>"
}