{
  "name": "Lark Bellingham",
  "slug": "lark-bellingham",
  "company_type": "property",
  "address": "800 Viking Cir, Bellingham, WA 98229",
  "review_count": 270,
  "average_rating": 2.63,
  "reviews": {
    "google_reviews": [
      {
        "author": "Victoria Pras",
        "rating": 1.0,
        "review": "I lived here back in 2022 for 3 months while subletting a room from a college student for the summer. I enjoyed living there for the short time I was there, other than the neighbors we had that would break glass, leave trash, blast music in the hall and scream at our door. Filed a complaint, and surprise! Lark did nothing. Fast forward 2 whole years to a few weeks ago, I received a letter in the mail from a collections agency saying that I owed $1000+ to Lark, and they had sent them after me. 2 whole years later, and they realized they never filed in the system that I had turned my keys in and moved out. I continued to get emails from them saying I owed money but it had the original tenants name attached, so I thought nothing of it and that it was a mistake. How disorganized do you have to be to forget to mark someone as moved out-especially when the original tenant had moved back in and they checked? Getting contacted by a collections agency for money that I never owed is the most ridiculous thing ever. After contacting Lark, I was told I would get a call back that day after she checked some things-never did. Called back the following day and she mentioned she forgot. Thankfully she updated the system and contacted the collection agency to drop the charges because they werent accurate. Unnecessary headache and stress due to a miscommunication from a place that I was already spending a lot of money to live at. While I really did like living here, this place is unorganized and will likely screw you over, like most other bad reviews have stated. Stay away from this place, itll come back to haunt you.",
        "ownerResponse": {
          "text": "Dear Victoria, thank you for taking the time to share your feedback with us. We are sorry to hear about your dissatisfaction and apologize for any miscommunication or error. While we sincerely regret that this issue occurred, so we are glad to hear that it was promptly resolved. As always we wish you well. If there is anything we can help you with in the future, please don't hesitate to reach out at live@larkbellingham.com."
        }
      },
      {
        "author": "John Duresky",
        "rating": 2.0,
        "review": "Parents:  Are you thinking of place your child here? There are pros, but consider carefully the cons. While these apartments look good, and seem to have all the right answers, I've run into a real problem with my child. And I'm 300 miles away, so I have hard time resolving these things. My child has had 3 different roommates. All of them have been disasters in their own special way. And I don't get the feeling the Lark really has a plan. As matter fact, it would seem that Lark views this as \"you\" problem not a \"them\" problem.\n\nSo, if you child has an excellent history with somebody, and they are certain they will make a good team and be responsible roommates, then Lark can work. If not, find someplace else.\n\nAs of today, I hate Lark and I will always hate them. They have failed me and my child in grotesque fashion.",
        "ownerResponse": {
          "text": "John, we are sorry to hear about the uncomfortable roommate situations your child has experienced while living at our community. We strive to provide a comfortable and safe living environment for all of our residents, and we take roommate compatibility very seriously. It is important for residents to communicate any concerns or issues they may have with their roommates so that we can address them promptly. We encourage all residents to reach out to us directly if they are experiencing any difficulties with their living arrangements. While we respect our residents' privacy and independence, we are happy to help facilitate productive conversations and find solutions to any roommate conflicts that may arise. We value your feedback and appreciate the opportunity to improve our services. If you have any further concerns or would like to discuss this matter further, please feel free to contact us directly by emailing Live@LarkBellingham.com."
        }
      },
      {
        "author": "Andy Johnston",
        "rating": 2.0,
        "review": "Pros:\n\nWater, trash and WiFi included, furnished, friendly staff and office, easy package pickups, shuttle to campus.\n\nCons:\n\nWindows not insulated, noise travels through walls and the beds are made of bricks. WiFi is decent but I wouldnt trust it if youre a competitive gamer or twitch streamer. Water condensates on the window easily so you have to watch out for black mold. My closet smelled like and had cat litter still before moving in. The parking is an absolute disaster. Instead of trying to find solutions they made more reserved spots to make you pay more for something that should be standard. Having to worry if you can park at home, or if you have to park somewhere else where you may be towed is ridiculous. Make a deal with a local business? Extend the parking lot? Add more visitor spots? I am moving out next year.\n\nGood temporary place to live for school, wouldnt live here long term.",
        "ownerResponse": {
          "text": "Hello, we are so glad you have chosen Lark as your home. We do our best to have staff that is friendly and well trained so that we can give you the best possible experience. We know that parking is hard in all of the available student housing. We recommend renewing your Housing Agreement early so that you can reserve a parking space for next year and you can look forward to another great year Living at Lark. If there is anything we can help you with, please contact us at (360) 778-1500."
        }
      },
      {
        "author": "Taylor Martin",
        "rating": 4.0,
        "review": "Amazing community with helpful staff and nice grounds. Ive lived here for two years and I cant remember a time where I was unhappy with them. Thanks a bunch to the team!\nAfterthought-\nI have a reserved parking spot so I dont have to worry about parking but it is a bit of a problem. Yes everyone is kind and they are stuck in a wetland so I understand the problem. if they can find a good way to solve that problem I would give them 5 stars easy.",
        "ownerResponse": {
          "text": "Hi Taylor, thank you for taking the time to share your feedback with us. We work hard to provide every resident with friendly and professional service every day, and we are so glad that you have noticed. We strive to provide a 5-star experience for every resident, so please reach out to us at Live@LarkBellingham.com and let us know what we can do to improve your experience with us."
        }
      },
      {
        "author": "Eleni Walsh",
        "rating": 1.0,
        "review": "After coming back to read these reviews, I'm realizing that some 1-star reviews have been removed, including mine and my partner's. Yet the same 3+ star reviews remain. Highly suspicious. Regardless, I would still give this place 1 star (or 0 if it was possible). Lark has a horrendous reputation around here and nothing has changed about them. Still the same greedy, unethical and predatory place it's been since I've known about it. Stay far away from this place. All they care about is money, and they'll do everything possible to squeeze every dime from you. Heed everyone's warnings and save yourself the hassle.",
        "ownerResponse": {
          "text": "Hi Eleni, we appreciate your feedback as a past resident of our community. We take all reviews seriously and value the input of our residents. Please note that we do not have the ability to remove reviews. We are always looking for ways to improve and address any issues that our residents may have. If you have any specific feedback or concerns that you would like to share with us, please feel free to reach out to us at (509) 652-3186."
        }
      },
      {
        "author": "James Higgs",
        "rating": 1.0,
        "review": "Hoping to bring down the overall rating with this, as I'm currently typing this using the free wifi (not the one for my apartment)  while my car is sitting outside the gate. I have to agree with another person here, why are there reserved spots at all? If we're paying to be here and we already have a parking pass, we should have a right to park in the complex that we live in. Absolutely inexcusable. Do Better",
        "ownerResponse": {
          "text": "Hi James, we are sorry to hear that our community has not lived up to your expectations. We understand that parking can sometimes be a bit of a challenge, but we are here to make your experience as smooth and enjoyable as possible. We truly appreciate your patience and understanding as we work to provide the best parking solutions for all of our residents. While our non-reserved resident parking spaces are available on a first come, first served basis, we are constantly exploring ways to improve and enhance our parking options. As you know, our community is conveniently located near grocery stores, public transportation, and the free Lark Shuttle that we provide for our residents. We are committed to making your daily life easier and more convenient. If you prefer the convenience of a reserved parking spot, we still have a few spots available for next year. Renew your lease now to secure your spot and enjoy peace of mind knowing you have a designated parking space. Please don't hesitate to contact our team by emailing Live@LarkBellingham.com  if you have any questions or need assistance. Your comfort and satisfaction are our top priorities, and we are always here to help in any way we can."
        }
      },
      {
        "author": "Richie King",
        "rating": 1.0,
        "review": "DO NOT LIVE AT LARK!!! Lark is absolutely ridiculous when it comes to actually living here. There are not enough parking spaces for all of the residents and many constantly have to park outside the gate and walk home in the cold and risk getting their cars towed. Lark also LOVES to tow cars, they will tow visitors for parking in resident spots even though there are on SIX visitor spots for the entire complex of over hundreds of apartments. They also send insane amounts of emails, its boarder-lining on harassment at this point. I moved in on September 19th and by the end of the month they were already sending me emails about renewing my lease for next year (i still get these CONSTANTLY) and how quickly apartment spots are going even though i signed my lease in June of this year so they clearly are not selling out that quick. There are also apartment inspections where staff thinks its appropriate to enter my apartment without permission and without anyone in the home and touch and move my personal items. Staff is also very strange about packages and picking them up, i have been denied my package before because i was too early and they werent ready yet even though i knew my package was in the office. Also the lark shuttle is the worst, the hours are inconsistent and were not communicated to residents, and the pickups are constantly late making me late to class. Also the bus driver is insane, she yells at drivers, honks at them, swerves, slams on her breaks etc. One time she hit the breaks so hard the kid in the very back of the bus flew forward and fell on the ground (yes he got hurt), the shuttle feels dangerous sometimes. ALSO the shuttle does not run consistently, it was not running for an entire week not too long ago, and they constantly stop running it in the middle of the day leaving students on campus.\nAll in all the amenities are nice but it is not worth the stress of parking and getting harassed by staff via email and in person. DONT LIVE AT LARK, SAVE URSELF THE TRAUMA.",
        "ownerResponse": {
          "text": "Hi Richie, we are sorry to hear that your experience at Lark so far has not met your expectations. We want to assure you that each of these items are things that we would be happy to address and resolve with you directly. We do want to let you know that you can always see where the shuttle is by checking with the shuttle tracker. Our drivers do their best to stay on a predictable schedule, but traffic and other factors may slow them down sometimes. Of course, we take our residents' safety very seriously, and if you have specific information that we need to consider in order to keep the ride to and from campus safe, please reach out to us at (360)778-1500 or send a message to our management team at Live@LarkBellingham.com."
        }
      },
      {
        "author": "anon",
        "rating": 1.0,
        "review": "In the past month the clubhouse and mailroom has been broken into 3 SEPARATE TIMES!! Are you  kidding me?? Ive had 3 packages stolen so far and each time I go in to talk to them about it they give me the number to the police and say theres nothing they can do. NOTHING THEY CAN DO? We literally pay for a full-time security guard and lark uses it as a big selling point to its residents but when it comes down to it theyre just here for decoration at this point. Lark has had numerous times to improve security and fix this issue yet they still havent. Youd think after the first or second time with a full-time security guard theyd figure out some sort of solution but apparently not. Im moving the second I can, DONT LIVE HERE.",
        "ownerResponse": {
          "text": "We share your frustration with the recent break-ins. It is our top priority to provide a safe and secure living environment, and we regret to hear about how these incidents have impacted you. We have been working closely with Bellingham Police, our parent company safety team, and our on-site security vendor to try to address and prevent break-ins. We have extended coverage by our courtesy officer adjusted our existing security system, and adopted additional policies designed to enhance security. If you, or anyone else, has any information about the person(s) that may be responsible for these break- ins, we and the police welcome any tips. You can reach us in person or via email. Additionally, you can contact the Bellingham Police tip line at (360) 778-8611(voicemail only) or through the online portal (https://cob.org/services/safety/police-services/reporting/police-tips). We will continue to work earnestly to help prevent future incidents and to provide a secure environment."
        }
      },
      {
        "author": "Antsy Pants Studio",
        "rating": 5.0,
        "review": "Kudos to the amazing team working at Lark Bellingham. It's been a freezing week here in Bellingham and the Lark team has been working overtime to keep our apartments warm, safe, and frozen pipe free! Thank you for keeping residents informed of the subfreezing temperatures before they arrived and for sending out instructions to residents on how to prep against frozen pipes so that we could avoid waterline interruptions.",
        "ownerResponse": {
          "text": "Thank you so much for the positive review! We are very proud of all of our staff here for being quick to jump in and help in whatever way they are asked, and proud of our residents for being so vigilant to help us keep our community safe, dry, and warm. The cold spell isn't over, so please don't hesitate to call our emergency maintenance line at (360)778-1500 and select maintenance emergency if you have a water leak or a power outage."
        }
      },
      {
        "author": "Morningstar",
        "rating": 5.0,
        "review": "I really appreciate how lark treats me and how kind they have been to me. I like the safe space provided and the great environment for making subtle progress in my own person.",
        "ownerResponse": {
          "text": "Thank you so much for taking the time to share your positive experience with us! We are thrilled to hear that you feel valued and supported by our team at Lark. Creating a safe and welcoming environment for our residents is a top priority for us, and we're glad to hear that you have found it to be a great space for personal growth. If there is anything more we can do to enhance your experience or if you have any suggestions for improvement, please do not hesitate to reach out to us at Live@LarkBellingham.com."
        }
      },
      {
        "author": "Angel Spencer",
        "rating": 5.0,
        "review": "My roommate and I are so happy we chose Lark Bellingham as our college housing solution.\n\nThe location to WWU is great. It's right on the bus line and there's a Lark shuttle to and from campus. The apartments are spacious, fairly soundproof, and include ample internet, as well as, a washer and dryer. Most important, the apartments are well-maintained and affordable, especially considering the extra amenities. There's a 24hr fitness center, resident lounge, game room, study center, sand volleyball, ping-pong tables, and (our favorite) outdoor firepits. Occasionally we are surprised with  invitations to Lark hosted community events. Best of all - they're pet friendly!\n\nThe office folks are amazing! They made the application process simple and straight forward, have quickly addressed any of our concerns, and helped make move-in day joyful and uncomplicated. They went above and beyond in helping us select an apartment that would meet our disability challenges. They daily work through package deliveries quickly and provide us with timely notices for pickup. The maintenance team is friendly, keeps the grounds clean, and is diligent in keeping up with garbage control and recycling (which is no easy task in a college housing setting).\n\nYes, you will see less starry reviews (mostly around parking issues), but those issues are easily fixed with early lease planning and reserving a paid parking space. In our experience, Lark has done a great job with parking enforcement.\n\nIf anything, Lark can improve it's shuttle service by adding a second driver, but overall, they do a great job of alerting tenants when the shuttle is out of service so that WWU students can plan accordingly and make use of the bus line.",
        "ownerResponse": {
          "text": "Hi Angel, we love to hear that you and your roommate have been enjoying your time here at Lark Bellingham! We appreciate your feedback and we will continue to work hard to provide all of our residents with the best experience possible. Please do not hesitate to ever reach out if you have any questions or concerns and we have loved having you as a resident and are excited to see you thrive at Lark in the future."
        }
      },
      {
        "author": "Emily Tennant",
        "rating": 1.0,
        "review": "DO NOT MOVE HERE!! I moved out in August. I had over $700 left in my account that they are supposed to refund me. I have not received a check and no one on the staff can provide me with an answer as to why I have not received a check, it is October now. They will steal your money and take advantage of you as a college student. Good luck getting parking because there is never enough spots. I paid for parking and still my car got towed and I had to pay a $600 tow fee to get my car back. I have had so many problems here that it isn't even worth it.",
        "ownerResponse": {
          "text": "Hi Emily, we are sorry to hear that your experience at Lark Bellingham has not lived up to your expectations. We would love the opportunity to help you with any refund that is due for you. Please reach out to us at Live@LarkBellingham and give us more context, and we will work to reach a resolution."
        }
      },
      {
        "author": "Julia Phillips",
        "rating": 1.0,
        "review": "The maintenance team when I lived there from 2019-2020 was the biggest group of disrespectful kids I'd ever experienced for apartment maintenance. I don't expect any maintenance person to actually provide good customer service, but they're always decent people who treat me like a normal person. The arrogance and disrespect I got from this crew was disgusting. They had an attitude of not wanting to do the jobs they signed up for.\n\nMy dishwasher and garbage disposal was jammed/broken so our sink was filling up with water when we ran the dishwasher and was almost full when we stopped it. We tried to see if it was jammed but the water was up to our elbows. So we scooped as much as we could out and waited. The sink was dirty and had dishes in it. Maintenance comes in to fix it, finishes and shows drain is draining, and as he's leaving says, \"You need to clean your apartment,\" in the most judgmental and rude tone and leaves before we can reply. Hard to do my dishes when the sink is backing up when I run the dishwasher and no water will drain if I try to use the sink.\n\nI never called maintenance unless it was related to water damage or leaks after that. So disrespectful and judgemental. I hope the crew has changed since then, but I doubt it from what friends who live there say.\n\nIn my own opinion, they're here to make profit and overcharge college students who can't find housing in time and/or didn't make the on-campus housing lottery. Slumlords. At least, at the very very bare minimum, provide *average* customer service and don't say whatever comes to your mind when you're robbing college kids blind.",
        "ownerResponse": {
          "text": "Hello Julia. We are sorry to hear about your unpleasant experiences at Lark Bellingham. In the years since you moved, we have worked hard to create a team that puts our resident experience at the top of our priority list. Feel free to reach out to us by emailing live@larkbellingham.com if you'd like to discuss ways that we can better serve our residents."
        }
      },
      {
        "author": "Connor Clark",
        "rating": 1.0,
        "review": "I think a lot of these other reviews sum up my experience living here pretty well. Terrible parking situation, apartment was very dirty upon move in, there was a shooting, the trash was always overflowing, and they charged me for damages to the apartment that existed upon my move in. My roommates room and closet smelled like cat piss and it took lark over a month to resolve the issue despite numerous emails. I would not recommend living here, the maintenance and management were really bad. Front desk staff were wonderful though.",
        "ownerResponse": {
          "text": "Hi Connor, we are sorry that your experience at Lark Bellingham did not live up to your expectations. We regret to hear of your concerns and we apologize if we have fallen short of providing a great living experience. Feel free to reach out to Live@LarkBellingham.com to discuss your experiences further."
        }
      },
      {
        "author": "Hiu Phm",
        "rating": 1.0,
        "review": "One star because the security is suck. In one month, the packages were stolen twice. The staff said to me: \"Nothing I can do, I am sorry\". Really? At least, you can work harder to notify our packages right away when we get the email from our merchant that says YOUR PACKAGE  HAS BEEN DELIVERED.",
        "ownerResponse": {
          "text": "Hi Hieu, we understand your frustration with this recent incident. We have recently taken steps to further increase security of our clubhouse and package room. Our team will continue to work hard to send notices of delivered packages to our residents as quickly as possible. Unfortunately, we do often get packages in batches of over 100 at a time, so it may sometimes take longer for our team to send these individual emails. We appreciate you taking the time to provide us with your feedback and share your experience. Please do not hesitate to reach out to us at Live@larkbellingham.com to discuss your experience further."
        }
      },
      {
        "author": "Hannah Hoffman (HeyHeyHannah18)",
        "rating": 1.0,
        "review": "Lark is still trying to take money from my sibling who applied to live there during their second year at WWU, but never actually went back. My sibling never lived there and even got the room signed over to a different person who did actually move in to the apartment, but Lark is still trying to say my family owes them over $10k. Lark is absolutely horrendous, do NOT try to start any agreement with them ever.",
        "ownerResponse": {
          "text": "Hi Hannah, we are sorry to hear that your sibling experience with Lark has not been what they hoped for. We would love additional information so we may prevent an unsatisfying experience like this to happen again. Please have your sibling email us at live@larkbellingham.com or call us at 360-778-1500."
        }
      },
      {
        "author": "Dylan Kasanders",
        "rating": 1.0,
        "review": "I would not recommend this place, as the management team does not seem to care about resolving the issues of their renters.\n\nWhen I initially moved in, the place wasn't properly cleaned as I was told it was going to be. (I even had to postpone moving in as they told me they wanted to clean the units) Stains and other miscellaneous items like hooks and pins were left around the room when I moved in. The drains to both the bathroom sink and shower didn't work upon moving in. Both of them filled up with water when used. I filed a maintenance request about the issue, only for it to be marked resolved a few days later with no action done by Lark or it's maintenance staff.\n\nI additionally didn't have internet access from when I moved in till late November. I would continually contact Lark about the issue and was always told they would email me back with a status update as they had to do stuff on their end that I had no control over. Throughout the entire time I had received none of the emails they said they were going to send to me.\n\nAt one point I had water pooling on my ceiling (this was at a point in time where we were experiencing heavy rainstorms and I lived on the top floor). I called Lark about the issue and was told that the general manager would immediately come over to do inspections. I had waited over an hour, and he still had not showed up. I recall to ask for a status update, to be told that he already left for the day. When contacted about potential damage to their property, the management at Lark does not care about resolving or inspecting it.\n\nI would not recommend this place, and I advise anyone reading to avoid this place. The management is wildly unhelpful, and often ignores the issues their renters have. It's impossible to recommend someone live here when the management doesn't even care about maintaining the property themselves.",
        "ownerResponse": {
          "text": "Hi Dylan, we are very sorry to hear about the condition of your room upon move-in. We want to ensure that every resident moves into a clean and prepared room. We would love to speak more about the issues with maintenance requests with you to get more feedback. Maintaining our property and our apartments is very important to us and we would love to improve beyond your experiences and beyond your expectations. Please give us a call at (360) 778 - 1500 or email us at live@larkbellingham.com so we may talk further about your experience living at Lark."
        }
      },
      {
        "author": "Nate Oostra",
        "rating": 1.0,
        "review": "You treat your adult residents like children expecting them to follow these ridiculous demands, you can leave your room spotless when you leave and they will hit you with the you didnt do something right, pay us even more moneyas if you werent doing that already and their communication is god awful Good luck getting a genuinely helpful email from them but when theres hot dog day youre the first to know. Dont even get me started on parking. Makes me want to cry thinking about it. And the securities a joke remember the shooting where were they when that was going on?",
        "ownerResponse": {
          "text": "Dear Nate, there were reported gunshots in April 2022 at around 12:30am as a party in an apartment was being broken up.  We called Bellingham Police to disperse the party and the gunshots occurred while police and management were already on site.  Thankfully there were no injuries.  We immediately terminated the occupancy of the residents that hosted the party."
        }
      },
      {
        "author": "Alex Willis",
        "rating": 1.0,
        "review": "Would not recommend. I nearly got towed twice because I had to park in a reserved spot due to the fact that there was rarely ever any visitor spots available as well as reserved parking passes to be able to park in those designated spots. I also got charged a ton for minor damages such as a tiny stain or a bended blind(500 bucks).",
        "ownerResponse": {
          "text": "Hi Alex, we are sorry to hear your experience at Lark was not a great one. Parking really is a struggle for all student housing in this area, which is why we recommend securing your reserved parking spot early. While we understand how hard it is to have your car towed, we also strive to make sure that once a parking spot has been reserved, it will be available for the person who has reserved it. If you have any other questions please contact us at live@larkbellingham.com,"
        }
      },
      {
        "author": "Lilly Bennett",
        "rating": 2.0,
        "review": "Cat litter and rusted through toilet on move in. My roommate was charged for holes that were there when she moved in. You will regularly have to park at fred meyer due to parking situation. The front desk people are nice and are clearly not responsible for these problems, but there is nowhere else to turn to. I was told they work 12+ hour days during move-in move-out season which is terrible management on scions part. Can't wait to lose my deposit on a room that was banged up to begin with :)",
        "ownerResponse": {
          "text": "Hi Lilly, thank you for your feedback. Here at Lark Bellingham we prioritize the experience of all our residents, and are sorry to hear that yours has been less than satisfactory. Our team has tried reaching you regarding your concerns, but it looks like we have been unable to connect. We would love the chance to speak with you to further clarify or remedy any of your concerns. Please reach out to us at (360) 778-1500 or live@larkbellingham.com."
        }
      },
      {
        "author": "Carlee Fleming",
        "rating": 1.0,
        "review": "Parking is an absolute waste of money, dont pay for reserved youll probably have to end up parking in a resident spot multiple buildings away from yours. The front office is very unorganized and arent very helpful with getting you information. Please read the whole lease 5x before signing because theyll not let you out and theres a lot of things most people probably wouldnt agree too hidden in there. They also over charge and nickel and dime young college students as much as they can. They are currently trying to charge me 500+ dollars for a carpet stain that was left by the resident previous to me. I have sent an email from their leasing office where they have acknowledged that its not from me and its not my responsibility, yet right now they are refusing to answer my emails and take the charge off. They also charge a 75 dollar cleaning for dust left on dressers and 50 dollars for what woulda taken a napkin to wipe off. It comes off as a complete scam which is a shame because the units are nice. (UPDATE) after many emails they did correct my balance from 500 to 58 dollars.",
        "ownerResponse": {
          "text": "Carlee, thank you for taking the time to leave a review for us here at Lark Bellingham. We appreciate the feedback and always want our residents to have the best possible experience at our community. Our front office staff are trained to handle most resident concerns, and as you mentioned, at times we can get a little busy, so we do our best to get back to everyone in a timely manner. As far as damages, we are happy to hear any and all appeals, and will review them for you. Please don't hesitate to reach out to us at (360) 778-1500 and we would be happy to discuss these concerns in more detail for you."
        }
      },
      {
        "author": "Liv Gray. C",
        "rating": 2.0,
        "review": "The staff are lovely everyone at the office and the maintenance is super helpful. But I suggest u do not live here I was here for 2 years the managers have tried to illegally over charge me and all of my roommates thousands of dollars from simply moving out. We have also had a lot of trouble with our cars there. There is no parking and there has been many times where we have car broken into because security is literally asleep, and they have tried to tow a lot of cars that have a permit to be there. They are a mess with rent and will commonly double or triple charge u for a months rent. Do not live here they take advantage of young adults",
        "ownerResponse": {
          "text": "Hi Liv, we are disappointed that certain aspects of your experience at our community were not what you had hoped. We would love to be able to reach out to you directly to address these concerns, but unfortunately, we have been unable to locate your contact information in our system. Please reach out to us at Live@Larkbellingham.com at any time and we'd be happy to try our best to remedy these situations."
        }
      },
      {
        "author": "Joanie Benson",
        "rating": 1.0,
        "review": "If you decide to move into these apartments, TAKE PHOTOS AND VIDEOS OF EVERYTHING! (DAMAGES!) These people will try to charge you for damages that were not caused by you, and be unresponsive when you try to dispute them. My roommate and I had the exact same experience when it comes to this, and had a combined total of over $500 in fees that included cleaning and damages that were completely made up. Ended up paying these charges in order to avoid getting sent to collections! Parking was never available, and the garbage and recycling areas were always DISGUSTING. The security guard is never there which led to A SHOOTING!!! This management staff are scam artists who are only after your money. STAY AWAY!!!!",
        "ownerResponse": {
          "text": "Hi Joanie, thank you for your feedback. We prioritize the experience of all our residents, and are sorry to hear that yours has been less than satisfactory. We would love the chance to speak with you to further clarify or remedy any of your concerns. Please reach out to us at property (360) 778-1500 or by visiting or leasing office during business hours."
        }
      },
      {
        "author": "Jenna Zeng",
        "rating": 1.0,
        "review": "Before choosing Lark I had already heard bad things about management, however with little option and faith I decided to sign a lease anyways. Needless to say it was a mistake.\n\nThe rent was way to high for the quality of living. Upon moving in I started getting eaten by flea because management KNOWINGLY gave us a pest infested apartment. Management was rude when we asked for a new apartment. Poor management eventually lead to a shooting that happened right next door to me. Finally, after moving out management ended up charging me $400 in cleaning and damage fee.",
        "ownerResponse": {
          "text": "Hi Jenna, we regret to hear that your experience here at Lark Bellingham has not been a positive one. Please contact us at your earliest convenience to setup an appointment with one of our managers so that we can help to further assist in addressing these concerns. Give us a call at (360) 778-1500 or email us at live@larkbellingham.com."
        }
      },
      {
        "author": "Chelsea Carpenter",
        "rating": 1.0,
        "review": "never any parking, bad security, garbage area looks like this most of the time, there was a shooting, some assaults, and cars broken into",
        "ownerResponse": {
          "text": "Chelsea, thank you for taking the time to share your experiences at Lark Bellingham, we are extremely sorry to hear of the challenges you encountered and would love an opportunity to discuss your individual experiences. Please do not hesitate to reach out to us at (360) 778-1500, live@larkbellingham.com, or by visiting our leasing office. We look foward to hearing from you."
        }
      },
      {
        "author": "Daniel Lang",
        "rating": 1.0,
        "review": "I would never rent from them again. Theres never any parking as they allow visitors to park in resident or reserved so id have to drive in circles and sometimes patk at Fred meyer. Dont mind security as theres bars missing on back side so anyone literally can come in. Ive seen deals gone down over there. Lark will allow people who are not on the lease to live there even if they threaten/ destroy property and are volatile to ACTUAL paying residents. Ive numerous friends who have faced that problem as did I when i stayed there. They'll act all nice but they have no interest in protecting their residents. I thought it would have changed since it became Lark instead of NXNW but it's just as bad! Save your money and find somewhere with actual professionalism.",
        "ownerResponse": {
          "text": "Daniel, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to hear of the challenges you have faced while living with us related to parking and security. Our team has been working to improve parking enforcement and security on-site, and we would love the opportunity to hear more about your individual experience to help us further these measures. Please don't hesitate to reach out to us at (360) 778-1500 or live@larkbellingham.com."
        }
      },
      {
        "author": "Elise Weaver",
        "rating": 5.0,
        "review": "I lived here almost 2 years and I loved it! The amenities on the property are great, the staff is friendly and helpful, and the buildings are new and clean. The apartment comes pre-furnished which can be really convenient if you are coming from out of state. The bedrooms and bathrooms are private and spacious. The location of the property is awesome too. It is located right next to Fred Meyer and about a 5 minute drive to downtown. Some people like to complain about the parking, but I never had an issue when I lived here and I didn't even pay for a spot. I used the general resident parking. If parking is something you are concerned about, then you should pay for a reserved spot. Overall, I have found that this property gives you the most for your money. I wouldn't have wanted to live anywhere else!",
        "ownerResponse": {
          "text": "Elise, we appreciate you taking the time to leave your review. We miss you as a resident and are glad to read that your experience at Lark Bellingham has been a great one. If we can be of any further assistance, please dont hesitate to reach out to us."
        }
      },
      {
        "author": "Alli Williams",
        "rating": 1.0,
        "review": "Living at Lark was an absolutely horrible experience. The managers take forever to get back to you - if they ever do. The parking situation is an absolute nightmare, even if you pay for a monthly parking pass. Maintenance will enter the apartment without any sort of notice; they will also need to be contacted several times before a work order is completed. Staff will give several varying answers to the same question (no one seems to be on the same page for any protocol ever). They will charge you damage/replacement fees for objects that are \"dirty\". You cannot break lease and the subletting program they talk about is a joke. Trash/recycle was always an overflowing disaster - was collected once a week and one year recycling was \"taken away\" from residents. I would never recommend Lark to anyone.",
        "ownerResponse": {
          "text": "Alli, we are very sorry to hear of your negative experiences as a Lark Bellingham resident. We greatly appreciate you taking the time to discuss your individual experiences, and for offering future residents advice. Thank you for bringing your concerns to our attention, consistent communication is something our team will work on. If there is anything further we can do for you please reach out, (360) 778-1500."
        }
      },
      {
        "author": "Jenna Scarcello",
        "rating": 5.0,
        "review": "Lark is such a great place to live! The staff is always wonderful and so helpful. Residents are always put first and its very evident through all the resident events and the regular check ins. Lindsay, Carly, and Anna are a few of the current staff members I have got to know and they have such big hearts and are always looking out for residents best interest. The GM Selena is AMAZING as well!!! I would absolutely recommend living here!",
        "ownerResponse": {
          "text": "Hey Jenna,\n\nThank you for your feedback. We are so glad you had an amazing experience while living here!"
        }
      },
      {
        "author": "Thorin Helmersen",
        "rating": 1.0,
        "review": "This place looked amazing at first, and for a little while it was pretty solid. Until you start to see that maintenance never actually comes to fix anything, and thats all on you. They say that you can have holes in your walls, but charge you for repainting every little nick in the wall. If you have a pet like I did, the pet deposit isnt too bad until you realize that it doesnt protect you from getting upcharged insanely for cleaning after you move out. I diligently cleaned my apt after moving out at the beginning of my last month there, and on top of the already paid damage deposit and pet deposit they still ramped me for another couple hundred bucks. Be careful, and leave it better than you found it and maybe youll only be charged $80 or so. Youd be fortunate.",
        "ownerResponse": {
          "text": "Hi Thorin, We apologize if your work orders were not completed as efficiently as needed. Some things, such as smoke alarm batteries, are fixed as a courtesy by maintenance and all work orders are completed as they are requested and by priority. When a unit is inspected after move-out, we have to charge for any additional cleaning or damage repairs as needed so that the unit is in move-in ready condition for the next resident moving in. We appreciate your honest feedback as it helps us make improvements toward our property. Please reach out if there is every anything else we can help you with."
        }
      },
      {
        "author": "Morgan Malizia",
        "rating": 5.0,
        "review": "I have been at Lark for just under two months now, and I have genuinely enjoyed living here. The accommodations have been great, and the staff has been so friendly! They are all so helpful whenever I have a question or concern. The apartment itself is really nice, and it feels like all the form benefits without the drawbacks. If Lark is an option for you, I would highly recommend living here.",
        "ownerResponse": {
          "text": "Hi Morgan,\n\nWe are glad to hear you have been loving being a part of the Lark fam! Thank you for your feedback."
        }
      },
      {
        "author": "Brandon Nelson",
        "rating": 1.0,
        "review": "ever since move in day these people have been repainting more and more free park zones into reserved park zones. there is now less free zones and more reserved zones so that we cave in and pay for a reserved spot. it is wrong and they need to stop with the extreme restrictive rules they have for parking. they need to have an even amount of free park spots and reserved park spots.",
        "ownerResponse": {
          "text": "Brandon, we sorry to hear on the challenges that you have encountered related to parking onsite. We encourage you to reach out to us at (360) 599-220, by email at live@larkbellingham.com, or by visiting our leasing office during business hours to further discuss your individual experiences."
        }
      },
      {
        "author": "Alaina Savage",
        "rating": 1.0,
        "review": "TLDR: STAY AWAY FROM LARK.\nThis is gonna be long.\nAt first living at Lark was nice, the only real issue seemed to be the lack of decent parking. My roommate and I quickly found out that not only was there not enough parking for all of the residents at lark to even park inside the gates, but calling and trying to report cars without passes accomplished nothing. Trying to get any help from the office accomplished nothing. The only thing that was handled quickly and efficiently was adding my cat onto my lease. Other than that the office staff has been unhelpful and just plain rude at times.\nI made at least half a dozen noise complaint calls in the middle of the night that never seemed to do anything before finding out that they DEFINITELY werent doing anything when I received a call and voicemail saying that they talked to my neighbors for the first time about the noise and next time I needed to just go talk to them instead since they were so polite and understanding. (Not sure where in my lease it says I need to uphold their quiet hours, but I digress).\nWhen my roommate and I went in with a friend to switch to a three bedroom for next year (we already renewed to keep the lower rent and are stuck in our lease) they told us what we needed to do and it seemed super simple. But we were unable to go online and request each other as roommates, my friend wasnt receiving any emails from them about her lease, and for the next couple months all three of us received multiple calls about who we wanted as roommates for next year. Each time we told them the names of our roommates and that wed been into the office several times now and been called even more about this. They told us they would make a note of it and it would be changed. They either dont communicate in the office at all, or theyre all not doing their job correctly. It shouldnt be that hard to write down the names of three people living in an apartment.\nTrying to get maintenance is a pain. Most recently we tried to get some help for the carpenter ants that are invading our apartment because we live on the first floor and our door has visible cracks and holes in the seal around it. We were told that it was OUR LIVING CONDITIONS that attracted and caused the ants and they were not going to come and even look at the door or offer any help other than sorry, its probably your fault. A couple times they havent bothered to come at all, marked the request as completed and sent a survey on how the maintenance was.\nSTAY AWAY FROM LARK. Its an overpriced, inconvenient, and incredibly stressful place to live.",
        "ownerResponse": {
          "text": "Hey Alaina, Thank you for chatting with us about your concerns. We hope we were able to clear up any misunderstanding and address everything you mentioned. Please let us know if there is anything else we can go over to help you out."
        }
      },
      {
        "author": "Alicen",
        "rating": 1.0,
        "review": "Please spare yourself from owners and managers that prey on college students that don't know any better!!! I've been screwed over multiple times by this place...and they try to get away with all of their excuses or straight up unresponsiveness until you threaten to sue them. Students that work in the office are just on phone calls or texting the whole time and are of no help..like they don't know the answers to basic questions. The walkthroughs are an absolute joke so DOCUMENT EVERYTHING WITH PHOTOS AND VIDEOS!!! Place always smells like weed, people are always blasting music, there is never a decently-close parking spot, and staff are rarely ever helpful. Please save yourself and rent somewhere else. Wish I would've never lived here, would've saved me a ton of frustration and HASSLE!!!",
        "ownerResponse": {
          "text": "Ali, we are sorry to learn that you have this impression of our community. We appreciate you taking the time to leave your feedback, as we take all these concerns into consideration when implementing improvements to our community here at Lark Bellingham. Please don't hesitate to reach out to us at live@larkbellingham.com and we would be happy to discuss these concerns in greater detail for you."
        }
      },
      {
        "author": "Tina Sypaphay",
        "rating": 4.0,
        "review": "Living here is nice. I wish there were more parking spots. I make a work order every month for something. The walls are thin, but what do you expect living in any apartment complex. Their staff is friendly. My unit gets lots of sunlight.",
        "ownerResponse": {
          "text": "Hi Tina, thank you for taking the time to share your experience. We always appreciate feedback and are happy to hear that you have enjoyed living the Lark lifestyle- especially your sunny apartment. Please reach out if you ever need anything!"
        }
      },
      {
        "author": "Jason Harrison",
        "rating": 2.0,
        "review": "No matter how big the issue no matter how little the inconvenience lark does not care. They may act like it to seem nice and friendly but they do not care about the bad residence they dont care about protecting the good residence and they most certainly dont care about parking or security. There are a couple of good employees but the majority will talk over you, talk down to you, or just not talk at all. Where is the professionalism?",
        "ownerResponse": {
          "text": "Jason we are very sorry to hear of the issues you have been experiencing related to parking at Lark Bellingham. We have reached out to you via phone and look forward to speaking with you to further discuss your individual experiences and to offer advice to alleviate this issues going foward."
        }
      },
      {
        "author": "Rhonda Nelson",
        "rating": 1.0,
        "review": "If there were zero stars - I would give it a zero .  The portal to pay is not easy to set up.  They will not take payment over the phone Parking is additional and God forbid you have an issue that you need to move out - there is no breaking  lease  and if you are a parent who co-signed you are on the hook , their subletting program doesnt work well because everything is still in original person - they are not taking over lease and have zero responsibility  do not rent from this place    oh and after you move out - They charge a vacant electric fee",
        "ownerResponse": {
          "text": "Rhonda, we are extremely sorry to hear of your negative experiences related child's residency at Lark Bellingham. We have reached out to you via phone as we would greatly appreciate the opportunity to address you individual concerns and experience. As always, it is our upmost intention to provide our residents with a wonderful place to live while maintaining fair and efficient policies for all of our residents."
        }
      },
      {
        "author": "chad k",
        "rating": 5.0,
        "review": "Lark Bellingham is a great place to live!! Ive lived here for the past two years and its been amazing! Very clean units, also having your own bathroom is a plus! Management here is very great as well! If you have any issues they are always here to help. Just come down and have a conversation with them! Lark is right on  the bus line and has a shuttle that will get you to school in less then 15 minutes! A lot of reviews are complaining about parking and Ive lived here 2 years with no issues. Pay for a parking pass or get the free one and walk further to your apartment. Nothing hard about that. Overall, Lark Bellingham is a great place to live and I highly recommend it if you are a student or even up working here in Bellingham!!\n5 STARS!!!!",
        "ownerResponse": {
          "text": "Chad, we appreciate you leaving us a review of your experience at Lark Bellingham! , We are glad to read that you have enjoyed the apartments, amenities and activities we offer our residents. Please feel free to reach out to us if we can assist you further."
        }
      },
      {
        "author": "Cr 7",
        "rating": 1.0,
        "review": "Place is trash when I moved out our couch was torn on the bottom because my roommate had a cat they are trying to make me pay for replacement finally got ahold of the manager and told him what was going on said the charges would be taken off its now been three weeks and I just got a email saying if I dont pay my bill will be taken to collections and hurt my credit and they will take legal action. Also why I lived here there was 2 shootings that they tried to cover up and say is no big deal moved out three months early and decided to pay two rents instead of live there any longer",
        "ownerResponse": {
          "text": "Hi Jacob, we are happy that we were able to speak with you last week to discuss your concerns. As always, our goal here at Lark Bellingham is to provide residents with an all-around excellent living experience with us, and your feedback has been valuable for us to keep making improvements. If there is anything further that we can do for you in the future, please do not hesitate to give us a call at (360) 778-1500."
        }
      },
      {
        "author": "Ella Collins",
        "rating": 1.0,
        "review": "If you want to enjoy college this is not the place. We rarely have parties with our close friends, and when we do we get noise complaints and expensive fines. The apartments are very nice, but be prepared to pay for every hair you leave behind. Also do parking is a nightmare unless you want to pay for a reserved pass.\n\nSeptember addition: Hi, after my rough experience I decided to sublet my apartment and move out, little did I know how really bad lark is. There was a small issue when transferring the electric bill from me to my new subletter, conservice stepped in even though we never missed a bill and have statements to prove it. So we spent months calling lark and conservice to fix the problems, conservice never answering and lark saying they were working on It. 6 months later all lark did was tack on late fees for the original fee which never should have been charged as agreed by lark associate we spoke to multiple times. When I moved out in February they walked through and charged for all normal wear in apartment even though there was little to no damage, and now that my subletter is moving out they are replacing everything and charging us BOTH for all of it. I have lived many places and have never had a slight issue with a neighbor or landlord, I have never written a negative review except this one. I cannot tell you how frustrated I am with lark and how glad I will be to be done with it.",
        "ownerResponse": {
          "text": "Hi Ella, thank you for voicing your concerns. We have been trying to reach you via phone and email to setup a time to talk in person about your concerns. Please give us a buzz back here in the office or swing by and see us. We value your feedback and would love to connect."
        }
      },
      {
        "author": "Munif Alkhaldi",
        "rating": 1.0,
        "review": "With regard to parking, the service is very weak and sometimes you wait and search for more than half an hour and you will not find a parking spot.  The security is also weak. There is a person who broke my car window and tried to steal some things. I complained to the office and they said this is not our business and there are no security cameras.  Knowing that in the same week the accident became for someone else in the residence.",
        "ownerResponse": {
          "text": "Munif, we are sorry to hear of the challenges you have been experiencing related to parking onsite and greatly appreciate you taking the time to share this feedback with us. As always, providing our residents with a safe and secure place to call home is the number one priority of Lark Bellingham management. As we work diligently to implement additional parking enforcement and security procedures, we would love for you to call our swing by the leasing office to further discuss your individual experiences."
        }
      },
      {
        "author": "Samadhi Moore",
        "rating": 2.0,
        "review": "I lived here for a while, I was new to Bellingham and didnt have many other options. At first I was roomed with two girls that were pretty nice, but after they moved out I was given other roommates without any notice. During covid the other spaces were vacant for months. One day a new roommate just showed up and I seriously thought someone was breaking in, I asked her who she was and she said she was moving in. I got 0 notice about this roommate, then it happened again with someone else moving in! There used to be security on premises but I never saw that again after the first year. There is a huge homeless camp right outside the gates that no one has taken care of in 6 months, the gates are always broken so anyone can enter the place. Ive had things stolen from my door step.\nLark will also attempt to charge you for any little thing, take pics before you move in because they will charge you for someone elses damage.\nDuring covid all the amenities were withheld from residents and there was no reimbursement for rent or anything.",
        "ownerResponse": {
          "text": "Samadhi, thank you for taking the time to speak with us on the phone to discuss your individual experiences and suggestions for making Lark Bellingham the best place to live for Students in Bellingham. The safety and security of our residents and their homes is always a priority and we greatly appreciate your suggestions for furthering these measures. Do not hesitate to reach out to us in the future with any addition concerns or suggestions as we greatly value your input live@larkbellingham.com."
        }
      },
      {
        "author": "sarah vanrooyen",
        "rating": 1.0,
        "review": "As a parent of a college student, and paying her rent, I can't put into words how frustrated I am with awful place. There are not enough physical parking spots for the amount of apartments. Getting anything fixed is a complete joke. The office staff is rude and unaccommidating. We were told security was on the premises, it is not. I pay A LOT for my daughter to live here. I thought the pricey rent would equal good service and a safer place for my daughter to live. Not in this case. Please stay as far away from Lark Bellingham as possible!",
        "ownerResponse": {
          "text": "Hi Sarah, We tried reaching out to you today to discus your concerns. The safety of our residents is always our top priority and we want to make sure any issues you or your student have are addressed and resolved. Please give us a call or email when you have a chance. Thank you"
        }
      },
      {
        "author": "Sitara Muse",
        "rating": 1.0,
        "review": "Most disorganized place ever. They will pester you to renew from day one. Then run a rather scammy tactic of saying they rented your room for the new lease term, despite giving a written renewal offer giving you well in to August to renew and keep your same room .Then they send you a renewal confirmation and a new lease when you have not at any time said you are renewing. Not to mention the constant calls from Lani about if you plan to renew. Seriously girl, calm down and stop walking around acting like you are the building manager when you are not. One time at the Thanksgiving dinner, Lani told maintenance they were not allowed a plate of food. Even though there were tons of leftovers! Just downright sad.\n\nThe place is noisy AF. Dog poop everywhere because some people with big dogs don't pick up. Maintenance is the only good part of this place. If the front office staff were as efficient as the maintenance staff,  this place would be alot better. Don't be fooled by the free coffee and a gym. The coffee machine is always down and the gym is always full. Also, whats up with the name changes for the place?\n\nEdit to add: Somebody was broken in to and Lark sent a memo trying to play it off as somebody accidentally walking in to the wrong apartment. Check out the infamous video of the naked tenant that made it in to the newspapers all the way in England. Also, their old security guard told me a story of how a young female tenant was locked out of her place and he tried to book her a hotel room for the night with his credit card. And a charming story of another security guard caught jerking it in the clubhouse!\n\nThere is a homeless camp in the wooded area around the site. You can see the garbage, graffiti and homeless people coming and going right in front of Lark. It's scary at night if you walk to and from Fred Meyer or the bus stop.",
        "ownerResponse": {
          "text": "We are concerned about your report of a negative experience at our community.  We are unable to locate any record of you as a current or previous resident.  We would be more than happy to discuss your concerns further with you if you would e-mail us at live@larkbellingham.com.  Our coffee machine is serviced on a daily basis and a technician comes in multiple times a week to restock the supplies.  If our residents notice it is not working properly, we encourage them to notify our staff.  We look forward to hearing from you soon."
        }
      },
      {
        "author": "Jessica Brewster",
        "rating": 2.0,
        "review": "This place sounded too good to be true when I signed my lease last year during their huge advertising push on campus. And, it was. NXNW was not the worst place to live but it's also not what they say it will be. When I signed, they said that they would have at least monthly social gatherings like Taco Tuesday, which failed to reoccur and attract residents. The apartment is nice but is not the best place to entertain (the courtyard is suitable for entertaining). In the bedroom, you're going to need to get a mattress topper for the provided mattress, and the desk does not come with any drawers (for being \"student housing\" you would think that they would take into account that we are students who use desks). And by far the worst part is (you guessed it) the parking. They did just add a total of seven new spots! WOW! I spent the majority of my school year last year driving around trying to find a spot to park (one time I spent an hour driving around the parking lot). I wish I was exaggerating. I would come home and drive around for at least 20-30 minutes looking for a space to park. They told me to park at Fred Meyer or the park and ride. Well, Fred Meyer tickets cars and I did not feel comfortable walking from the park and ride in the dark back to my apartment. It is a safety concern when students line all of the fire lanes of the complex, thank goodness there wasn't any emergencies or fires or that would have definitely ended poorly. If you live here next year, the parking will always be a struggle. So many people have talked to them about this issue and they have been \"working on it\" since fall 2016. I suggest finding someplace else to live. They will get you in with all of the perks that they offer, which are great, but not worth it in the end. Also the wifi does not work well, it really only works decent if your sitting next to your box :) Save yourself the hassle and find another place to call home. Come to NXNW for one of the parties, but this is not the best place to live long term. You can find a great apartment for a much better price and conditions than this place. Good luck and happy apartment hunting!",
        "ownerResponse": null
      },
      {
        "author": "brit sudds",
        "rating": 1.0,
        "review": "these apartments are overpriced and horrible to live at. the actual living space is nice, great for new college student if your ready to go broke. the staff are nice people but as far as the cooperation they are just money stealing fake individuals. they could care less about anyone living in their apartments until they want to steal more money from them.",
        "ownerResponse": {
          "text": "Hi Britney, we are sorry to see you have had a less than perfect experience. We tried to find your contact information and were unable to locate it in our system. We would like the opportunity to speak with you and resolve any concerns you may have. Please reach out to our team at your convenience at (360)778-1500. Thank you"
        }
      },
      {
        "author": "Elle Williams",
        "rating": 2.0,
        "review": "I placed both my son and one of his friends in a two bedroom apartment at the lark Bellingham for the 20/21 academic year. Do not place your child in this complex unless you have absolutely no other choice. Their lease is designed to completely screw the tenant. You will be obligated for the entirety of your lease regardless of what circumstances may arise necessitating an early departure. Additionally the lease must be for an entire year even if your child is coming home during the summer. We were charged $250 for a television set that the larks maintenance people removed from the apartment since we had our own TV. When we put in a request to have the TV returned, the lark claimed that they had no record of the original TV being removed and therefore were going to charge us to replace it. Furniture and accommodations are cheaply made and not built to last for any serious stretch of time. If your child is in a two bedroom apartment and the roommate in the other bedroom moves out, the lark will randomly assign your child a new roommate. The entire complex is run by college kids with no experience no wisdom and no ability to truly assist you. I would not recommend the lark to anyone!",
        "ownerResponse": {
          "text": "Hi Elle, thank you for providing feedback. We are sad to hear that you had an unpleasant experience at Lark. We attempted to reach out to you earlier today to discuss how we can improve your experience but were unable to reach you. Please reach out at (360)778-1500 or at live@larkbellingham.com at your earliest convenience so that we can address and improve your experience at our community."
        }
      },
      {
        "author": "Shane Wood",
        "rating": 2.0,
        "review": "Over priced hollow living experience. I will say that they do their best to keep everything clean and well maintained but I do know someone who's sink fell into the bottom of their counter...so there is that. My friend has lived here for two years and constantly complains about the cold in her room since the room was not properly insulated so there is also that. But I mean besides those two things the property is pretty there are nice big windows and there is literally a grocery store right next door.",
        "ownerResponse": {
          "text": "Shane, thank you for your review. Any sort of maintenance issues that residents have should be addressed with our maintenance team.  We strive to resolve all service request within 24 hours. If your friend was having heat issues, we encourage them to come to the front office and have the unit inspected. We do love our convenient location and having both Fred Meyer as well as Whole Foods next to our property."
        }
      },
      {
        "author": "Kelly Paulson",
        "rating": 3.0,
        "review": "Living here has been great so far, apartments looked wonderful upon, my only issues have been the fact that i pay for a parking spot I can barely get in and out of because they do not enforce no parking on the fire lane attached to my building, as well as the unbelievable noise that comes from people above us, but no controlling that one! staff is so sweet and try their best.",
        "ownerResponse": null
      },
      {
        "author": "Hailey Brother",
        "rating": 5.0,
        "review": "Rooms are furnished and are perfect for off campus housing! NXNW has community events that helps connect residents and makes everyone feel welcome! They also have so many amenities like free coffee, wifi and cable are available, a gym with tanning booths, and also have sand volleyball courts! The workers are also very helpful and strive to make all the residents satisfied. This is my second year and I have loved staying here! If you're looking for a great place to live then this is a great selection!",
        "ownerResponse": {
          "text": "Hailey, thank you so much for your review! We love hearing from residents about their experience at NXNW.  If you ever have any questions for us please feel free to contract our office or stop by the clubhouse."
        }
      },
      {
        "author": "B",
        "rating": 1.0,
        "review": "Reserved spots are not enforced at all. I have spent an extra $30 a month, totaling close to $500, to have the same parking rights as people who do not pay a premium for parking. It is unfair. Management claimed their new solution to parking (make almost every spot reserved and allow people who pay the premium to park in these spots, allow residents who do not pay extra to park in resident spots, and guests in guest spots). This solution works in theory, yet due to the lack of proper enforcement (also something that was promised to become better) it is a useless solution.\n\nAside from the parking issue, quite a number of things have caused concern.\n\nFirst, there was a large 20+ foot fire in the complex, management never notified any residents. I am sure most residents were unaware it ever happened. Although it was a recycling bin that caught fire, it was within 10-15 feet of a building and could have easily spread. This is a large safety concern that I feel should have warranted notifications to the residents. Just to note, this was a cardboard recycling bin fire on a rainy day, thus it was likely arson.\n\nMost of the amenities offered are unavailable half of the time. The coffee machine often needs repair, the printer runs out of paper or ink, the small self-checkout mini mart was turned into a vending machine (without notifying the residents of this change).\n\nLastly, there are predatory business practices when it comes to renewal. I have known of several other residents who received emails saying they signed a lease when they did not. They would then go in and ask about it and the management team would say they merely are wanting them to sign. It seems like a way to scare people into resigning to me.\n\nOverall, it is a very nice place to live that has been ruined through poor management practices.",
        "ownerResponse": {
          "text": "We are sorry to hear your experience with NXNW has not been the most positive one. As for our parking lot, it was constructed based on the city zoning laws and is in compliance with those regulations. As for enforcement, Washington state law does not allow us to patrol our lot for improperly parked vehicles. If there is a vehicle parked improperly resident's can request for the vehicle to be towed. This service is available 24 hours a day. As for the fire you mentioned, it was contained that same night and did not affect any buildings. The Fire Department ruled out the possibility of arson on the scene. We too were sorry to see the market go, but this was a decision made by the vendor due to a high amount of items not being paid for. We sent out two notices about the change to residents. We send out offers to residents about renewing each time we have a new special or deadline, so we can keep resident's informed about renewing. We would love to have a conversation about the concerns you have brought up, but unfortunately due to the anonymous nature of the review we are unable to reach out to your directly. Please feel free to call us at 360.778.1500, e-mail us at live@nxnw-bellingham.com or come down to the leasing office to discuss this further."
        }
      },
      {
        "author": "Connie johnson",
        "rating": 5.0,
        "review": "I am a resident and an employee NXNW is the best apartment complex I have ever lived in. Clean, new, fully furnished,  and put together. I have lived in a lot of apartment complexes and NXNW is the best apartment complex i have ever lived in. I see a lot of negative reviews about noise but I have never experienced anything above normal apartment noise. People also complain about parking, but again, i have never had an issue with this. In any apartment complex people are going to compete for parking.",
        "ownerResponse": {
          "text": "Thank you for your review, Connie. We are happy to have you as a resident and employee as well."
        }
      },
      {
        "author": "ayed",
        "rating": 2.0,
        "review": "Im living here right now! Please stay away from Lark Bellingham! Ill be moving out ASAP. The walls are too thin that you can here your neighbors talking! the apartment above us have dog, and Im ok with that in fact I love dogs! However, that doesnt mean they can play around the apartment and make noises all the time! also whoever is living above me is having a problem with the doors! He/She always slaps the door even after midnight! I really dont wanna talk about the parking because I think you can read the reviews and figure that out! The internet is so bad. One last thing is how dirty the apartment was when I got it. I found some blood on the floor on my bathroom! and there were dogs hair all over the place. JUST STAY AWAY!!!!",
        "ownerResponse": {
          "text": "Ayed, we are very sorry to hear of the troubles that you are encountering as current resident of Lark Bellingham. We would greatly appreciate you reaching out to us via phone,(360) 778-1500, or email so that we can address your individual concerns/experiences and are confident that we can offer you with solutions to improve your current living experience."
        }
      },
      {
        "author": "Sophia Lazich",
        "rating": 1.0,
        "review": "I think the parking situation makes this place unlivable. It's not fair to be paying $700 a month and still have to drive around for 20 minutes after work trying to find a spot, only to wake up the next morning to a ticket for parking in the only area they left available. I would not recommend living here if you aren't one of the very few with a reserved parking spot. 400 spots for the 800 residents is not good enough.\nI will not be extending my lease next year because of this.",
        "ownerResponse": null
      },
      {
        "author": "Izze Davidson",
        "rating": 2.0,
        "review": "They raised rent after guaranteeing that my rate would stay the same when I renewed and they try to get you to not read your housing agreement and screw you over. They also do not take care of problems even though they say they do.",
        "ownerResponse": {
          "text": "Hi Izze, we greatly apologize for the confusion regarding your renewal rate here at Lark Bellingham, and we do appreciate you coming by to speak with us about this. We are always here to help if you have any future questions or concerns."
        }
      },
      {
        "author": "Danny Aimone",
        "rating": 1.0,
        "review": "To give you an example of how much Lark actually cares for their tenants, let me layout how I was recently treated. I have lived here the entire year with my car and recently found out my car was towed. How I found out is where the issue lies; my phone number is on call, my license plate and car description is connected with my car (as well as a sticker showing that I am a resident here), but I had to CALL the towing company myself after however many days it's been impounded and find out that I'm being charged $500 to retrieve my car that I have parked in my own apartment complex. Not ONCE was I notified by any of management that my car was being towed nor do I know WHY my car was towed. I have been unable to reach any of management for the urgency of this issue to find recourse for this or to even find out why I wasn't even simply contacted. Lark Bellingham takes a shoot first, ask questions later kind of aggressive approach with all issues that don't concern them, yet when you as a tenant have an issue, I guarantee most of the time you won't actually get more than a \"We're sorry!\" This has occurred in multiple situations. My roommates car was broken into earlier this year while parked on the complex and had an expensive subwoofer in (his car was lock, the window was literally sRuntimemashed.) Something like this would normally be easily solved by having security on site, right? Well, Lark claims they do, but they have gone through at least 6 security officers in the span of this year and none of them have offered any actual protection to a complex as big as this. When he contacted management, all they did was point to the lease and say they're not responsible. Lark will take to their lease agreement and offer no recourse or assistance in any time of need; my neighbors were broken into and it took them weeks to send out an email which just stated \"Just keep your doors locked!\" I would not recommend Lark to anyone.\n\nEDIT 02/01/2020\nYou probably see Lark's response below me, assuring that they'd take care of any issues. Don't be fooled. They basically just reiterated to me that I'm SOL and I never was given any apologies. Management truly is a joke.",
        "ownerResponse": {
          "text": "Dan, we are concerned to learn that you are not enjoying your experience to the fullest extent - your vehicle which is registered with resident parking, was reported as being parked in a reserved stall. When you register your vehicle with Lark there are clear polices about where you are allowed to park based on the permit you have. We have sent our parking rules and regulations to our residents reminding them of these policies. Security is on site from Thursday through Sunday and they have a required route, so they can patrol the entire complex. There is no specific security guard assigned to Lark, this is why there are different security guards throughout the year. We are more than happy to discuss your concerns further if you would stop by the office or e-mail us at live@larkbellingham.com."
        }
      },
      {
        "author": "Tayler McInerny",
        "rating": 4.0,
        "review": "The apartment itself is really nice. its awesome to find an updated place in Bellingham, unlike the several houses and apartments I've lived in before that have had mold, ants and a number of other issues.\n\nIt's a great location, only a 5 min ride from campus.\n\nAgreed that they need more parking, but I have a reserved spot so it usually isn't an issue (except when people park in it late at night which has happened a number of times).",
        "ownerResponse": {
          "text": "Tayler, thank you so much for your feedback.  We are glad to hear that your experience at NXNW has been an enjoyable one.  If we can be of any assistance, please do not hesitate to reach out to us."
        }
      },
      {
        "author": "Cheyenne Gillespie",
        "rating": 2.0,
        "review": "They dont reply to emails after youve moved in, the shuttle has been a nightmare because it is smaller and theres only one. Parking IS NOT enforced . I pay $30 a month and emailed them about so many people parking in the reserved but they want you to police it and take pictures of the license plate etc and they also took over a day to reply and the problem was not solved. When emailing them about concerns they are not prompt at all, and have taken at least a day to reply if they reply at all. For the amount I pay to live here Im just really disappointed in the customer service aspect of how they run things, they get your money and thats all they care about. Super sad about it because I was really excited about living here.",
        "ownerResponse": {
          "text": "Cheyenne, we appreciate your feedback and review of Lark Bellingham.  We've already reached out and left you a voicemail in regards to the matter at hand. Looking at our email correspondences we replied with in a 24 hour time frame. There are a few ways to get to campus from Lark Bellingham - during peak times the shuttle does get full, if and when that happens WTA has put in a bus stop right at the bottom of our driveway that is freely accessible to WWU students. We do appreciate all of our residents and their feedback. Please give us a call back at your convenience - 360-778-1500."
        }
      },
      {
        "author": "Irena Kolbert",
        "rating": 1.0,
        "review": "Where do I start. I lived at Lark for seven months, and my roommate was doing drugs. I repeatedly complained to the management about my roommate, but they did nothing. One day, my roommate started using intense drugs that caused her to become physically violent, and she was arrested for domestic violence. I fled out of my own apartment in fear of my own life, and moved out that same day. I refused to pay rent after that point because the police report that was filed was proof that my apartment was not safe to live in. However, Lark refused to break my housing agreement, and they forced me to pay rent up until I found a replacement. I lost over $2000 because of Lark. Worse experience of my life.",
        "ownerResponse": {
          "text": "Hi Irena, thank you so much for addressing your concerns with us. We completely understand your frustration with this situation. It is always our top priority that our residents feel comfortable in their homes. Our team has worked with you along the way in an attempt to assist you through the obstacles you have faced, but we apologize that our actions did not remedy the situation. We appreciate your feedback in stating your concerns, and are always here should you want to reach out to us in the future."
        }
      },
      {
        "author": "Penny Lockbeam",
        "rating": 1.0,
        "review": "Rent is due on the first but you can't move in until the 15th or 16th. Does this mean I get to move out on the middle of the month and if not, Why do we have to pay for 2 weeks of not being able to live here, I know that is not legal. There is 400 parking spots for 700 units, I am told this is within city ordinances,  I tried to buy a reserved spot but there were none available ,but will be looking into that personally. I have never lived in an apartment complex that did not offer each unit at least one parking spot. I keep seeing reviews about insulation, our heating bills have been running $220 a month, seems a bit high to me. The first 3 or 4 months we lived here we got mega phone calls, emails, text trying to get you to sign a new lease,  we kept telling them no, and kept getting calls until I had to get rude with them and was told that I needed to unsubscribe to text, etc.. but then if you got a package they could not notify you because you I opted out.  I got an email from management complaining about a serious offense,  I tried to find out what the offense was, but I was told I had to come in person and talk to them, I am 53 yrs old. I felt like I was being punished by a principal or something, I go in and am told that there was loud screaming like a child screaming late at night and early in the morning ( felt like I was being accused of child abuse. My grand daughter is almost always asleep by the 11 pm  Noise restrictions, and sleeps until 10 or 11 am. Sometimes when she is playing she has a high pitched scream, but I guess we are not allowed to play. although I have an elephant and a hyena that live above me and have parties until all hours of the night especially on weekends,  they must have got in trouble too because the parties have been less frequent.  They have quarterly inspections, or the rental agreement says approximately quarterly, but it has been 65 days and another inspection today.  You start getting rent reminders before the end of the month is up letting you rent is almost due, on the 1st of the month you get a reminder that your rent is due per your rental agreement, they were sending out e-mails that stated you could use the night deposit box to put your rent in. but there is not one. Managements name was on it, but she didn't even know what was in the automatic email that was being sent out. last month my rent was counted by several of us. and on the 4th or 5th of the month I got a notice telling me I needed to come pay them $1.36 (seriously) I am also in fear of retaliation of this post. The girls at the front desk are nice, the security gates don't work properly, sometimes the entrance gates are open all night long, the exit gates you have to sit and wait to get out of the complex in the middle of the day sometimes,  I had to call the police one night as I heard the neighbors boyfriend pounding on the window at 2:30 am followed by the sounds of something like the siding getting ripped off of the wall, I heard my neighbor crying, I went back outside and seen the screen all mangled and her crying inside the window so I called the police. (only for her safety) I don't complain about the noise, as I know I live in College housing. its only expected. I was told if I didn't keep my grand daughter (2 yrs old) from the noises I would be kicked out and still owe the remaining of my lease.  (After 1 warning) This is unfair, they knew there was a child when we moved in. Kids make noise   sometimes, I guess its not OK for the kids to play and have fun during normal hours but is OK for me to have to listen to all night parties,  furniture being moved all over the house,  beds banging against walls, elephants trampling through the upstairs and , and hyenas laughing all night long",
        "ownerResponse": {
          "text": "Penny, I am sorry your experience with NXNW has not been a positive one. It has been noted in your account that you have had a meeting with management regarding the noise issue as well as the verbiage on our rent notices. Whenever you see something irregular or out of the ordinary please alert the office or management in a timely manner so we can address it. Our accounts manager has reached out to you and we look forward to discussing your concerns and issues further tomorrow in our meeting."
        }
      },
      {
        "author": "GodNuggetz",
        "rating": 2.0,
        "review": "Been living here for a year super nice place with kind staff and tons of commodities, only problems I've ever had is payment on their website besides that awesome place.\n\nEdit: man was I wrong, lived at lark for 3 years and it's not like it was horrible, the staff that works there is still pretty great and helpful and it has nice accommodations like the free coffee machine but the price of this place is insane it was my first apartment so I wasn't sure what to expect but paying over $2000 a Month for a pretty small two bedroom is pretty rough and be fully prepared to pay for \"damages\" I was charged over $1800 dollars for this exact thing and some of the pictures provided of said \"damage\" was from my roommates room (he was also charged) and maybe I just got unlucky, but I'd ask some current residents before you move here, do your own research don't just pick the first apartment you find on Google cause I'll say that I'm now living in a better area with more space and pay about 1/3rd of what I payed at lark.",
        "ownerResponse": {
          "text": "Thank you for taking the time to share your experience with us.  We are glad to read that your overall experience has been an enjoyable one.  If we can be of any further assistance, please do not hesitate reaching out to us."
        }
      },
      {
        "author": "Ben",
        "rating": 1.0,
        "review": "Not nearly enough parking for residents that dont pay for a reserved spot. I will definitely not be resigning my lease",
        "ownerResponse": {
          "text": "Ben, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to hear that the available parking has not met your expectations. While our limited available onsite parking does prevent us from guaranteeing spaces for those who have not added a reserved space to their Housing Agreement, we are actively working to improve onsite enforcement in order to ensure that each and every available space is being utilized by an authorized resident. Do not hesitate to reach out to us at (360) 778-1500 or by visiting the Leasing Office during business hours."
        }
      },
      {
        "author": "Nicholas Kim",
        "rating": 2.0,
        "review": "Good:\n- It is a very nice place, get your own room and bathroom.\n- Very fancy and provides a gym and student shuttle.\n- It provides a lot of furniture and it is gated.\n- Close to Fred Meyer\n\nBad:\n- Its management doesnt do much for students. When students complain, they do nothing about it. They fire a lot of people as well.\n- The students are terrible where you will hear party noises all the time because there is no quiet hours. Even when there are fireworks being launched, management doesn't do anything as well as the police.\n- They can take away the recycle center if they wanted to\n- Far away from campus",
        "ownerResponse": {
          "text": "We appreciate your feedback and if we can assist you in any way please reach out to us at your earliest convenience.  You are more than welcome to stop by the office, contact us at 360.778.1500 or email us at office@nxnw-bellingham.com at your earliest convenience."
        }
      },
      {
        "author": "SUSAN WEST",
        "rating": 1.0,
        "review": "THINK TWICE BEFORE SIGNING YOUR LEASE!\nMy daughter lives here - currently has gone ONE WEEK without hot water... WHY??? They tell her the pipes are frozen...but the cold works just fine. Maintenance says the pipe from the hot water tank to the shower is frozen. Pipes run through inside walls, and if the hot water pipe is frozen, why isn't the cold frozen too?",
        "ownerResponse": {
          "text": "Susan, we are extremely sorry to hear of the ongoing inside you are experience with the hot water in your daughters apartment. Please do not hesitate to have her reach to us, (360) 778-1500, as we are happy to help arrange alternative access to hot water in our model apartment or community clubhouse while we work to correct this frozen pipe issue asap."
        }
      },
      {
        "author": "Linda Merritt",
        "rating": 2.0,
        "review": "Every e-mail you get from them will raise your blood pressure.  They tell you to buy renter's insurance.  You buy policy.  They change insurers.  Insurer charges you for yet another policy.  You dispute new charge, they tag you for NSF fees.  Their error, your time over and over and over.   You'll be in contact with them at least once a month to remove fees for money they're not owed.  If you want to pay them?  Also a fee, for \"convenience\" of $3.99.    The rooms are nice enough, the staff is nice enough.  It's more than nickel and diming, it's constant.  The \"hey, we want to keep your student!\" and other marketing e-mails are constant.  They've wasted enough of my time.",
        "ownerResponse": {
          "text": "Hi Linda, we appreciate you leaving us your feedback.  We tried reaching you but were unsuccessful.  Please give us a call back at your earliest convenience, so we can connect and address your concerns."
        }
      },
      {
        "author": "Tommi Adams",
        "rating": 5.0,
        "review": "Ive lived at Lark for a year now and have yet had to run across any problems. Maintenance has always been extremely fast and ready to fix any problem that is needed. The Lark staff as well works fast and makes sure that everything you need is ready and there for you. Love it here!",
        "ownerResponse": {
          "text": "Hi Tommi, thanks for taking the time to share your experience. We are so happy to hear that you have enjoyed living the Lark lifestyle, and we have enjoyed having you as part of our community. If there's anything we can do for you, let us know!"
        }
      },
      {
        "author": "Ellie",
        "rating": 1.0,
        "review": "Do not move into Lark. I can't make it clearer. Save your money and mental health and find another complex. These people do not care. They will not change any toxic living situations or break leases so you will be stuck in disgusting and terrible living conditions. Please do not take this lightly.",
        "ownerResponse": {
          "text": "Ellie, we regret to hear that you did not enjoy your experience at Lark Bellingham. We are constantly improving to make sure our residents have an enjoyable experience and know that we are always here to assist in anyway. If you would like to discuss your concerns with us further, please email us at live@larkbellingham.com and we will be happy to address your specific concerns."
        }
      },
      {
        "author": "Debbie Tully",
        "rating": 1.0,
        "review": "Be aware of their move out policy. My son paid the penalty fee for an extra 24 hours to vacate his apartment, but staff and vendors cleared it within the 24 hours and without his permission. There was also no system in place: some items were bagged/tagged for him, although many items were tagged incorrectly; some items had been thrown away; and some items were on staff member's desks - it looked like they were keeping things for themselves! Staff were not helpful and simply called it a 'miscommunication within their team'. They did waive the penalty fee. However, there are many important documents and personal items that are now permanently lost. Just be warned!",
        "ownerResponse": {
          "text": "Debbie, thank you for your feedback and review of our community.  Our accounts manager has already spoken with you about this matter. When we go into the apartment upon move out, we do identify items of value and importance, and things that are irreplaceable. This would include documents, electronics, clothes, etc. When it comes to trashing out any other items, this would be any trash that was left such as toiletries, dishes, pans, household items, etc. A holdover fee was assessed due to the apartment still being occupied past his agreement end date. Our staff did reach out to Joseph on move out to explain that there was a fee being assessed, and he confirmed he would be getting his items that night. It is simply a holdover fee for not turning in keys on time, we still take possession of the apartment at that time. As he did not come to remove his belongings that night, at that point, we do go in and begin clearing the apartment.  We did bag and tag his items, and then set it aside in our office for him to come pick them up. If you have any further questions about this, please reach out to our office at 360-778-1500 or office@larkbellingham.com"
        }
      },
      {
        "author": "Kim Robertson",
        "rating": 1.0,
        "review": "I wish there was a zero star...alas but I have to give one.  My son lived there for a year.  Early spring before move out in August he kept getting hammered to sign a lease for the next year.  He did so and then they told him he did not qualify without a co-signer.  I got an email to co-sign for him.  I called them in less than 24 hours after he signed and asked that it be cancelled as he did not qualify and I was between jobs at that time and was not in a position to co-sign and I felt like he could do better than the outrageous rent he was paying there.  The person I spoke with said no problem it would be cancelled.  I again asked, so I will not be getting a final fee for this at move out?  Repoh, definitely not mam we will tear it up.  Even though I provided multiple emails and told them about this conversation I had to pay over 500 bucks or they were going to turn him and myself into collections.  They also charged for an HDMI cord that never existed.  Run, dont walk, away from this place.",
        "ownerResponse": {
          "text": "Kim, we appreciate your feedback and review of your experience at our community.  Thank you for taking the time to further discuss your concerns with us directly after this review.  We're glad we could work out a solution together.  Please do not hesitate to reach out to us if we can assist you further."
        }
      },
      {
        "author": "Sonja Hansen",
        "rating": 4.0,
        "review": "This place was perfect for what I needed - a fully furnished apartment close to Western that offered roommate matching & has solid wifi. I'll be the first to admit that I didn't really take advantage of the test kitchen or play volleyball, but it was always an option. Nice to have a Fred Meyer and a bus stop right by, too.",
        "ownerResponse": {
          "text": "Sonja, thank you so much for your review.  We love our prime location, amenities and multiple transportation options to campus as well. We are sorry to see you leave NXNW, but thank you for being a resident with us while you were a student at WWU!"
        }
      },
      {
        "author": "Monica Weber",
        "rating": 1.0,
        "review": "If I can rate my experience here, it would be 0 stars. They charged me $280 for a replacement dresser when the fix for it could take 5 minutes and 2 screws. They will do anything to get money out of you, including flooding the apartment, then offering no compensation for electricity for the fans THEY put in. I am going to make sure that everyone knows what kind of scam they are signing up for. Extremely unprofessional and disappointed in that $280 charge for a replacement when I know they are just going to put new screws in.",
        "ownerResponse": {
          "text": "Hi Monica, thank you for providing feedback. We are sad to hear that you had an unpleasant experience at Lark. For the dresser, we did have to replace the entire thing. However, as you know, our Resident Services Manager was able to offer you a reduction of the amount of the dresser, resulting in less than the original $280 charge. As for the flood, our maintenance staff was able to address the situation the same day. We would love to address any further concerns you may have.\nPlease reach out to us at Live@larkbellingham.com and we would be happy to talk at any time. Thank you."
        }
      },
      {
        "author": "Kate Welch",
        "rating": 1.0,
        "review": "Be forewarned, they utilize extremely predatory leasing practices and their staff is completely unhelpful in every way. I signed a lease here and attempted to cancel it before move-in and was given the runaround from the staff, who seem to have poor communication skills. It was posed that I had to find a subletter instead of cancelling my lease, which is against the law. I was told by one staff member finally that it was fine and that they'd take care of it and it would be fine. They closed out my online portal account and my access to any signed documents, and I didn't hear from them for a month before receiving an email saying I owed them for the whole term of the lease only two months into the year. I have not seen any reasonable measures on their part to re-rent the unit I was assigned in order to mitigate damages (illegal under RCW 59.18.310). Needless to say, they will be hearing from my family's attorney.  Of all the predatory rental companies in Bellingham, they might be among the worst. Avoid at all costs.",
        "ownerResponse": {
          "text": "Kathryn, I am sorry to hear your experience with NXNW was not what you expected it to be. Someone from the management team has already reached out to you about the back fill process and your spot has already been filled. We are more than willing to discuss your situation further and explain the back fill process and its compliance with Washington State Law. As always, you can call the office at 360.778.1500 or email us at live@nxnw-bellingham.com."
        }
      },
      {
        "author": "Benjamin Follett",
        "rating": 4.0,
        "review": "There are small caveats that I have with NXNW. The gym is a bit small, the maintenance requests took way longer than the ETA, the shuttle still isn't ready, and rent is expensive. All that aside though, this place is very nice and you really get what you pay for.",
        "ownerResponse": null
      },
      {
        "author": "Natalie Storm",
        "rating": 1.0,
        "review": "The 5 star reviews are fake from Asset Plus Company employees. By far the worst apartment management I have ever dealt with. Severely overpriced, false advertising, aggressive/insecure leasing manager Aaron making threats when tenants speak up. Some buildings with no insulation, some sinking into the ground, no parking for a vast amount of residents, horrible security. AND THEY'RE BUILDING ANOTHER ONE called Gather Bellingham, who have a majority of fake reviews from employees in Dallas Texas.\nThey took their reviews entirely off of Facebook because it was so overwhelmingly honest.\nSave yourself. Stay away from here!",
        "ownerResponse": {
          "text": "Natalie, we appreciate your feedback, but we want to make sure that your experience while living at NXNW is an enjoyable one. It is important to us that our residents know that the management office is a resource for them, and we are here to help resolve any issues or concerns to the best of our ability. We have made some staff changes as of this summer to ensure excellent customer service is provided. We have also reached out to a third-party company when this was brought to our attention and had the insulation corrected. In addition, we have also made enhancements with our current security company to further support our residents. Please contact our office should you wish to discuss further, we would be more than happy to address any further concerns with you."
        }
      },
      {
        "author": "Paige Carey",
        "rating": 5.0,
        "review": "I haven't moved in yet, but I am way beyond excited to. As a transfer student I feel like I missed out on making friends since I didn't get to experience the \"dorm life\". But NXNW gives me that chance to have that experience and be connected to the school, all while having my OWN SPACE. (Instead of having to share a room like in the dorm) The service has been great! All staff has been extremely friendly and helpful. Although I was nervous since I have not seen the apartments because they are being built, NXNW updates us with pictures on how the construction is going. I cannot wait for my move in date in September!",
        "ownerResponse": null
      },
      {
        "author": "Simone Sawyer",
        "rating": 3.0,
        "review": "Was a fine experience. But they tried to charge me over $300 to fix a carpet in my room that was damaged before I moved in and I contacted the person who lived in the room after me and they didnt even bother to fix the carpet.",
        "ownerResponse": {
          "text": "Simone, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to hear of the issues you experienced related to carpet replacement and have attempted to reach out to you to discuss your individual experiences. Please do not hesitate to reach out to us at live@larkbellingham.com or (360) 778-1500."
        }
      },
      {
        "author": "Thnh L",
        "rating": 5.0,
        "review": "This apartment has modern decoration, during this pandemic time staff are so nice and helpful. My roommates are the best roommates I ever had, they are so nice. The best way to enjoy college life.",
        "ownerResponse": {
          "text": "Hi Ken,\n\nThank you for your response. We love seeing you tag us on social media and are glad you are having a nice time here."
        }
      },
      {
        "author": "Jared Strand",
        "rating": 1.0,
        "review": "My daughter has had nothing but bad things to say about her experience here. This place dresses up the common areas to sell it to parents but it is an unmanaged, dangerous complex.\nHer roommate violated her property, brought home a boyfriend with a restraining order, and her cat had fleas.\nManagement REFUSES to respond to her unless her parents call, despite her being an ADULT and being proactive in contacting them.",
        "ownerResponse": {
          "text": "Jared, we are sorry that your daughter seems to have some unresolved issues with NXNW from last year's leasing term. Please note that as of last spring, NXNW was acquired by new ownership and management. A member of our management team will be reaching out to you directly. In the mean time if you have any questions or concerns always feel free to contact us at live@nxnw-bellingham.com"
        }
      },
      {
        "author": "Justin Taylor (J_ Taylor)",
        "rating": 1.0,
        "review": "Nice new place.  600 parking spots needed. 400 parking spots provided.  You do the math every evening trying to park, and parking blocks away in unsecured areas. NEEDS PARKING\n\nAlso management needs to make repairs *still* from new construction bullet list.",
        "ownerResponse": {
          "text": "Justin, we appreciate your feedback concerning the parking at NXNW.  We were recently acquired by new ownership and are undergoing some improvements.  If we can help address any concerns or issues that you might still have, please stop by the office or email us at office@nxnw-bellingham.com at your earliest convenience.  We look forward to hearing from you soon."
        }
      },
      {
        "author": "Holly Hobby",
        "rating": 1.0,
        "review": "Always take photos when you move in or out. These people will charge you a fee if theres a fly in the apartment. They will also take their damages that were there already from the previous tenant and charge you. Beware.",
        "ownerResponse": {
          "text": "Holly, thank you for taking the time to share your experience with Lark Bellingham. Because it is always our number one priority to provide or residents with the best places to live while maintaining fair and consistent policies, we would greatly appreciate you reaching out to us at live@larkbellingham.com so that we can discuss your individual situtaion and make any adjustments as required."
        }
      },
      {
        "author": "Steven Stiles",
        "rating": 3.0,
        "review": "Parking here is garbage. Paying $30 extra monthly for parking does not guarantee you a spot. However the complex is fairly nice and new and the amenities are useful. The staff is usually friendly and willing to help.",
        "ownerResponse": {
          "text": "Steven, we are sorry to hear that your experience with our reserved parking has not gone as expected.  The additional $30 is for the reserved parking, and we encourage our residents to call the office if someone is parked in your spot.  We have an operator who will direct your call to one of the two managers who will assist you with towing.  If we can answer any further questions for you, please do not hesitate reaching out to us."
        }
      },
      {
        "author": "Annabel Jordan",
        "rating": 4.0,
        "review": "I like having my own bathroom and I do think the price is worth it, the 24/7 gym is also a plus. I wish there was more parking but overall a good place to live",
        "ownerResponse": {
          "text": "Hi Annabel, thank you for your review. We are glad to see that you are enjoying living at Lark, thanks for being a part of our Lark family!"
        }
      },
      {
        "author": "James Mitchell",
        "rating": 1.0,
        "review": "DO NOT PAY FOR PARKING. They will charge you money for reserved parking and do absolutely nothing about people who don't pay for parking taking up the reserved spots. They do nothing about issues and just play games with you over email. The management at this complex is absolutely awful.",
        "ownerResponse": {
          "text": "James, our Resident Services Manager has attempted to reach out to you about the proper procedure for reporting an improperly parked vehicle since due to Washington State laws we cannot patrol the parking lot. We have also attempted to schedule a meeting with you so we can discuss your concerns directly, but you did not come to the meeting. Our office will be reaching out to you again, so we can hopefully schedule a time to address your concerns further."
        }
      },
      {
        "author": "Mark MacDonald",
        "rating": 5.0,
        "review": "Great place to work and live with helpful and supportive staff members. There's a large community vibe thanks to the volleyball courts, BBQ's, fire pits and ping pong tables available to all residents in the courtyard. Love being a part of the team and NXNW community.",
        "ownerResponse": null
      },
      {
        "author": "Karl Denby",
        "rating": 5.0,
        "review": "Over hated. Not 5 stars but this is my attempt to balance it.",
        "ownerResponse": {
          "text": "Thank you so much for taking the time to leave your feedback. Please feel free to reach out and let us know how we can earn your 5-star review. You can email us at live@larkbellingham.com, or stop by for a chat."
        }
      },
      {
        "author": "Ali Nazy",
        "rating": 5.0,
        "review": "I have enjoyed my time living at Lark Bellingham and I am looking forward to another year of living here! The staff is very accommodating and friendly. They make sure any issues that come up are taken care of quickly and efficiently! I would recommend living here!",
        "ownerResponse": {
          "text": "Hi Ali, thank you so much for your wonderful feedback! We enjoy having you as a resident with us. We can't wait to start the new term. Please reach out if you ever need anything."
        }
      },
      {
        "author": "Eric Jensen",
        "rating": 5.0,
        "review": "I have lived here half a year. Loved it already and have renewed as well as upgraded for next year. Verry pretty, has alot of little services that are very useful. Large rooms",
        "ownerResponse": {
          "text": "Eric, we appreciate your review and are glad you decided to live with us for another year.  We are glad you are enjoying the many amenities we offer our residents in the clubhouse. Please let us know if there is anything else we can do for you."
        }
      },
      {
        "author": "Kaylie Kummer",
        "rating": 5.0,
        "review": "I love it here!  The staff are all so friendly, and the main areas are really nice.  My apartment is perfect, and I have not had any problems with anything!",
        "ownerResponse": {
          "text": "Hi Kaylie,\n\nThank you for your feedback. We are so glad to hear that you are enjoying living here! Don't hesitate to reach out if you ever need anything."
        }
      },
      {
        "author": "HUSSAM Alsubaie",
        "rating": 2.0,
        "review": "It's a good place to live in however, there is now spots to park and its not save to park your car in some of it's parking, it's dark and no cameras are which makes it easier to be stolen and that had happened alot",
        "ownerResponse": {
          "text": "Thank you for taking the time to share your experiences in living at Lark Bellingham. We are sorry to hear of the challenges you have been experiencing related to parking onsite. As our management team works diligently to implement additional parking enforcement and security procedures, we would love for you to call our swing by the leasing office to further discuss your individual experiences."
        }
      },
      {
        "author": "Courtney Neveu",
        "rating": 5.0,
        "review": "the staff is amazing and whenever I have questions, they make sure that they get back to you the same day fi I emailed them about my concerns. I am really excited to move in to my new apartment!!.",
        "ownerResponse": null
      },
      {
        "author": "joel con",
        "rating": 2.0,
        "review": "Parking is atrocious as well as the cleanup of the dumpster area. As far as the help is concerned with requests it is usually just figure it out yourself.",
        "ownerResponse": {
          "text": "Joel, thank you for taking the time to leave us a review. We are sorry to hear your experience with us has not been a positive one but we are grateful for the feedback. To address concerns over parking, we have implemented a new parking system for the upcoming year, with assigned spaces on each reserved parking pass. As for the dumpster area, we hear your concerns and are working diligently on creating a new system to ensure that trash and recycling guidelines are being followed to ensure trash is picked up in a timely manner by the city. Please don't hesitate to reach out to us at (360) 778-1500 or live@larkbellingham.com to discuss your concerns in more detail."
        }
      },
      {
        "author": "Athena McCormack",
        "rating": 4.0,
        "review": "I absolutely love Lark! The only complaint that I have is that the trash and recycling are often always overflowing, but other than that the staff is great and so are my neighbors!",
        "ownerResponse": {
          "text": "Hi Athena, Thank you so much for your feedback. We have recently been able to add cardboard recycling back to our property and hope that the trash overflows less now. We are glad to hear you are having a nice time here!"
        }
      },
      {
        "author": "Tanyia Tweten",
        "rating": 5.0,
        "review": "I was just cleaning out the apartments before the new kids moved in. I would totally want to live here if I was in Uni",
        "ownerResponse": {
          "text": "HI Tanyia, thank you for the positive feedback! We are happy to hear about your perception of our community. Please do not hesitate to reach out if you have any questions!"
        }
      },
      {
        "author": "ShelbyElyse",
        "rating": 5.0,
        "review": "Above and beyond staff! I love the office, they are professional and empathetic people:) the maintenance manager is also very kind!",
        "ownerResponse": {
          "text": "Thank you for your review, Shelby! We are happy to hear that our staff was able to make a tough situation better for you. We value you as a member of our community. Please don't hesitate to reach out again in the future (360) 778-1500."
        }
      },
      {
        "author": "Medo _",
        "rating": 5.0,
        "review": "Lark is a great place to live in, there is only one problem you could have, the parking",
        "ownerResponse": {
          "text": "Thank you so much for taking a moment to leave us your feedback. We do our best to give every resident a five star experience at Lark Bellingham and it makes our day when someone recognizes our efforts. Thank you so much for being a valued member of our Lark Bellingham Community."
        }
      },
      {
        "author": " ",
        "rating": 5.0,
        "review": "Been living here for a year. No problems so far. Office is always ready to help you with any kind of problems and the maintenance is super fast here",
        "ownerResponse": {
          "text": "Hi, thank you for your review. We are glad to see that you are enjoying living at Lark, thanks for being a part of our Lark family!"
        }
      },
      {
        "author": "Nolan Stansberry",
        "rating": 5.0,
        "review": "I had a problem logging in and called the main building and I wasnt really in a good mood because of it and the girl who picked up the phone was a named McKenzie R. And she was so helpful and was so nice on the phone she was the 3rd person I have met there and they all had the same wonderful costumer service",
        "ownerResponse": {
          "text": "Nolan, thank you for taking the time to share you positive customer experience with a member of our Experience Team Member staff. We pride ourselves on providing the best place for students to live, and the best customer experiences in Bellingham. Thank you for choosing Lark Bellingham!"
        }
      },
      {
        "author": "Cindy Howard",
        "rating": 1.0,
        "review": "Nice place but be prepared to pay rent for 2 weeks that you can't even live there and the false advertising on their website about \"plenty of onsite parking options\".",
        "ownerResponse": null
      },
      {
        "author": "Linnea Nordquist",
        "rating": 5.0,
        "review": "so sweet. love the office people.",
        "ownerResponse": {
          "text": "Linnea, thank you for leaving us this kind review and sharing your experiences at Lark Bellingham. We love our staff too!"
        }
      },
      {
        "author": "Madeline Brusky",
        "rating": 5.0,
        "review": "Lark has awful sound deadening windows and no way to speak with management or security after hours. Good luck",
        "ownerResponse": {
          "text": "Hey Madeline, thank you for taking the time to share your experiences and feedback with us, we greatly value your input. We strive to address any issues that may arise in timely and  at Lark Bellingham in an efficient manner."
        }
      },
      {
        "author": "Victoria Carlson",
        "rating": 5.0,
        "review": "Being a continuing resident and employee at NXNW has been a blessing. I wouldnt want to live anywhere but here, in Bellingham.",
        "ownerResponse": {
          "text": "Thank you for your review, Victoria.  We are happy to have you as a resident and employee as well."
        }
      },
      {
        "author": "Jasmine",
        "rating": 1.0,
        "review": "Not enough windows and there are no normal apartments",
        "ownerResponse": {
          "text": "Hi Jasmine, thank you for taking the time to leave your feedback. We're sorry that your visit with us didn't live up to your expectations. As a complex that is designed to serve our local student population, we have some unique features that include walk in closets and private baths in each bed space. Feel free to call us (360)778-1500 with any specific questions or concerns, and we will be happy to chat with you further."
        }
      },
      {
        "author": "Marian Bills",
        "rating": 5.0,
        "review": "Phenomenal staff and friendly community! Apartment is well designed and comfortable",
        "ownerResponse": {
          "text": "Hi Marian,\n\nThank you so much for your review! We appreciate your feedback. Please reach out if you ever need anything -- we're always here to help."
        }
      },
      {
        "author": "Austin pieper",
        "rating": 5.0,
        "review": "The staff is always friendly, They have lots of green space for my dog.",
        "ownerResponse": {
          "text": "Austin, thank you for the review!  We love all of our furry resident's and are glad they enjoy the green space to play and have fun."
        }
      },
      {
        "author": "Trenton Shaflik",
        "rating": 5.0,
        "review": "I can tell from the organization the staff has, along with their friendliness, living here is going to be amazing! So fricken excited",
        "ownerResponse": null
      },
      {
        "author": "Ceci Vazquez",
        "rating": 5.0,
        "review": "Nice and clean 5 min from downtown and 2 min from Fred Meyers woods coffee little cesar",
        "ownerResponse": {
          "text": "We appreciate your feedback and glad to see you are enjoying our close proximity to local amenities."
        }
      },
      {
        "author": "Sam Magno",
        "rating": 5.0,
        "review": "Heard they use to have the number 1 ranked tourer on the west coast, very impressive!",
        "ownerResponse": {
          "text": "Sam, thank you for your review and kind words about our staff.  It is true according to J Turner that we had two of the top rated Housing Consultants on the West Coast for giving tours.  Our staff is always here to assist our residents in the best way we can."
        }
      },
      {
        "author": "Aimee Bordeaux",
        "rating": 1.0,
        "review": "DON'T GO HERE. For the love of god, this complex is absolutely horrible. Stay away from it like the plague.",
        "ownerResponse": {
          "text": "Hi Aimee, thank you for taking the time to provide feedback. We would like to discuss your experience at Lark Bellingham but we are failing to find you in our system.  Please email us at live@larkbelligham.com or call the office at 360-778-1500 so we can further discuss your experience and work towards solutions."
        }
      },
      {
        "author": "Saience Vanadium",
        "rating": 4.0,
        "review": "Really nice and safe place to live",
        "ownerResponse": {
          "text": "Thanks for your positive feed back. We work hard to make our community a great place to call home. Please don't hesitate to reach out if there's anything we can do for you!"
        }
      },
      {
        "author": "Mister Latro",
        "rating": 1.0,
        "review": "If you like fleas, you'll love Lark!",
        "ownerResponse": {
          "text": "We are extremely sorry to hear that you have experienced an issue related to fleas at Lark Bellingham. We are unable to contact you with your screen name, so please do not hesitate to reach out to us immediately at (360) 778-1500, live@larkbellingham.com or by visiting our leasing office. We want to make sure we can assist you as soon as possible."
        }
      },
      {
        "author": "Henry Leenstra",
        "rating": 5.0,
        "review": "Amenities are always nice and the neighborhood always feels safe, as it is gated.",
        "ownerResponse": null
      },
      {
        "author": "Ethan Forsberg",
        "rating": 5.0,
        "review": "Love it here! Staff is amazing and accommodations are priceless!",
        "ownerResponse": {
          "text": "Hi Ethan, thank you so much for the kind comment. We love having you stop by the office as well as having you as a resident. Please reach out if you ever need anything!"
        }
      },
      {
        "author": "adam poss",
        "rating": 4.0,
        "review": "Staff is awesome and helpful can't wait to get into my be apartment",
        "ownerResponse": null
      },
      {
        "author": "Zachary Toombs",
        "rating": 3.0,
        "review": "Everyone who lives there can't stop talking about one of two things, the huge appartments or the crappy parking.",
        "ownerResponse": {
          "text": "Zachary, thank you for your review about our property. In regards to our parking lot, it was constructed based on the city zoning laws and is in compliance with those regulations. We do offer reserved parking, if our residents want to ensure they have a guaranteed parking spot. Otherwise we offer first come, first serve general parking to residents and designated visitor parking spots for our guest. If you would like to discuss parking or any other amenities at our property, please feel free to reach out to our office at live@nxnw-bellingham.com or by phone at 360.778.1500."
        }
      },
      {
        "author": "Richard Peterson",
        "rating": 5.0,
        "review": "Brand new housing units! Very nice residences for students !",
        "ownerResponse": {
          "text": "Richard, we are glad to see that you are enjoying your apartment and are having a great experience while living at NXNW.  If we can assist you in any way, please don't hesitate to stop by the office or contact us at your earliest convenience."
        }
      },
      {
        "author": "MJ Barrett",
        "rating": 1.0,
        "review": "They really don't understand how to investigate people who are drinking under age and smoking pot underage.",
        "ownerResponse": {
          "text": "Maegan, we are sorry to hear your experience with NXNW has not been a positive one. We would love to speak with you further about your experience with us, but based on our records we do not have you as a current or past resident with us and are unable to contact you directly. Please feel free to call us at 360.778.1500 or email us at live@nxnw-bellingham.com at your earliest convenience."
        }
      },
      {
        "author": "Quinton Rundell",
        "rating": 5.0,
        "review": "Its cool for sure dont know what it is but aparently ive been there",
        "ownerResponse": null
      },
      {
        "author": "Shachaf zm",
        "rating": 5.0,
        "review": "Best place to live at. Close to WWU, AMAZING for the price",
        "ownerResponse": {
          "text": "Shachaf, thank you for your feedback! We are happy to hear you are enjoying your time as an NXNW resident."
        }
      },
      {
        "author": "Amanda Marie",
        "rating": 5.0,
        "review": "The two kenzies that work here are so sweet and helpful!!!",
        "ownerResponse": {
          "text": "Amanda, thank you for taking the time to share your experience with the staff at Lark Bellingham. We think we have a pretty amazing team too!"
        }
      },
      {
        "author": "Madison Roper",
        "rating": 3.0,
        "review": "Great apartment & amenities but poor communication & parking.",
        "ownerResponse": null
      },
      {
        "author": "Keith Strom",
        "rating": 5.0,
        "review": "Has a market area that sometimes have communal treats.",
        "ownerResponse": {
          "text": "Keith, we appreciate your review.  We love our market area as well, and if there is anything you would like to see more of in the market please let us know."
        }
      },
      {
        "author": "Kyle Rochelle",
        "rating": 5.0,
        "review": "Nice student housing. I was only a vistor though.",
        "ownerResponse": {
          "text": "Kyle, we appreciate you taking the time to give us a review.  We would love for you to make NXNW your home next year.  If we can be of any assistance, please do not hesitate reaching out to us."
        }
      },
      {
        "author": "Bella Yoho",
        "rating": 1.0,
        "review": "Stop littering all over WWU's campus!",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave us a rating. We appreciate you reaching out about your concerns and due to your feedback, we requested and received approval from our parent company to eliminate our flying efforts on campus. If you'd like to discuss further, please reach out at (360) 778-1500 or at live@larkbellingham.com at your earliest convenience."
        }
      },
      {
        "author": "Annette Nicole",
        "rating": 5.0,
        "review": "Super convenient and the staff is so friendly!",
        "ownerResponse": {
          "text": "Annette, thank you so much for your review.  We love hearing that you enjoy living at NXNW and have renewed your lease for next year!"
        }
      },
      {
        "author": "Kristina",
        "rating": 5.0,
        "review": "Clean and stylish apartments!",
        "ownerResponse": {
          "text": "Kristina, thank you so much for your review. NXNW strives to offer top of the line customer service and apartments in the Bellingham student housing marketing. If you ever have any questions about our community do not hesitate to reach out to us!"
        }
      },
      {
        "author": "Steve Skippy Austin",
        "rating": 1.0,
        "review": "Age discrimination at its finest.",
        "ownerResponse": {
          "text": "Steve, we are sorry your experience with NXNW has not been a positive one.  We abide by equal opportunity housing, HUD and Fair Housing laws, and currently offer two different leasing styles depending on if you are enrolled in a higher education program. If you are of a non-student status, you would sign an agreement for an entire apartment versus an individual bed space. We would love to discuss this further with you however, you are not listed in our system as having applied or lived at NXNW, so we cannot reach out to you directly. Please feel free to call us at 360.778.1500 or email us at live@nxnw-bellingham.com at your earliest convenience."
        }
      },
      {
        "author": "Jay Lock",
        "rating": 1.0,
        "review": "Don't. Just don't.",
        "ownerResponse": {
          "text": "Hi Jay, we are sorry to see you have had a less than perfect experience. We tried to find your contact information and were unable to locate it in our system. We would like the opportunity to speak with you and resolve any concerns you may have. Please reach out to our team at your convenience at (360)778-1500 or live@larkbellingham.com."
        }
      },
      {
        "author": "Stephen Murphy",
        "rating": 1.0,
        "review": "Worst complex ever",
        "ownerResponse": null
      },
      {
        "author": "Tuesday King",
        "rating": 5.0,
        "review": "uhhh-mazing",
        "ownerResponse": {
          "text": "We are so glad to see that you are enjoying your experience while living at NXNW.  We hope you are having a great summer and if we can assist you in any way, please contact us or stop by the office."
        }
      },
      {
        "author": "Rhonda Binschus",
        "rating": 3.0,
        "review": "Just walked by",
        "ownerResponse": {
          "text": "Rhonda, we appreciate your review and would love the opportunity to give you a tour of our property. We are open seven days a week, so if you are interested in learning more of what NXNW has to offer stop by at your convenience."
        }
      },
      {
        "author": "Sam Serati",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Sam, we are sorry to hear that your experience at Lark didn't live up to your expectations. Feel free to reach out to us with details by emailing Live@LarkBellingham.com."
        }
      },
      {
        "author": "Ethan Kromer",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave a review. We are glad to hear that you had a positive experience with us. We strive to provide the best service possible and would love to hear more about your experience so we can continue to improve. Please feel free to reach out to Live@LarkBellingham.com  and share any feedback you may have."
        }
      },
      {
        "author": "Roma Couvillion",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Toma, thank you for taking the time to leave a review. We strive to provide 5-star service every time, and it is good to know when we hit that mark. Please feel free to reach out to us and share more details about your experience. (360)7881500 or Live@LarkBellingham.com"
        }
      },
      {
        "author": "qing li",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "We are sorry that Lark Bellingham didn't meet your housing expectations. Please feel free to contact us with more details and let us know how we can improve your experience. You can reach us by calling (360)778-1500 or emailing Live@LarkBellihgham.com."
        }
      },
      {
        "author": "Lennon Ashley",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Lennon, thank you for taking the time to share your experience with us. We are thrilled to see that your time at Lark Bellingham has been a great one. Please feel free to reach out to us at Live@larkbellingham.com if there is anything we can help you with!"
        }
      },
      {
        "author": "Cameron Carl",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Cameron, thank you for the 5-star review! We are happy to see that you had a positive experience at Lark Bellingham, and we will continue striving to make your time here enjoyable. Please do not hesitate to reach out to us at live@LarkBellingham.com if you need anything."
        }
      },
      {
        "author": "Hailee Farrell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hey Hailee, thank you for leaving this kind review. At Lark Bellingham we prioritize the way our community is perceived, so we are glad that you are enjoying it here. Please feel free to reach out to us at  (360) 778-1500 if we can ever assist you!"
        }
      },
      {
        "author": "MJ Barrett",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Maegan, thank you for taking the time to share your experiences at Lark Bellingham. It was great to speak with you about your emergency maintenance issue and the proper procedures for reporting emergency maintenance requests 24/7 by calling our office at (360) 778-1500 and selecting the option for emergency maintenance. Do not hestitate to reach out to us if we can be of assistance in any way."
        }
      },
      {
        "author": "Justin",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Justin, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to here that your experiences did not meet your expectation and encourage you to reach out to us via phone at (360) 778-1500, by email at live@larkbellingham.com, or by visiting our office during business hours as we would love an opportunity to discuss your individual experiences and what we can do to improve in the future."
        }
      },
      {
        "author": "Justin Anderson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Justin, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to here that your experiences did not meet your expectation and encourage you to reach out to us via phone at (360) 778-1500, by email at live@larkbellingham.com, or by visiting our office during business hours as we would like an opportunity to discuss your experiences and what we can do to improve in the future."
        }
      },
      {
        "author": "Juev",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Juev, Thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to hear that your experiences did not meet your expectation and encourage you to reach out to us via phone at (360) 778-1500, by email at live@larkbellingham.com, or by visiting our office during business hours."
        }
      },
      {
        "author": "GhostAlex73",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Alex, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to here that you had a less than satisfactory experience and would love an opportunity to discuss your individual experiences. Do not hesitate to reach out to out via phone at (3360) 778-1500, via email at live@larkbellingham.com, or by visiting our leasing office during business hours."
        }
      },
      {
        "author": "Aidan Corbin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Aidan, we are glad to hear that you are enjoying living at Lark! Don't hesitate to reach out to us at live@larkbellingham.com if you ever need anything."
        }
      },
      {
        "author": "John Mitchell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "John, thank you for taking the time to share your experiences with Lark Bellingham. We are extremely happy to hear that we have been able to provide you with 5 star service. "
        }
      },
      {
        "author": "Michael Brettin",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Michael, Thank you for taking the time to leave us a review! We would love to hear from you at live@larkbellingham.com or via phone at (360) 778-1500 to learn how we could have made this a 5 star experience."
        }
      },
      {
        "author": "Mitchell Feragen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Mitchell,  Thank you for taking the time to share your experiences with Lark Bellingham, we have reached out to you to further discuss your individual experiences and would greatly appreciate you calling us at (360) 778-1500, emailing us at live@larkbellingham.com, or visiting our office during business hours."
        }
      },
      {
        "author": "Adam Holston",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Adam, thank you for your feedback on your experience here at Lark Bellingham. We strive to provide the best experiences to all and are saddened to read that your time here has not met your expectations. We'd like the chance to discuss any issues or concerns you may have. Please stop by the office or reach out to us at live@larkbellingham.com so that we can try to resolve your concerns."
        }
      },
      {
        "author": "S R",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to share your experiences with us here at Lark Bellingham. We would greatly appreciate you reaching out to us via email at live@larkbellingham.com or by calling (360) 778-1500 to further discuss your individual experiences."
        }
      },
      {
        "author": "Mady",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Maddy, we are sorry to hear of the issues you are experiencing related to parking onsite at Lark Bellingham. As the Management team works to implements additional policies and procedures to address these ongoing issues, we would greatly appreciate you reaching out to us via phone or email so that we further address your needs."
        }
      },
      {
        "author": "Brianna Werner",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Brianna, thank you for reaching out to share you experiences with Lark Bellingham. We are very sorry to hear that you have been dissatisfied with your living experience and we would love an opportunity to further discuss the details of your individual experiences. As always, our number one goal is to pprovide amazing places to live with fair and cinsistant policies for all of our residents."
        }
      },
      {
        "author": "Claire Nickols",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Claire, thanks for taking the time to share your experience. We are happy to hear that you have enjoyed living the Lark lifestyle, and we have enjoyed having you as part of our community. If there's anything we can do for you, let us know!"
        }
      },
      {
        "author": "Desirae Bradley",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Desirae, we are extremely sorry to hear of your negative experience. As always, we strive to make Lark Bellingham the best possible place to live for all our residents. We would love to hear from you to address your individual situation and to get your valuable feedback. At your earliest convenience please call our office at (360) 778-1500 so that we can work towards ways to improve."
        }
      },
      {
        "author": "Holly Chavet",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Holly, thank you for sharing your feedback with us. We always aim to exceed expectations, so we're sorry to hear they were not met. We rely on feedback from our community so that we can address concerns, please don't hesitate to reach out if you'd like to discuss them further (360) 778-1500."
        }
      },
      {
        "author": "Peter Geissler",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Peter, thank you for sharing your feedback with us. We hope all our residents have a great experience at our community and are sorry to hear that your expectations weren't met. We rely on feedback from our residents so that we can address concerns. Please reach out to us at live@larkbellingham.com to tell us more specifics about your experience so we can continue to improve the overall community and resident experience."
        }
      },
      {
        "author": "Aliyah Zullo",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave us a rating. We attempted to reach out to you earlier today to discuss how we can improve your experience but were unable to reach you. Please reach out at (360)778-1500 or at live@larkbellingham.com at your earliest convenience so that we can address and improve your experience at our community."
        }
      },
      {
        "author": "Morgan Mitchell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Morgan, thank you for your review. We are glad to see that you are enjoying living at Lark. We appreciate you taking the time to give us feedback."
        }
      },
      {
        "author": "Haylee Hines",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hey Haylee, our General Manager attempted to reach out to you to see if we could address your concerns, but unfortunately we were not successful in reaching you. Please reach back out to us at (360) 778-1500 or at live@larkbellingham.com if you would like to discuss the issues you were faced with during your time here. Thank you."
        }
      },
      {
        "author": "hoodlum ninja",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi there, we are sorry to hear that you had an unpleasant experience at Lark. Unfortunately, we are unable to find your contact information in our database to reach out to you directly. Please kindly reach out to us at Live@larkbellingham.com so we can address any of your further concerns."
        }
      },
      {
        "author": "Zoe",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hey Zoe, We are sorry to see you had a less than perfect experience here. We tried locating you in our system to reach out and discuss your experience with us further. Unfortunately we could not locate your contact information. If you would like to share feedback us, please reach out at your earliest convenience, and we will be happy to chat (360)778-1500."
        }
      },
      {
        "author": "Kiya Coon",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Kiya, we regret to learn that you are not enjoying your experience to the fullest extent.   After looking into your account, we noticed you did have a few service request that we were able to address for you.  If you are still experiencing issues, please do not hesitate giving us a call so we can be sure to address them for you as well. Each year we have a hefty wait list of new prospects that would like to join the Lark Bellingham experience, so want to ensure that our current residents have the opportunity to confirm their housing first.  If you would like to discuss your concerns further, please feel free to stop by the office or e-mail us at live@larkbellingham.com."
        }
      },
      {
        "author": "Karissa Renteria",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hey Karissa, Thanks so much for your positive review! Please feel free to reach out anytime and we would be happy to help keep your experience with us great. (360)778-1500"
        }
      },
      {
        "author": "Emily Cohen",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Emily, here at Lark Bellingham, the most important thing for us is the experience of our residents. That is why we interact on our Instagram to connect with you all, we offer community events for our residents to interact with us and other residents. With the shuttle running every day M-F throughout the academic year, there are going to be times where the shuttle service maybe out. A great thing about our location is that there are multiple WTA stops right in front of our complex that you are able utilize if our shuttle is not running. Parking is limited on our property, that is why we offer two types of parking, Reserve and Resident.  We would love the opportunity to discuss your experience further.  Please stop by the office or email us at live@larkbellingham.com."
        }
      },
      {
        "author": "abdulaziz aldossary",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Aziz, thank you for the positive review. We enjoyed having you as a resident with us!"
        }
      },
      {
        "author": "Tyler Houtsma",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Tyler for the positive review! We appreciate it."
        }
      },
      {
        "author": "Amanda Gale",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Amanda, we are glad to see that your experience has improved since your previous review.  Please do not hesitate reaching out to us if we can be of any assistance."
        }
      },
      {
        "author": "Garnet Droppo",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "James Mitchell",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "James, we regret to learn that you are not enjoying your experience at our community. Our staff works hard to provide a great experience for all our residents and guests. We would welcome the opportunity to discuss your concerns and issues directly with you, please e-mail us at live@larkbellingham.com at your earliest convenience."
        }
      },
      {
        "author": "Demarcus DeLaCruz",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Demarcus, we regret to learn that you are not enjoying your experience at our community.  Our staff works hard to provide a great experience for all our residents and guests.  We would welcome the opportunity to discuss your concerns and issues directly with you, please e-mail us at office@larkbellingham.com at your earliest convenience."
        }
      },
      {
        "author": "Corryn Johnson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joshua Reid",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Joshua, we have already reached out to you to discuss your experience with our property, but did see you recently moved out and had a question about our move out process and refunds. At your earliest convenience please give us a call back at (360) 778-1500 or e-mail us at office@larkbellingham.com and we would be happy to assist you in anyway that we can."
        }
      },
      {
        "author": "Douglas Baumgardner",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Douglas, we are sorry to hear that your experience with our community was not a positive one.  I know we were recently in contact with you concerning your renters liability insurance, and the requirement for each individual to have their own policy.  If there is anything else we can assist you with, please reach out to us at your earliest convenience.  We want to ensure that your time here is an enjoyable one."
        }
      },
      {
        "author": "Stephen Mohan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Luis Carbajal",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "BarakaAllahu_ Feek",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "James Hafner",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "George Martinez",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Luis Carbajal",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Elyzabeth Torres",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Laura Hentges",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Laura, we are sorry to hear your experience with NXNW has not been a positive one. We would love to discuss your situation further. A member from our management team has reached out to you and we look forward to hearing from you soon, so we can discuss your concerns further."
        }
      },
      {
        "author": "Kel Ly",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Kelly, we are sorry to hear your experience with NXNW has not been a positive one. We currently do not have your contact information, but would love to reach out to you and discuss the situation in more detail. It is always our priority to be providing the best customer service possible. Feel free to reach out to our office at 360.778.1500 or at live@nxnw-bellingham.com"
        }
      },
      {
        "author": "Caleb Guenther",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Caleb, we are sorry to see your experience with NXNW has not been a positive one. A member from our management team reached out and left you a voicemail, so we can hopefully resolve any current issues you are having. Please call us at 360-778-1500 or email us at office@nxnw-bellingham.com."
        }
      },
      {
        "author": "Blake Talbot",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Blake, thank you for your review! We would love to hear more about your experience living with NXNW last year as a resident. A member of our management team has reached out to you. Please feel free to give us a call or email the leasing office with comments or questions at office@nxnw-bellingham.com."
        }
      },
      {
        "author": "MrPokeStone",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Clare Burkhardt",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "James Williams",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jessica Fancher",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Dannina",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Garrett S.",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Emily M",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Celissa Celestial",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Garrett Lepoidevin",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Noat Fakei",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kailyn Warner",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "A4Haylee",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cass Skye Howlett",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Eli",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Elijah, we are sorry to see that you may have some unanswered questions or concerns.  If we can be of any further assistance, please reach out to us at your earliest convenience at office@nxnw-bellingham.com."
        }
      },
      {
        "author": "Elana Monique",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ed Franco",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Hannah McCullough",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We are happy to see that you are having a great experience at NXNW and are enjoying all that we have to offer our residents.  Please don't hesitate to reach out to us if we can help in any way.  We hope you are enjoying your summer!"
        }
      },
      {
        "author": "Allen Murray",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Allen, we encourage you to reach out to us at your earliest convenience, so we can help address any concerns or issues you may be experiencing.  You can reach us at 360.778.1500 or email us at office@nxnw-bellingham.com.  We look forward to hearing from you soon!"
        }
      },
      {
        "author": "Wren Rhodes",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Emily, we regret to see that your experience thus far has not been what you expected. If we can assist with any specific issues or concerns, please reach out to our Management Staff at your earliest convenience so we can ensure those are properly addressed."
        }
      },
      {
        "author": "Alison Mowry",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Alison, we are sorry to see that you may be experiencing some issues or have some concerns.  We want you to know that we are here to assist our residents in any way we can.  Please contact us, stop by or email us at office@nxnw-bellingham.com at your earliest convenience."
        }
      },
      {
        "author": "Marissa",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Marissa, we appreciate your feedback but want you to know that we are here if we can assist you in any way.  We hope you are enjoying your summer and please stop by the office or email us at office@nxnw-bellingham.com if we can help address any of your concerns."
        }
      },
      {
        "author": "Salvatore Cindrich",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Aaron Lutz",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Aaron, we appreciate your feedback and are happy to see that you are enjoying your experience at NXNW.  If we can be of any assistance, please do not hesitate to reach out."
        }
      },
      {
        "author": "Nate Haisch",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Gavin Leinen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Josh",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Matthew",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Maggie Wang",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Scott Rhodes",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Season Rovang",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Emma B.",
        "rating": 3,
        "review": "Brand new apartments, although they do have their ups and downs it's not terrible. \n\nI do love the locations and the rooms themselves are quite nice. Buying a parking spot is a MUST though. The shuttle is very convenient as well. \n\nThere are problem here a there like the lack of security presence, especially when it comes to noise complaints at night. And the Internet connection can be a pain, it often cuts out. \n\nOverall the biggest thing to be said is they are new apartments, so I don't expect perfection but they are very nice and if things continue to go well I will renew my lease for sure!!",
        "ownerResponse": null
      },
      {
        "author": "Sam K.",
        "rating": 1,
        "review": "Lark Bellingham is one of the worst possible places you could choose to live. It is a gilded, faux posh crap show that would be just as happy to cover you in a thin coating of cheap paint to hide the issues.\n\nLet's get the big one out of the way, parking. You have def heard it before but I'm gonna lay it for you again because it's just that bad. If you don't have a reserved spot, (which are $60 a month mind you for a total of $720 a term, nearly an entire month of rent somewhere else), you are completely screwed. They don't have anywhere near enough spots and don't limit how many people they give the basic pass so you will be constantly fighting for parking and if you try and get help from them they will basic tell you to f-off, yeah this is what I'm paying over $1k a month for. You will get a little burst if anxiety every single time you come back and thats no way to live. You should be able to feel most secure with your car at your apartment not the least.\n\nHowever that's not all, the place itself also is awful. Everything's cheap and will break, the appliances, the blinds, the lights. You will need to make several maintenance requests a year just to ensure when you move out you don't lose your security deposit because of lark cheap corner cut. Which is once again surprising considering just how expensive it is. \n\nThe community is also awful, from late night and very loud parties on weekdays, to the constant aroma of drugs that persists everywhere you know it's not a nice establishment. On occasion residents will actually pretend to be staff to try and bully you out of a parking spot. The staff aren't any better they range from generally unhelpful to outright antagonistic, especially when you are just trying to find a fricking parking spot. The mailroom is broken into constantly and people aren't reimbursed for stolen mail. The shuttle they are oh so proud of is constantly taking unscheduled breaks or just outright breaking down. And there will likely be a bot that shows up under this review to get me to send an email that no one will ever read.\n\nEnd all be all, I made a massive mistake that I am still needing to deal by moving in to lark, please be better than me and find literally anywhere else to live. You will likely have a better experience!",
        "ownerResponse": {
          "text": "Hi Sam, we are sorry to hear about your concerns. We understand that parking can be a frustration, especially if you do not have a reserved space. We do our best to address this by being forthright about our parking situation during the leasing process. If you don't have a reserved parking space, we cannot guarantee that you will be able to find a parking space every time. We take your comments about the building materials and construction quality seriously. Please make a maintenance request in your portal if there are any specific concerns. We work hard to ensure that all requests are addressed within just a couple of business days when possible. Additionally, we apologize for any disruptions this may have caused. We have policies in place to address noise disturbances and will work to ensure that all residents are respectful of their neighbors. If you are bothered by disturbances of the peace in the future, please reach out to us at (509)652-3186, and choose the option for courtesy officer. If you have any further concerns or suggestions, please feel free to reach out to us directly by emailing Live@LarkBellingham.com. This email address goes directly to our management staff, and issues brought to our attention here get handled immediately."
        }
      },
      {
        "author": "Clark D.",
        "rating": 1,
        "review": "I lived here for multiple years in undergrad. Parking was always ABYSMAL, multiple times the \"secure\" package room was broken into (a friend of mine lost multiple hundreds of dollars worth of contents and was not reimbursed), and having a kind staff member interaction is a rare occurrence.\n\nThere are so few reason to live in these hospital room looking apartments that were NOT clean when you move in that I struggle to identify a positive reason to live here unless the ONLY alternative is the sidewalk outside (then I would have to think on it)\n\nRenting from this place is setting yourself up for failure, I can honestly say that paying a hundred more dollars for ANYWHERE else is more than worth it to save yourself from such a horrendous and predatory tenet experience.",
        "ownerResponse": {
          "text": "Hi Clark, thank you for taking the time to leave your feedback. We regret to hear of your concerns, and we sincerely apologize for the experience you've described, as this does not meet our standards. We would appreciate the opportunity to discuss these items with you directly if you would reach out to us at Live@Larkbellingham.com."
        }
      },
      {
        "author": "Eleni W.",
        "rating": 1,
        "review": "Be extremely cautious when trying to rent a unit from them!\nI'm currently locked into a contract with them even though they refuse to allow me to rent due to a past missed payment on an old electric bill from years ago, which has already been paid for. I told them, after months of trying to move past that issue and trying to find alternative routes to rent the room (their only other options were to get another person to guarantor me or guarantor with a sketchy 3rd party, neither of which were an option for me), that I was no longer interested in renting with them if they were going to make things so needlessly complicated. Their response was that I needed to find a new person to take over my lease (I have NEVER in my life ever heard of this practice when renting from an apartment before.)\n\nFrom what I've been told by my partner, who I was going to room with, was that spot has already been taken over by a new person, and they were able to do it relatively quick too. If you guys can fill a room yourselves no problem, then why do you make the potential renters take on the responsibility once they sign a lease and can't move in? It doesn't make any sense.\n\nNow, I'm getting past due rent reminders every so often, stating that I owe thousands of dollars worth of rent for an apartment that I was never even able to get in the first place. It's complete madness. This was even after I got a hold of management and tried to sort out the rent due issues. It's been nothing but phone tag, being forgotten about, and being ignored by them countless times. \n\nBesides that headache, every time I've gone to visit my partner at this place last summer, there seems to be problems. He can almost never find a decent parking spot during certain hours and has to resort to parking at Fred Meyer (which they eventually wrote a letter to their tenants saying that they were no longer allowed to park there, leaving many to park outside the gates sometimes), there are sometimes MOUNTAINS of trash piled up outside the waste bins, other tenants are loud and party during the odd hours of the night and there's animal waste everywhere.\n \nIf they treat potential renters this unfairly, I can only imagine what people who have lived here long term must experience. \n\nMaybe just look elsewhere.",
        "ownerResponse": {
          "text": "Hello Eleni, thank you for taking the time to share your feedback with us. Our financial qualification guidelines have been designed with students in mind. We understand that prospects might have little or no credit history, which is why we offer a guarantor option. We are always excited to add new members to our Lark Bellingham Community, but we also know that sometimes plans and circumstances change. For this reason, we have a couple of options available to release you from the legally binding contract and financial obligation associated with signing a housing agreement. Feel free to call us at (360) 778-1500, or email us at Live@LarkBellingham.com if you have any other questions."
        }
      },
      {
        "author": "Beth C.",
        "rating": 1,
        "review": "DO NOT RENT from this company!! Do not sign a contract because even if you do not qualify to rent from them, they will charge you for an entire year of rent even though you NEVER move in. They offer a sketchy 3rd party guarantor that is how they get you. I turned them in to consumer fraud through the state and working with the BBB. Please beware. I don't want other families to go through what our daughter has gone through.",
        "ownerResponse": {
          "text": "Hi Beth, we are sorry to hear that your experience has not lived up to your expectations. We do offer multiple methods to qualify to live here, including guarantors, credit and income qualifying on your own, or paying an administrative fee. Even so, we understand that sometimes plans change even after contracts are signed, so we have a couple of options to meet your contractual obligations if you choose not to move in. Feel free to reach out directly at Live@LarkBellingham.com if you would like to discuss these options or if you have any specific questions we can help you with."
        }
      },
      {
        "author": "Jon B.",
        "rating": 1,
        "review": "This place is such a scam don't let you child rent from this place they will scam them because they are young Becky the manager is part of it she just say there is nothing we can do but place other people's debt on your child's name and they know it is not her bull they just want someone to pay will be taking all party to small claims court recommend don't rent from here they will scam you and probably thousands of other people",
        "ownerResponse": {
          "text": "Hi Jon, we are sorry to hear that your experience with Lark Bellingham has been anything less than satisfactory. Please reach out to us at Live@LarkBellingham.com so that we can discuss your outstanding concerns and ways that we can improve our customer service in the future."
        }
      },
      {
        "author": "Maegan B.",
        "rating": 1,
        "review": "As a resident, I only am staying cause I have a lease and can't break it. They don't care if you're with a bad roommate or that they have a homeless dude living on the couch every night cause they just claim them as a guest. They will charge you for everything and anything they can. I would never in my right mind advise anyone to live here",
        "ownerResponse": {
          "text": "Maegan, we are sorry to hear of your concerns, but we are glad to welcome you back home this year. We'd appreciate the opportunity to further discuss your concerns so that we may work toward providing a better experience for you. Feel free to reach out to Live@LarkBellingham.com and let us know how we can make this year a great one, or drop by our office for a chat."
        }
      },
      {
        "author": "Dallas H.",
        "rating": 1,
        "review": "Probably the worst experience I've ever had. 2 shootings in the span of a few months. Staff is rude. No parking. Homeless constantly prowling and breaking into cars.\n\nMaintenance has come into my apartment and room Multiple times without announcing themselves.  \n\nI love how the trauma I have from SWAT walking outside my window with guns drawn and pointing them into my apartment because of a shooting wasn't taken seriously.\n\nNora constantly lies and makes things up because they're either ignorant or think because they're the GM, they can say whatever, \n\nThis place is money hungry. I havnt seen green grass since last august, and now suddenly the grass is green again for move in and tours? \n\nSave yourself the headache.",
        "ownerResponse": {
          "text": "Dallas, thank you for taking the time to share your experiences with Lark Bellingham. We are very sorry to hear of the challenges you have faced while living with us and we would love the opportunity to hear more about your individual experience. Please don't hesitate to reach out to us at (360) 778-1500 or live@larkbellingham.com."
        }
      },
      {
        "author": "Javin H.",
        "rating": 1,
        "review": "this place has terrible management that just wants to take advantage of students and their parents. First coming to Lark I was told via email contract and phone call that I would receive $200 off my rent for the time period of one lease. they only gave me one month and claimed it was an error. they also force tenants to have a guarantor and if they don't have one they will offer a terrible third party company. They told my partner this after her lease was signed and she was given a move in date. they denied her the apartment and later asked for the whole years worth of rent. even after they immediately filled the space. terrible here. don't give them any of your money.",
        "ownerResponse": {
          "text": "Javin, thank you for taking the time to leave your thoughts with us. We do offer concessions to all of our residents, and the amount of your concession is determined by when you sign your housing agreement. The earlier you sign your contract, the higher your concession will be. Additionally, our contracts state the full amount of the concession, as well as the way that the concession will be applied monthly. We apologize for any confusion and would appreciate the chance to speak with you directly. Please feel free to reach out to us and we will happily go over it with you. 360.778.1500"
        }
      },
      {
        "author": "Makena M.",
        "rating": 1,
        "review": "My roommate and I will be going on our second year living here and the only reason we renewed our lease is because we were told if we did (very early and months in advance) that our rate would stay the same as we had a discounted rate for applying when we did. Our rent was increased by 30$ with no notice or explanation.\n\nWhen you move in lark says a cleaning company comes into the unit and cleans it, this is either the worst cleaning company ever or a bald faced lie. there was dust everywhere, the bathroom was disgusting and the floors. THE FLOORS. I had to get on my hands and knees and scrub them for hours. After going over them maybe 3 times the water kept coming back disgusting. Due to the color of them you can't see the dirt but trust me it's there. My bathroom door is missing a latch strike plate (I think thats what it is) also the rubber that separates my carpet from the living room constantly comes off and isn't attached. \n\nThe apartment two floors below me consistently has EXTREMELY loud parties at 2-6 am and when I've emailed and submitted noise complaints I have gotten absolutely ZERO response. Anytime I try to contact them they are extremely unresponsive and don't actually help with anything. \n\nSomeone literally got shot amongst other things/ injuries that happened at a raging party and they literally did nothing. Some of our friends literally had people begging to come through their window because they were running from the party. They sent out a crappy letter that addressed nothing and then they got the cops called on them AGAIN at another party and all lark did was take away our gate code which just caused a million more problems and inconveniences than it solved. I think they did end up moving out but they should have been evicted immediately after the first incident.\n\nThe parking is an absolute nightmare. You pay 45$ a month for a \"reserved pass\" to park in the reserved spots and so you're \"guaranteed a spot\" and yet when people with the resident passes park there they do NOTHING. AND if you get home after like 8pm good luck finding a spot anywhere near your building if at all. If I had known parking was just a free for all I wouldn't have paid the 45$ and just parked wherever I wanted because apparently that's ok. Apparently we are getting assigned spots for reserved people. Excited to see if I get a spot anywhere near my unit. \n\nWe were having problems with our circuits and our breaker would flip up to 8 or 9 times in a night and we requested maintenance many times and he was the most unhelpful unknowledgeable man ever. It took like 3 months for them to finally get someone who was able to help us identify and fix the problem. (We also weren't the only people with breaker issues) \n\nNot to mention the washer and dryer included in the unit are absolute trash. My clothes have been pilling so badly and it's really ruining the quality of them. The dishwasher isn't great either. Yes it's nice to have them included but I  just thought for how much we are paying my clothes wouldn't be getting ruined and my dishes would be clean. I also had to unclog my own sink and fix my garbage disposal with my dad on the phone. gross. \n\nWhen we moved in we had issues with our wifi and lark was no help, they just told us to go to xfinity and figure it out ourselves. When we finally got it figured out and got a new modem a couple weeks later lark had these incredibly large and inconvenient boxes put into all the units to replace the nice small one we had before and the wifi is worse than it was before. Also getting a device put onto the wifi is now a bigger annoying process that you have to go through the website to do. \n\nUnfortunately the apartment below us caught on fire a couple months ago and luckily everyone was ok. The only issue is the fact that there are people doing construction from 6 or 7am until literally 11pm. Frequently. And its been happening for a while I'm not sure how they aren't done yet. \n\nThe garbage is also an issue. It's like they don't know how many people they have living here and how to accommodate correctly. The garbage spills out of the compactor a lot into a big pile and once I was taking my garbage down and since the thing was full there was a huge pile so I put my garbage on the pile as it was the only place to put it and someone on a golf cart came around and told me \"we don't leave our garbage on the ground here\" um sir where else should I put it. I'm not going to just leave it in my apartment until you decide to take care of it. \n\nThey are pet friendly but in the pet contract it says you have to declaw your cats which is not only incredibly inhumane but just messed up. I obviously did not declaw my fur babies and I'll gladly pay for a new, sh*tty couch, if need be. \n\nOne of my friends worked for them for a while and said they've already been reported to the better business bureau multiple times. Speaks for itself. \n\nSo yea, I don't recommend living here.",
        "ownerResponse": {
          "text": "Makena, we appreciate your feedback and review of your experience at our community. We are sorry to read that your experience has not been as you expected. If you would e-mail us at live@larkbellingham.com, we would be happy to discuss your concerns further."
        }
      },
      {
        "author": "Brenda W.",
        "rating": 1,
        "review": "Lark was the most horrible experience I have ever had. Please go somewhere else!! Amount many other things, the management was deceptive, the manger promised one unit during tour and confirmed with email. But when moving in, a totally different unit was given.",
        "ownerResponse": {
          "text": "Brenda, thank you for taking the time to provide your feedback to us. We regret to hear that you have not had the best experience here at Lark Bellingham. We aim for all of our residents to have the best experience and would love to further discuss any issues you've faced while living with us. Please feel free to reach out to us at live@larkbellingham.com so we can discuss how to make this right."
        }
      },
      {
        "author": "Jennie A.",
        "rating": 1,
        "review": "Where do I even begin--Lark seems nice at first glance, just like how any place that calls themselves \"luxurious\" should look like. They draw you in with fancy amenities, spacious rooms, their location being close to the WWU campus, etc. That's all a faade for how horrible this company is at managing a so-called student living complex.\n\nLet me start off that when I moved in, I put in a roommate application saying I would prefer to live with someone who is female and generally keeps themselves and their living environment clean. What did Lark match me with? The exact opposite. They assigned me a male roommate, when I explicitly said that I only wanted to live with females and living with a male would make me uncomfortable. My male roommate was also extremely unhygienic and incompetent, since he didn't seem to know how to pick up a broom and sweep the floor.\n\nWhen I first moved in, he was already living there for a year prior. The place stunk with a foul stench, the kitchen was horrendously dirty, and the floors were unable to walk on barefoot due to how much grime was covering the floor. When I arrived at my bedroom space, the toilet was covered in dried up urine, the carpets weren't vacuumed and I didn't even have a screen installed to my window. I thought to myself, this is what I'm paying close to $900 for each month? In this kind of living condition? And Lark didn't even do anything about it.\n\nAlso they invade your space every week or so, emailing you that they'll be doing some sort of \"maintenance\" that involves trespassing into your apartment. Also, if no one is home, they'll just barge in anyways. Isn't that illegal or something for landlords to enter into your place without your permission? Whatever.\n\nGood luck trying to break your lease if you don't want to pay upwards of $2,500 to mitigate the loss on their end. For a place that calls themselves student living, they're not very accommodating to their own residents, whom they know are college aged and have issues pertaining to life circumstances, ESPECIALLY during COVID-19 where students would rather live with their families instead of their disgusting roommates.\n\nMy roommate left me with a giant mess to clean up on my own. The absolute worst experience with a roommate I've ever had--and that's on Lark for assigning him to me.\n\nI didn't have an issue with parking spaces as I always had a spot close to my building, but that's probably due to not enough people living inside the units. I've walked past several ground floor units where the bedrooms are not occupied, which tells me they're struggling to find gullible students to fill in the spots.\n\nLark is so desperate for new residents that they've contacted people on instagram via direct messages that have \"WWU\" in their bio and ask if they're interested in signing a lease with them. They've also emailed residents and offered free items, food and accommodations to those who leave good reviews on google. How disingenuous and pathetic.\n\nDon't forget the absolute ridiculous astounding charges they slap you with after you move out--either pay those soon or they'll send you to collections! I left my apartment cleaner than when I moved in and they still charged me over a whopping $250 for a \"deep clean of the kitchen & living room\" even though I cleaned that place spotless before I moved out.\n\nThey also charged me well over $150 to \"repaint\" all the holes from tacks in the walls even though I had hung up one poster and the rest of it was already there from the previous tenant. All Lark does is charge their residents for maintenance, cleaning, and repairs and then don't actually repair or clean the place at all. They just pocket the money.\n\nThe only good thing about Lark is the student-led staff in their main office--they're somewhat kind and accommodating to your questions and concerns, but the other managers are a nightmare.\n\nDO NOT live here--even if it's your last choice. Just like everyone else who left a nasty review, this place deserves ZERO stars. Avoid this place like the plague, or reap the consequences.",
        "ownerResponse": {
          "text": "Jennie, we are extremely sorry to hear of your negative experiences with roommate matching at Lark Bellingham during your time living here. As a student housing provider who offers per room leasing, it is always our upmost intention to match you with a potential future best friend and apologize that we did not meet this goal during your occupancy. We would greatly appreciate you reaching out to us via phone or email to share your individual experience and to offer us any advice on making Lark Bellingham the best place for students to call home in Bellingham."
        }
      },
      {
        "author": "Mercedes N.",
        "rating": 1,
        "review": "The worst place to live! They towed my car, charged me $1,600 on my account and didnt explain the charges, threatened to have animal control take my cat even though they are pet friendly, and they will NOT terminate a lease under any circumstances. They are dealing with several lawsuits right now and they claim they are \"student apartments\" when they are not affiliated with the college AT ALL.",
        "ownerResponse": {
          "text": "Mercedes, thank you for taking the time to share your experiences at Lark Bellingham, we are extremely sorry to hear of the challenges you encountered and would love an opportunity to discuss your individual experiences. Please do not hesitate to reach out to us at (360) 778-1500, live@larkbellingham.com, or by visiting our leasing office. We look forward to hearing from you."
        }
      },
      {
        "author": "Holly C.",
        "rating": 1,
        "review": "I wrote a review on here a year ago and took it down because I wanted to give them a chance to turn things around for my second year of leasing since there was a major staff change. I'm not surprised at all that very little has changed.\n\nLet me just start by saying Lark Bellingham totally takes advantage of college students. The marketing is aggressive, they prey on you through social media (AND I was even told that they use social media to match roommates together - which is completely unethical). The system of renting through individual leases is just one of the many loopholes this place uses to abuse tenant's rights and unfortunately, many college students are just trying to get their first place on their own so we fall victim to it.\n\nMy first year here parking was a nightmare. I would get home late from work and have to park at Fred Meyer when it was very dark outside and walk over because there wasn't a single spot available. This is how they get you to pay the extra $40 a month for a Reserved spot. I witnessed so many college students get towed for parking at their own apartment complex. This year, I gave in on paying for a spot only to have nothing enforced and lots of parking available since there were so many vacancies during the pandemic. I could have saved thousands of dollars on this pass. \n\nThe \"security\" does not exist. Wait... let me correct myself. They do exist, but they sleep on the job and can't actually respond to calls about safety. Yes, I witnessed a security guard sleeping in their car last year after cars were broken into. \n\nThere was a good month and a half where my packages would continually \"go missing\" since they are delivered to the office and not straight to our door. The old manager here tried to convince me I was lying and then 2 weeks later my package magically reappeared. \n\nWhen it came to having roommates on this individual-lease system, I got completely screwed over. My old roommate worked for the complex and told me many times that she would be the one picking my roommates for this year, told us that she memorized our phone numbers, and would speak poorly of other staff members and residents while in our unit. I ended up being alone this year after I raised concerns about my safety given that my privacy was violated, but now only 4 weeks from me finally moving out of this place, I received 6 days notice that I would be getting a roommate and only 17 hours notice that someone would be entering my apartment the following day. The staff was nice enough to follow the law and wait until 24 hours+ to enter after I raised my concerns, but did nothing about giving me very little time to make arrangements for the person moving in with me. \n\nThe new staff members are very kind and try their best to be helpful, but it seems like they don't really have the right training to provide guidance to residents. I feel bad for them because it really isn't their fault, but it's also difficult to be paying $800+ to live here and not have great resources when it comes to the leases and issues with the space.\n\nAlso, be aware if you move here that the power seems to go out more than anywhere else I've ever lived. So stock up with flashlights and portable chargers. \n\nOh, and they bribed residents with pizza if they left a good review for them on Google.\n\nI will also add that all the responses from Scion seem to just be trying to delegitimize the negative experiences shared by other residents.",
        "ownerResponse": {
          "text": "Hi Holly, thank you for addressing your concerns with us. We completely understand your frustration with these situations. It is always our top priority that our residents feel comfortable in their homes. Our team has worked with you along the way in an attempt to assist you through the obstacles you have faced, but we apologize that our actions did not remedy the situations. We appreciate your feedback in stating your concerns, and are always here should you want to reach out to us in the future (360) 778-1500."
        }
      },
      {
        "author": "Aliyah Z.",
        "rating": 1,
        "review": "Apparently my review was deleted. Would give 0 stars if possible.\nLived here for 2 years and management turned into a joke a month after move in.\nParking is a nightmare. And they tow residents cars. \nApartments and furnishings are so cheaply built.\nHave electrical issues, as the breaker constantly flips.\nTrash is everywhere\nAmenities are always closed (even 1 1/2 years without the shuttle)\nNot ESA friendly (which isn't legal).\nWay too much money for what you get.\nThey tried to charge me at move out for a bunch of things until I sent them back the lease agreement and correspondence about damage from original roommate.\nEveryone in Bellingham knows the gate code, not that they'd need it to get in the gate (which frequently was stuck open)",
        "ownerResponse": {
          "text": "Hi Aliyah, thank you so much for taking the time to express your concerns and frustrations, so we can help resolve these challenges for you. We're sorry to hear you have had some difficult experiences during your time as a resident here, but glad that we've been able to speak with you directly to assist with all your concerns.  We closely follow Washington Law to provide accommodations for anyone with disabilities. These requests are addressed directly by our attorneys who are trained specifically in Federal Fair Housing Law as well as state laws. We are happy to speak with you directly if you have any questions about this process."
        }
      },
      {
        "author": "Casea S.",
        "rating": 1,
        "review": "Edit: I - like my husband - do not answer to my legal name and thus do not have my legal name listed through my account. I have emailed Scion to clear this up. Haven't heard back from them at all. My roommate has also been trying to pay for damages and get some disputes resolved for a month now and has yet to have them resolved, which has prevented us from finding a new place to live. \n\nI lived here for two years. During that time, the office staff was transphobic, incompetent, and rude. They often misgendered my husband and called him by the wrong name, even after multiple attempts to correct them. One of the staff there, Selena, was particularly malicious and seemed to make it her personal mission to make our living experience there terrible. Throughout our every experience with her, she never once showed my husband any ounce of respect in his gender identity. Keep in mind, he goes by his middle name. It is LEGALLY his name. There is no excuse for their dismissiveness on our request that he be called by the correct name.\n\nOnce, he ordered something online and though he knew it was there, office staff insisted it wasn't. He had ordered same sized products from the same company before. They were always only delivered to the office. The staff, moments later, SHOVED into our open mailbox for us to collect.\n\nThe printer in the computer room was known for not working very often. The computers sometimes didn't work either. \n\nWe were once accused of not picking up after our dog, the official story being that someone tried calling after my husband to get him to clean up, but that my husband ignored them. Not only did nobody ever talk to him about his dog, but it wasn't even our dog. He was our roommate's dog, so they should have contacted her. Not him.\n\nThe outdoor amenities weren't what we expected. The hammocks were sometimes broken or missing. We found a few times that the grills were left on at night leaking propane. At one point, the fire pits wouldn't even turn on and I have no idea if that ever got fixed.\n\nDog trash cans were frequently overflowing and empty of any bags, sometimes left that way for weeks. \n\nThe dumpsters tended to overflow too, piles of trash and recycling so high you couldn't even get through. \n\nThe quarterly inspections were often unorganized and sometimes rescheduled to the day after they were supposed to have been done, which was incredibly inconvenient for us. \n\nDuring one of the inspections, they had trouble opening my bedroom door. I told them of they just lift the handle up instead of pushing it down, it opens just fine. A few days later, unbeknownst to us, maintenance came by because they were scheduled to fix it. After the inconvenience of the late inspection, the unwanted and spontaneous presence of maintenance was especially frustrating. \n\nAnother inspection happened on Halloween. I had to cancel my plans. My pets don't deal well with strangers coming into our home and I didn't like the idea of them entering unsupervised. So, with my plans canceled, we waited around for hours. I kept calling throughout the day, getting a different estimated time of when they would be getting to my building. No one seemed to be certain or even know what building they were currently working on. By the end of the day, NO ONE EVEN SHOWED UP. I called the manager and left an angry voicemail. The next day, I get a call back with the manager saying that they simply ran out of time, something I already knew because that was blatantly obvious. The worst part of it was that I didn't get an apology. The call was just a condescending excuse for them not doing their job correctly and having little consideration for their tenants.\n\nWhen we worked late, there was often no parking at all. We frequently had to park at the Fred Meyer parking lot. They advertise \"free parking\" but don't have enough parking spaces for everyone, so that's completely misleading. Even people who pay for RESERVED parking can't find spots at the end of the night!\n\nThere was a hole in the fence that led out to the Fred Meyer parking lot. It was continuously broken open again whenever it was repaired. The smart thing to do would be to put a gate there. (But it's Lark. They aren't exactly smart.) It's the least they can do for the people who aren't able to actually PARK in the Lark parking lot and have to walk around the fence in the middle of the night just to get home. But whatever. Keep wasting money replacing it, I guess. \n\nThey call themselves \"luxury apartments,\" but don't bother to even put backsplash in the kitchen or proper insulation in their walls. You can hear everything your neighbor does and the entire apartment is freezing during the winter.\n\nThis is by far the worst, most poorly managed place I've ever lived. Do not live here. Believe me, you'll regret it.",
        "ownerResponse": {
          "text": "We are concerned about your report of a negative experience at our community.  We are unable to locate any record of you as a current or previous resident. If you would e-mail us at live@larkbellingham.com, we would be happy to assist you further as these experiences you stated are a concern for us."
        }
      },
      {
        "author": "Em T.",
        "rating": 1,
        "review": "Please do not rent from here. They advertise as off campus housing. They claim to be pet friendly. They aim for an aesthetic that isn't true. They also pressure you into signing another lease less than 3 months after move in. They provide all these \"community\" activities during \"move in month.\" After that month is over, they reduce activities and ask for residents to help contribute to resident activities and morale via providing their own games and etc. \n\nAlso, there is bunny poop everywhere. The grounds are only green during the tour and move in month. They sprinkle pesticides around plants that aren't pet friendly. They allow pets to be off leash. They allow trash to be left everywhere. \n\nAnother issue is that there are drugs being sold here. Cops constantly being called...\n\nPlease do not make the same mistake I did!\n\nEdit: you do not host 5 events a month and last time I tried to communicate my issues, Nora attacked me personally and acted like a psycho. Kellie, you don't even work at this location. You're just the community outreach for a lot of their apartments in multiple locations. No ty!",
        "ownerResponse": {
          "text": "We are extremely sorry to hear of your negative experiences with Lark Bellingham. Our team aims to exceed the expectations of our residents by providing a wonderful place to live, fair and consistent policies, and hosting five resident events each month. We would greatly appreciate you reaching out to us via phone, or email, in order to address to your concerns and for you to offer any advice that would ensure Lark Bellingham is the best place for students to live in Whatcom County. "
        }
      },
      {
        "author": "Grayce P.",
        "rating": 1,
        "review": "My experience here was horrendous. not only was practically everything they advertised a lie, but my apartment practically fell apart. There was a leak in the ceiling and it cause my kitchen ceiling to cave in. The maintenance team was not kind, and i was left with gigantic holes in my walls and ceiling because the team 'FORGOT' they were supposed to fill the holes. Management feels entitled to the space you occupy, and barely give you any time to answer the door, they will just walk right in. Kyle, the property manager, makes it his goal to swindle college kids into giving them more money. Parking is not free, it's an additional 50 a month and your spot isn't even guarantied. i think there's about 7-10 guest parking spots for a complex with literally over 700 residents. and THEN they have the audacity to just stick towing stickers to everyone's windows. also, if you have a roomate move out, get ready for maintenence to stain you furniture with their god awful fugly turquoise paint.",
        "ownerResponse": {
          "text": "Grayce, thank you for your feedback. We are sorry that your experience didn't live up to your expectations. Our team works hard to address issues in the most timely and courteous manner possible. We will continue to keep working to make sure that the Lark Bellingham experience is a great one. We'd appreciate the opportunity to connect with your to discuss your concerns further and work toward improving your experience with us. Please feel free to reach out to us at (360) 778-1500."
        }
      },
      {
        "author": "Justin G.",
        "rating": 5,
        "review": "Loved here for 4 years the the staff are amazing. The place comes with a gym, study space, free coffee, and with your own room/bathroom! Recommend living here!!!",
        "ownerResponse": {
          "text": "Hi Justin, thank you for taking your time to share your experiences at Lark Bellingham. We are so happy to hear of your 4 years of loving Lark! Providing our residents with great places to live, along with experiences that make Lark Bellingham the best place for students to live in Bellingham. We hope you continue to use all the great amenity spaces during your last year.\n"
        }
      },
      {
        "author": "Emily D.",
        "rating": 1,
        "review": "I lived here for approximately a year and a few months. I can honestly say this is one of, if not the worst places I've ever lived. I have waited a full year before writing this review so that my anger could subside and I could be concise, but this is still a lot. The prices are insane, and they are very aggressive in forcing you to sign and resign your lease. Our lease started in September and by October they were already egging us on to signing another year. So, we did, because we didn't want the prices to go up...what a mistake that was. \n\nWe all ended up moving out early because of the pandemic. But before that, we witnessed so many things that made none of us want to return. \n\nThe people who lived above us would constantly have parties late into the night, sometimes as late as 4 or 5am on a weekday. Blaring music and the sounds of moving tables, beer pong, and fireworks were just some of the noises. We would call security and nobody would pick up, or nothing would happen. Parking was also a nightmare, we bought reserved spots but even then if you came home after 5pm it was nearly impossible to find a spot (this was before the pandemic). The shuttle is an absolute joke- you would not only have to wait in line (most of the time in the rain because it's Washington) but there were hardly ever enough seats. It also would be shut down randomly so you'd have to find another form of transportation to get on campus, which normally is fine, except for the fact that the shuttle is advertised as a main selling point for the complex. The dumpsters were always overflowing and never seemed to be emptied. All of the amenities were a sham.\n\nThe other thing that was always incredibly frustrating was the front desk. I get it, college students need jobs; but they were never trained well and could never answer any questions you would have as a tenant- they were trained to get people to sign leases. That's it. \n\nAll in all, I urge you, do not get stuck in the trap that is this place. Their leases prey on innocent young students just trying to find a place to live.",
        "ownerResponse": {
          "text": "Emily, we are extremely sorry to hear of your past negative experiences as a resident of Lark Bellingham. While we have been hard at work over the last 12 months to make Lark Bellingham the best place for students to live in Bellingham, we would love a chance to speak with you regarding your individual experiences. We have attempted to reach out to you via phone and would greatly appreciate a return call, (360) 778-1500, or email."
        }
      },
      {
        "author": "Jessica H.",
        "rating": 1,
        "review": "If I could give no stars I would. I have lived here for 2 years and have had nothing but trouble. The office is ran by college students who are little to no help. It is way too expensive for the quality. The gate is a joke. It is open all day allowing anybody to come in which is why so many people have had things stolen. There is never any parking except during this global pandemic. Quiet hours are a joke that they tell you to deal with yourself. The maintenance people don't know anything about what they are doing and end up incorrectly fixing it so it breaks a week later. I have attached a few pictures of inside my apartment damage. There are lots of other damages as well I have a whole Google drive of damages because they try and price gouge you at any turning point at move out unless you call them out. I have also attached a photo of damage to the side of building 807. Absolutely the worst place I have ever lived.",
        "ownerResponse": {
          "text": "Jessica, thank you for taking the time to share your concerns regarding living at Lark Bellingham. It is always our utmost priority to provide or residents with the best community possible. We have reached out to you via phone in hopes of further discussing these concerns. We would love for you to give us a call back at (360) 778-1500, or swing by our office to learn how we can make Lark Bellingham the best place for you to live."
        }
      },
      {
        "author": "Kate D.",
        "rating": 1,
        "review": "Predatory apartment complex. They appeal to younger individuals who may not know what should be expected of them. I signed a lease thinking I wouldn't need to move out, which all college students believe. However life happens and Lark allows no flexibility when it comes to moving out. \n\nStaff will do their very best to avoid you if you need to move out. I got married in the middle of the school year and decided to transfer to an online school since my husband is in the military. I planned on moving in with him in SC. While I understand I signed a lease, no one in the office wanted to help start me with the move out process and there was zero communication. I sent emails, called the office and showed up yet it took weeks to hear back from them. I genuinely only think I was able to move out because of luck, and because my parents called and yelled at staff. There was also a point I was sent a refund, and they shorted me. I had to remind them how much I was supposed to get, THEN they sent me the proper amount back. \n\nDoesn't matter if you're 18-19, they will treat you like a child and avoid communication.\n\nSince moving out I have lived in 4 different apartment complexes around the US, and Lark will always be my worst experience.",
        "ownerResponse": {
          "text": "Hi Kathryn, we regret to learn that you did not enjoy your experience at our community and felt that our staff didn't have your best interest at heart.  We work hard to provide a great experience for all our residents and guests, and will use your feedback as we continue to improve our communication.  If you have any further concerns or issues, please do not hesitate emailing us at live@larkbellingham.com or giving us a call. We would love to help you in any way we can, and wish you the best."
        }
      },
      {
        "author": "Gen B.",
        "rating": 1,
        "review": "When my former roommate moved out, Lark assigned me a new roommate. Online, I informed them that I cannot live with a smoker, but the new roommate smokes, which leaves an odor in the living room. Even though the smell makes me sick, Lark refused to do anything about it because the roommate doesn't smoke inside. They would not waive the $200 fee to move units or the professional cleaning fee to remove the smell, despite ignoring my health needs. At least they were polite about it. In addition, the furniture they provide is cheap and the floors of my unit are warped. \n\nManagement is awful. Flooding in an electrical room damaged my friends' unit, and all they did was plug in fans... using the tenant's electricity, which the tenants had to pay for. A lot of the units have a mold problem in the vents, too. They enter units for inspection without notice beforehand. The upsides of Lark is that the units are furnished, there's a bus stop right outside, and a shuttle service to campus for students... and that's about it. Look elsewhere for housing!",
        "ownerResponse": {
          "text": "Genevieve, we are concerned to learn that you are not enjoying your experience to the fullest extent.  We understand that our Accounts Manager has been speaking with you in regards to your options about your roommate concerns. As always, based on our availability we are more than happy to transfer you to a different apartment on our property. The policies outlined state that we do not allow smoking inside the apartments.  If it is brought to our attention that smoking is occurring inside of an apartment, we would be more than happy to take proper action. As for any maintenance concerns, we always encourage residents to put in a service request, so we can address any issues you may be experiencing.  Mold is a common occurrence in the North West. We have included a section in our Housing Agreement that goes over the proper way to clean areas with mold. If someone sees mold in their apartment, maintenance is more than happy to assist them with proper clean up. We have attempted to reach out to you to discuss your concerns further, however we've been unsuccessful in reaching you.  If you would like to discuss your concerns further, please feel free to stop by the office or e-mail us at live@larkbellingham.com."
        }
      },
      {
        "author": "Kassy P.",
        "rating": 1,
        "review": "If I could give 0 starts I would. I had such a horrible experience here. It started out nice when the good managers were there but the 2nd year was the start of the downward spiral. I lived here from August 2016 when the opened to February 2018.\n\nLet's start with a few positive before I get to the real tea. The apartments are nice. It looks quaint with IKEA furniture and with a decent amount of storage place. Each bedroom is huge and comes with a desk, full size extra long bed with mattress and storage under the bed, a bathroom with a tub and a walk in closet. The roommate match is hit or miss it honestly just seems like a just placing people randomly.\n\nNow let's start spilling:\n\nThere's trash (a Fred Meyer cart on the 3rd floor) and dog shit everywhere (including in the sand of the volleyball court), there's only 1/3 free parking spaces and 2/3 paid but there are always empty paid parking spots but supposedly they can't sell the exact number of parking passes for the exact number of spots. I would get home at 11 and they would call me  in the morning saying if I didn't move they would tow me and I kept asking for a parking pass but they said we sold the max. One night they decided to tow people parked in the paid spots at 3 am without notice.\n\nThey wouldn't give notice to enter the apartment, and would just come in. My unit had shitty insulation and we could feel the cold air coming through the outlets and windows so our heating bill in the winter would be like $100-130 a person in a 3 bedroom. We had a roommate who stole prescription medication from my other roommate and I but they wouldn't help us and they wouldn't kick him out. People who didn't live here would be in and out at all hours through the gates because the access codes were posted online so you never know who would be in the GATED community. People would either be throwing parties or be ridiculously loud at all hours with no one doing anything about noise complaints. When I first moved there people were throwing fireworks into random apartments as a prank. My boyfriend's bike got stolen there (it was locked and everything) and management would not help us out at all. \n\nLet's not even get started with the 60 page airtight lease where it even says that you're not allowed to give negative feedback online while you live there. They are a greedy and selfish company. I was asked to vacate but here's the fucked up part, they made me still pay rent for the rest of my lease even though someone had moved into my room but since it wasn't a new lease and because no one would take my lease I had to pay 650 a month for 7 month ( which was the cheap because i locked in my price in January 2016)\nThey never really had any events like they promised (they promised every month but it was like once every 4 months). The printers a lot of the time were either out of paper or out of ink.\n\nTo everyone thinking about moving here, it seems nice online and on paper but it's run by the worse property management company ever being operated by the bitchest managers who would never be helpful. Honestly if you're gonna do something like this try Elevate Bellingham ( I never lived there but I had friends who did) which is clean, has even bigger spaces and a lot nice amenities for about the same price and owned by a different company.",
        "ownerResponse": {
          "text": "Hi Kassy, thank you for sharing your feedback with us. We hope all our residents have a great experience at our community and are sorry to hear we did not provide that for you. We rely on feedback from our residents so that we can address concerns and improve the overall community and resident experience. \nPlease reach out to us at live@larkbellingham.com if you have further concerns we can address."
        }
      },
      {
        "author": "Lana A.",
        "rating": 1,
        "review": "Honestly, I would say avoid living here at all costs. Lark's management is entirely for profit, at the expense of your own well being, and I had several red flag issues while living there.\n\n1. Lark will bankrupt you if that what it takes to extract profit. The move out process is not friendly to the resident. During the winter 2020 peak of the COVID-19 pandemic I was unemployed and needed to move out. When I notified Lark of my financial hardship they did not respond with sympathy, they instead replied saying I owed the full balance of my lease, and they threatened that they would pursue debt collection if I couldn't pay. \n\nAdditionally, Lark is unwilling to take reasonable efforts to mitigate damages and re-lease your unit, which is a fragrant dismissal of state property law. When I explained to the leasing office management that I would be moving to Seattle for law school and if they didn't allow me to exit the lease I'd be paying double rent, the manager looked me in the eyes and said she was sorry that I would be forced into starvation but there's nothing she could due about the remaining balance on my lease, including moving the unit into someone else's name.\n\nFast forward to me being here in law school--I've paid off my debt to Lark and I am left $128 dollars to my name! Did I mention I'm in school and cannot work? Yeah, it's really nice that my credit score is still intact since I did not go into debt collection, but I am one utility bill away from total bankruptcy and starvation! I hope the Lark staff is having fun using my blood sweat and tears to redecorate the lobby every 6 weeks.\n\n2. Living at Lark is not safe for a young woman. I have had several near misses of sexual assault with Lark. There have been several occasions where I am in my individual room, with the door locked, showering or naked or in my underwear, and a maintenance employee has tried to gain entry. I remember once I had just gotten out of the shower, heard maintenance unlocking my room door, and had only seconds to grab a towel and throw my body against the door to stop the man from entering. I literally had to push against the door and scream as he was opening it so that he wouldn't see me naked. \nAnother time, in August 2020 an unidentified man entered my apartment and tried to gain entry to my roommate's room. This incident occurred during the turnaround time where Lark deep cleans units for new residents. Lark employs an off-site cleaning service, and they will be in your unit with the door open and unlocked for several hours at a time. A man who was not associated with the cleaning crew came into our house, walked past the workers, and tried to enter my roommates room. He hung around the unit, inside and outside, and waited for one of us to come out because I saw him watching my door when I went to the kitchen and when he saw me he just left. I was very alarmed and went to text my roommate, but as soon as I saw my phone I saw frantic messages from her asking if I was the one knocking and shaking her door handle. It took both my roommate and I expressing fear of our safety multiple times for Lark to do the bare minimum and notify us when maintenance would be arriving at our unit. I still deal with trauma from these occasions and the constant fear that I am not safe inside my own apartment, even if the door is locked.\n\n3. Lark's lackadaisical, contemptuous and profit motivated approach to property management is disgusting, and it will be a lifelong regret of mine that I allowed myself to fork over thousands of dollars to a company that doesn't care whether I live or die.",
        "ownerResponse": {
          "text": "Lana, we are extremely sorry to hear of your negative experience with Lark Bellingham as it is always are upmost priority to provide our resident with the best possible place to live while maintaining fair and consistent policies for all of our residents. We would appreciate if you would be willing to reach out to us in order to discuss you individual situation and for you to offer any available advice to make Lark Bellingham the best possible place for students to live."
        }
      },
      {
        "author": "Xichen J.",
        "rating": 4,
        "review": "This is a brand new construction behind Fred Meyers. This place boasts of all the luxury amenities for a price of about $785 a month for a room in a two-bedroom apartment. Electricity is not included. Internet and water are included. I moved into this place a day ago and for the most part, it has been good. There were some issues such as no internet modem in my apartment and no shuttle for the first week. However, the front desk have been courteous and helpful. One thing that I do want to warn future residents is that the kitchen and bathroom sink are quite small. There is one sink and the space around that sink is not that large. There are also small bathtubs in the units. Parking can be notoriously hard to find at night (all of the designated $30/month spots have been sold out). Other than that, this place is great if you want to pay the high price tag.",
        "ownerResponse": null
      },
      {
        "author": "Emily T.",
        "rating": 1,
        "review": "The apartment itself is nice but everything else is crap maintenance will walk in unannounced. I was laying in bed asleep and a male maintenance person walked into my locked bedroom. There is no parking. Ever. And if you can't find parking the want you to park at Fred meyers and walk. They continue to give out parking passes when they don't have enough spots. Do not recommend living here.",
        "ownerResponse": {
          "text": "Emily, we are very sorry to hear of the issues you have been experiencing related to park at Lark Bellingham. While our Resident parking spaces at Lark Bellingham are unassigned and available on a first come first serve basis, we are diligently working to remedy these ongoing issues. By eliminating the high number of unauthorized guest vehicles utilizing our resident parking spaces, we aim to ensure that there is available parking for all residents at Lark Bellingham."
        }
      },
      {
        "author": "Emily N.",
        "rating": 1,
        "review": "Pet friendly - absolutely! However I've been here 2 weeks and was attacked by a dog off leash my first day living here. Sent photos and information to management and didn't receive a response. I witnessed several other animals off leash. When dogs off leash approached me, I explained that it would be considerate if your pet was leashed because I also have a dog and do not want any incidents. The owners have rolled their eyes and blew me off. Also, several residents are working with rover and those dogs they have here are not allowed to be here.\nTwo homeless people have approached me asking for money. I asked if they lived here and they both said no but the gates open. I've had a homeless man yell at me as I walked outside the gates during daylight. I witnessed another homeless person run around naked in the field in front of lark screaming.\nI asked the office what is it I can do about these incidents and asked if I should call the police and they said \"there is nothing we can do, don't call the police. We don't own the land outside the gates and welfare (Idk what welfare is) is checking up on them.\" Maintenance has now left my door unlocked twice. Everything I've experienced has been reported to the office via email and verbal reports that the front desk submitted for me.  From the moment we applied...it's been a absolute nightmare. I really wanted lark to be everything it advertised. It's upsetting I'm having to be scared of where I live.\n\nDon't let the fake 5 star reviews fool you.",
        "ownerResponse": {
          "text": "Hi Dallas, thank you so much for addressing your concerns with us. We completely understand your frustration with this situation. It is always our top priority that our residents feel comfortable in their homes. We attempted to reach out to you earlier today to discuss how we can improve your experience but were unable to reach you. Please reach out at (360)778-1500 or at live@larkbellingham.com at your earliest convenience so that we can address and improve your experience at our community."
        }
      },
      {
        "author": "Sunny L.",
        "rating": 1,
        "review": "The worst community, the worst management of all time! Run away as fast as you can when they sugarcoate everything to make you sign a lease.",
        "ownerResponse": {
          "text": "We are concerned about your report of a negative experience at our community.  We are unable to locate any record of you as a current or previous resident.  If you would e-mail us at live@larkbellingham.com, we would be happy to assist you further."
        }
      },
      {
        "author": "Sasha T.",
        "rating": 3,
        "review": "Haven't even moved in yet and I'm already encountering problems. Before signing my lease I spoke to the marketing manager Lani, and asked her specifically if animals in aquariums/vivariums would be allowed as I collect exotic animals. She told me that yes the pet addendum would show that they were fine and I would have no problems. Fast forward a few months, it's getting closer to move in and I've already signed my lease, they email me a copy of the pet addendum and what do you know, exotic animals of any kind are prohibited. Pretty sleezy if you ask me. Had I known they weren't allowed I would not have signed a lease with them.",
        "ownerResponse": {
          "text": "Sasha, we are sorry to learn that your experience has not been as you expected thus far. We understand that our office has reached out to you to attempt to clarify the situation. Based on the notes on our account and the verbiage in the Housing Agreement - Fish in aquariums are allowed.  If you would like to bring an animal that is not pre-approved, you will need to submit a request to the office in writing.  We are more than happy to discuss any further questions you may have if you would stop by the office or email us at live@larkbellingham.com."
        }
      },
      {
        "author": "Ryan M.",
        "rating": 1,
        "review": "the few consistent amenities were nice. other than that, living here was a nightmare. \n\nmost of the staff were unhelpful and clueless (apart from Rita and maybe one person that worked the desk occasionally), parking sucked even though site advertises free parking. they don't even have enough spots for the amount of leases they do. \n\noverall, horrible. i hated living here.\n\nEDIT (because i don't know if i'm able to respond to comments):\n\ni understand reserved parking vs resident parking. i lived there for two years. the problem is that the website advertises free parking. therefore implying that there is enough parking for residents to park freely without paying for the reserved spots. but there was not enough parking for the amount of tenants. \n\ni would have loved to have discussed all of this with the business themselves but upon completing my move out survey, i selected that i wanted to be contacted by the lark \"dream team\" to discuss my dissatisfaction and was never contacted after. \n\ni don't appreciate the unprofessional responses that i receive from lark whenever i try to speak to them about things that end up just questioning my intelligence and comprehension rather than actually trying to solve problems.",
        "ownerResponse": {
          "text": "Ryan, thank you for leaving us your feedback on your experience at Lark Bellingham.  We're glad to hear that you have enjoyed the amenities we offer at our community. We do offer two types of parking, Reserve Parking and Resident Parking. If you have Reserve Parking, you are always guaranteed a parking spot. If you have Resident Parking, it is on a  first come basis.  Please let us know if we can assist you further in any way."
        }
      },
      {
        "author": "Barb C.",
        "rating": 5,
        "review": "OMG!!! I'm the parent and my son and his friend had nothing but great experiences here at NXNW Student Housing for Western up in Bellingham, WA. We moved him in today and this place is amazing!!! Fully furnished two bedroom with private bathrooms and walk in closest, all utilities except electricity, shuttle service to campus all day long, complimentary coffee bar, tons of parking, close to stores, etc etc. And the management has been amazing and helpful all summer long with all of our questions and concerns. And all this for $799. What a great deal!!! As a parent, I feel very thankful and appreciative that our young adults will have an amazing college experience. I'm jealous. Nothing like this existed in my time.",
        "ownerResponse": {
          "text": "Barb, thank you so much for the feedback and review.  We love hearing that our residents as well as our parents are so happy with the NXNW Community. We are working on rolling out some great events over the next couple of months, and hope you can make it back up to visit us. If you have any questions or concerns, please do not hesitate reaching out to us!"
        }
      },
      {
        "author": "Lisa W.",
        "rating": 1,
        "review": "Management is unethical, profit driven, and manipulative. The sales team is intrusive from the moment tenants arrive, with a full court press on gaining a second year contract that starts immediately after arrival. The management team is syrupy sweet but unresponsive and disorganized. Read the 14 page lease carefully to see all the tactics they use to undermine tenant rights and evade accountability. Although the facilities are nice, the quality and integrity of the management team makes this a low quality experience for many residents. I would strongly urge prospective tenants to look elsewhere. BTW your lease may start on the first of the month, but they will not let you move in until two weeks later...one of many strategies designed to line their pockets at your expense.",
        "ownerResponse": {
          "text": "Hello Lisa, thank you for providing this feedback. We offer residents to keep their same space at our lowest rate in the beginning of our leasing term for the next housing term as a priority to our current residents that renew with us. Every year, we release our lowest rates in October. As for having resident pay on the first, total rent of the housing agreement is a single fixed price for the entire term. We then divide this total contract price into equal installments and make them payable on the first day of each month for convenience , as our residents typically prefer to budget for equal installments on a set payment calendar. Please reach out to us at live@larkbellingham.com, we would love to help assist with any further concerns."
        }
      },
      {
        "author": "Emily E.",
        "rating": 1,
        "review": "NXNW is one of the worst places you could live as a student or as an adult in the Bellingham area. I know when touring it seems great and adult like, but it's not all it seems. \n\n1. The shuttle seems like a great idea until you actually get there and realize it doesn't actually have the capacity to hold the amount of students that it needs to. Unless you plan on standing outside for 30 minutes waiting for the shuttle to finally pick you up, I would recommend walking.\n\n2. Parking is extra which is complete bullshit. For the amount they are charging parking should be free and come with an assigned  parking spot by your apartment. This place is just a ripoff and not worth what you're spending. \n\n3. Management sucks. They are the least helpful people in the world. People will be screaming and playing music until 3 in the morning and they won't do anything. People leave their DOG POOP everywhere and they won't do anything. The computers in the lab don't work and they don't do anything. The people working here are honestly useless.\n\n4. Don't move here just because the outside stuff/gym look fun. You won't really get to use it during the winter because it's so cold/rainy, and based on most of the people who live here, you're probably going to go home for the summer. And the gym is always packed. Just use the western/whatcom gym.\n\n5. The price for the apartment is not worth the cheap apartments/furniture you are getting. Just move to a better cheaper place and buy furniture. Trust me.\n\nThis place comes off as great during the tour (I felt the same way) but it's honestly the worst.",
        "ownerResponse": {
          "text": "We are sorry to hear your experience with NXNW has not been a positive one. As for transportation to campus, at peak times the shuttle can get full. WTA has a bus stop at the front of the NXNW driveway, which goes directly to campus as well and is free with your full time Student ID. We offer free and paid reserved parking at NXNW. Per city regulations the property was not built with a 1 to 1 ratio of parking per resident. We always encourage residents to come down to the office if they have questions or concerns, and would be more than happy to discuss your issues further.  Please feel free to e-mail us at office@nxnw-bellingham.com or call us at 360-778-1500."
        }
      },
      {
        "author": "Megan C.",
        "rating": 1,
        "review": "I have lived at Lark Bellingham for about a month now. I have encountered a number of problems that has made living here a miserable experience. \n\nFirst and foremost, the parking. This complex has to have the most atrocious parking setup. There are two types of parking--residential and reserved. If you are lucky enough to be able to get on the list for reserved parking then parking won't be a problem. But is you do not get granted reserved parking you will be stuck with residential parking. There are not enough parking spaces and during the afternoon the parking lot becomes a free-for-all with people seemingly ready to crash into another car just to get a spot. If you work late or have classes later in the day you will NOT be able to park within the community. Many people park outside the fence or at the Fred Meyers located next to the Lark. If you drive a car are not sure you will be able to get a reserved parking space like many of the residents here, I suggest turning around and driving to another complex. \n\nThe staff are not helpful. They are ill equipped to solve any problem that is presented with them and quite a number a very rude if you are insistent on having a problem solved. \n\nScion Group itself is not helpful as well. I reached out to them with my complaints while taking the post move-in survey. They said they would be in contact but weeks have passed an I have yet to hear from them. There are clear problems from upper level management and this incompetency can be seen within the planning of the Lark community. \n\nOn a less serious note, I hope everyone looking into living here is ready to invest in physical therapy as the furniture is extremely uncomfortable. \n\nI will suggest to anyone reading this review to not live here. Find somewhere else with more competent staff and a more competent parent company preferably. It truest has been a regret living here and I'm looking forward to the remaining 11 months of torture ahead.",
        "ownerResponse": null
      },
      {
        "author": "Kari B.",
        "rating": 1,
        "review": "Wish I could give 0 stars honestly. This is an extremely predatory apartment complex. They prey on first time students who are desperate for a place, and then they try and suck every last dime out of you. When I first moved in there were FLEAS in my room (which had supposedly been cleaned before I moved in). It took almost 3 weeks to get rid of the fleas, during which time I got eaten alive and didn't get any reimbursement on my rent or anything. They did not tell me the people already in the unit had pets, and then when I asked to switch rooms they told me I WOULD HAVE TO PAY TO SWITCH! Even though it was their mistake! And don't even get me started on the parking- there is never enough spaces if you go anywhere past 5 PM you won't get a space. I even paid for \"premium parking\" and I wouldn't get a space if I worked late that night. They were completely unhelpful during covid, all they did was extend the late period for rent payments by 10 days. The roommates they picked for me were extremely obnoxious and loud, even though on my roommate form I said I would prefer quiet and studious people. DO NOT MOVE IN HERE!! It may seem like a good deal for the price but it's not. Avoid at all costs!!",
        "ownerResponse": {
          "text": "Hi Kari, We work with an exterminator to prevent any infestations and apologize that your experience was unpleasant. For flea infestations, our vendor requires there to be 2 sessions that take about 2 weeks to complete in order to fully exterminate the fleas and their eggs. We consider all application preferences when finding placements for our residents, but not all preferences are guaranteed to be met, including preferences on pets. We offer a limited number of transfers for residents with a fee that covers the required admin work. We understand that finding a parking space is difficult in the evening and late at night, but it is always first come, first served. We do enforce towing during office hours and through our after-hours line. We appreciate your honest feedback so we can work to continually make improvements toward our property. Please feel free to reach out if there is anything else we can help you with."
        }
      },
      {
        "author": "Paola C.",
        "rating": 5,
        "review": "I lived in one of the NXNW apartment for six months. I loved living there. Everything is brand new, the rooms are very spacious, the kitchen is great. The clubhouse is amazing, you can get as much gourmet coffee as your body can handle, FOR FREE! They do activities  very frequently, they even had a Thanksgiving dinner for the residents! The staff is very good too. I had to break my lease because I got a position in Seattle, and they helped me a lot with the process of breaking the lease. I highly recommend living in NXNW.",
        "ownerResponse": {
          "text": "Paola, thank you so much for the review. We too love the amenities we have to offer, and loved having you as a resident.  We are happy you were able to go through the delegation process with ease, and would love to have you as a resident again if you are ever in the Bellingham area."
        }
      },
      {
        "author": "Scott R.",
        "rating": 1,
        "review": "DON'T SIGN A LEASE HERE!!!\n\n(You guys really suck, can't wait for your business model to collapse on itself!!)\n \nIf you're thinking of living here don't! The monthly electric bill is through the roof (My average is $100 for 2 people) and you hear all your neighbors having sex because the walls are so poorly insulated. Yeah, cool, its fancier than the dorms, but most-certiantly not worth it for the collective $1530+ they charge for a 2-room apartment ---- THERE AREN'T ENOUGH PARKING SPOTS FOR EVERYONE AND ABOUT 1/2 OF THE SPOTS THEY HAVE COST $30/MONTH EXTRA!!! ---- They also like to have \"Quarterly Inspections\" that, for me, resulted in $400+ damage charges, 2 months after the inspection, to replace a couch that isn't even worth $400!!",
        "ownerResponse": null
      },
      {
        "author": "Hailey B.",
        "rating": 5,
        "review": "Rooms are furnished and are perfect for off campus housing! NXNW has community events that helps connect residents and makes everyone feel welcome! The workers are very helpful and strive to make all the residents satisfied. This is my second year and I have loved staying here! If you're looking for a great place to live then this is a great selection!",
        "ownerResponse": {
          "text": "Hailey, thank you so much for your review.  We love hearing from residents about their experience while living at NXNW.  If we can be of any further assistance, please do not hesitate reaching out to us!"
        }
      },
      {
        "author": "Danny A.",
        "rating": 1,
        "review": "To give you an example of how much Lark actually cares for their tenants, let me layout how I was recently treated. I have lived here the entire year with my car and recently found out my car was towed. How I found out is where the issue lies; my phone number is on call, my license plate and car description is connected with my car (as well as a sticker showing that I am a resident here), but I had to CALL the towing company myself after however many days it's been impounded and find out that I'm being charged $500 to retrieve my car that I have parked in my own apartment complex. Not ONCE was I notified by any of management that my car was being towed nor do I know WHY my car was towed. I have been unable to reach any of management for the urgency of this issue to find recourse for this or to even find out why I wasn't even simply contacted. Lark Bellingham takes a shoot first, ask questions later kind of aggressive approach with all issues that don't concern them, yet when you as a tenant have an issue, I guarantee most of the time you won't actually get more than a \"We're sorry!\" This has occurred in multiple situations. My roommates car was broken into earlier this year while parked on the complex and had an expensive subwoofer in (his car was lock, the window was literally smashed.) Something like this would normally be easily solved by having security on site, right? Well, Lark claims they do, but they have gone through at least 6 security officers in the span of this year and none of them have offered any actual protection to a complex as big as this. When he contacted management, all they did was point to the lease and say they're not responsible. Lark will take to their lease agreement and offer no recourse or assistance in any time of need; my neighbors were broken into and it took them weeks to send out an email which just stated \"Just keep your doors locked!\" I would not recommend Lark to anyone.",
        "ownerResponse": null
      },
      {
        "author": "Jayda D.",
        "rating": 1,
        "review": "PLEASE READ!!!!!!\nThis place deserves 0 stars. I have lived here for only a few months and it is already terrible. I woke up one morning to find that my car been improperly towed, no notification from lark at all but they okayed the tow. I was told I didn't have a sticker but I had it placed where I was told to put it and their excuse was that \"it was dark and we didn't see it\" have you ever heard of a flashlight?! Lark makes residents pay and extra $30 for a reserved spot yet they can't seem to enforce parking AT ALL! They will lie to you and say their doing their best but it's all a lie. I was told that after hours there is nothing they can do! Residents are the one that need to call the towing company and report improperly parked cars! So my question is why are we having to pay an extra $30 each month if you can't even enforce the parking rules 24/7?! Lark also states that this is a gated community which in some cases it is but in reality they leave the gate open from 7am to 7pm for anyone and everyone to come in and if it's after 7 people that don't live there park outside the gate and wait for someone else to scan their card and sneak in. The management is corrupt saying that they care for their residents yet they suck them dry of their money. Because of larks mistakes I missed work as well as my dad because he had to get my car that they improperly towed having to drive all the way from downtown Seattle to Bellingham and all they offered was to take $30 off my next rent... is that a joke? That was slap in the face to me and clearly showed that all this place cares about is talking as much money as they can from students. It's so sad. Please do not sign a lease here, lark does not deserve the time of day or your money find a place that actually cares for its residents and not just suck them dry. Lark was also formerly known as NXNW and many residents believe the name changed happened because a naked man was masterbating outside in the apartment complex and the police had to shoot him with salt bullets, lark makes it seem like they are a perfect student houseing center but in reality it's party central drugs party's and alcohol 24/7 with no ways to file a complaint. Management is as fake as they come! If you want to have a happy year I would think again before signing here \n\nHere is proof https://youtu.be/iUKMG6ZtTeY",
        "ownerResponse": null
      },
      {
        "author": "T P.",
        "rating": 1,
        "review": "My daughter signed a lease last spring without my permission. I was sent a guarantor request, but never signed it. Literally the day after she signed it, we let Lark know that this was not going to work out. My daughter and her friend found a roommate to take my daughter's place in the apartment, yet Lark is still insisting that they did that, and she needs to pay $400. If she doesn't they are threatening to send her and me to collections. I'm still not sure how I am on the hook never having signed anything.\nIf this group is supposed to be providing housing for students, they should not be using predatory practices to get students who are still in high school to sign leases, and then using punitive charges to make money off of them. \nKeep your child away if possible. The university is there for kids. This place is just out to make money.",
        "ownerResponse": null
      },
      {
        "author": "Samantha B.",
        "rating": 1,
        "review": "Do not move here. It was probably the worst experience of my life. They say they provide a bus but half of the time it's shut down. When you leave if there's a tiny bend in your blinds they will charge you a huge amount for anything they don't think is perfect-even if when you moved in it everything was already scratched. Our sink even fell through our counter that's how cheap everything is made. They will sign you up for insurance you don't want without asking which my insurance agency said is illegal. This all happened to me first hand.",
        "ownerResponse": {
          "text": "Hi Samantha, thank you for providing your feedback. We apologize that you have experienced our shuttle being out of service due to maintenance repairs. We do have the city WTA shuttle that comes by our property everyday. Renter's insurance is required while residing at Lark; however, residents are able to provide their own renter's insurance instead of going through our preferred insurance. We apologize that you had an unpleasant experience during your time here. Please let us know if we can help you with anything."
        }
      },
      {
        "author": "Alaina S.",
        "rating": 1,
        "review": "I would give 0 stars if I could. Way too overpriced, terrible customer service, the office is run by college students who have no idea how to help or what direction to point you in if you do need help, everything is broken constantly, parking is a nightmare unless there's a global pandemic happening so students are staying home, and no noise complaints are enforced (they told me it was my problem to tell them to be quiet). Not to mention the carpenter ant infestation we complained about and were told that it was probably due to our living conditions insinuating we were unsanitary. The garbage and recycling are constantly overflowing and there is broke glass everywhere, even the parking lot in the back corner of the complex where my building is located. There's a serious mold problem in both units I've lived in. When you move out of a unit they charge you ridiculous rates for cleaning services and maintenance only for the unit you move into to be disgusting and in disrepair. The units have paint all over the floors and when we moved in there was a giant white spot on the teal wall from them patching a hole and not bothering to repaint. The previous tenants broke the couch but it wasn't replaced so we will probably be charged for it when we move out despite us not being the ones to break it. I think I would have preferred to live in someone's basement. At least it would have been quieter.",
        "ownerResponse": {
          "text": "Hi Alaina, thank you for taking the time to provide feedback.  We are extremely sorry to hear about your negative experiences at Lark Bellingham. Feedback like this helps us to continue improving our residents experiences. We have tried reaching out to you via phone, but we must've caught you at a bad time. At your earliest convenience please give us a call back at (360) 778-1500, our office hours are Monday-Friday 10am-7pm and Saturdays 10am-5pm."
        }
      },
      {
        "author": "Elle P.",
        "rating": 1,
        "review": "As a parent, I would say we are pretty disappointed with this place. Each and everything possible thing about this place is cheap-- except the rent. The walls are paper thin; you can hear everything that is happening in every room around you. The furniture and lighting are horrible, so plan to pay more for things that make it more comfortable.  The amenities are a joke. It is far from campus and kids really feel burdened to get to class. The location is so depressing: stuck between the ass end of a Fred Myer and the highway. Our daughter and her roommates can't wait to get out and boy oh boy is she bummed that she agreed that she'd be responsible for paying rent over the summer. There's nothing luxurious, convenient or healthy about this place. Help your child find somewhere else and don't be talked into this place. You will both regret it.",
        "ownerResponse": {
          "text": "Elle, were sorry to hear you feel that way but we thank you for the feedback. We always want to have our ear to the ground so we can better assist our residents. In terms of access to campus, we offer a shuttle that runs 5 days a week to and from Western every half an hour during normal class times. As for the location, many residents find it convenient being next to a full service grocery store. Look for a direct message from us and we can come to some solutions!"
        }
      },
      {
        "author": "Kim K.",
        "rating": 1,
        "review": "We were seduced early 2015 before the apartments were completed. It looked like an awesome place for my child to live. However, her roommate backed out before school ended and it has been a nightmare since then.  My daughter is being bullied by the roommate that they (NXNW) matched her with and is living in a less than ideal situation. We have talked to management numerous times but it always comes back to the fact that we signed a contract.  Bottom line, big corporation with little regard for the student's/tenant's welfare.",
        "ownerResponse": null
      },
      {
        "author": "Madison M.",
        "rating": 1,
        "review": "Please for the love of god don't rent here. Don't mistake my one star for actually having any appreciation for this place; everything about this place is terrible and while half the stuff they advertise is complete lies, the other half is majorly exaggerated. \n\n- free parking? Nope! Their website implies that parking is free for everyone and that spots are always available, 90% of the time all parking is entirely full except for spots you pay $40 A MONTH FOR. Not only is it $40 extra to have access to an amenity they promised was free, but I have been on the waiting list for a reserved pass for almost 3 months. So, yeah, I'd even pay for parking if i could. Also, don't try temporarily using a reserved spot just until a resident spot opens; your car will get towed at 1 am 30 minutes after parking there! \n- private shuttle bus to WWU? Yeah, if you can manage to get a spot! Students are stuffed on the bus like sardines, some sitting on the floor just to pray they can make it to class on time. For a complex with hundreds of students, you think the shuttle would be able to fit more than maybe 25 people. Also, the shuttle is frequently shut down with no more than 12 hours notice for \"maintenance\"; once it was gone for three days while they gave it an ugly new decal. \n- $200 pet fee per year? Yeah, but there are rules they don't advertise: you can't have more than 2 pets, it's $200 per pet, and they'll make it as hard as possible to get any information. I was trying to emergency foster a small litter of kittens and the office was rude and condescending to me, as well as completely unwilling to help. \n\nThe walls to other apartments are thin. Noise complaints aren't verified and you'll be held responsible even if you and your roommate were ASLEEP when the complaint was filed. The desk attendants are friendly but absolutely clueless and all give different information. When I filed a complaint about parking, the response i got was rude and suggested that I uber to work so I don't have to worry about their incompetent amount of parking (ubering to my job would cost around $30-$40 every night, which is almost as much as I make in one shift). When I filed a maintenance request about my dishwasher that wasn't cleaning dishes, I was told that I was \"putting the dishes in wrong\" and that bowls and pots weren't supposed to go on the bottom rack of the dishwasher even though that's exactly how a dishwasher works. Maintenance was either clueless or too lazy to fix it. Maintenance will enter your apartment with no regard for you or your privacy completely unannounced. Amenities will be taken away with 0 notification to the students; one of the biggest things that drew me to this place was the tanning beds they advertised. I suffer from seasonal depression and I was thrilled when I learned they offered tanning beds, only to be replaced with a \"meditation room\" with no notification to the residents. Security once yelled at us for playing music with our windows open at 9:30 pm on a Friday. Rooms are much smaller than they show them off to be. Wifi that's provided is slow and unreliable. All communication with the complex is condescending and rude. Drywall is cracked and waterlogged because of faulty appliances. Lights frequently flicker for no reason. \n\nOn top of all of this, our rent is $1700 a month. Lark Bellingham is taking advantage of and scamming students. I loved this place at first but everything advertised is gold plated. Take your money somewhere else.",
        "ownerResponse": null
      },
      {
        "author": "Jarod S.",
        "rating": 1,
        "review": "I pay extra for parking and just in 3 months I have had to park outside of the complex so many time just because I work late. I get the reserve sticker but it means nothing people can park wherever they want. If you want you car to be in the lot just make sure you dont go anywhere past 7 especially on the weekends.",
        "ownerResponse": null
      },
      {
        "author": "Ai H.",
        "rating": 5,
        "review": "nice place. Nice officers and quickly solve the problems. Furniture. Include and they are nice. Also a safe place to live and you need card to get in after 8in weekdays and 6 at weekends. Shuttle bus also helps a lot.",
        "ownerResponse": null
      },
      {
        "author": "Gordon Schiff S.",
        "rating": 1,
        "review": "The apartments are fairly nice.  Be aware that this company is very aggressive about collecting any move out fees and will send you threatening letter indicating that they will report you to National Credit Services if you do not pay this fee within 2 weeks.   Take this threat seriously and pay your fees or they will attempt to ruin you credit.  We paid the fees within a month of move out and they did report us to a credit agency the month after payment. It has been a hassle getting our credit fixed.  We were able to prove payment prior to the company sending us to collections and I think this is straight now.  Probably best to avoid this company from the start.",
        "ownerResponse": null
      },
      {
        "author": "Debbie T.",
        "rating": 1,
        "review": "Be aware of their move out policy. My son paid the penalty fee for an extra 24 hours to vacate his apartment, but staff and vendors cleared it within the 24 hours and without his permission. There was also no system in place: some items were bagged/tagged for him, although many items were tagged incorrectly; some items had been thrown away; and some items were on staff member's desks - it looked like they were keeping things for themselves! Staff were not helpful and simply called it a 'miscommunication within their team'. They did waive the penalty fee. However, there are many important documents and personal items that are now permanently lost. Just be warned!",
        "ownerResponse": {
          "text": "Debbie, thank you for your feedback and review of our community. Our accounts manager has already spoken with you about this matter. When we go into the apartment upon move out, we do identify items of value and importance, and things that are irreplaceable. This would include documents, electronics, clothes, etc. When it comes to trashing out any other items, this would be any trash that was left such as toiletries, dishes, pans, household items, etc. A holdover fee was assessed due to the apartment still being occupied past his agreement end date. Our staff did reach out to Joseph on move out to explain that there was a fee being assessed, and he confirmed he would be getting his items that night. It is simply a holdover fee for not turning in keys on time, we still take possession of the apartment at that time. As he did not come to remove his belongings that night, at that point, we do go in and begin clearing the apartment. We did bag and tag his items, and then set it aside in our office for him to come pick them up. If you have any further questions about this, please reach out to our office at 360-778-1500 or office@larkbellingham.com"
        }
      },
      {
        "author": "Allie S.",
        "rating": 4,
        "review": "This place is great. It has tons of amenities and free coffee is always a plus. The only down side is that if people are hanging out in the court yard it makes everything very loud.",
        "ownerResponse": null
      },
      {
        "author": "Danielle L.",
        "rating": 4,
        "review": "NXNW is a beautiful site, with the most luxurious amenities. The maintainable staff is outstanding and is not thanked enough for their never ending hard work. I think some of the managers are not the kindest or easiest to work with, they are sales people, but over all, I cannot imagine living anywhere in Bellingham after living in such a beautiful community.",
        "ownerResponse": null
      },
      {
        "author": "Kim R.",
        "rating": 1,
        "review": "I wish there was a zero star...alas but I have to give one.  My son lived there for a year.  Early spring before move out in August he kept getting hammered to sign a lease for the next year.  He did so and then they told him he did not qualify without a co-signer.  I got an email to co-sign for him.  I called them in less than 24 hours after he signed and asked that it be cancelled as he did not qualify and I was between jobs at that time and was not in a position to co-sign and I felt like he could do better than the outrageous rent he was paying there.  The person I spoke with said no problem it would be cancelled.  I again asked, \"so I will not be getting a final fee for this at move out?\"  Rep--\"oh, definitely not m'am we will tear it up\".  Even though I provided multiple emails and told them about this conversation I had to pay over 500 bucks or they were going to turn him and myself into collections.  They also charged for an HDMI cord that never existed.  Run, don't walk, away from this place.",
        "ownerResponse": null
      },
      {
        "author": "Lynne D.",
        "rating": 1,
        "review": "Please be wary of the pressure tactics used by NXNW on these young inexperienced college students.  My child was high pressured into re-signing a lease for another year thinking there was a way to easily back out.  The price was hiked up without his knowledge as well.  There is NO CANCELLATION POLICY once you sign a rental agreement.  NO WAY OUT.  As the guarantor (I pay the rent, not my kid), I was contacted by email AFTER the 72 hour period where we could have legally gotten out of the contract, asking me to sign the new lease, which I find very suspicious.  The staff was very friendly when it came to seducing us on leasing an apartment last August for the first time but, now, after my child unwittingly renewed the lease and we notified them of the misunderstanding, their \"customer service\" took a complete 180 degree turn.  NXNW is owned by a large corporation and staff has obviously been trained in this strategy of high pressure sales and retention, then once a contract is signed, they behave with complete inflexibility if a misunderstanding has occurred in dealing with the young and inexperienced tenants.",
        "ownerResponse": null
      },
      {
        "author": "Morgan P.",
        "rating": 4,
        "review": "a nice modern living space for a decent price, NXNW is a pretty nice place to live for a student. Not only are there various amenities at our disposal, but all students can ride the shuttle bus back and forth from school, saving $$ on transportation. the free coffee in the game room is a nice addition. Honestly just having my own bathroom is a blessing in itself. Maintenance is always there to fix any issues that come about.",
        "ownerResponse": null
      },
      {
        "author": "Kendra D.",
        "rating": 4,
        "review": "Everything seems to be very good, except I don't like that the tanning beds are included in our rent since I never use them and never will. However, I do really like that the staff is nice and very helpful! The club house is also super awesome by including a mini market, free coffee, a 24hr gym, computers, and plenty of space to hang out with roommates and friends.",
        "ownerResponse": null
      },
      {
        "author": "Sidney N.",
        "rating": 5,
        "review": "So far I,ve had a great experience with the NXWN apartment buildings. Everyone who works there is super kind and ready to answer any questions or concerns you have!",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 188,
  "adjusted_average_rating": 2.42,
  "summary": "<article class='review-summary'><section><h2>Disclaimer</h2><p>This article provides a summary of reviews for Lark Bellingham, generated by ChatGPT. It intends to provide an analysis of customer opinions and experiences with the property. As an AI language model, I strive to remain neutral and present a well-rounded view without bias, but please be mindful that it is not a substitute for personal research and due diligence when considering a property management company or rental property.</p></section><section><h2>Good</h2><p>Some residents have had positive experiences at Lark Bellingham, praising the amenities offered, such as the 24-hour fitness center, resident lounge, game room, and shuttle to campus. The pet-friendly policy and community events have contributed to a sense of belonging for some tenants. They've appreciated the support from friendly and helpful staff members who resolved issues promptly as well as the provision of furnished units that include spacious personal areas with private bathrooms and walk-in closets.</p><p>For a number of tenants, Lark Bellingham has been a satisfactory living choice. Their experiences have been enhanced by the convenience of having retail stores like Fred Meyer close by, along with the added security of gated access. The coffee services and study spaces have been remarked upon as highly valuable, along with the orderly package pick-up system. Few residents highlighted the company's capability to address and resolve maintenance matters swiftly and professionally.</p></section><section><h2>Great</h2><p>A group of contented tenants appreciated Lark Bellingham's aesthetics, describing the complex as modern with luxurious touches. They were content with their living space, finding the furnished apartments comfortable and the buildings well-maintained. Positive notes were also mentioned concerning the safety of the neighborhood and the inclusive community vibe supported by amenities like volleyball courts, BBQs, and fire pits.</p><p>Some residents stated that Lark Bellingham was an ideal locale for student living due to its proximity to Western Washington University, the availability of shuttle service to campus, and the community's vibrant atmosphere. The pet-friendly policy was lauded by pet owners, and the promptness of the maintenance team in fixing apartment issues was also appreciated, sidelining minor glitches. Overall, these residents recommended Lark Bellingham as a viable living option, especially for the student community.</p></section><section><h2>Bad</h2><p>Among the criticisms, tenants have expressed concerns about the lack of parking space, with those returning home late often unable to find a spot. The existence of security services was questioned due to perceived inefficiencies and lack of visibility, as residents reported incidents of car break-ins, thefts, and other security threats. Staff members, while friendly, were often described as ill-equipped to resolve issues or provide clear direction when problems arose.</p><p>Internet connectivity issues at Lark Bellingham have caused frustration among some residents. Complaints include slow, unreliable Wi-Fi and technical problems that were not always rapidly remedied. Additionally, the thin walls and insufficient insulation resulted in noise disturbances and high heating bills during winter, affecting the quality of life for some tenants. Frequent inspections and privacy intrusions by maintenance staff without appropriate notices also fueled discontentment.</p></section><section><h2>Ugly</h2><p>Some residents experienced significant distress due to Lark Bellingham's management practices, feeling that the company's actions were predatory towards less experienced renters like college students. Reports of aggressive marketing, deceitful lease terms, and refusal to break contracts even in extenuating circumstances were common grievances. A number of individuals felt taken advantage of financially, with unexpected and high charges for damages upon moving out, and had severe miscommunications that led to collections and credit issues.</p><p>Tenants have expressed serious dissatisfaction with management's alleged negligent and profit-driven attitude. Incidents like improper towing of vehicles and a disregard for living conditions were mentioned, leading some to assert that their basic rights as tenants were undermined. Troubling roommate matchings that did not align with preferences, lack of responsiveness to complaints, and overall mistrust in the company's business ethics and legality of leasing practices were pervasive themes in the negative reviews.</p></section></article>"
}