{
  "name": "Local Property Management",
  "slug": "local-property-management",
  "company_type": "Company",
  "address": "810 Harris Ave, Bellingham, WA 98225",
  "review_count": 17,
  "average_rating": 3.88,
  "reviews": {
    "google_reviews": [
      {
        "author": "Susan Zanol",
        "rating": 5.0,
        "review": "Superb! I have rented from Local Property Management for 4 1/2 years. Staff is highly competent and totally tenant centered without being the least bit intrusive. Rent is reasonable and so are increases. In fact, this year there was no increase at a time when huge rent increases are in the news. When I have had maintenance issues, they were taken care of immediately. I have noticed units for rent go fast. I am certain that is because Local Property Management is the very best!",
        "ownerResponse": null
      },
      {
        "author": "Evan Jacobson",
        "rating": 1.0,
        "review": "Do not rent with this company they will nickel and dime you for every chance they get they make up bogus fines and violations also the employees seem completely useless and incompetent.",
        "ownerResponse": {
          "text": "Hi Evan.\n\nI'm sorry to hear that you're so upset that we chose to impose consequences for your actions. Apparently we \"nickel and dime you\" every chance we get, but the only fine we have imposed during your entire tenancy with us was for when a City of Bellingham inspector found that tenants in your unit removed and otherwise failed to maintain several smoke and/or carbon monoxide detectors. Go ahead and ask your neighbors if they've ever been randomly fined. We manage those houses too. Surely if this is a common practice by us, then your neighbors would have similar experiences. But I can tell you right now that they haven't been. We issue fines when there are clear and serious lease violations. Don't violate your lease and you won't get fined.\n\nAlso, this fine is not something we \"made up,\" and it's certainly not \"bogus.\" Not only is your responsibility to maintain your smoke detectors clearly spelled out in your lease agreement, it's also codified into law (including the associated fine) by RCW 43.44.110. Anywhere you rent in Washington will have this policy and associated fine. Furthermore, specific clauses or RCWs shouldn't be required to know that you shouldn't remove batteries from essential safety equipment or detach/disable them entirely. This should be common sense. This violation represents a serious safety hazard that we want to emphasize, something with which you should be well familiar after your household held a wild party on top of your brand new roof we freshly installed (the only other time you've violated your lease, and you'll note that we did not issue any sort of fine for that).\n\nThere are other companies in town that will treat their tenants like piggy banks. They'll charge you an administration fee upon move-in (usually several hundred dollars), and for violations like the ones mentioned above, they'll tack on \"serve notice fees.\" We don't do any of that, and we certainly don't go around looking for reasons to fine people. Again, this was a *City of Bellingham* inspection that found these safety violations - not us. We have to act on these inspection findings, or we can get penalized by the city. \n\nWe take care of our properties. Remember that fresh roof on which you decided to throw a party? That's part of our ongoing and constant campaign to upkeep our properties. We didn't wait until it was a serious problem. We didn't wait until it started leaking. You didn't have to beg us to do this. We did it proactively. We're not at all shy about spending money to maintain our units, even though that ultimately hurts our bottom line. With all the stories going around about landlords who have to be fined by the city, or forced to sell their properties because they let them fall so far into dilapidation that they are unlivable, you'd think tenants would be appreciative of landlords' efforts to make voluntary improvements to their rentals.\n\nIt's clear you wrote this review in anger because we imposed consequences for your negligence. Perhaps when you cool down you'll consider removing this review. I hope it's clear to everyone reading that your assessment of our actions is not fair or accurate and that you deserved the fine you got. And, not for nothing, calling our employees \"useless and incompetent\" is needlessly rude.\n\nI hope you never have to experience the true slumlord behavior that is rampant throughout this industry, because if you think being fined for removing your smoke detector batteries is bad, you are not ready for the greater rental market. Despite your unfair review and your mean-spirited insults, I wish you all the best.\n\n-James"
        }
      },
      {
        "author": "Rhonda Steel",
        "rating": 5.0,
        "review": "This property management is phenomenal and responsive. The management office is easily accessible on site in the Fairhaven location, w/ protected parking and protected mail. The apartments are good quality comparatively.",
        "ownerResponse": null
      },
      {
        "author": "Meghan Lopez",
        "rating": 5.0,
        "review": "Local Property takes care of its tenants!! Every request for maintenance was responded to within days, and the manager Dawnah is easy to reach and communicate with; she will always respond to your emails within a day. Our experience renting from Local Property was smooth and everything else we could have hoped for.",
        "ownerResponse": null
      },
      {
        "author": "AJ Bernstein",
        "rating": 1.0,
        "review": "Very poor management, bad communication, extremely rude and unprofessional, DONT RENT WITH THEM",
        "ownerResponse": {
          "text": "Hi AJ,\n\nFor those reading, AJ is a roommate of Evan, who wrote an unfairly negative review after his household was fined for removing/improperly maintaining smoke detectors.\n\nBut thank you, AJ, for giving me the opportunity to provide further context. As stated in the response to Evan's review, you had no issues with us as management until two things happened, both of which were entirely the fault of your residence:\n\n1. Throwing a wild party on your brand new rooftop - an optional, voluntary improvement that we decided to do without any request or mandate of any kind.\n\n2. When the City of Bellingham inspectors found that your household had removed and otherwise failed to maintain smoke detectors.\n\nYour household initially demanded that we provide you a copy of the report, because you didn't believe us. We did so, happily and willingly, but then suddenly the fine is \"bogus,\" and the fact that we imposed consequences means we are \"very poor management\" with \"bad communication.\"\n\nIt is also very interesting to note that none of your neighbors have been fined or issued 10-day notices to comply even though we manage those properties as well. If we were so \"extremely rude and unprofessional,\" wouldn't all of your neighbors have had similar experiences? Unless of course, there was some difference in the tenancy of your unit and theirs, like, for instance, multiple lease violations.\n\nIt seems like, if you don't throw wild rooftop parties or fail to maintain essential safety equipment, then you won't have any issues with us.\n\nIt's truly unfortunate that you have used our imposition of consequences for your actions to launch a crusade of misinformation intended to harm our reputation, when, if you had just done what most other tenants seem to have no problem doing, you would never have ran into issues with us.\n\nWe weren't playing gotcha - this was a city of Bellingham inspection that found your lease violations, not us. And we also aren't making up \"bogus\" fines. The fine is written into Washington State law. By leaving this review, all you're doing is trying to punish us for enforcing your lease. \n\nI'll issue a final note to everyone reading this: if you're a good tenant, who will take good care of your rental property and abide by the obvious and common sense terms of your lease, I guarantee you'll have no issues with us. We have a great reputation in town for this exact reason.\n\nTo you, AJ, I'm sorry that your experience hasn't been what you hoped. I think you can use this experience going forward and learn how to take better care of the properties you rent so you can avoid these hassles in the future.\n\nI wish you only the best.\n\n-James"
        }
      },
      {
        "author": "Jessica Danielle",
        "rating": 5.0,
        "review": "Dawnah and James are a joy to work with, very responsive, kind and understanding! Probably the best rental company Ive ever worked with in Bellingham (out of a lot), definitely would love to continue renting from them in the future",
        "ownerResponse": null
      },
      {
        "author": "Sandra Lewis",
        "rating": 5.0,
        "review": "Good experience.  My son rented for two years.  They try their best to be good managers!  Manager gets busy at times, but always got back with us...but not many issues.  Would recommend!",
        "ownerResponse": null
      },
      {
        "author": "Silas Uhder",
        "rating": 5.0,
        "review": "Hands down the best property management company in Bellingham. They are responsive, professional and won't rip you off like some of the other companies in Bellingham.",
        "ownerResponse": null
      },
      {
        "author": "Sandor Voros",
        "rating": 5.0,
        "review": "A great place to rent from! They respond quickly to emails and maintenance requests and do not try to shell money out of you.",
        "ownerResponse": null
      },
      {
        "author": "John and Gretchen",
        "rating": 5.0,
        "review": "From beginning to end, there has been great communication and the unit we rented was very nice and high quality! Would recommend!",
        "ownerResponse": null
      },
      {
        "author": "Ashley V",
        "rating": 5.0,
        "review": "My favorite place to rent from so far! Very clean, nice and responsive management too!",
        "ownerResponse": {
          "text": "Aw, thanks Ashley! We are sad to see you go, and we wish you all the best.\n\n-James & Dawnah"
        }
      },
      {
        "author": "Brian Gass",
        "rating": 5.0,
        "review": "Great company. They are responsive to issues and address them promptly.  Always professional when interacting with them.",
        "ownerResponse": null
      },
      {
        "author": "Merve Candemir",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Eli J",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Renee D.",
        "rating": 5,
        "review": "Local Property management offers a professional rental experience and is prompt, friendly, and efficient throughout the entire process.",
        "ownerResponse": null
      },
      {
        "author": "Kiana O.",
        "rating": 1,
        "review": "If you like being scammed rent from Local\nProperty! I lived there for several months and experienced several in inconveniences and terrible customer service.",
        "ownerResponse": {
          "text": "Hi Kiana,\n\nUnfortunately, your description does not at all line up with the facts of your tenancy with us. You repeatedly violated the lease agreement, left your apartment a complete mess and then tried to use photos from someone else's listing to deceive us (something you admitted to doing in your subsequent communication with us). I am happy to provide those records if you now don't recall doing so.\n\nI am sorry that you were clearly unhappy living with us - that is not what we want at all, and we work very hard on resident satisfaction. Our Google reviews, which are much more popular than yelp, show that we have one of the highest ratings in all of Bellingham. But still, that is no excuse to continue to lie and smear our name.\n\nI hope you'll find it in you to update or delete your review in accordance with honesty and integrity.\n\nWe wish you all the best.\n\n-James"
        }
      },
      {
        "author": "Billie R.",
        "rating": 1,
        "review": "Completely dis-organized and could care less about potential customers time.  Called on a property, Tonya said they wouldn't be showing it for a week and a half, gave me a day and time.  Tonya ended up calling me back that evening to advise she gave me the wrong day.\n\nShowed up to the property, with 3 other people and waited 15 minutes.  Finally called to find out it had been rented.\n\nNot only did she/they not call us back to give us the courtesy of not wasting our time, no apologies were made.  She obviously had my name and number.\n\nI will not do business with a company that has such a disregard for people and their time.  I find this rude.  \nA call could have been made at any time that the house had been rented. Mind you, it is still listed on their website.  \n\nFar to many property management companies in this town.  \n\n1 star because they do not offer NEGATIVE STARS option.",
        "ownerResponse": {
          "text": "Hi Billie,\n\nThere is no excuse for what happened when you interacted with our business, and I'm sorry this review didn't get a response sooner. We are much more active on Google reviews, so these few Yelp ones tend to slip through the cracks.\n\nAlso, with this review being so old, I can assure you that management has changed up significantly. I am James, the new manager. Been working here for two years now and have a strong emphasis on resident satisfaction - the aforementioned Google reviews will show that effort to be successful.\n\nWhile I know there's nothing we can do to undo what happened when we were under less effective management, I hope you'll keep a look out for any of our listings again if you should need housing. I promise you won't be disappointed!\n\nHave a wonderful day.\n\n-James"
        }
      }
    ]
  },
  "adjusted_review_count": 15,
  "adjusted_average_rating": 3.93,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the Good category, Local Property Management has been described as exceptional when it comes to maintaining equipment and responding to maintenance issues. Several user reviews commend the staff for being \"highly competent and totally tenant centered,\" highlighting that rent increases are reasonable and at times non-existent even amidst reporting of significant rent hikes elsewhere. A particular positive note from one previous tenant includes swift actions taken by the company's management team to address all maintenance requests rapidly, ensuring a hassle-free living experience.</p><p>User reviews also appreciate the on-site manageability, accessible office location in the Fairhaven area, and quality of apartments under the management's portfolio. Tenants have expressed satisfaction with how their rental experiences were handled, specifically pointing out that units were nice, high-quality, and managed by a prompt and friendly team. It is evident that the company strives to deliver a professional service and it reflects positively in these reviews.</p></section><section><h2>Great</h2><p>A highlight for many tenants has been the customer service offered by Local Property Management, with staff like Dawnah and James receiving specific mentions for their responsive, kind, and understanding nature. Furthermore, users have expressed that their interactions with the company were always professional and issues were addressed in a timely manner. Excellent management practices are regularly noted, with tenants reporting few or no issues and recommending the company to potential renters.</p><p>Another example of the company going above and beyond includes an acknowledgement of proactive improvements made to properties, including an unsolicited roof repair that speaks to the initiative the company takes towards property upkeep. Long-term renters have had positive experiences, affirming the great communication and quality service provided throughout their stay, with continued willingness to rent from them in the future. This section of the article illustrates the company's dedication to not only meet but also exceed tenant expectations.</p></section><section><h2>Bad</h2><p>On the less favorable side, user reviews have brought up some concerning issues regarding Local Property Management. Some tenants have reported bad communication and rude treatment, with a tone of unprofessionalism highlighted by a couple of dissatisfied renters. These complaints are significant because they indicate a stark contrast to the positive experiences reported by others, suggesting a possible inconsistency in the company's approach to tenant relations.</p><plus>The management's approach to enforcing lease agreements and handling violations has also been criticized, with specific instances where fines for lease violations were considered unwarranted or excessive by the tenants. While management has responded to these allegations, explaining the rationale behind their actions and emphasizing the importance of adhering to lease terms, the negative sentiment expressed by these reviewers underscores the importance of clear and fair communication regarding tenancy rules and responsibilities.</p></section><section><h2>Ugly</h2><p>The Ugly aspects of Local Property Management, based on user reviews, have dealt a blow to the company's reputation. A reviewer described an experience that involved deception on their part during the moving out process and a seemingly retaliatory stance from management. The company's management has replied to these claims, suggesting a mismatch between the tenant's report and actual tenancy facts, and reflecting an unsavory encounter that signals issues with transparency and trustworthiness from both parties.</p><p>Additionally, another user's experience depicted a lack of organizational skills, sharing that after being scheduled for a property viewing, they showed up only to find the property had been rented without any prior notice or an apology from the company. This review not only raises concerns about the company's regard for potential customers' time but also questions their method of communication and follow-up, which should be a standard protocol. Such experiences underline the importance for a property management company to maintain a high level of professional integrity and respect for all clients.</p></section>"
  }
}