{
  "name": "Mahogany Manor",
  "slug": "mahogany-manor",
  "company_type": "property",
  "address": "1300 Mahogany Ave, Bellingham, WA 98226",
  "review_count": 8,
  "average_rating": 2.12,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tracy P",
        "rating": 1.0,
        "review": "I did a lease takeover because I needed something quick that accepted dogs. Im sure this place is fine for a certain demographic but as a nurse for 30 years this is like living in a dorm. Super loud. Nobody picks up their dog poop. Ridiculous management with frequent apartment checks. My lease is up. So freaking glad. Nearly 2000$ per month for a one bedroom and I live under a hundred a twenty pound dog. Peace out PTLA.",
        "ownerResponse": null
      },
      {
        "author": "Brian McGough",
        "rating": 1.0,
        "review": "Won't let you see your apartment beforehand, bad neighbors who don't pic up after dogs. I never walked my dog off leash but was threatened with a $300 fine for walking my dog off leash.\n\nInsane claims about the costs and fees after I left. Don't plan on getting your money back, to owe more money after you leave.\n\nSeleni in the office is nearly impossible to reach unless they want something from the tenant.",
        "ownerResponse": null
      },
      {
        "author": "Wyland Reed",
        "rating": 1.0,
        "review": "It seems lack of communication is a common issue with this complex, I got in for a viewing and had all the communication needed for the tour, but after they got the $90 for my wife and I to apply communication just went dead. It's been almost two weeks and the only time I've had a chance to talk with anyone is by showing face \"since the phone isn't working, and what I could only assume emails aswell\".",
        "ownerResponse": {
          "text": "Thank you for your feedback. The screening process can sometimes take longer than anticipated, and we apologize for the communication delays you experienced. A member of our team should be reaching out to you, if they have not already, to address your concerns."
        }
      },
      {
        "author": "Exploraa Laura",
        "rating": 2.0,
        "review": "Lovely little apartment, but theyre expensive. They take a long time to fix issues in the building or get back to you",
        "ownerResponse": {
          "text": "Thank you for your feedback. We take your concerns seriously, and we appreciate the opportunity to improve. It sounds like a member of our team has spoken with you directly already, but if there is anything else we can do for you, please let us know!"
        }
      },
      {
        "author": "Skye T",
        "rating": 1.0,
        "review": "Psycho prices, an insult to Washingtonians.",
        "ownerResponse": {
          "text": "Thank you for your feedback. We would love the opportunity to address your concerns, but unfortunately we don't have any record of you in our system. Please feel free to reach out to us at your earliest convenience and we would be happy to speak with you."
        }
      },
      {
        "author": "Ryan Van Duisen",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Carlos Torres",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Angela Munson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.2,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT and is intended solely as a tool to assist in the search for a property management company or rental property. The summaries below reflect various user reviews of Mahogany Manor, providing an overview of their experiences without revealing any identifying personal information. The sentiments expressed are based on past reviews and are not necessarily indicative of the current status of the property. This article's intent is to lend perspective on the purported performance of Mahogany Manor's property management.</p>  </section>    <section>    <heading><h2>Good</h2></heading>    <p>Some user reviews highlight the appealing aspects of Mahogany Manor, noting the attractiveness of the apartments themselves. Residents who find the property accommodating mention the benefit of the complex accepting pets, which can be a significant positive for dog owners looking for a rental space in the area.</p>    <p>Furthermore, there are examples where the management responded to reviews with courteous language, expressing a willingness to address concerns. This suggests that at least in the public view, the company responds professionally and is open to engaging dialogue with tenants to resolve issues, which has been acknowledged and appreciated by some reviewers.</p>  </section>    <section>    <heading><h2>Great</h2></heading>    <p>The fact that Mahogany Manor is recognized for allowing pets is a great comfort to certain demographics, catering especially to those residents who treat their pets as family. Additionally, one user has given the property a five-star review, albeit without further details. This indicates that there might be a subset of the tenant population who are content with their living experience at the Manor.</p>    <p>Moreover, the management's practice of responding to some negative reviews signals a degree of accountability. Their responses have included apologies and acknowledgments of communication delays and maintenance issues, with assurances to reach out and address the matters raised. This representativeness and responsiveness is promising, as it provides an avenue for communication and possibly corrective actions.</p>  </section>    <section>    <heading><h2>Bad</h2></heading>    <p>Several user reviews express disparity in upkeep and management responsiveness. In particular, complaints about delayed or insufficient maintenance responses have surfaced often, with tenants feeling frustrated about lengthy waits for fixes and follow-ups. One user described their experience with slow reaction to building issues and general communication as a source of dissatisfaction</p>    <p>Another troubling common theme from the negative reviews is the management's alleged lack of clarity and difficulty in communication. Prospective tenants have reported silence from the management after paying application fees, which raises concerns about transparency and business conduct. These experiences have understandably soured some residents’ perceptions of Mahogany Manor.</p>  </section>    <section>    <heading><h2>Ugly</h2></heading>    <p>The more severe grievances against Mahogany Manor involve financial discrepancies and potential mismanagement. One user described an alarming scenario involving unexpected and what they perceived as unreasonable costs and fees upon departure. Such instances may signal deeper systemic issues within the management's financial administration.</p>    <p>In addition, recurring mention of excessive noise, lack of enforcement of community guidelines (specifically regarding pet waste management), and invasive apartment inspections contribute to a sentiment of discontent amongst some tenants. The repeated nature of these complaints suggests an 'ugly' side to the tenant experience at Mahogany Manor, pointing to areas where property management requires significant improvement.</p>  </section></article>"
}