{
  "name": "Mahogany Manor",
  "slug": "mahogany-manor",
  "company_type": "Property",
  "address": "1300 Mahogany Ave, Bellingham, WA 98226",
  "review_count": 13,
  "average_rating": 2.62,
  "reviews": {
    "google_reviews": [
      {
        "author": "Brock McDaniel",
        "rating": 1,
        "review": "Take the reviews into serious consideration before renting from PTLA.  I can honestly say, only rent from them if you have absolutely have no other choice.  I knew going in it wouldn't be a great experience...but didn't expect it to be as bad as my experience was. Now of course, they manage many different properties all over the county so they differ from location to location... but the blatant neglect of Mahogany Manor, not giving me any other option to relocate when they were dealing with drugs/homeless living in and intruding the building, theft/vandalism (the mail carrier cant even have her hamper to do her job)... I actually questioned the humanity of the employees they had working for them, I truly don't understand how they treat tenants the way they do and go home to their kids and sleep at night.  I got my final move out and just like another recent review, they'll rake you for everything they can... they charged me for lightbulbs and smoke detector (I replaced lightbulbs in the place on my dime during my time there and the smoke detector was fine, actually tested earlier in the year when they did building inspections.) I am so relieved to not be under PTLA anymore, good riddance. Stay far away from them.",
        "owner_response": {
          "text": "Thank you for your review. We appreciate your feedback. We've been working hard to address security and cleanliness at the property, and we are continuing to closely monitor that here. It also looks like you spoke with a member of our team yesterday who was able to address your concerns with your move-out charges and return your full deposit to you. We always welcome past residents to reach out to us if they believe they were charged in error. If there is anything else we can do for you, please let us know."
        }
      },
      {
        "author": "Alyssa Nuno",
        "rating": 5,
        "review": "Lynda, the property manager, is great! I have never had such a good experience renting. She is an excellent communicator and really wants the best for the building and tenants. The building is very nice and all the tenants (that I have interacted with) are great and respectful. Very minimal noise from neighbors and it is so nice to see all the dogs playing in the lawn at sunset. Our unit is very nice and cozy and worth the price. Parking is never an issue, which always seems to be a common problem in big complexes. Also super close to I-5 which is nice for us commuters. Not to mention Costco is RIGHT there.",
        "owner_response": {
          "text": "We're so glad to hear you've had a great experience so far! If there's anything else we can assist you with, please don't hesitate to ask. "
        }
      },
      {
        "author": "R M",
        "rating": 1,
        "review": "Building and units need to be better taken care of and clean. The building on the outside looks very nice but once inside when you walk through the hallways, the carpets look dirty, and the units at move in are not clean and they wont reimburse for cleaning products or waive cleaning fee at move out or tell you, you can request for them to have the unit clean. Doors, walls, floors etc should all be taken care of better with how expensive the units are. For how much money they units are ($2000) for a 1/1, I would assume the units should be more decent, fire detector alarm went off because they battery was dead with just a few weeks of me moving in and they supposedly should have the units check and ready for the next tenant. Lease is up in January and I cant wait to move out.",
        "owner_response": null
      },
      {
        "author": "Veronica Valdelamar",
        "rating": 5,
        "review": "My daughter lives here and its set up pretty nice. Their gym was clean and their community room had everything u could ask for!\nIm so happy for her!",
        "owner_response": {
          "text": "Thank you for your review! We're so glad you and your daughter are pleased with the community! "
        }
      },
      {
        "author": "Karen A",
        "rating": 5,
        "review": "Lynda at Mahogany Manor has been amazing.  She communicates regularly and addresses issue to the tenants.  She always has a ready smile and super helpful with information and problem resolution.",
        "owner_response": {
          "text": "We're so glad to hear you've had a great experience so far! If there's anything else we can assist you with, please don't hesitate to ask. "
        }
      },
      {
        "author": "Tracy P",
        "rating": 1,
        "review": "I did a lease takeover because I needed something quick that accepted dogs. Im sure this place is fine for a certain demographic but as a nurse for 30 years this is like living in a dorm. Super loud. Nobody picks up their dog poop. Ridiculous management with frequent apartment checks. My lease is up. So freaking glad. Nearly 2000$ per month for a one bedroom and I live under a hundred a twenty pound dog. Peace out PTLA.",
        "owner_response": null
      },
      {
        "author": "Vince McGough",
        "rating": 1,
        "review": "Won't let you see your apartment beforehand, bad neighbors who don't pic up after dogs. I never walked my dog off leash but was threatened with a $300 fine for walking my dog off leash.\n\nInsane claims about the costs and fees after I left. Don't plan on getting your money back, to owe more money after you leave.\n\nSeleni in the office is nearly impossible to reach unless they want something from the tenant.",
        "owner_response": null
      },
      {
        "author": "Wyland Reed",
        "rating": 1,
        "review": "It seems lack of communication is a common issue with this complex, I got in for a viewing and had all the communication needed for the tour, but after they got the $90 for my wife and I to apply communication just went dead. It's been almost two weeks and the only time I've had a chance to talk with anyone is by showing face \"since the phone isn't working, and what I could only assume emails aswell\".",
        "owner_response": {
          "text": "Thank you for your feedback. The screening process can sometimes take longer than anticipated, and we apologize for the communication delays you experienced. A member of our team should be reaching out to you, if they have not already, to address your concerns."
        }
      },
      {
        "author": "Exploraa Laura",
        "rating": 2,
        "review": "Lovely little apartment, but theyre expensive. They take a long time to fix issues in the building or get back to you",
        "owner_response": {
          "text": "Thank you for your feedback. We take your concerns seriously, and we appreciate the opportunity to improve. It sounds like a member of our team has spoken with you directly already, but if there is anything else we can do for you, please let us know!"
        }
      },
      {
        "author": "Skye T",
        "rating": 1,
        "review": "Psycho prices, an insult to Washingtonians.",
        "owner_response": {
          "text": "Thank you for your feedback. We would love the opportunity to address your concerns, but unfortunately we don't have any record of you in our system. Please feel free to reach out to us at your earliest convenience and we would be happy to speak with you."
        }
      },
      {
        "author": "Hoke Herrin",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thanks for your review! We're so glad you're happy at Mahogany Manor! "
        }
      },
      {
        "author": "Ryan Van Duisen",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Angela Munson",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 10,
  "adjusted_average_rating": 2.3,
  "distribution": {
    "1": 6,
    "2": 1,
    "3": 2,
    "4": 0,
    "5": 4
  },
  "summary": {
    "created_timestamp": 1739205497,
    "text": "<section id=\"good\"><h2>Good</h2><p>Mahogany Manor has received some favorable feedback from residents and their families, highlighted by the facility's clean and well-equipped amenities such as a gym and community room. Family members of tenants have expressed satisfaction with the property's setup, enjoying the cleanliness and variety of amenities available to residents. These aspects enhance the community feel and imply a degree of attentiveness to the property's communal areas. Another positive aspect noted by a resident is the quiet and respectful neighborhood, contributing to a pleasant living environment. The convenience of the property's location, with easy access to major roads and nearby commercial areas, such as Costco, is also appreciated by commuters. Additionally, parking is reportedly not an issue, which is considered a significant advantage in larger complexes.</p></section><section id=\"great\"><h2>Great</h2><p>One of the brightest highlights of Mahogany Manor is its well-regarded property manager, who has been described as an excellent communicator, ensuring tenant satisfaction by addressing issues promptly. Tenants appreciate her consistent efforts to maintain a positive living experience, underscoring her commitment to both the tenants and the property's upkeep. This personal touch and effective communication seem to significantly boost the property's reputation even in the face of various challenges indicated in other reviews. Furthermore, the units themselves have received individual praise for being cozy, well worth their rental price, and comfortable for the residents, with some tenants specifically appreciating the sense of community fostered within the complex. The property's efforts in resolving issues thoughtfully, as evidenced by their responses to feedback, have left certain residents feeling acknowledged and supported.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positive experiences, Mahogany Manor is not without its downsides, as some residents have pointed out issues with internal maintenance and cleanliness. Common areas, such as hallways and individual units, reportedly need better care, with some residents expressing dissatisfaction over the cleanliness at move-in and a lack of responsiveness regarding maintenance requests. This concern was exacerbated by an unexpected lack of communication post-apartment showings, with potential residents feeling neglected after payment of application fees. For the price of the units, tenants expect a higher standard of service and are disappointed when met with delays in communication or action. Rent prices, which are considered high for the offered conditions, further add to the dissatisfaction, with residents expecting better upkeep and more attentive management in return for their financial commitment.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Unfortunately, some reviews paint a more concerning picture of Mahogany Manor, particularly around security and management issues. Reports of safety issues, such as unauthorized entry and intrusion, have been serious enough for tenants to question the management's commitment to ensuring a safe living environment. Additionally, there have been allegations of unfair move-out charges, with some residents feeling taken advantage of despite taking personal measures to maintain their units. One tenant described aggressive management practices and disputed charges as feeling trapped in a \"dorm-like\" situation, emphasizing the loud environment and frequent disturbances. The management's poor communication regarding these critical concerns impacts their reputation, leaving some residents disillusioned and eager to terminate their leases. Such experiences highlight significant areas where improvements are urgently needed.</p></section>"
  }
}