{
  "name": "Mahogany Manor",
  "slug": "mahogany-manor",
  "company_type": "Property",
  "address": "1300 Mahogany Ave, Bellingham, WA 98226",
  "review_count": 8,
  "average_rating": 2.12,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tracy P",
        "rating": 1.0,
        "review": "I did a lease takeover because I needed something quick that accepted dogs. Im sure this place is fine for a certain demographic but as a nurse for 30 years this is like living in a dorm. Super loud. Nobody picks up their dog poop. Ridiculous management with frequent apartment checks. My lease is up. So freaking glad. Nearly 2000$ per month for a one bedroom and I live under a hundred a twenty pound dog. Peace out PTLA.",
        "ownerResponse": null
      },
      {
        "author": "Brian McGough",
        "rating": 1.0,
        "review": "Won't let you see your apartment beforehand, bad neighbors who don't pic up after dogs. I never walked my dog off leash but was threatened with a $300 fine for walking my dog off leash.\n\nInsane claims about the costs and fees after I left. Don't plan on getting your money back, to owe more money after you leave.\n\nSeleni in the office is nearly impossible to reach unless they want something from the tenant.",
        "ownerResponse": null
      },
      {
        "author": "Wyland Reed",
        "rating": 1.0,
        "review": "It seems lack of communication is a common issue with this complex, I got in for a viewing and had all the communication needed for the tour, but after they got the $90 for my wife and I to apply communication just went dead. It's been almost two weeks and the only time I've had a chance to talk with anyone is by showing face \"since the phone isn't working, and what I could only assume emails aswell\".",
        "ownerResponse": {
          "text": "Thank you for your feedback. The screening process can sometimes take longer than anticipated, and we apologize for the communication delays you experienced. A member of our team should be reaching out to you, if they have not already, to address your concerns."
        }
      },
      {
        "author": "Exploraa Laura",
        "rating": 2.0,
        "review": "Lovely little apartment, but theyre expensive. They take a long time to fix issues in the building or get back to you",
        "ownerResponse": {
          "text": "Thank you for your feedback. We take your concerns seriously, and we appreciate the opportunity to improve. It sounds like a member of our team has spoken with you directly already, but if there is anything else we can do for you, please let us know!"
        }
      },
      {
        "author": "Skye T",
        "rating": 1.0,
        "review": "Psycho prices, an insult to Washingtonians.",
        "ownerResponse": {
          "text": "Thank you for your feedback. We would love the opportunity to address your concerns, but unfortunately we don't have any record of you in our system. Please feel free to reach out to us at your earliest convenience and we would be happy to speak with you."
        }
      },
      {
        "author": "Ryan Van Duisen",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Carlos Torres",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Angela Munson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.2,
  "summary": {
    "text": "<section><h2>Good</h2><p>In this article, the positive sentiments about Mahogany Manor are relatively scarce. Some tenants have noted the pet-friendly policy as a plus for those with furry companions. However, the specific mentions of positive experiences are limited within the user reviews, suggesting that while there may be some redeeming qualities, they are not often highlighted in tenant feedback.</p><p>Moreover, it's important to recognize that among the user reviews, there was an instance of a positive appraisal from a tenant, reflected in the lone 5-star rating. It should be noted, however, that the review did not include any additional comments or details to expand on this positive impression. The reason for this satisfaction remains unclear without further information.</p></section><section><h2>Great</h2><p>Despite the overall low ratings, Mahogany Manor has attempted to engage with their clientele by responding to some of the complaints and feedback. They have expressed a willingness to address concerns and improve the tenant experience. This is evidenced by their responses to reviews, assuring tenants that their feedback is valued and promising to reach out to discuss problems directly.</p><ume we don't have any record of you in our system. Please feel free to reach out_SECTIONN to us and we would be happy to speak with you.\" These gestures suggest an awareness of customer service and an intention to cultivate a positive relationship with tenants.</p></section><section><h2>Bad</h2><p>User reviews indicate a trend of dissatisfaction related to Mahogany Manor's management and maintenance performance. Several tenants have lamented long waits for repairs and a lack of timely responses to issues within the apartments. One particular user described the apartment as \"lovely little,\" but was frustrated by the slow response to building issues and concerns being addressed, implying a disconnect between management and the maintenance needs of residents.</p><p>Furthermore, the communication breakdown extends beyond maintenance issues. There have been complaints about poor communication during the application process, with a user recounting an experience where communication \"just went dead\" after the application fee had been paid. This lack of consistency in communication contributes to a sentiment of unreliability and neglect from the management team.</p></section><section><h2>Ugly</h2><p>User reviews for Mahogany Manor reveal several deeply concerning issues. From exorbitant pricing that one tenant labeled \"psycho prices,\" to another recounting frequent \"ridiculous\" apartment checks and a living environment comparable to \"living in a dorm\" due to noise levels, there is a shared sentiment of frustration and dissatisfaction from past residents. Additionally, pet-related problems like uncollected dog waste have been reported, pointing to a larger issue of inattention to communal living standards.</p><p>The financial aspects also contribute to negative feedback. Residents have reported unreasonable claims about costs and fees, and some feel that getting a security deposit returned is unlikely. One tenant highlighted being threatened with fines for issues they did not commit, showcasing potential mismanagement and unfair treatment in enforcing property policies. These user reviews paint a grim picture of the resident experience at Mahogany Manor, which is something potential tenants should consider.</p></section>"
  },
  "timestamp": "09/07/2024"
}