{
  "name": "Maplewood Apartments",
  "slug": "maplewood-apartments",
  "company_type": "property",
  "address": "2849 W Maplewood Ave Apt C2 Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 3.54,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Jordan M.",
        "rating": 1,
        "review": "I lived in this dump unfortunately for a year due to time constraints I had to take it because it was the only thing available at the time, these people never came around to do maintenance, they literally never did anything to the building or the grounds and the place looks like a complete crack shack! \n\nWe Moved into the unit at the end of spring so it was quite warm and would have been nice to open the windows but unfortunately these morons didn't even have a screen in our window from the first day we moved in and is soon as we put in a maintenance request nothing happened and we literally did not get a screen at all, I moved out of the unit and there was still not a screen in that window! After a year!!! \n\nAlso don't give me started on all the cockroaches that we're crawling around inside the building that were coming out of the big hole that was hidden behind the fridge! They also never addressed that!\n\nThey also stole my entire deposit because they claimed they had to clean out the unit and replace screen window and blinds that were never there in the first place ( we couldn't even open our windows) these people are thieves and scumbags do yourself a favor and stay in a motel for a couple weeks until something else pops up!",
        "ownerResponse": null
      },
      {
        "author": "Kayla G.",
        "rating": 1,
        "review": "Cheap apartments but you get what you pay for. Management not on site. They give no cares about any problems that arise(which many will that are most likely not your doing) and in fact they will  most likely turn it around to make it about you and how it's your fault and your responsibility. The neighbors alone will make you cringe. Noise at all hours, definitely drugs dealers who have people going in and out. Parking lot is beyond small for all that live there, good luck trying to even fit a regular sized car in those parking spots when it's full. Good luck not getting your car smashed or scratched because others that live there do not understand how to back out or enter such small spaces. Management does a horrible job at communicating all together to new tenants, so if you work late and the only spot you pay for has been taken by someone else. There's nothing you can do. Overflow is always full and street parking as well. So you're looking at illegally parking at the Free masons lodge across the street or miles away from your apartment. Enjoy the cold! It isn't until you ask management to get on the apartment towing list to be able to actually call the tow company and get a car towed out of your spot, not on your dime, when such things happen. But after that happens the first time, good luck not getting your car keyed. There are many who try to warn others about Apex, heed their warning, unlike me who didn't.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Jasmine Aviles",
        "rating": 3.0,
        "review": "The apartments are decent, yet there was constant mold buildup in the bathroom of the apartment I lived in. Parking sucks. Too many neighbors were loud and would take neighbors spots, one of the leasing managers had way more parking than they needed. Could use that extra spot or two for residents since they have designated parking at the front of the office. Im saying this because they live on the property.",
        "ownerResponse": null
      },
      {
        "author": "Dawn Potvin",
        "rating": 5.0,
        "review": "Lived here about a year now and I cannot say anything but good things.  There was a management change but it was a very smooth transition. The new maintenance team is great and I have wonderful neighbors",
        "ownerResponse": null
      },
      {
        "author": "C S",
        "rating": 5.0,
        "review": "I love living here! I moved from TX to here and everyone in the office was so helpful and nice. This is my first apartment ever. It is actually my first time ever renting anywhere! Maintenance was prompt and so friendly (even though I didn't really need anything but a bulb I couldn't reach changed) & I always felt safe. I would recommend these apartments to anyone.",
        "ownerResponse": null
      },
      {
        "author": "Elizabeth Caughey",
        "rating": 5.0,
        "review": "Great apartment at an affordable price!  I moved in a few months ago and my move in was easy and enjoyable.  The office staff was friendly and the location is great.  I had a small maintenance issue and maintenance fixed it quickly without having to call them back much like my old apartment elsewhere.  Thank you for such a smooth transition!",
        "ownerResponse": null
      },
      {
        "author": "Philip Caughey",
        "rating": 5.0,
        "review": "Just moved in and the staff made it a simple process.  I like that we can rent washers and dryers as well for only $40 a month.  I love that it doesn't have carpet either.  You can tell the maintenance staff has good attention to detail.",
        "ownerResponse": null
      },
      {
        "author": "Elena Reese",
        "rating": 1.0,
        "review": "One star because it's better than being homeless. They have serious black mold issues, ceilings are falling in in spots. They prop it up with moo handles. Maintenance men are rude and disrespectful. Drug dealers in multiple units and hit and runs are far to common. You can do better!",
        "ownerResponse": null
      },
      {
        "author": "Lauren Stovall",
        "rating": 2.0,
        "review": "By far the worst place weve lived at.\nThe only reason I wouldnt give 1 star is that the office people are nice.\nNo parking, extremely nosey neighbors, no privacy, A LOT of sketchiness, trash everywhere, came home to swat team blocking the entrance one time should I go on?",
        "ownerResponse": null
      },
      {
        "author": "Jamie Johnson",
        "rating": 5.0,
        "review": "Management is great and always super helpful. My apartment is very nice inside and I havent had a single issue since I moved in. I would highly recommend renting here.",
        "ownerResponse": null
      },
      {
        "author": "Crystal Garcia",
        "rating": 5.0,
        "review": "Management here is great they are very helpful and so nice. Ive lived here for almost a year and i have not had a problem with this apartment complex. I highly recommend living here.",
        "ownerResponse": null
      },
      {
        "author": "David Kornfield",
        "rating": 5.0,
        "review": "I really enjoyed renting an apartment here.  The management has always been pleasant and quick to respond to maintenance requests.",
        "ownerResponse": null
      },
      {
        "author": "Justin H.",
        "rating": 3.0,
        "review": "It's a cool place",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 13,
  "adjusted_average_rating": 3.54,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is generated by ChatGPT and is intended to be a tool to help individuals find a property management company or rental property. The summary is based on user reviews of Maplewood Apartments and aims to present a balanced overview of positive and negative experiences. Please note that the specifics of each sub-section reflect the sentiment of the sub-section's heading, and the article does not include any identifiable information about the reviewers.</p>  </section>  <section>    <h2>Good</h2>    <p>Maplewood Apartments have been praised for their affordability and friendly office staff. A number of user reviews highlighted how easy and enjoyable their move-in experience was, attributing this to the helpfulness of the office personnel. The attention to detail from the maintenance staff was also noted, with one reviewer mentioning the smooth handling of a small maintenance issue without the requirement for a callback.</p>    <p>In addition to the praise for their staff, several residents expressed that they felt safe within the complex. One testimonial, which called out the maintenance team's promptness and friendliness, emphasized the resident's overall satisfaction with living at Maplewood Apartments. Renters who had a positive experience often recommended the complex to others, underscoring a sense of community and a well-managed environment.</p>  </section>  <section>    <h2>Great</h2>    <p>The great aspects of the Maplewood Apartments, as per user reviews, shine through the experiences of longtime tenants and first-time renters alike. A consistent note of appreciation was directed towards maintenance, as one review stated that even something as trivial as a difficult-to-reach bulb was promptly replaced. Furthermore, the staff's willingness to go above and beyond for new renters, including those relocating from out of state, has made for very smooth transitions into the community.</p>    <p>Tenant satisfaction did not end with the service but also extended to the features of the apartments themselves. Cleanliness, the option to rent washers and dryers, and the absence of carpet were all tangible benefits that received positive mentions. It seems that for a significant faction of renters, Maplewood Apartments stands out as a gem for its functionality and management's earnest efforts to ensure resident contentment.</p>  </section>  <section>    <h2>Bad</h2>    <p>Despite the instances of satisfactory experiences, some tenants faced issues at Maplewood Apartments that marred their stay. Predominant among complaints were mentions of maintenance concerns that were not addressed in a timely fashion, if at all. From the lack of window screens to the presence of cockroaches due to unaddressed holes behind appliances, these gripes reflect a neglect of essential upkeep responsibilities by the management.</p>    <p>Noise disturbances and inconsiderate parking by other residents also contributed to the dissatisfaction for some, which points to a lack of effective community guidelines or enforcement thereof. Additionally, the accusation of mismanagement of security deposits and allegations of management blaming tenants for pre-existing problems exhibit a potential breakdown in communication and trust between the property management and renters.</p>  </section>  <section>    <h2>Ugly</h2>    <p>The worst aspects of Maplewood Apartments, as drawn from the user reviews, present a rather dire picture. Serious allegations of black mold, structural damages like falling ceilings, and rude maintenance personnel suggest a dangerous living environment and an unprofessional approach to tenant interactions. Reports of rampant sketchiness within the complex, including regular sightings of drug dealing and a swat team appearance, provide a glimpse into potentially serious safety concerns.</p>    <p>Moreover, some reviews indicate property management neglecting to deal with bedrock issues like mold and pest control, risking both the health and peace of mind of tenants. The claims of unreturned deposits for issues not initially caused by the tenant, along with instances of vehicular vandalism, further sully the reputation of Maplewood Apartments, painting a picture of a living situation fraught with frustration and angst.</p>  </section></article>"
}