{
  "name": "Maplewood Apartments",
  "slug": "maplewood-apartments",
  "company_type": "property",
  "address": "2849 W Maplewood Ave Apt C2 Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 3.54,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Jordan M.",
        "rating": 1,
        "review": "I lived in this dump unfortunately for a year due to time constraints I had to take it because it was the only thing available at the time, these people never came around to do maintenance, they literally never did anything to the building or the grounds and the place looks like a complete crack shack! \n\nWe Moved into the unit at the end of spring so it was quite warm and would have been nice to open the windows but unfortunately these morons didn't even have a screen in our window from the first day we moved in and is soon as we put in a maintenance request nothing happened and we literally did not get a screen at all, I moved out of the unit and there was still not a screen in that window! After a year!!! \n\nAlso don't give me started on all the cockroaches that we're crawling around inside the building that were coming out of the big hole that was hidden behind the fridge! They also never addressed that!\n\nThey also stole my entire deposit because they claimed they had to clean out the unit and replace screen window and blinds that were never there in the first place ( we couldn't even open our windows) these people are thieves and scumbags do yourself a favor and stay in a motel for a couple weeks until something else pops up!",
        "ownerResponse": null
      },
      {
        "author": "Kayla G.",
        "rating": 1,
        "review": "Cheap apartments but you get what you pay for. Management not on site. They give no cares about any problems that arise(which many will that are most likely not your doing) and in fact they will  most likely turn it around to make it about you and how it's your fault and your responsibility. The neighbors alone will make you cringe. Noise at all hours, definitely drugs dealers who have people going in and out. Parking lot is beyond small for all that live there, good luck trying to even fit a regular sized car in those parking spots when it's full. Good luck not getting your car smashed or scratched because others that live there do not understand how to back out or enter such small spaces. Management does a horrible job at communicating all together to new tenants, so if you work late and the only spot you pay for has been taken by someone else. There's nothing you can do. Overflow is always full and street parking as well. So you're looking at illegally parking at the Free masons lodge across the street or miles away from your apartment. Enjoy the cold! It isn't until you ask management to get on the apartment towing list to be able to actually call the tow company and get a car towed out of your spot, not on your dime, when such things happen. But after that happens the first time, good luck not getting your car keyed. There are many who try to warn others about Apex, heed their warning, unlike me who didn't.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Jasmine Aviles",
        "rating": 3.0,
        "review": "The apartments are decent, yet there was constant mold buildup in the bathroom of the apartment I lived in. Parking sucks. Too many neighbors were loud and would take neighbors spots, one of the leasing managers had way more parking than they needed. Could use that extra spot or two for residents since they have designated parking at the front of the office. Im saying this because they live on the property.",
        "ownerResponse": null
      },
      {
        "author": "Dawn Potvin",
        "rating": 5.0,
        "review": "Lived here about a year now and I cannot say anything but good things.  There was a management change but it was a very smooth transition. The new maintenance team is great and I have wonderful neighbors",
        "ownerResponse": null
      },
      {
        "author": "C S",
        "rating": 5.0,
        "review": "I love living here! I moved from TX to here and everyone in the office was so helpful and nice. This is my first apartment ever. It is actually my first time ever renting anywhere! Maintenance was prompt and so friendly (even though I didn't really need anything but a bulb I couldn't reach changed) & I always felt safe. I would recommend these apartments to anyone.",
        "ownerResponse": null
      },
      {
        "author": "Elizabeth Caughey",
        "rating": 5.0,
        "review": "Great apartment at an affordable price!  I moved in a few months ago and my move in was easy and enjoyable.  The office staff was friendly and the location is great.  I had a small maintenance issue and maintenance fixed it quickly without having to call them back much like my old apartment elsewhere.  Thank you for such a smooth transition!",
        "ownerResponse": null
      },
      {
        "author": "Philip Caughey",
        "rating": 5.0,
        "review": "Just moved in and the staff made it a simple process.  I like that we can rent washers and dryers as well for only $40 a month.  I love that it doesn't have carpet either.  You can tell the maintenance staff has good attention to detail.",
        "ownerResponse": null
      },
      {
        "author": "Elena Reese",
        "rating": 1.0,
        "review": "One star because it's better than being homeless. They have serious black mold issues, ceilings are falling in in spots. They prop it up with moo handles. Maintenance men are rude and disrespectful. Drug dealers in multiple units and hit and runs are far to common. You can do better!",
        "ownerResponse": null
      },
      {
        "author": "Lauren Stovall",
        "rating": 2.0,
        "review": "By far the worst place weve lived at.\nThe only reason I wouldnt give 1 star is that the office people are nice.\nNo parking, extremely nosey neighbors, no privacy, A LOT of sketchiness, trash everywhere, came home to swat team blocking the entrance one time should I go on?",
        "ownerResponse": null
      },
      {
        "author": "Jamie Johnson",
        "rating": 5.0,
        "review": "Management is great and always super helpful. My apartment is very nice inside and I havent had a single issue since I moved in. I would highly recommend renting here.",
        "ownerResponse": null
      },
      {
        "author": "Crystal Garcia",
        "rating": 5.0,
        "review": "Management here is great they are very helpful and so nice. Ive lived here for almost a year and i have not had a problem with this apartment complex. I highly recommend living here.",
        "ownerResponse": null
      },
      {
        "author": "David Kornfield",
        "rating": 5.0,
        "review": "I really enjoyed renting an apartment here.  The management has always been pleasant and quick to respond to maintenance requests.",
        "ownerResponse": null
      },
      {
        "author": "Justin H.",
        "rating": 3.0,
        "review": "It's a cool place",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 13,
  "adjusted_average_rating": 3.54,
  "summary": {
    "text": "<section><h2>Good</h2><p>Some residents of Maplewood Apartments expressed satisfaction regarding the property management's responsive nature. These content residents commended the new maintenance team for their great work and pleasant demeanor. Evidently, there were instances where maintenance issues were attended to expeditiously, avoiding the need for repeated calls. Moreover, certain tenants highlighted the ease of interaction with the office staff, appreciating their friendliness and the uncomplicated move-in process.</p><p>User reviews indicate a sense of safety and comfort among some of the tenants. The community was perceived as welcoming, notably for first-time renters who found the staff helpful and nice. Tenants have also appreciated the opportunity to rent washers and dryers at a reasonable price and were pleased with the quality of their living space which benefited from regular attention to detail by the maintenance staff.</p></section><section><h2>Great</h2><p>The positive experiences at Maplewood Apartments are further exemplified by reviews praising the affordable prices and the apartment's great location. New tenants had a smooth transition with the help of office personnel, and this contributed to a generally good impression of the overall living experience. The apartment complex's amenities, like the option to rent appliances, added to the convenience and appeal of the property.</p><p>Some long-term residents expressed genuine contentment with the quality of management. There is a recognition of proactive measures taken to make the renting process straightforward and worry-free. This positive sentiment is echoed in reviews that have advised others to consider Maplewood Apartments for their clean and well-organized environment, showcasing that the company sometimes exceeds expectations.</p></section><section><h2>Bad</h2><p>There have been reports of dissatisfaction among some tenants facing maintenance and cleanliness issues. Complaints about recurring mold in bathrooms, along with difficulties in securing parking spaces due to overcrowding, have been mentioned. Moreover, there were cases where tenant requests for maintenance, such as the need for window screens, went unresolved by the property management, impacting the living conditions negatively.</p><p>Several user reviews criticized the complex for not maintaining the building or the grounds, leading to an unpleasant aesthetic that detracted from the overall appeal of the property. Concerns were also raised regarding property management's alleged negligence in handling pest control, particularly cockroach infestations, and a significant delay in addressing structural issues like holes behind appliances.</p></section><section><h2>Ugly</h2><p>Some user reviews painted a rather grim picture of Maplewood Apartments, with severe grievances about security and community issues. Incidents involving drug dealers, frequent noise complaints, and lack of privacy were among the problems suffered by the residents. In one extreme situation, a tenant recounted coming home to a SWAT team blockade, amplifying the sense of insecurity within the apartment complex.</p><p>Tenants also voiced frustration over what they felt was unfair treatment regarding their security deposits. One pointed out that their deposit was withheld on grounds that seemed unfounded, as the required repairs were for items allegedly not provided during their stay. Such experiences hint at a level of distrust towards the property management, accentuating the need for greater transparency and fairness in their dealings with tenants.</p></section>"
  }
}