{
  "name": "Maple Park Apartments",
  "slug": "maple-park-apartments",
  "company_type": "property",
  "address": "1743 E Maple St, Bellingham, WA 98229",
  "review_count": 80,
  "average_rating": 3.54,
  "reviews": {
    "google_reviews": [
      {
        "author": "Sarah W",
        "rating": 2.0,
        "review": "What you can expect from this complex:\n- Being able to park wherever you like, even across spots!\n- Having dings/scrapes on your car from people hitting it\n- Blasting music from 9am-2am\n- Being snowed in\n- Trash in the hallways/corridors\n- Dog poop all over the property that isn't picked up\n- Dogs running around and not on leashes\n- Getting your packages: most are delivered to the office which isn't always open, so add about 2-4 days to your expected time\n- A pretty good maintenance team that responds quickly\n- Convenient location\n\nWhat you can't expect:\n- The office to do ANYTHING about issues except send out a single email (if they remember)\n- Regulated rent - each apartment is priced differently, even if it's the exact same unit. They up the rent whenever a unit is available and have no clear amounts (as verified on their own site)\n- Not to step in dog poo (even if you don't have a dog)\n- Peace in your apartment because it's noisy as all get-out\n\nSo yeah, location and maintenance are awesome, everything else sucks!",
        "ownerResponse": null
      },
      {
        "author": "Gabriela",
        "rating": 1.0,
        "review": "This apt does not seem to care about the road conditions in the actual complex. My car got stuck twice and had to call out of work for two days in a row. When I asked if they were going to take care of this they pretty much told me that they were not going to do anything about it because it is too expensive. The person who told me this also doesnt even live here and has a nice SUV so to them it doesnt seem like a problem but they clearly do not care about the others who dont have that same luxury.",
        "ownerResponse": null
      },
      {
        "author": "Ryan King",
        "rating": 1.0,
        "review": "I feel bad for the tenants who are living there. The management for this complex are terrible price gougers. Rent used to be 1300 just a few years ago, and every single year they have hiked it up more than $100+. I implore everyone to PLEASE look around Bellingham. There is no longer a housing shortage and many apartment complexes have 2 bedrooms/1 baths around $1500 for rent, whereas this complex is charging nearly $1800 for a ONE bedroom with no additional amenities. This place is NOT worth it, and I did not find the front desk very helpful during my time there.\n\nDON'T RENT HERE!!!",
        "ownerResponse": null
      },
      {
        "author": "Mikennah Schwing",
        "rating": 5.0,
        "review": "My partner and I lived here for about six months and really enjoyed it! The apartments were nice and the fire places and large tub were a nice touch. The staff is super friendly and helpful and are really looking out for your best interest. They are open every day and the office is on site so any questions or concerns are handled promptly. We would definitely recommend this pet friendly complex to anyone.",
        "ownerResponse": null
      },
      {
        "author": "Jared Larson",
        "rating": 5.0,
        "review": "We loved renting from Maple Park Apartments.\nForced to rent sight-unseen (we signed the lease in New York) we were prepared for literally anything. We got so lucky to have chosen these apartments. The office staff--Sarah and Tonia--were unfailing friendly, personable, approachable and kind. Their maintenance crew were always present and active and responded to Maintenance request promptly and reliably.\nThe complex itself is very quiet and peaceful with most tenants keeping to themselves. The pool, hot tub and gym facilities were well maintained and easily accessible.\nThe units are as-advertised and though they are not cheap, they fall within the average rental rates for the area.\nWe moved not from wanting anything other than to live in a bigger house with our own yard.",
        "ownerResponse": null
      },
      {
        "author": "Steve Avila",
        "rating": 5.0,
        "review": "Ive been here for two years and just upgraded to a two bedroom due to a room mate moving in with me.  Both apartments were completely remodeled with modern fixtures and flooring.  Bob does a great job of keeping things maintained and Sarah is always on top of anything needed.  Its been a bummer not having the hot tub due to COVID but when its open its my favorite perk.  The community center is now completely remodeled and I cant wait to start being able to use it.  A very warm setting with shuffleboard, a kitchen, fireplace and TV.  Love this place and plane to be here a while longer.",
        "ownerResponse": null
      },
      {
        "author": "Mia Stone",
        "rating": 1.0,
        "review": "Trying to get a hold of the people who work at the front desk is an absolute nightmare. It took me multiple tries across multiple days, and no one getting back the voicemails I left, to get someone on the phone. Then when they finally picked up, they were rude and unhelpful. Ive been trying so hard to find housing and clearly everyone who works here couldnt care less if people have somewhere to live. The horrible customer service, or lack thereof, made my housing search exponentially harder. Definitely not somewhere I want to live.",
        "ownerResponse": null
      },
      {
        "author": "R. V.",
        "rating": 5.0,
        "review": "I very much enjoyed living in the Maple Park community. The location is great, the apartments are beautiful and the staff is excellent! They're honest, fair, kind and understanding. Ever when the pandemic began their professionalism remained in tact. I had a great time living here and highly recommended this property.",
        "ownerResponse": null
      },
      {
        "author": "Kellsy Triplet",
        "rating": 2.0,
        "review": "Ive been living here for close to two years now. Most everything has been pretty bare able up until recently. Rent has went way up despite their being no updates and things are getting broken down. I cant get anyone to fix the electrical in my kitchen and Ive learned that the people in the apartment above me have the same issue with the electrical in the kitchen. The staff are not particularly friendly but also very unhelpful. They keep making mistakes with our lease and cant seem to get it figured out. Overall I would not recommend living here unless you have to.",
        "ownerResponse": null
      },
      {
        "author": "Dan Drayer",
        "rating": 5.0,
        "review": "I have lived here for nearly a year now and it's safe to say the best apartment complex I've ever lived in. The new management really turned this place into feeling like a home. Very friendly staff that are always accommodating.\n\nFor information on the units; I live in a 2 bedroom 1 bath with the master bedroom having a sink and vanity. The units utilize every inch of what they have to offer. There's storage on the deck, a massive closet inside (think narina), and a coat closet down the hall. If you get the opportunity to live here, pull the trigger! You won't regret it.",
        "ownerResponse": null
      },
      {
        "author": "Gail Leclair",
        "rating": 5.0,
        "review": "First off the staff is A1. Welcoming and friendly they really do the best they can with what they have. My wife and I stayed in two different sizes during our time at Maple Park each had their perks!\n\nOur 3 bedroom had a wonderful fireplace great for chilly winters ( bottom floors only I believe). Spacious, and closet space! All the storage space its just something you don't get in most apartments.\n\nOur 2 bed room was just as spacious surprisingly. We got a top floor unit and it had gorgeous vaulted ceilings and the biggest closet I've ever seen both in the bed and the entry way to the home! Our second apartment was by far our favorite out of the two but its also because we had the greatest neighbors all around us!\n\nThe property grounds are well maintained and staff is helpful and almost always around ( minus nights of course). Assigned parking is nice so you always have a spot especially being close to the college and just being in a town in general that lacks parking at times.\n\nI do know they are working on slowly renovating/updating the units but with the cost of rent increasing as it does in bellingham often I wish our apartment rent reflected the quality of appliances we had. Everything works don't get me wrong, but most of the appliances are outdated and I found they can be fidgety. The linoleum floors are rough in some areas from wear and tear. The carpet is the light brown that basically is a tell all to your life in the apartment be so careful with liquids. Over all its a very loveable space with personality I just wish that for the money they interiors reflected what you pay in rent for the property. The OWNERS really need to put more into it bottom line. We were paying almost 1600 ( we also have two cats so this is woth pet rent btw) for a two bed  two bath and I feel like that deserves some more attention by the ownership. This does not reflect on the staff they do what they can with what they are given.\n\nBut all and all nice area of town not directly downtown but a min away from a bus stop that will take you pretty much anywhere. There is a 3 grocery stores within a 10 min walk from the apartments. Everything is very conveniently located. We surely enjoyed our stay and if we could we would have taken all the staff and our neighbor with us! Thanks for the laughs and all the friendly chats. We love you guys!",
        "ownerResponse": null
      },
      {
        "author": "Natalie Storm",
        "rating": 5.0,
        "review": "I lived at Maple Park Apartments for just over a year. From day one, I felt very comfortable. They had availabliliy when nobody else in town seemed to have any openings. Our apartment was very nicely cleaned and repaired before move in, and the people in the office made everything simple and easy.\nI would say the price was average for a two bedroom in this town. Cheaper is available, but keep in mind it often means a place in a bad state of repair, possibly in a questionable area of town, and the conduct of apartment management varies widely from place to place.\n\nThe employees are all wonderful people. They treated me with respect every time we interacted. When I had maintainence needs, they were addressed quickly and thourouly. Bob the maintainence man specifically would always go above and beyond. When he came in to fix the bathtub faucet, he saw that the shower grout was starting to deteriorate. He worked a time out with me to come fix it the next day instead of requiring another maintainence form, wait period, and unnecessary trouble. The whole maintainence crew was always proactive, competent, and friendly.\n\nTanya in the office was the one to show me the apartment before I moved, and help me through the leasing process. She was a delight to be around and made everything a breeze. The office manager Sarah is just as friendly, and was always there to answer questions or address my needs as a tenant. She seemed to enjoy her job, and know exactly what she was doing.\n\nEveryone is very professional but at the same time, they treat tenants like humans as opposed to many rental agency that seem to see tenants as account numbers rather than individuals. I recommend Maple Park every time I get the chance. Places like this are what we need more of! A big thank you to the whole team at MPA!",
        "ownerResponse": null
      },
      {
        "author": "Alfred Fleming",
        "rating": 4.0,
        "review": "The complex is kept up well and the staff is respectful of the residents.  We moved here because we have dogs and all of the staff is very accepting of the dogs.  I have told people that I know if they need a place to live this would be a good choice.  It is ideally located to many different places around the city.  It is also quiet.",
        "ownerResponse": null
      },
      {
        "author": "Paul Hyde",
        "rating": 4.0,
        "review": "Maple Park Apartments had absolutely horrid management in the past. Their currently dealing with a book-keeping nightmare. Suhrco, the property management company which oversees the property, recently hired an entirely new staff at this property. The terrible reviews you see along with mine were correct. The management WAS terrible and disrespectful. With the recently hired management now overseeing the property, their books are being put in order, and their customer service skills have vastly improved. I'm hopeful that the management will continue to improve, and I can forgive the mistakes of the idiots who used to manage this property, such as charging me rent for a cat I didn't even own. They seem to have their books in order now.",
        "ownerResponse": null
      },
      {
        "author": "Richard Ohana",
        "rating": 4.0,
        "review": "Rented here in 2016-2018 and it was one of the best apartment living situations that I have had. Staff was not particularly friendly, but they were tremendously helpful in getting things done and assisting in sublets.",
        "ownerResponse": null
      },
      {
        "author": "Scott Furniss",
        "rating": 5.0,
        "review": "Maple Park is a great place to live! Best value for what you get and management is responsive helpful and friendly!  As long as you communicate you should have no problems here.  The pool bbq and other amenities are great!",
        "ownerResponse": null
      },
      {
        "author": "Avery Hindman",
        "rating": 5.0,
        "review": "This is by far one of the best apartment complexes I have lived in in Bellingham. The people in the office are always so nice the apartments located in a perfect location and the price is really good. I could not recommend this place enough!",
        "ownerResponse": null
      },
      {
        "author": "Dolola Ava",
        "rating": 3.0,
        "review": "It's an apartment complex with bad communication between staff members. I gave it one star for having open spaces, another for being close to WWU and Fred Meyer and another overall for just being a decent apartment complex. If you are a college student with income and want to live somewhere that isn't a dorm, this will probably do just fine.",
        "ownerResponse": null
      },
      {
        "author": "Kylan Childers",
        "rating": 2.0,
        "review": "Been here a month and am already pretty fed up. The facility and apartments themselves aren't bad at all (dryers all suck, but I've found that that's pretty much to be expected in apartment life), but what really gets to me is the staff working the front desk. I wish I remembered everyone's names at this point, but I don't. There's one lady who has been super sweet, one who has been a tubby butthole, and one who is incompetent. Tubby butthole was ridiculously cranky, pissy, and unhelpful to both me and my friend and her parents as I was trying to sign on to my friends existing lease as a roommate. For some reason she was convinced that they were trying to sublet it to me. The second time I came in, she wouldn't even get up to talk to me. She just screeched at me from her desk in the back. The last time I had to go in to actually sign the lease, only the sweet lady was there and she apologized profusely for tubby butthole's behavior.\n\nNow, they have a new girl working there. I called the office asking about storage units and if one was available. She did not know, did not know how to find out, and did not know who to contact. I can give her a pass because she's new, but I was told that everyone else was on vacation and she is the only person there, so I can't actually find out until 3-4 days later. Now, I guess this says more about the people in charge than the employee themselves. Piss poor planning. I wouldn't be surprised if tubby butthole was responsible.\n\nLastly, they are gone a lot and close down the office, during their advertised office hours. I have so far had 2 packages that have not been able to be delivered, at 2 and 3 in the afternoon, which is after lunch hour and far before closing. Also, when in the stages of getting paperwork, I found that again, there were 2 times when the office was closed during the clearly labeled office hours.",
        "ownerResponse": null
      },
      {
        "author": "McDaniel Corbett",
        "rating": 5.0,
        "review": "As a college student I love Maple Park Apartments for a variety of reasons.\n\nFirstly the assistant manager Tanya is super awesome, who will help you and try to solve any problems within in her control.\n\nSecondly it's fairly close to WWU campus about 10 min bus ride.  Then it's right in front of WWU parking n Ride no need to walk too far to get to school, and with many bus options as well.\n\nThird every maintenance and repair is done by Maple Park Apartments for free.\n\nThen here's the worst part of living at Maple Park, you have to deal with old grumpy Peggy,\nBe aware when you are dealing with her, she will do anything to make your life difficult, and that's part of life.  So beside Peggy this place is awesome!",
        "ownerResponse": null
      },
      {
        "author": "Liam Malley",
        "rating": 5.0,
        "review": "This is a great apartment complex. The people are nice and easy to work with, and the pool/hot tub/ gym make all the difference. Never had any issues with management.",
        "ownerResponse": null
      },
      {
        "author": "Wade Deitrick",
        "rating": 3.0,
        "review": "Expensive for the quality, but it's close to town and school. Maintenance is getting better, management must be tough to deal with. Tonya at the leasing office is great, she gets it. She volunteers as much help as she can.",
        "ownerResponse": null
      },
      {
        "author": "Justin Jijina",
        "rating": 5.0,
        "review": "I lived here for three years, the people in the front office were a joy to work with and would replace or help with damaged or old appliances within a couple days of learning about it. Prompt and great service.",
        "ownerResponse": null
      },
      {
        "author": "Solar Eclipse",
        "rating": 5.0,
        "review": "The matenice team is exceptional! They really work hard to make sure you enjoy living there",
        "ownerResponse": null
      },
      {
        "author": "night fire yt",
        "rating": 4.0,
        "review": "Great no problems yet just expensive",
        "ownerResponse": null
      },
      {
        "author": "TYLER WALD",
        "rating": 1.0,
        "review": "Failed to get holding deposit back. Terrible service all year long takes about a month to get anything fixed. Just a complete joke of a complex with terrible management. AVOID AT All COSTS.",
        "ownerResponse": null
      },
      {
        "author": "Johan van der veen",
        "rating": 4.0,
        "review": "Pretty good apartments in a pretty good location for a pretty good price.  Staff on the complex is great!",
        "ownerResponse": null
      },
      {
        "author": "Kyle LaRoche",
        "rating": 4.0,
        "review": "I give the apartment complex 4 stars bc its an average place with close proximity to western and fred meyer.",
        "ownerResponse": null
      },
      {
        "author": "Brittney Segel",
        "rating": 5.0,
        "review": "Friends live here and they love it and my daughter loves using their playground",
        "ownerResponse": null
      },
      {
        "author": "Scarlette",
        "rating": 5.0,
        "review": "Best people Ive ever rented from hands down. Love living here  ",
        "ownerResponse": null
      },
      {
        "author": "Conrad Norris",
        "rating": 3.0,
        "review": "There arent any lights and it can be hard to get ahold of the office sometimes",
        "ownerResponse": null
      },
      {
        "author": "Dalton Hunt",
        "rating": 1.0,
        "review": "Poor employees that seem to hate their job.  That shows in every moment that they cant do their jobs properly.",
        "ownerResponse": null
      },
      {
        "author": "Steve Skippy Austin",
        "rating": 2.0,
        "review": "Trashy damn place. Bad part of town. Don't like knowing I have relatives living here.",
        "ownerResponse": null
      },
      {
        "author": "Rebecca Kinley",
        "rating": 1.0,
        "review": "Damn, like who wants to pay 1350 for rent for a one bedroom.",
        "ownerResponse": null
      },
      {
        "author": "Rhonda Doughty",
        "rating": 3.0,
        "review": "Cute apartments rent is way to much.",
        "ownerResponse": null
      },
      {
        "author": "Angry Child",
        "rating": 5.0,
        "review": "Custom service was good",
        "ownerResponse": null
      },
      {
        "author": "Te Stacy",
        "rating": 5.0,
        "review": "Great place to live",
        "ownerResponse": null
      },
      {
        "author": "Saad Almutairi",
        "rating": 2.0,
        "review": "There are expensive!",
        "ownerResponse": null
      },
      {
        "author": "Floyd Sharp",
        "rating": 3.0,
        "review": "nice apartment complex",
        "ownerResponse": null
      },
      {
        "author": "Riley Harmon",
        "rating": 5.0,
        "review": "Cozy apartments.",
        "ownerResponse": null
      },
      {
        "author": "Marissa Avalos",
        "rating": 4.0,
        "review": "huh",
        "ownerResponse": null
      },
      {
        "author": "Natalie Rodriguez",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sydney Gaylor",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Nicolas Robinson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "David Drayer",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Emma",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "S M",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Amanda Gillies",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Nathan Mattly",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Adam Parent",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Greg Krasniak",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Les Leslie",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Anastasia Pizarro",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kelsey Cornish",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Zachary Toombs",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Anthony & Ali Bowen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "John Wamble",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Austin Hamilton",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Wesley Keystone",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brian Cary",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Justen Kennedy",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Austin Reed",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Christian Reyes",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Fletcher Kurita",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tanu Singh",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Dane Stanfield",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "ABrownCowNow",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Sarah W.",
        "rating": 2,
        "review": "What you can expect from this complex:\n- Being able to park wherever you like, even across spots!\n- Having dings/scrapes on your car from people hitting it\n- Blasting music from 9am-2am\n- Being snowed in\n- Trash in the hallways/corridors\n- Dog poop all over the property that isn't picked up\n- Dogs running around and not on leashes\n- Getting your packages: most are delivered to the office which isn't always open, so add about 2-4 days to your expected time\n- A pretty good maintenance team that responds quickly\n- Convenient location\n\nWhat you can't expect:\n- The office to do ANYTHING about issues except send out a single email (if they remember)\n- Regulated rent - each apartment is priced differently, even if it's the exact same unit. They up the rent whenever a unit is available and have no clear amounts (as verified on their own site)\n- Not to step in dog poo (even if you don't have a dog)\n- Peace in your apartment because it's noisy as all get-out\n\nSo yeah, location and maintenance are awesome, everything else sucks!",
        "ownerResponse": null
      },
      {
        "author": "Ann V.",
        "rating": 5,
        "review": "I've lived here for five years, seen multiple rotations of staff through the front office, and can comfortably say that I have had really lovely experiences. \nMaintenance has slowed down due to a severe shortage of staffing, but urgent issues are addressed promptly. Courtney, the complex manager, is friendly, diligent, and communicates well. Rent has increased quite a bit since I moved in but it's comparable to other Bellingham complexes, and Maple Park is quiet, feels very safe, and is pet-friendly. (There are a few cats that are safely able to be indoor/outdoor cats, which is saying a lot.) \nMany residents have been here for multiple years, and I've seen residents leave and then return a year or two later. \nPlus, it's managed by Suhrco, NOT landmark, which in Bellingham is just a massive plus. \nI've kept an eye out for other apartments in the city, out of curiosity, and haven't found anywhere that feels even remotely worth the move. \n\nMy only moderate complaint is that sometimes Amazon or USPS get lazy when the leasing office is closed and decide to just not deliver packages, but I guess Courtney said something because it's been several months since they pulled that nonsense.",
        "ownerResponse": null
      },
      {
        "author": "Jennifer J.",
        "rating": 5,
        "review": "I moved into Maple Park Apartments nearly two years ago during what was a very difficult time in my life. My two bedroom ground floor unit was clean, spacious, and had more storage than any apartment I have ever lived in. In fact, the plethora of storage space was one of the things that made moving out a very difficult decision.\n\nBut in addition to all of the cupboards, the outdoor storage, and the world's most gigantic coat closet, Maple Park Apartments offered something that can't be seen in photos. It was the smiles, and friendliness of their manager and staff that contributed to this being such a great place to live. The complex is kept impeccably clean, and maintenance requests are handled very quickly. There is always someone around sweeping, painting, repairing, or planting new landscaping. The office staff, Sara (the manager) and Tanya are like friends when you go to the office with a need, question, or just to pick up a package. Often, residents are seeing chatting away with these two fine ladies. I don't know how they get any work done, they are very popular around there! Bob, who heads the maintenance department, is also just about the friendliest guy around.\n\nIn addition to the storage, and the smiles, Maple Park is like a retreat. There are well landscaped paths, a great clubhouse which you can use for entertaining, an indoor hot tub, and a lovely outdoor pool that's open in the summer. There's also a cabana with two large BBQ grills for residents to use, and a playground if you have little ones. While we did not have any pets, many of our neighbors did, so Maple Park does appear to allow cats and small dogs. The complex also host events throughout the year, like potlucks and movie nights.\n\nIt's been almost 20 years since I had to rent an apartment, and I could not have had a better experience than I did at Maple Park. I will truly miss these guys as I move on to my new place. Thank you, Sara and Tanya and Bob and staff, for giving us a safe haven to call home.",
        "ownerResponse": null
      },
      {
        "author": "Mia S.",
        "rating": 1,
        "review": "I made a yelp account specifically to give this place a 1-star review. that's how fed up I am. The front desk is nearly impossible to get a hold of and when they finally answer they're so unnecessarily rude and unhelpful. The idiots who \"work\" here made my housing search so much more difficult and complicated than it ever needed it to be and I'm honestly appalled by how bad the service was. Even the other houses/apartments I looked at that bad service did not compare to how absolutely horrible this place is. Not somewhere I want to live.",
        "ownerResponse": null
      },
      {
        "author": "Douglas G.",
        "rating": 1,
        "review": "Don't rent here unless you don't mind favoritism from the manager. I was able to see an attractive woman, who was not a resident of the community, sitting on a bench for one or one and a half hours. A young girl ran out to walk her dog, saw the woman, halted and quickly returned home. This on a few occasions. There is no excuse for that. Who would ever want to call this place home? When I moved in I found a big earthworm on my living room floor which was so unusual that I had them change my locks. Practically every employee interrogated me as to why. Such abuse of privacy is extremely serious. Courtney Long, the manager has systematically mismanaged everything concerning me. She has to be the laziest human being that I know. The office is always closed. I disliked it as a place to live so much that I broke my lease two months early.  With just Courtney Long, a young female tenant and myself, their conversation turned to \"Feminine hygiene.\" It made me wonder whether she had some kind of agenda or difficulty with men. I repeated it at a later time and she showed no recognition. Upon leaving for vacation in the middle of the month I left a check for rent. They cashed it immediately which just shows how little respect they have. The next vacation I decided to send in my rent from there. They claimed that they never received it and two thick envelopes were stuck on my door and in my mailbox. I had to pay $ 110 in legal fees also. I wrote a new check for the rent. Suddenly the check that was sent in was discovered. I said that it could be put towards the next month's rent. It was cashed immediately! Once can be claimed as a mistake; twice, it's deliberate. 3 times threatened with eviction with a thick letter stuck to my door and another going to my mailbox. She exaggerates her importance. Maintenance threw up dirt with their power tools onto my patio, also causing a strong odor. For responding strongly to this I was threatened with eviction and accused of cussing which was false. All the passageways to the front doors are filthy and no effort is made to clean them. It is two weeks after my departure and Long's reply to refunding my security deposit was that she still has thirty days to do so. Lazy.",
        "ownerResponse": null
      },
      {
        "author": "MichaelJon K.",
        "rating": 2,
        "review": "I moved in here in August 2015. The rent is comparable to similar sized apartments in the area. There are no built in light fixtures in the living room or bedroom, which I prefer - built in fixtures tend to be plain at best and really ugly at worst; I'll use my own lamps, thank you very much. While larger rooms would be nice, the rooms as fine as they are. Same with the closet. The kitchen is one of the best apartment kitchens I have seen, better than the others I looked at before choosing to move here. The landscaping needed a lot of work when I moved in, work they have been doing diligently; the grounds are looking really good. A major plus is that Maple Park is extremely dog friendly and I feel quite safe walking her at any hour.\n\nOne reserved parking spot per apartment is not unusual; many of the apartment complexes I looked at in Bellingham, and rejected, have no reserved parking at all.\n\nThe office staff is extremely helpful and friendly. Peggy left just weeks after I moved in here, so I have very little experience with her. I found her to be business-like and no nonsense; not warm and cuddly to be certain, but not overly unfriendly. Tanya is wonderful, as is Sara, the new manager. The maintenance staff is friendly, helpful and good at their jobs.\n\nUPDATED Sept 2017. I've changed my rating from 4 stars to 2 stars. If you're a good tenant, don't create problems and pay your rent on time or early every month, they show their appreciation with an 11% rent increase. I can't move in the short time before my lease expires, so they can bleed me for another year, after which, I'm gone. Excellent management but the owners don't know how to keep good tenants.",
        "ownerResponse": null
      },
      {
        "author": "Dan D.",
        "rating": 5,
        "review": "I have lived here for nearly a year now and it's safe to say the best apartment complex I've ever lived in. The new management really turned this place into feeling like a home. Very friendly staff that are always accommodating. \n\nFor information on the units; I live in a 2 bedroom 1 bath with the master bedroom having a sink and vanity. The units utilize every inch of what they have to offer. There's storage on the deck, a massive closet inside (think narina), and a coat closet down the hall. If you get the opportunity to live here, pull the trigger! You won't regret it.",
        "ownerResponse": null
      },
      {
        "author": "Carrie O.",
        "rating": 1,
        "review": "For starters, the previous comment is spot on regarding the apartments. No lights in the rooms, small closets, small rooms for the cost.\nPeggy, the \"manager\" is an unreachable, combative, violent human being.\nWhen our son was told he had to not only lose his deposit but owed an additional $695 on top of the security deposit for new carpet my husband was baffled. He had helped move the guys out!! He vacuumed the carpet!!! \nWhen he tried to speak to Peggy, she grabbed paper work out of his hands!! My husband has never been confrontational!! When he ask about what happened, she mentioned photos, but could not show them. She told him to leave & acted threatened & when he ask for her manager she gave him a disconnected number.\nWe are smart enough to find the right people & will handle this as the professional, non-violent people we are.\n\nDo not ever rent from Peggy!!!",
        "ownerResponse": null
      },
      {
        "author": "Veronique H.",
        "rating": 1,
        "review": "This place is a complete joke. DO NOT RENT. They only give you one parking spot, which is fine if you only have one car per apartment, but in many cases this is not how it works. The landlords are completely nasty and condescending. Tonya is afraid of the world, while Peggy is the nastiest person I've ever met. I tried to move out at the end of the month because our lease is up, but because I didn't submit the paperwork TWO days before now, I am unable and have to pay rent for an extra month despite me not living here. They are incredibly inflexible, and obnoxious. The apartments are not worth the cost. They don't come with lights in the bedrooms, or the living room. They are small, and grungy. If you choose to sign a lease for another year, your rent increases, Do NOT rent from these people.",
        "ownerResponse": null
      },
      {
        "author": "Amy H.",
        "rating": 1,
        "review": "DO NOT RENT, the manager Peggy lied numerous times and promised call backs regarding the security deposit and \"other costs\" that were crazy.  My daughter rented an apartment at Maple Park Apartments for the school year of 2014-2015.  When she moved out she and her 2 roommates were charged an additional $900 for not cleaning the toilets or the showers, and supposed burned mark on the counter-top which they indicated would have to replace the whole counter-top for $400.  They were never told of these costs when they checked out.\n\nThe counter-top was not burned, and I personally scrubbed the toilets and showers myself and they were spotless.  Upon calling \"PEGGY the Manager\" she was rude and promised photos  of the \"damage\".  I called her numerous times and was always told by Peggy she would call me back.  She indicated all kids don't clean their showers all year and they have to clean with special chemicals.  Peggy hangs up on me when I called her, hasn't provided any pictures. and is a very rude person.\n\nWhen my daughter moved in the windows had mold on them, the carpets were filthy which we had to clean to get her moved in.\n\nI have had 2 other sons who went to college and rented from numerous apartment complexes with never this kind of issue.\n\nI would encourage kids and their parents NOT TO RENT from Maple APTS.",
        "ownerResponse": null
      },
      {
        "author": "Lindsey F.",
        "rating": 4,
        "review": "I have lived in Maple Park Apartments for about twelve years now and while I have visited and investigated many other apartments over the years, I have never found one that could outshine Maple Park Apartments. I did a lot of research before moving here in 2005 and research has proven time and again over the years that this is a wonderful place to live in Bellingham. And much has improved over the past year.\n\nIt's true you're going to pay more at MPA than the average apartment in Bellingham, but the average apartment in Bellingham doesn't have what Maple Park has to offer: on-site fast-responding and professional maintenance and office team (some are new, all are very friendly and hard-working), very pet-friendly, covered parking (you'll be so happy when it snows) with spare spaces for guests, in-unit washer/dryer machine, safe neighborhood, pool, hot tub, workout room, outdoor BBQ and gazeebo area, kids playground, beautiful landscaping (blackberries in the summer!), office that will safely hold packages, and incredible proximity to the WWU park and ride/bus shuttle, WTA bus lines, the interstate, Downtown Bellingham, grocery stores, coffee, parks, and you're not a 10-minute drive to Western itself. You're about 12 minutes' drive from Fairhaven, 12 minutes from Meridian, 15 minutes from north Bellingham. So again, all things considered, you might be paying a little bit more at MPA, but you're paying for the phenomenal staff, the amenities, and all these great conveniences.\n\nThe apartments are reasonably spacious. There are heaters in the living room and bedrooms and some units have a fireplace. Many of the apartments (I know the 1BR/1BA and the 2BR/2BA) have walk in closets and all of the units have generous storage. You can pay a small fee for additional garage storage. The kitchen has a full oven, four burners, a microwave, a fridge, and a dishwasher. You get a tub and a shower (big ol' tub in the single units). There's a balcony with patio storage.\n\nI have lived in three of the units and all were clean, free of bugs (I am an extremely afraid of bugs so this is important to me), and decent quietness -- more so in the single units. I'm not very bothered by the normal sounds of people living around me (especially in a college town), but I'm not hearing any wild and crazy parties and everything is reasonably quiet after 10pm.\n\nI've visited friends and have looked at other places to live in Bellingham over the years and I'm convinced Maple Park Apartments has so much more to offer than most of Bellingham. I have to be honest, I've read the negative reviews and I think they're really off the mark. I have been here for a LONG time, moved from out of state when I was starting WWU back in 2005, and I just love this place. Love the staff. Much has improved over the last year (renovations, new office and maintenance staff, etc.), so take those older reviews with a huge grain of salt. Maple Park is really a gem and they're always doing everything they can to make their tenants happy and improve the overall experience.",
        "ownerResponse": null
      },
      {
        "author": "K. C.",
        "rating": 1,
        "review": "Do not move into this apartment complex. The manager, Peggy, is the rudest person I have ever met. She always has this angry look on her face, never talks in a nice tone, and spends all her time online shopping. Customer service is non-existent with this lady. Our washer/dryer set started leaking in January of this year. After countless time of going down to the office and reporting it, it was never fixed. The maintenance manager took a used washer/dryer unit and put it into our apartment as a \"fix\" to the problem. The washer/dryer still leaks and now our dishwasher leaks. Save yourself the $1500 for a three-bedroom and go somewhere else. The apartments are out-dated and overpriced.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 53,
  "adjusted_average_rating": 3.36,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is generated by ChatGPT and serves as a helpful summary of user reviews for Maple Park Apartments. It is intended solely for informational purposes and to assist individuals in finding a property management company or rental property. The specific examples and themes drawn from user reviews do not contain personally identifiable information, and the sentiments expressed in the sub-sections reflect the overall tone of reviews provided.</p>  </section>  <section>    <h2>Good</h2>    <p>Some residents of Maple Park Apartments have had positive experiences, citing the proficient maintenance team's quick response to issues as a notable highlight. The location has also been praised for its convenience, situated close to essential amenities and transportation links which many find beneficial. Furthermore, several reviewers have attested to the friendliness of the onsite staff, describing interactions with the office personnel as welcoming and solutions-oriented.</p>    <p>Residents have also appreciated the apartment features, such as in-unit washers/dryers and personal storage options. Functions like the indoor hot tub, outdoor pool, and the pet-friendly policy have been favorably mentioned in some reviews. These amenities, combined with a perceived sense of community among tenants, can contribute to a comfortable living environment that some tenants have positively acknowledged.</p>  </section>  <section>    <h2>Great</h2>    <p>Certain reviewers have expressed particular satisfaction with Maple Park Apartments, some living in the complex for numerous years. The apartments' spacious layout, ample storage, and availability of outdoor spaces have been described as exceptional. Long-term residents have noted improvements over the years, including renovations and staff changes, which reportedly enhanced their living experience.</p>    <p>Residents have also lauded the apartment complex for its tranquility and have commended management for maintaining a clean and well-landscaped property. The community-oriented events, like potlucks and movie nights, are a testament to the complex's focus on resident engagement. The sentiment that Maple Park Apartments is among the better housing options in Bellingham is a recurring theme in positive reviews.</p>  </section>  <section>    <h2>Bad</h2>    <p>Despite some positive feedback, there are areas where Maple Park Apartments has room for improvement according to some user reviews. Issues with inefficient communication are a common complaint, with difficulty reaching staff and delayed responses to inquiries. Additionally, instances of disorganized lease management have been a source of frustration for tenants, with some reporting mistakes and complications regarding their agreements.</p>    <p>Furthermore, the aspect of package delivery logistics has proved inconvenient for residents. There are mentions of unreliability in receiving packages on time due to the office being unexpectedly closed. Pricing concerns also emerge, with some residents feeling that the rise in rent does not correspond with the quality or the updates of the apartments, pointing out that some units appear outdated given the rent rates.</p>  </section>  <section>    <h2>Ugly</h2>    <p>Among the harsher critiques of Maple Park Apartments are accounts of employee conduct that suggest a lack of professionalism. Reports of unhelpful and occasionally rude interactions with some staff members have tarnished the reputation of the complex for several reviewers. Others have expressed dissatisfaction with the handling of their security deposits, citing challenges in obtaining a reasonable explanation for certain charges or in recovering their deposits in a timely manner.</matteinde p>    <p>Additionally, user reviews describe infrastructural and management neglect, such as unresolved road conditions causing accessibility issues during inclement weather and insufficient addressing of public health concerns like dog waste management. Alongside these complaints, there's a shared sentiment that the quality of customer service has a significant impact on the overall living experience at Maple Park Apartments.</p>  </section></article>"
}