{
  "name": "Maplewood West Apartments",
  "slug": "maplewood-west-apartments",
  "company_type": "Property",
  "address": "2836 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 10,
  "average_rating": 3.3,
  "reviews": {
    "google_reviews": [
      {
        "author": "Megan",
        "rating": 1,
        "review": "Please do yourself a favor and choose any other building to live in because I dont care who you are, you deserve better. Here are just some of my highlights:\n\n- The apartment was filthy upon move-in. They didnt let us do a virtual walk through before signing the lease so I didnt know what we were getting into.\n- The dishwasher and freezer were both non-functioning for months and they refused to do anything about it.\n- They only issued one parking pass for between 2 people in the same unit. Parking was never available on the street because of all the people living out of their cars.\n- Neighbors leave trash outside their apartments and around the dumpsters so rats were a problem.\n- So many people have dogs and they dont pick up after them. I cannot emphasize enough how much dog poop is around each building. The whole place smells like dog poop.",
        "owner_response": null
      },
      {
        "author": "Charlotte Jane",
        "rating": 5,
        "review": "Cute apartments with well tended yards, very nice inside, and fabulous neighborhood.",
        "owner_response": null
      },
      {
        "author": "Steve",
        "rating": 4,
        "review": "Very well- managed and well maintained",
        "owner_response": null
      },
      {
        "author": "Tiger Woo",
        "rating": 3,
        "review": "Quiet neighborhood",
        "owner_response": null
      },
      {
        "author": "Nick Zender",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "SHANNON VAN DUISEN",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kelsey Florer",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mandi Meyers",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mike Linebrink",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Lenin Mendoza",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 4,
  "adjusted_average_rating": 3.25,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 4,
    "4": 2,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739095085,
    "text": "<section id=\"good\"><h2>Good</h2><p>This article highlights the positive aspects of Maplewood West Apartments based on user reviews. Several tenants have expressed satisfaction with the aesthetic qualities of the apartments, noting that they are well-designed and situated in a pleasant neighborhood. One reviewer described the apartments as cute, with well-tended yards and a very nice interior, which suggests that the property management takes care of the landscaping and overall cleanliness.</p><p>Additionally, some reviews mention that the apartments are well-managed and maintained, contributing to a positive living experience. The comments hint at a quiet neighborhood, which could be an attractive feature for those seeking a peaceful environment. Such comments indicate that there are redeeming qualities at Maplewood West Apartments that some current residents appreciate.</p></section><section id=\"great\"><h2>Great</h2><p>User reviews reflect a sense of community at Maplewood West Apartments, where some residents have found a comfortable living arrangement. The positive reviews regarding management suggest that tenants overall appreciate the upkeep of the property. The presence of amenities, although not detailed in the reviews, may also play a role in the enjoyment of living in this community.</p><p>Several users rated the apartments highly, particularly praising the neighborhood's vibe. This sentiment hints at a good social atmosphere among residents and a supportive environment. Such positive reflections imply that for some, the apartments are a great choice, blending comfort and community spirit effectively.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite positive sentiments, there are significant criticisms concerning Maplewood West Apartments as voiced by several tenants. One particularly dissatisfied resident described a serious lack of cleanliness upon moving in, highlighting filth in the apartment and non-functional appliances like the dishwasher and freezer that remained unfixed for months. Such issues indicate potential negligence in maintenance and a lack of responsiveness from management.</p><p>Another complaint centered on inadequate parking arrangements, which are said to be insufficient for the number of occupants, leading to frustrations for those sharing units. Additionally, complaints were raised about neighbors neglecting to clean up after their pets, resulting in unsanitary conditions outside the buildings. These ongoing issues reflect areas for improvement that property management must address to enhance tenant satisfaction.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>User reviews also bring to light serious concerns regarding the living conditions at Maplewood West Apartments. The report of rats due to trash left by neighbors and the overwhelming presence of dog waste reveals a troubling disregard for cleanliness and hygiene in the community. This may create health concerns for residents and diminishes the overall quality of living.</p><p>Moreover, some reviews depict a lack of communication from property management regarding urgent maintenance issues, which could contribute to tenant frustration and dissatisfaction. The absence of responses from management to user reviews suggests a concerning disconnect between tenant needs and property management's engagement, leading to an impression of neglect that can significantly impact residents' overall experiences.</p></section>"
  }
}