{
  "name": "Maplewood Apartments LP",
  "slug": "maplewood-apartments-lp",
  "company_type": "Property",
  "address": "2849 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 4.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Dawn Potvin",
        "rating": 5,
        "review": "Lived here about a year now and I cannot say anything but good things.  There was a management change but it was a very smooth transition. The new maintenance team is great and I have wonderful neighbors",
        "owner_response": null
      },
      {
        "author": "Jasmine Aviles",
        "rating": 3,
        "review": "The apartments are decent, yet there was constant mold buildup in the bathroom of the apartment I lived in. Parking sucks. Too many neighbors were loud and would take neighbors spots, one of the leasing managers had way more parking than they needed. Could use that extra spot or two for residents since they have designated parking at the front of the office. Im saying this because they live on the property.",
        "owner_response": null
      },
      {
        "author": "C S",
        "rating": 5,
        "review": "I love living here! I moved from TX to here and everyone in the office was so helpful and nice. This is my first apartment ever. It is actually my first time ever renting anywhere! Maintenance was prompt and so friendly (even though I didn't really need anything but a bulb I couldn't reach changed) & I always felt safe. I would recommend these apartments to anyone.",
        "owner_response": null
      },
      {
        "author": "Elizabeth Caughey",
        "rating": 5,
        "review": "Great apartment at an affordable price!  I moved in a few months ago and my move in was easy and enjoyable.  The office staff was friendly and the location is great.  I had a small maintenance issue and maintenance fixed it quickly without having to call them back much like my old apartment elsewhere.  Thank you for such a smooth transition!",
        "owner_response": null
      },
      {
        "author": "Philip Caughey",
        "rating": 5,
        "review": "Just moved in and the staff made it a simple process.  I like that we can rent washers and dryers as well for only $40 a month.  I love that it doesn't have carpet either.  You can tell the maintenance staff has good attention to detail.",
        "owner_response": null
      },
      {
        "author": "Elena Reese",
        "rating": 1,
        "review": "One star because it's better than being homeless. They have serious black mold issues, ceilings are falling in in spots. They prop it up with moo handles. Maintenance men are rude and disrespectful. Drug dealers in multiple units and hit and runs are far to common. You can do better!",
        "owner_response": null
      },
      {
        "author": "Jamie Johnson",
        "rating": 5,
        "review": "Management is great and always super helpful. My apartment is very nice inside and I havent had a single issue since I moved in. I would highly recommend renting here.",
        "owner_response": null
      },
      {
        "author": "Lauren Stovall",
        "rating": 2,
        "review": "By far the worst place weve lived at.\nThe only reason I wouldnt give 1 star is that the office people are nice.\nNo parking, extremely nosey neighbors, no privacy, A LOT of sketchiness, trash everywhere, came home to swat team blocking the entrance one time should I go on?",
        "owner_response": null
      },
      {
        "author": "Crystal Garcia",
        "rating": 5,
        "review": "Management here is great they are very helpful and so nice. Ive lived here for almost a year and i have not had a problem with this apartment complex. I highly recommend living here.",
        "owner_response": null
      },
      {
        "author": "David Kornfield",
        "rating": 5,
        "review": "I really enjoyed renting an apartment here.  The management has always been pleasant and quick to respond to maintenance requests.",
        "owner_response": null
      },
      {
        "author": "Justin H.",
        "rating": 3,
        "review": "It's a cool place",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 4.0,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 2,
    "4": 0,
    "5": 7
  },
  "summary": {
    "created_timestamp": 1739095080,
    "text": "<section id=\"good\"><h2>Good</h2><p>The user reviews highlight several positive aspects of living at Maplewood Apartments LP. Many residents have praised the management team for their responsiveness and helpfulness. For instance, tenants have reported a smooth transition during a management change and have appreciated the friendliness of the office staff, which makes the living experience enjoyable.</p><p;Additionally, reviews indicate that the maintenance staff is attentive and prompt in addressing minor repairs. Residents have noted that their maintenance requests are handled quickly, leading to a hassle-free living environment. The general positivity surrounding the community and supportive neighbors also contributes to a favorable atmosphere for those residing in the apartments.</p></section><section id=\"great\"><h2>Great</h2><p;Overall, a significant number of reviews reflect a high level of satisfaction, as evidenced by the average rating of 4.0 stars. Many users have described their apartments as being nice and well-maintained, with one resident specifically noting the absence of carpeting, which is a personal preference for many. The affordability of the apartments has also been a major draw for current tenants, who find the pricing to be reasonable given the services provided.</p><p;Furthermore, several reviews highlighted the enjoyment of living in the area, with residents feeling safe and comfortable. The flexibility of features such as renting washers and dryers for a reasonable fee adds to the appeal of the property. Overall, the combination of a friendly management team, satisfactory maintenance service, and a welcoming community contributes to the property's positive reputation.</p></section><section id=\"bad\"><h2>Bad</h2><p;While the community has many positive aspects, there are also some concerns raised by residents. A few users have pointed out issues regarding cleanliness and maintenance, particularly regarding mold and parking availability. For example, one reviewer noted persistent mold buildup in their bathroom and voiced frustrations about the noise levels and parking situation, suggesting that the management might need to address these issues more proactively.</p><p;Additionally, there were mentions of some sketchy activities within the premises, giving rise to safety concerns among tenants. Despite these issues, the more significant concerns appear to be relatively few compared to the overall body of positive feedback, suggesting that management has room for improvement in specific areas to enhance the quality of life for all residents.</p></section><section id=\"ugly\"><h2>Ugly</h2><p;Some user reviews reflect serious issues that cannot be overlooked. A particularly alarming review described severe black mold problems and structural downfalls in the apartments, indicating a potential neglect of health risks. Such reports raise substantial concerns about the property's maintenance practices and overall safety for residents.</p><p;Moreover, there are accounts of rude behavior from maintenance personnel, which can severely undermine the tenant experience. Instances of perceived crime and general safety concerns within the community further paint a troubling picture for potential renters. These negative experiences highlight critical areas where management must take immediate action to ensure the well-being and comfort of all tenants.</p></section>"
  }
}