{
  "name": "Maplewood West Apartments",
  "slug": "maplewood-west-apartments",
  "company_type": "Property",
  "address": "2836 W Maplewood Ave, Bellingham, WA 98225",
  "review_count": 10,
  "average_rating": 3.3,
  "reviews": {
    "google_reviews": [
      {
        "author": "Megan",
        "rating": 1,
        "review": "Please do yourself a favor and choose any other building to live in because I dont care who you are, you deserve better. Here are just some of my highlights:\n\n- The apartment was filthy upon move-in. They didnt let us do a virtual walk through before signing the lease so I didnt know what we were getting into.\n- The dishwasher and freezer were both non-functioning for months and they refused to do anything about it.\n- They only issued one parking pass for between 2 people in the same unit. Parking was never available on the street because of all the people living out of their cars.\n- Neighbors leave trash outside their apartments and around the dumpsters so rats were a problem.\n- So many people have dogs and they dont pick up after them. I cannot emphasize enough how much dog poop is around each building. The whole place smells like dog poop.",
        "owner_response": null
      },
      {
        "author": "Charlotte Jane",
        "rating": 5,
        "review": "Cute apartments with well tended yards, very nice inside, and fabulous neighborhood.",
        "owner_response": null
      },
      {
        "author": "Steve",
        "rating": 4,
        "review": "Very well- managed and well maintained",
        "owner_response": null
      },
      {
        "author": "Tiger Woo",
        "rating": 3,
        "review": "Quiet neighborhood",
        "owner_response": null
      },
      {
        "author": "Nick Zender",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "SHANNON VAN DUISEN",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kelsey Florer",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mandi Meyers",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mike Linebrink",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Lenin Mendoza",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 4,
  "adjusted_average_rating": 3.25,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 4,
    "4": 2,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739205500,
    "text": "<section id=\"good\"><h2>Good</h2><p>Maplewood West Apartments offers some redeeming qualities, as highlighted by user reviews. Several users have praised the apartments, noting their well-tended yards and overall pleasant ambiance. This appeal extends to the quiet neighborhood and the attractive appearance of the apartment interiors, which some tenants find refreshing and comfortable.</p><p>Moreover, the management seems to be good at handling property maintenance, as noted by one user who mentioned that the complex is very well-managed and maintained. The presence of a peaceful environment also stands out, making it a reasonably good choice for potential renters seeking a tranquil living space.</p></section><section id=\"great\"><h2>Great</h2><p>In terms of great features, the standout reviews emphasize the neighborhood and the maintenance of the apartments' exteriors. One user particularly appreciates the charming and cute atmosphere of the apartments, adding that the yards are well-kept and contribute to the overall fabulous nature of the surrounding area. It's worth noting that the neighborhood receives positive remarks for its serenity.</p><p>Another aspect that resonates with the residents is the internal condition of the apartments. According to one review, the interiors are described as very nice, which adds to the property's allure for those who prioritize aesthetics and modern living conditions. This suggests a well-executed effort in design and upkeep by the property management company.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the good and great points, some user reviews highlight less favorable aspects of living at Maplewood West Apartments. An issue mentioned by residents includes the inadequate number of parking passes provided, which causes inconvenience for tenants with multiple vehicles. Parking availability is further exacerbated by a high density of people, including those living in their cars around the area, complicating the situation.</p><p>Another concern raised is the lack of virtual walkthroughs before lease signing, which left some renters dissatisfied upon move-in, unaware of the state of the apartments. This lack of transparency led to frustrations for tenants who discovered subpar conditions only after signing their leases, highlighting a potential area of improvement for the management team in terms of service and communication.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Regrettably, the ugly aspects of Maplewood West Apartments are quite pronounced in some user reviews. One tenant expressed significant dissatisfaction, mentioning initial conditions upon move-in such as a filthy apartment, highlighting an apparent neglect in preparing the unit for new occupants. Further complaints detailed malfunctioning appliances like dishwashers and freezers, which remained unrepaired for months despite requests, indicating a problematic approach to maintenance.</p><p>Compounding these issues, the environment is described as unhygienic, with numerous reports of trash pile-ups leading to rodent problems. Moreover, the pervasive presence of dog waste left unattended by pet owners contributes to a pervasive odor around the complex. These persistent environmental issues reflect poorly on management's ability to maintain a basic standard of cleanliness and tenant satisfaction.</p></section>"
  }
}