{
  "name": "Maplewood Apartments",
  "slug": "maplewood-apartments",
  "company_type": "Property",
  "address": "2849 W Maplewood Ave Apt C2 Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Jordan M.",
        "rating": 1,
        "review": "I lived in this dump unfortunately for a year due to time constraints I had to take it because it was the only thing available at the time, these people never came around to do maintenance, they literally never did anything to the building or the grounds and the place looks like a complete crack shack! \n\nWe Moved into the unit at the end of spring so it was quite warm and would have been nice to open the windows but unfortunately these morons didn't even have a screen in our window from the first day we moved in and is soon as we put in a maintenance request nothing happened and we literally did not get a screen at all, I moved out of the unit and there was still not a screen in that window! After a year!!! \n\nAlso don't give me started on all the cockroaches that we're crawling around inside the building that were coming out of the big hole that was hidden behind the fridge! They also never addressed that!\n\nThey also stole my entire deposit because they claimed they had to clean out the unit and replace screen window and blinds that were never there in the first place ( we couldn't even open our windows) these people are thieves and scumbags do yourself a favor and stay in a motel for a couple weeks until something else pops up!",
        "owner_response": null
      },
      {
        "author": "Bell C.",
        "rating": 1,
        "review": "Cheap apartments but you get what you pay for. Management not on site. They give no cares about any problems that arise(which many will that are most likely not your doing) and in fact they will  most likely turn it around to make it about you and how it's your fault and your responsibility. The neighbors alone will make you cringe. Noise at all hours, definitely drugs dealers who have people going in and out. Parking lot is beyond small for all that live there, good luck trying to even fit a regular sized car in those parking spots when it's full. Good luck not getting your car smashed or scratched because others that live there do not understand how to back out or enter such small spaces. Management does a horrible job at communicating all together to new tenants, so if you work late and the only spot you pay for has been taken by someone else. There's nothing you can do. Overflow is always full and street parking as well. So you're looking at illegally parking at the Free masons lodge across the street or miles away from your apartment. Enjoy the cold! It isn't until you ask management to get on the apartment towing list to be able to actually call the tow company and get a car towed out of your spot, not on your dime, when such things happen. But after that happens the first time, good luck not getting your car keyed. There are many who try to warn others about Apex, heed their warning, unlike me who didn't.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 2,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739095080,
    "text": "<section id=\"good\"><h2>Good</h2><p>Given the overwhelmingly negative feedback from user reviews for Maplewood Apartments, it's challenging to highlight positive aspects. However, the affordability has been noted by some tenants. For those looking for budget-friendly housing options in a tight rental market, Maplewood appears to be one of the least expensive options available, even if the costs come with significant caveats.</p><p>Another potential positive could be the availability of apartments, as some users indicated that Maplewood may have units ready for immediate occupancy. This might attract prospective tenants who are in urgent need of housing, albeit with the understanding that the overall living conditions and management practices could lead to dissatisfaction later on.</p></section><section id=\"great\"><h2>Great</h2><p>There are no reviews indicating exceptional experiences or commendable service at Maplewood Apartments. User reviews predominantly focus on negative experiences, which highlights a concerning trend of management neglect and poor living conditions. Unfortunately, there is no substantial evidence to present a “great” aspect of the property.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews detail serious issues with maintenance and management responsiveness. One tenant reported that despite numerous maintenance requests, serious problems, including a missing window screen and pest infestations, remained unaddressed for the entire year of occupancy. Complaints about cockroaches and the lack of upkeep on the building seem to be widespread, painting a bleak picture of the property's condition.</p><p>Further complicating matters, another user described management as unresponsive and indifferent to problems, often redirecting blame to tenants. The parking situation was also criticized as inadequate, leading to difficulties with parking and potential vehicle damage, showcasing the lack of support and infrastructure for residents. This inability to provide basic maintenance and communication is a significant concern for prospective tenants.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The experiences shared by tenants present a grim reality about the living conditions at Maplewood Apartments. One user described feeling compelled to leave after enduring a year filled with neglected maintenance issues, pest problems, and a particularly troubling experience with the return of their security deposit. The claim was made that they were charged for cleaning and repairs that were unnecessary, indicating a pattern of mismanagement regarding tenants' finances.</p><p>Additionally, issues with noise disturbances and reports of drug activity create an unsafe and uncomfortable living environment. Users also expressed frustration with poor communication from management, often leading to confusion around parking regulations and maintenance requests. This troubling landscape results in a property that may deter tenants from choosing Maplewood Apartments despite its budget-friendly pricing.</p></section>"
  }
}