{
  "name": "Maplewood Apartments",
  "slug": "maplewood-apartments",
  "company_type": "Property",
  "address": "2849 W Maplewood Ave Apt C2 Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 3.54,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Jordan M.",
        "rating": 1,
        "review": "I lived in this dump unfortunately for a year due to time constraints I had to take it because it was the only thing available at the time, these people never came around to do maintenance, they literally never did anything to the building or the grounds and the place looks like a complete crack shack! \n\nWe Moved into the unit at the end of spring so it was quite warm and would have been nice to open the windows but unfortunately these morons didn't even have a screen in our window from the first day we moved in and is soon as we put in a maintenance request nothing happened and we literally did not get a screen at all, I moved out of the unit and there was still not a screen in that window! After a year!!! \n\nAlso don't give me started on all the cockroaches that we're crawling around inside the building that were coming out of the big hole that was hidden behind the fridge! They also never addressed that!\n\nThey also stole my entire deposit because they claimed they had to clean out the unit and replace screen window and blinds that were never there in the first place ( we couldn't even open our windows) these people are thieves and scumbags do yourself a favor and stay in a motel for a couple weeks until something else pops up!",
        "owner_response": null
      },
      {
        "author": "Bell C.",
        "rating": 1,
        "review": "Cheap apartments but you get what you pay for. Management not on site. They give no cares about any problems that arise(which many will that are most likely not your doing) and in fact they will  most likely turn it around to make it about you and how it's your fault and your responsibility. The neighbors alone will make you cringe. Noise at all hours, definitely drugs dealers who have people going in and out. Parking lot is beyond small for all that live there, good luck trying to even fit a regular sized car in those parking spots when it's full. Good luck not getting your car smashed or scratched because others that live there do not understand how to back out or enter such small spaces. Management does a horrible job at communicating all together to new tenants, so if you work late and the only spot you pay for has been taken by someone else. There's nothing you can do. Overflow is always full and street parking as well. So you're looking at illegally parking at the Free masons lodge across the street or miles away from your apartment. Enjoy the cold! It isn't until you ask management to get on the apartment towing list to be able to actually call the tow company and get a car towed out of your spot, not on your dime, when such things happen. But after that happens the first time, good luck not getting your car keyed. There are many who try to warn others about Apex, heed their warning, unlike me who didn't.",
        "owner_response": null
      }
    ],
    "google_reviews": [
      {
        "author": "Dawn Potvin",
        "rating": 5,
        "review": "Lived here about a year now and I cannot say anything but good things.  There was a management change but it was a very smooth transition. The new maintenance team is great and I have wonderful neighbors",
        "owner_response": null
      },
      {
        "author": "Jasmine Aviles",
        "rating": 3,
        "review": "The apartments are decent, yet there was constant mold buildup in the bathroom of the apartment I lived in. Parking sucks. Too many neighbors were loud and would take neighbors spots, one of the leasing managers had way more parking than they needed. Could use that extra spot or two for residents since they have designated parking at the front of the office. Im saying this because they live on the property.",
        "owner_response": null
      },
      {
        "author": "C S",
        "rating": 5,
        "review": "I love living here! I moved from TX to here and everyone in the office was so helpful and nice. This is my first apartment ever. It is actually my first time ever renting anywhere! Maintenance was prompt and so friendly (even though I didn't really need anything but a bulb I couldn't reach changed) & I always felt safe. I would recommend these apartments to anyone.",
        "owner_response": null
      },
      {
        "author": "Elizabeth Caughey",
        "rating": 5,
        "review": "Great apartment at an affordable price!  I moved in a few months ago and my move in was easy and enjoyable.  The office staff was friendly and the location is great.  I had a small maintenance issue and maintenance fixed it quickly without having to call them back much like my old apartment elsewhere.  Thank you for such a smooth transition!",
        "owner_response": null
      },
      {
        "author": "Philip Caughey",
        "rating": 5,
        "review": "Just moved in and the staff made it a simple process.  I like that we can rent washers and dryers as well for only $40 a month.  I love that it doesn't have carpet either.  You can tell the maintenance staff has good attention to detail.",
        "owner_response": null
      },
      {
        "author": "Elena Reese",
        "rating": 1,
        "review": "One star because it's better than being homeless. They have serious black mold issues, ceilings are falling in in spots. They prop it up with moo handles. Maintenance men are rude and disrespectful. Drug dealers in multiple units and hit and runs are far to common. You can do better!",
        "owner_response": null
      },
      {
        "author": "Jamie Johnson",
        "rating": 5,
        "review": "Management is great and always super helpful. My apartment is very nice inside and I havent had a single issue since I moved in. I would highly recommend renting here.",
        "owner_response": null
      },
      {
        "author": "Lauren Stovall",
        "rating": 2,
        "review": "By far the worst place weve lived at.\nThe only reason I wouldnt give 1 star is that the office people are nice.\nNo parking, extremely nosey neighbors, no privacy, A LOT of sketchiness, trash everywhere, came home to swat team blocking the entrance one time should I go on?",
        "owner_response": null
      },
      {
        "author": "Crystal Garcia",
        "rating": 5,
        "review": "Management here is great they are very helpful and so nice. Ive lived here for almost a year and i have not had a problem with this apartment complex. I highly recommend living here.",
        "owner_response": null
      },
      {
        "author": "David Kornfield",
        "rating": 5,
        "review": "I really enjoyed renting an apartment here.  The management has always been pleasant and quick to respond to maintenance requests.",
        "owner_response": null
      },
      {
        "author": "Justin H.",
        "rating": 3,
        "review": "It's a cool place",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 13,
  "adjusted_average_rating": 3.54,
  "distribution": {
    "1": 3,
    "2": 1,
    "3": 2,
    "4": 0,
    "5": 7
  },
  "summary": {
    "created_timestamp": 1739205511,
    "text": "<section id=\"good\"><h2>Good</h2><p>Some residents at Maplewood Apartments have shared positive experiences in user reviews, highlighting the smooth transition during the management change. Many have found the new maintenance team to be attentive and efficient, promptly addressing issues, even minor ones like changing light bulbs. This level of care has led to a satisfying rental experience for several tenants, who also appreciate the friendly office staff that contributes to a welcoming environment. Another positive note is the affordability of the apartments, with unbeatable prices for the location, making it a great option for budget-conscious renters. Some reviews noted the property's convenient location and the option to rent appliances like washers and dryers, enhancing the overall living experience.</p></section><section id=\"great\"><h2>Great</h2><p>Several user reviews reflect a great sentiment toward the living experience at Maplewood Apartments, particularly praising the friendly and helpful management staff. New residents often find the move-in process straightforward, receiving ample support from the staff. Additionally, the quick responsiveness of the maintenance team to address issues contributes positively to the residents' perception. Furthermore, many tenants commented on the pleasant living space, with features like carpet-free apartments adding to the appeal. For some residents, the apartment complex has provided a safe and enjoyable environment, and they would not hesitate to recommend it to others.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews pointed out several negatives about Maplewood Apartments, notably issues with parking. The limited space leads many tenants to struggle with inadequate parking spots. Additionally, noise and disturbances from neighbors are recurring themes, including problems with residents taking others' parking spaces or being generally noisy. Some reviewers have also mentioned maintenance issues like mold buildup in bathrooms, highlighting a need for more frequent or thorough maintenance. Despite some tenants feeling safer overall, the user reviews suggest inconsistent experiences concerning property management attendance to crucial detail.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Several user reviews express a more severe dissatisfaction with the living conditions at Maplewood Apartments. Complaints have included significant issues like unaddressed cockroach infestations and unresolved maintenance problems, such as windows lacking screens. Some tenants felt management was negligent, failing to address critical maintenance issues like black mold or structural deficiencies. There are also allegations of drug activity and crime in the area, leading to safety concerns for residents. Further exacerbating these issues are claims of property management shifting blame onto tenants and retaining security deposits without valid reasons, adding to tenant frustration and dissatisfaction.</p></section>"
  }
}