{
  "name": "Meadow Wood Townhomes",
  "slug": "meadow-wood-townhomes",
  "company_type": null,
  "address": "923 Mahogany Ave, Bellingham, WA 98226",
  "review_count": 42,
  "average_rating": 3.45,
  "reviews": {
    "google_reviews": [
      {
        "author": "caitlin hepworth",
        "rating": 1,
        "review": "This place is awesome if you love mold and greedy landlords who do nothing when there are legitimate health and safety concerns in these units.\n\nCongrats Meadow Wood! You are now one of the many bellingham slumlords taking advantage of people. Gold Star. But just one.",
        "owner_response": null
      },
      {
        "author": "Crystal",
        "rating": 1,
        "review": "Don't move here if you have a daughter",
        "owner_response": null
      },
      {
        "author": "MackA Ken",
        "rating": 4,
        "review": "This place is set in the northern end of bellingham with close access to numerous shopping outlets and Bellis Fair mall.  The surround area is lush Woodlands that during the right time of year you can expect to see wild deer grazing upon the grass.  All in all the apartments are nice and it is a fairly quiet complex.",
        "owner_response": null
      },
      {
        "author": "Barbara Barb Casort",
        "rating": 3,
        "review": "Visiting a friend I noticed well kept buildings and landscaping but tenents who regularly tossed trash toward dumpsters.  Weekends cars don't obey parking regulations and cigarette butts are not picked up in the smoking areas",
        "owner_response": null
      },
      {
        "author": "Desirre Jeffords",
        "rating": 1,
        "review": "If management clean up the place better it would be a better and safer place to live they don't take care of the disabled like they should or even the elderly",
        "owner_response": null
      },
      {
        "author": "Desi J",
        "rating": 5,
        "review": "We Rock here ha jk its a beautiful neighborhood their's a elementary school down the road and their is also a middle school the opposite direction a 1/4 mile if that",
        "owner_response": null
      },
      {
        "author": "Noneyour Business",
        "rating": 5,
        "review": "Nice place to live at . The current landlord is amazing . Listens to concerns and ensures the problem is solved. Kristopher is amazing !",
        "owner_response": null
      },
      {
        "author": "Alexus Twombly",
        "rating": 3,
        "review": "Not at all a bad location, very pretty surrounding wooded areas",
        "owner_response": null
      },
      {
        "author": "Sarina Sutanthavibul",
        "rating": 4,
        "review": "Spacious and new low income housing. With a playground and trail that leads to Bakerview square.",
        "owner_response": null
      },
      {
        "author": "kelly daniels",
        "rating": 2,
        "review": "I've lived here for 4 years now and the drugs and crime are getting really bad, and the management isn't doing anything about it.",
        "owner_response": null
      },
      {
        "author": "Juanita Perez",
        "rating": 5,
        "review": "Looked really nice like thelay out",
        "owner_response": null
      },
      {
        "author": "Justen Kennedy",
        "rating": 3,
        "review": "Nice Town homes, a bit pricey tho.",
        "owner_response": null
      },
      {
        "author": "J R",
        "rating": 1,
        "review": "Shady place..weird people",
        "owner_response": null
      },
      {
        "author": "Michael Bennett",
        "rating": 4,
        "review": "Great place",
        "owner_response": null
      },
      {
        "author": "Jayson Ellis",
        "rating": 5,
        "review": "The best",
        "owner_response": null
      },
      {
        "author": "Jackson Bold",
        "rating": 4,
        "review": "Little Pricey\nClean",
        "owner_response": null
      },
      {
        "author": "Noah",
        "rating": 5,
        "review": " ",
        "owner_response": null
      },
      {
        "author": "Anna Eichhorn",
        "rating": 5,
        "review": "Straight dub",
        "owner_response": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 3,
        "review": "Dumpy",
        "owner_response": null
      },
      {
        "author": "Christopher Baggett",
        "rating": 3,
        "review": "Decent apartments",
        "owner_response": null
      },
      {
        "author": "Auston Olapas YouTube",
        "rating": 5,
        "review": "In and out",
        "owner_response": null
      },
      {
        "author": ". .",
        "rating": 5,
        "review": "OK.",
        "owner_response": null
      },
      {
        "author": "Patricia Ramirez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Sonny Hill",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Rebecca Percy",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Chris&dess Lewis",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Rome Hills",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Alisa 26",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Nani Bidnezz",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Julee Ann Guilliot Van Leuven (Cricket)",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "carih spence",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Darcy Lindenmuth",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mackenzie Smart",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mary DePoppe",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Tessa Hamm",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Joel Zerwekh",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "james hunt",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Joseph Lincoln",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "music tunes Roubideaux",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Lucas Guthrie",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kerri Little",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Happy Beltran",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 22,
  "adjusted_average_rating": 3.5,
  "distribution": {
    "1": 6,
    "2": 2,
    "3": 14,
    "4": 7,
    "5": 13
  },
  "summary": {
    "created_timestamp": 1739095094,
    "text": "<section id=\"good\"><h2>Good</h2><p>Meadow Wood Townhomes has received positive feedback about its location and surrounding environment. Several user reviews highlight the beautiful, lush woodlands and accessibility to shopping areas, making it an attractive option for residents who enjoy nature and convenience. The spacious townhomes also contribute to the positive sentiment, offering ample space for families and individuals alike.</p><p>Some renters have praised the management, specifically noting that a particular landlord is responsive to tenant concerns, which significantly enhances the living experience. Positive reviews discuss how the management ensures that problems are addressed in a timely manner, showcasing a commitment to tenant satisfaction that many find reassuring. Overall, there is a sense of community fostered within the complex that enhances residents' quality of life.</p></section><section id=\"great\"><h2>Great</h2><p>A number of reviews indicate that stakeholders appreciate the overall structural quality of the townhomes. Users have noted that the buildings are well-kept and the landscaping is aesthetically pleasing. Additions such as playgrounds and nearby trails provide recreational opportunities that enhance the community atmosphere, making it an attractive place for families.</p><pMoreover, multiple reviewers highlight the accessibility to local schools, which is an important feature for families with children. The combination of amenities, good upkeep, and the pleasant setting contribute to a generally favorable impression of the townhomes, suggesting that for many, this property is a solid choice in the area.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite its positives, Meadow Wood Townhomes has garnered a fair share of negative feedback, particularly concerning management practices. Several users expressed frustration regarding the lack of responsiveness to serious maintenance issues, such as mold problems and safety concerns, which they felt were not adequately addressed. This has led to sentiments of dissatisfaction among renters who believe that these issues compromise their quality of life.</p><pIn addition, some user reviews mention concerns about cleanliness and upkeep of common areas, with a particular emphasis on improper disposal of trash by tenants. The perception of growing crime and drug-related issues has also been noted by long-term residents, contributing to a sense of unease within the community. With mixed sentiments on management effectiveness, this property could improve its standing by addressing these concerns.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most serious complaints about Meadow Wood Townhomes revolve around allegations of neglectful management practices. Certain user reviews are particularly harsh, describing the complex as a “slum” and referencing landlords who appear indifferent to tenant health and safety issues. These comments raise significant concerns about living conditions within the townhomes, casting a shadow on the community's reputation.</p><pAdditionally, horrifying experiences such as tenants feeling unsafe due to inadequate management response or action may deter potential renters. The culmination of these unresolved issues raises red flags about whether current residents can expect positive change in the future, and whether potential new tenants should consider alternative housing options until management addresses the serious complaints more effectively.</p></section>"
  }
}