{
  "name": "MJB Real Estate Group",
  "slug": "mjb-real-estate-group",
  "company_type": "Company",
  "address": "310 E Magnolia St Suite 201, Bellingham, WA 98225",
  "review_count": 24,
  "average_rating": 4.96,
  "reviews": {
    "google_reviews": [
      {
        "author": "Gabe Wynn",
        "rating": 5,
        "review": "Jeff was amazing, he assisted my partner and I with finding and purchasing the perfect home. We are first time home buyers so we were really nervous and Jeff truly treated us like family. He was honest and extremely knowledgeable about everything the whole way! He would drop everything to get us into a house so we could make an offer! He even went to bat for us when there was multiple offers on the house we wanted. We got the house thanks to Jeff! I would highly recommend him to anyone who wants to buy a home in whatcom or surrounding areas!!! It truly was an amazing choice to go with Jeff, I hope you do too",
        "owner_response": null
      },
      {
        "author": "Lauren",
        "rating": 5,
        "review": "I can't thank Mike enough for his hard work and timely attention to closing a deal on my first home. He really knows his stuff, from the local area to working with the right lenders for the best rate. He also has a great intuition for negotiating a deal in a tough sellers market. As a first time home buyer, I definitely asked every question you could possibly imagine during the process, but Mike graciously offered his time and advice every time something came up to help make things clear for me. He's patient, easy to talk to, and knowledgeable. Good experience makes all the difference and Mike is a guy you can trust for that.",
        "owner_response": null
      },
      {
        "author": "Kasey Peach",
        "rating": 5,
        "review": "We found Mike by doing some research here online as the reader is probably doing now. One of our favorite parts of working with Mike is that he gets to the point and quickly pin points what it is that you are interested in and then uses that with his expansive knowledge of the area to find the perfect home for you. Within just an hour of talking he was able to drill down to exactly what we were looking for even if we hadnt previously thought of some of those aspects. As a testament of his resourcefulness, responsiveness and efficiency, Mike found us our home in less than a week and took all the stress out of the process by being there to answer any questions we had. Mike is a not only excellent at his job, but a great teammate in the home buying process - its very obvious hes in your corner every step of the way. We know that we will return to Mike for any real estate business in the future and cannot recommend him highly enough to others.",
        "owner_response": null
      },
      {
        "author": "Jennifer Lally",
        "rating": 5,
        "review": "I worked with Mike Belisle to purchase my condo in Bellingham in the fall of 2018 and to sell it in February/March 2021, and I would HIGHLY recommend Mike to anyone looking to buy or sell.\n\nMike is extremely professional, knowledgeable, and a go-getter.  As both a seller and buyer, he made himself keenly aware of my goals, timeline, and expectations, and worked to accomplish successful results!  He knows the WA state real estate markets in and out, and is able to advise well.  He is a fantastic communicator, and very upfront, as well as quick to respond.  His assistant Carey was also amazing during the sale of my home.  I would recommend them to anyone (and already have others working with them to sell their homes who are also quite thrilled with the experience).",
        "owner_response": null
      },
      {
        "author": "Maureen Van Deuren",
        "rating": 5,
        "review": "If you want to get the job done Mike Belisle and his TEAM should be your first call!\nThe excellence is apparent the minute you talk with Mike. He listens, asks questions then responds tailored to your needs. At this point there is a professional strategy set in motion!\nMikes knowledge of real estate is extensive. It started with pricing our home. He listened and did his research to come up with the best price. Then came the marketing. He assembled a professional team to take exquisite photography, this blew me away! It was a huge asset! He has all the necessary players available to set in motion the very BEST outcome for you.\nMikes experience set the stage for our home to sell in 30 days!\nHe also began a new trend for our neighborhood garnering the highest $per square food ever sold! He worked with the appraisal process to ensure everything went smoothly!\nWe are now on a new adventure moving closer to our Family in Bellingham!\nA HUGE thanks to Mike Belisle and the MJB real estate team!\n\nMaureen Van Deuren",
        "owner_response": null
      },
      {
        "author": "bFishLike bFischLike",
        "rating": 5,
        "review": "My professional relationship with Mike Belisle stretches back to 2015 when he made my transition from San Diego to Bellingham an absolute walk in the park. He guided me in the purchase of a new home and was there to assist me every step of the way.\nFast forward to the end of 2018 and my job mandated that I relocate to the east coast so I called up Mike and he came through and provided an exceptional marketing package and the expertise to navigate a market and out of season (Fall) sale timeline to maximize our profit earning potential.\n\nI picked Mike originally because of his reviews and the volume of his Bellingham sales and I was not disappointed. Mike has gone above and beyond every step of the way and has lived up to the expectations his portfolio details.",
        "owner_response": null
      },
      {
        "author": "Linda Walker",
        "rating": 5,
        "review": "Mike Belisle did a great job marketing and selling our small acreage Bellingham home in the country this past fall. Priced right, pointers on staging, great communication and follow-up. After we moved out and the deal was done, a truly lovely gift basket arrived thanking us. And then two weeks ago, a roll of Christmas wrapping paper showed up on our front porch with a thank you and Christmas greeting from MJB Realty...over the top. Classy. I'd do business with Mike again in a heartbeat.",
        "owner_response": null
      },
      {
        "author": "Nancy Landau",
        "rating": 5,
        "review": "My husband and I worked with Jeff Engen on our move from Berkeley, CA to Bellingham, WA.  He is a fabulous real estate agent!  Jeff really walked us through the whole process, talked us down when we were anxious, explained the steps and the terms, made videos of walk-throughs so that we could view houses through YouTube, and worked seamlessly with the condo group to help us make the transition.  We highly recommend Jeff, and MJB Real Estate.  We couldnt have done it without them.",
        "owner_response": null
      },
      {
        "author": "Jane Wareing",
        "rating": 5,
        "review": "Experience with Michael Belisle of the MJB Real Estate Group\n\nEarlier this spring, we were getting ready to sell our home so we could move closer to our children and grandkids. I saw an ad for Homelight.com one morning and decided to check it out. I provided my name, email address and phone number. Shortly I received several telephone calls from a number of local realtors. Although all were obviously polished professionals, Michael Belisle of the MJB Real Estate Group really intrigued me, so I invited him to meet with my wife and me to discuss selling our home.\n\nMy wife and I welcomed Michael into our home and then listened as he detailed his sales process. We were \"Blown Away\" by what he showed us. We could not have been more impressed with Michael or his sales process. After a thorough discussion of the real estate agreement and a walk-thru of our home and yard, during which Michael provided excellent suggestions for staging both. We hired Michael and began to prepare for the sale.\n\nMichael brought in professionals who took photos and videos that became key selling tools. To make a long story short, Michael sold our home the second day it was on the market. We received full price plus offers. Since we had already found a house in the area where we wanted to relocate to, we accepted the best offer.\n\nMichael provided excellent counsel and support as we moved through the challenging closing process that followed. His knowledge of the closing process was impressive and his negotiation skills were invaluable. He really knew the market, and how to prepare, stage and present our home to get the best result.\n\nOur home sold for much more that a comparable home close by. We closed shortly thereafter and were successful in buying the house we wanted move to.\n\nWe could not have been more pleased with Michael Belisle of the MJB Real Estate Group. As realtors go, there are certainly \"good, better and best\", but Michael is in a class by himself. On a 10-point scale we would rate Michael as a 100. He is, in a word: SUPERB.\n\nThanks Michael, we couldn't have done it this well without you.",
        "owner_response": null
      },
      {
        "author": "Jenni Cox",
        "rating": 5,
        "review": "I found a dream house when I least expected it and called Michael to talk through the numbers of placing and offer and eventually selling my existing home.  I thought it was going to be a longshot but he went right into action and worked on a competitive offer with contingencies that was accepted in less than 24 hours.  From that point forward, they guided me through the inspection, further negotiations, and appraisal perfectly.  He was always available and made sure my best interest was protected every step of the way.  One week later, my existing house was on the market and they found me and negotiated an offer that I was extremely happy with in less than two weeks.  There were no hiccups or issues with buying or selling.  Whenever I had questions or moments of stress or second guessing, they were always there to go back through the numbers and put my mind at ease.  All in, I was able to buy a home, sell a home, and close on both within 60 days.  I bought and sold at a price I was extremely happy with and all aspects of both transactions were flawless.  I would highly recommend MJB to any buyer or seller!  This is the 4th time I've been through the buying and selling process and this was BY FAR the BEST experience I've ever had.  Thank you MJB!",
        "owner_response": {
          "text": "Hi Jenni, thank you for the great review. We really enjoyed working with you as well. We wish you all the best in your new home and can't wait to hang out soon."
        }
      },
      {
        "author": "Kelsey Chance",
        "rating": 5,
        "review": "Thank you Mike!!  As first time home buyers, we felt confident all the way with you as our agent.  From trudging through the rain and mud with me to look at the property lines, all the way to getting our winning offer in within 2 hours of viewing the house - you were hands on and a real advocate for us.  We love our new home!!",
        "owner_response": {
          "text": "Thank you Kelsey. It was an honor working with you and Spencer. I wish you both the best and hope to see the personal touches you do."
        }
      },
      {
        "author": "Micah Bartlett",
        "rating": 5,
        "review": "I've had Mike's help buying 2 places now. While a little rough around the edges, Mike has good knowledge and insight into homes/ property and is a great guy to have in your corner. He will ask the tough questions, keep the process moving, and bargain for your best interests.",
        "owner_response": null
      },
      {
        "author": "Millard Shires",
        "rating": 5,
        "review": "I hope this isn't too long...  Some agents are wonderful at hand holding and explaining.  Some agents are wonderful at getting the job done -- you just tell them what you want/need and let them go to work.  Sort of like surgeons...some have great bedside manners, some have great technique but not so great personality.  The point is, Michael Belisle had both qualities with us.  He didn't inundate with details, but if/when we had questions he responded thoroughly.  He was a 'take charge' agent, but kept us in the loop and asked clear and probing questions so he could formulate the best strategy for our situation.  In a time of Covid-19 pandemic, he navigated what could be done with great skill and care.  He used social media resources skillfully.  He took great care to ensure our safety.  He was always positive and energetic.  He let us know the status and processes as various thresholds (no pun intended) were crossed. And we were astonished by all the connections to resourceful people he had at his disposal to help us get our house sold, and then worked with us to find a new home that met our changing needs.  And through it all he was a personable source of confidence, knowledge, and experience.  I highly recommend MJB Real Estate Group.",
        "owner_response": {
          "text": "Mill, you and Carol are so great. Thank you for your kind words. Its a pleasure to know you and thanks again for the advice on my trees.  Everyone needs to know a Master Gardener. : )"
        }
      },
      {
        "author": "Scott Stone",
        "rating": 5,
        "review": "We had Mike sell our home and were very impressed with his professionalism and knowledge of the market. He exceeded our expectations. If you are looking to buy or sell a house, Mike will not disappoint.",
        "owner_response": null
      },
      {
        "author": "J Venus",
        "rating": 5,
        "review": "Mike Belisle is the most knowledgeable real estate agent in Whatcom County.  He has a vast background that includes land development, home remodels, investment properties, and mortgage management, just to name a few.  As a fellow real estate agent in town, I have learned a lot just by working with Mike.  I highly recommend him and his team at MJB Real Estate Group for all your real estate needs.",
        "owner_response": null
      },
      {
        "author": "George Walker",
        "rating": 5,
        "review": "Mike did a fine job of marketing our house and satisfying both the sellers (us) and the buyers.  The deal went smoother than expected -  probably due to Mike's flexibility during negotiations.",
        "owner_response": null
      },
      {
        "author": "Kelly Earl",
        "rating": 5,
        "review": "My husband and I moved to Bellingham in July 2021 and always dreamed of being home owners. After passing on a home we were positive we wanted, we settled on a gorgeous new construction in Everson. Jeff Engen worked around the clock constantly being in contact with listing agents, the lender, and sometimes even returning our texts at 9 pm answering all of our questions. He was thorough, informative, knowledgeable, kind, patient with us and honest. It meant everything to us that he treated us like a priority. Thank you so much Jeff for helping us get this beautiful home!",
        "owner_response": null
      },
      {
        "author": "Ben King",
        "rating": 5,
        "review": "What would we have done without Jess?! My wife and  I just concluded a lengthy search for a new home, and Jess Davis was there for us every step of the way. We looked at house after house for months and she never balked at our specificities or list of wants and needs. I know we were picky, and Jess went above and beyond for us every step of the way. She drove all over the greater Bellingham area and once even had to diffuse a situation with another agent who was extremely rude and territorial over the property we were trying to look at. After we closed, she even drove up to our new house just to let our beloved husky Kinley in to get used to the new place and sat on the floor with us in the empty house while Kinley explored. She never pushed us to do anything we didnt want to do, she never even bothered to show us a house if it didnt fit in our parameters and she never pressured us. Jess embodied class, grace and patience with 2 complete novices through every step of the process. I am not the most trusting person, and Jess is not at all what a real estate agent was in my head when I began this process. She set my skeptical heart completely at ease. I cant say enough good things about her. Proceed with full confidence, prospective buyers. Thank you Jess!!!",
        "owner_response": null
      },
      {
        "author": "Makayla M",
        "rating": 5,
        "review": "I stumbled on MJB real estate through Instagram and reached out to find a realtor. I spoke with Jordyn and she put me in touch with Jessica. The team at MJB is super helpful and knowledgeable about buying a home! I would highly recommend!",
        "owner_response": null
      },
      {
        "author": "Funny Moms I Like To Follow",
        "rating": 5,
        "review": "Mike was a GREAT teammate through the buying process! He pushes past limits most will not and cheers you on during the entire buying process. 1,000 times PICK HIM. Hes got your back.",
        "owner_response": null
      },
      {
        "author": "Steve Chance",
        "rating": 5,
        "review": "I have used Mike on several purchase and sales over the years and would use no one else.  He is experienced, highly professional, accessible, responsive, and consistently works beyond my expectations.",
        "owner_response": null
      },
      {
        "author": "Spencer Berger",
        "rating": 5,
        "review": "I cannot recommend Mike Belisle highly enough. He is extremely knowledgeable about all things real estate.",
        "owner_response": null
      },
      {
        "author": "Edith",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Sarah Peach",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 22,
  "adjusted_average_rating": 5.0,
  "distribution": {
    "1": 0,
    "2": 0,
    "3": 0,
    "4": 1,
    "5": 23
  },
  "summary": {
    "created_timestamp": 1739205519,
    "text": "<section id=\"good\"><h2>Good</h2><p>MJB Real Estate Group receives high acclaim from many clients for their excellent service. Numerous user reviews highlight the agents' expertise and dedication. An example includes a first-time buyer who appreciated Jeff's family-like treatment throughout their home-buying journey. Jeff's devotion to helping them secure their dream home in a competitive market left a lasting impression. Another user praised Mike for his ability to pinpoint their needs quickly and efficiently. His resourcefulness turned what could have been a stressful process into a pleasant experience by finding the perfect home in under a week.</p><p>The team's assistance doesn't end after the sale is made, as highlighted by a user who received unexpected but thoughtful gestures from the company. After successfully selling their home, Mike's team sent a lovely gift basket and a festive holiday greeting, making the client feel valued even after the transaction. This demonstrated the company's commitment to client satisfaction extends beyond mere business transactions, ensuring clients feel appreciated and supported throughout and beyond their real estate endeavors.</p></section><section id=\"great\"><h2>Great</h2><p>The MJB Real Estate Group's reputation for greatness is reflected in their thorough and knowledgeable handling of transactions. One user review raves about how Mike Belisle's professionalism and knowledge were unmatched, exceeding the seller's expectations by facilitating a smooth process and setting a new price trend in their neighborhood. Additionally, Mike's marketing skills, through exquisite photography, helped their home sell swiftly, providing a stress-free experience. The users express amazement at how the expert guidance made such a significant impact.</p><p>Users have also said that MJB Real Estate Group's agents show unparalleled dedication and support, such as when one agent, Jess, went above and beyond for her clients, even helping with pet care during the transition. Her patience, understanding, and determination to meet clients' specific wants and needs foster trust and reassurance throughout the process. Another user characterized their experience as the best they've ever had with any real estate dealings, with MJB guiding them through sales and purchases effortlessly and celebrating as the clients reached their desired outcomes with peace of mind.</p></section><section id=\"bad\"><h2>Bad</h2><p>Finding specific bad experiences with MJB Real Estate Group is challenging due to the overwhelming focus on positive interactions shared by users. However, there is an implicit suggestion for improvement in communication responses to reviews, as evidenced by the few times the company replies to online user reviews. This might indicate room for enhancing interaction and post-service engagement with clients.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>In the realm of reviews indicating an \"ugly\" side typically full of grievances and dissatisfaction, MJB Real Estate Group seems to have sidestepped this section altogether. With no discernible accounts of significant negative experiences or unresolved issues in the user reviews, the company's impeccable reputation remains intact. The absence of complaints speaks volumes about their commitment to service quality and customer satisfaction.</p></section>"
  }
}