{
  "name": "Monterra Apartments",
  "slug": "monterra-apartments",
  "company_type": "Property",
  "address": "487 31st St Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 3.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Anthony D.",
        "rating": 5,
        "review": "this IS a safe place to live. you're super close to the University andddd its super close to Haggen market and the ~dollar store~. There ARE rat cluster buddies that like- run around in groups of 20 near and under the dumpster, and I AM scared of them infiltrating this sweet unit during the Winter, but all has been good for now... the unit is completely carpeted with ONE washer and ONE dryer in a room and each load is $2, so $4 to wash and dry a load. It's in a safe area tho and we got a little porch in the trees where you can hear the rats fight~ genuinely really crazy to hear them just go at each other like that. Cool place though~",
        "owner_response": {
          "text": "Hi Anthony, thank you for taking the time to write a review. We are glad to hear that you find Monterra to be a safe place to live and that our location is convenient for you. We appreciate your feedback and will take steps to address these issues. Please do not hesitate to reach out if you need anything."
        }
      },
      {
        "author": "Chloe E.",
        "rating": 1,
        "review": "This is NOT a safe place to live. If you're considering renting here, don't.  The residents include several criminals at this time. I've seen threats left on apartment doors and cars. I'd love to break my lease because I feel unsafe, but aparently I cannot. Cars get keyed all the time. We aren't allowed to recycle. There isn't enough parking for the residents. By the time I had lived here 3 months, we had gone through 3 different property managers, and none of them seemed to have a clue what they were doing. I cannot stress enough how terrible living here is. I have had 0 positive experiences with property managers or other tenants.",
        "owner_response": {
          "text": "Hi Chloe, We're troubled to read your review of Monterra, and we're eager to do all we can to help improve your time here. When you get a moment, could you please come to see us in the office or give us a call at (360) 306-8756? We look forward to hearing from you soon. Thanks."
        }
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 3.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739095094,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Monterra Apartments receive praise for their safe environment and convenient location. One user particularly highlighted the proximity to the University and local amenities such as Haggen market and the dollar store, which adds to the appeal for potential tenants. The apartment features, like the included appliances and carpeting, were also appreciated, creating a comfortable living space overall.</p><p>User reviews indicate a positive interaction with the property management, as seen in the owner’s responses to feedback. The management seems open to suggestions, as they acknowledged the concerns regarding safety and promised to make improvements, demonstrating a willingness to engage with residents and enhance their living experience.</p></section><section id=\"great\"><h2>Great</h2><p>While the property is generally deemed a safe living opportunity, it also boasts a certain charm that appeals to some residents, including the natural surroundings and community atmosphere. The pleasant outdoor spaces, like porches nestled in trees, allow residents to enjoy the outdoors even amidst urban living. Users appreciate these aspects, which contribute to a homely feel.</p><p>The management’s commitment to addressing issues raised in user reviews suggests a proactive approach to property management. Their prompt replies illustrate an interest in resident satisfaction, which can foster a supportive community even when faced with challenges.</p></section><section id=\"bad\"><h2>Bad</h2><pDespite some positive aspects, substantial concerns have been raised about safety and tenant security at Monterra Apartments. One user reported witnessing threats directed at residents and vehicles, citing an overall feeling of unease within the community. Additionally, the frequency of issues such as a high turnover of property managers has led to dissatisfaction among residents, impacting their overall experience.</p><pResidents have also voiced complaints about basic amenities, including insufficient parking and restrictions on recycling, which have added to the frustration. These recurring management issues seemingly detract from the livability of the complex and contribute to a less-than-ideal tenant experience.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThe most concerning reviews indicate a serious disparity between tenant experiences, creating an unsettling atmosphere. One tenant described a chaotic environment marked by criminal activity and ongoing safety threats, painting a picture that contradicts the notion of a safe community. The inability to easily break a lease due to safety concerns underscores significant challenges faced by residents seeking a secure living situation.</p><pFurthermore, the management's struggles with maintaining consistency and effectiveness have led to a general distrust among tenants. While some residents may enjoy their living experience, others are facing critical issues that management may be neglecting, pointing to a troubling trend that could deter potential renters from choosing Monterra Apartments.</p></section>"
  }
}