{
  "name": "Monterra Apartments",
  "slug": "monterra-apartments",
  "company_type": "Property",
  "address": "487 31st St Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 3.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Anthony D.",
        "rating": 5,
        "review": "this IS a safe place to live. you're super close to the University andddd its super close to Haggen market and the ~dollar store~. There ARE rat cluster buddies that like- run around in groups of 20 near and under the dumpster, and I AM scared of them infiltrating this sweet unit during the Winter, but all has been good for now... the unit is completely carpeted with ONE washer and ONE dryer in a room and each load is $2, so $4 to wash and dry a load. It's in a safe area tho and we got a little porch in the trees where you can hear the rats fight~ genuinely really crazy to hear them just go at each other like that. Cool place though~",
        "owner_response": {
          "text": "Hi Anthony, thank you for taking the time to write a review. We are glad to hear that you find Monterra to be a safe place to live and that our location is convenient for you. We appreciate your feedback and will take steps to address these issues. Please do not hesitate to reach out if you need anything."
        }
      },
      {
        "author": "Chloe E.",
        "rating": 1,
        "review": "This is NOT a safe place to live. If you're considering renting here, don't.  The residents include several criminals at this time. I've seen threats left on apartment doors and cars. I'd love to break my lease because I feel unsafe, but aparently I cannot. Cars get keyed all the time. We aren't allowed to recycle. There isn't enough parking for the residents. By the time I had lived here 3 months, we had gone through 3 different property managers, and none of them seemed to have a clue what they were doing. I cannot stress enough how terrible living here is. I have had 0 positive experiences with property managers or other tenants.",
        "owner_response": {
          "text": "Hi Chloe, We're troubled to read your review of Monterra, and we're eager to do all we can to help improve your time here. When you get a moment, could you please come to see us in the office or give us a call at (360) 306-8756? We look forward to hearing from you soon. Thanks."
        }
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 3.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739205516,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Monterra Apartments offer some appealing aspects, especially for individuals seeking proximity to essential amenities and the local university. Located near Haggen Market and a dollar store, the apartments provide convenience for daily errands. According to user reviews, the property is situated in a safe area, giving residents a sense of security in a location that is close to nature and local stores.<p>Residents have mentioned the benefit of having a small porch area that allows them to enjoy the surrounding trees, which adds a pleasant touch to the living experience. The management has responded positively to feedback, indicating a willingness to address issues raised by tenants. These aspects are appreciated by residents who value peaceful and accessible living conditions.</p></section><section id=\"great\"><h2>Great</h2><p>Monterra Apartments has received commendable feedback for its convenient location, being particularly attractive to students due to its proximity to the University. The convenience of amenities being nearby, such as grocery stores, makes it suitable for those who lead a busy lifestyle. This ideal positioning is viewed as a significant benefit from a user review perspective.<p>Additionally, the management's responsiveness to reviews shows a commitment to improving resident satisfaction. In one instance, management acknowledged the presence of rodent issues near the dumpsters and expressed a determination to resolve such concerns. By engaging with residents and actively seeking to address their feedback, Monterra demonstrates a proactive approach, which enhances its reputation among tenants who have positive communication experiences.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positive aspects, Monterra Apartments have faced criticism, particularly regarding safety and management inconsistency. One user review highlighted significant concerns over security, mentioning threatening notes and criminal activities among residents, which seriously affected their peace of mind. Insufficient parking facilities and the inability to recycle were additional frustrations shared by tenants seeking basic amenities and sustainable living practices.<p>Another troubling aspect is the frequent turnover of property managers, which appears to have resulted in inadequate property oversight and service disconnect. One tenant expressed dissatisfaction with going through three different property managers within a short period, which can lead to confusion and lack of continuity in addressing tenant needs. Such issues reflect challenges that Monterra faces in maintaining consistency and reliability in its management services.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Serious allegations of unsafety and mismanagement have marred the reputation of Monterra Apartments in alarming ways, as stated by one tenant. Reports of cars being vandalized and threats being left on apartment doors raise grave concerns regarding the living conditions. Such incidents are undoubtedly distressing for residents who expect a secure and pleasant environment. The review stresses experiencing no positive interactions with property management or fellow tenants, painting a grim picture of the community atmosphere.<p>The contrast between the management's responses to these claims and the tenants' experiences is stark, suggesting either a breakdown in communication or ineffective problem resolution strategies. Such discrepancies between management's assurance and tenant realities necessitate urgent and genuine action to address deeply rooted issues of safety and community well-being at Monterra Apartments.</p></section>"
  }
}