{
  "name": "Morgan Loy - Bellingham Real Estate Company",
  "slug": "morgan-loy-bellingham-real-estate-company",
  "company_type": "Company",
  "address": "2900 Meridian St, Bellingham, WA 98225",
  "review_count": 55,
  "average_rating": 5.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Brittany Dowden",
        "rating": 5,
        "review": "I cannot express our gratitude to Morgan and our appreciation for her during our home-buying experience. Not only is she extremely knowledgeable, attentive, communicative, and in tune with the market, but she is also so kind and comfortable to work with. We found a listing we were interested in and within a few days we had met with Morgan, visited the home, and put an offer in that was accepted. Her negotiating skills are top-notch and we are so beyond grateful for her. Her experience and dedication to her clients is truly incredible. We were first-time home buyers and had a lot of anxiety about the process, but she made it so easy and painless for us. She is an expert and I highly recommend!!",
        "owner_response": null
      },
      {
        "author": "Emily Mickelson",
        "rating": 5,
        "review": "Morgan was phenomenal in helping us find our first house. We were on a bit of a time crunch and she made it happen for us in a short span of time. She met with us on weekends and weekdays on short notice, you can tell she is extremely dedicated to her clients and helping them find their perfect home. She also helped us with negotiating and informed us of other types of concessions we can request that made the deal awesome for us. We are so thankful for her services and 10/10 recommend",
        "owner_response": null
      },
      {
        "author": "Kole Thiriot",
        "rating": 5,
        "review": "Morgan is one of the most organized people Ive ever met. Her website alone shows that. She is professional, friendly, knowledgeable, and even found me a babysitter to go around with us looking at houses so I could focus on the homes we were touring. It was extremely helpful. The sitter she brought was so great she has continued helping our family.\n\nMorgan navigated our negotiations with respect and tact and got us the price possible.\n\nI would recommend her without hesitation. 10/10",
        "owner_response": null
      },
      {
        "author": "Kimberly Farias",
        "rating": 5,
        "review": "Morgan helped my partner and I purchase our first home and was an invaluable resource. Since this was our first time ever going through this process, we had a lot of questions along the way and needed a lot of guidance. Morgan went above and beyond to provide all the info we needed and really supported us, including taking calls and meeting up with us outside of business hours and helping us put an offer in over a tight weekend timeframe. She had clear and helpful answers to our questions and when information wasnt available, was able to track things down and follow up with us quickly. She was also a great advocate for us throughout the offer and negotiation process. Morgan knows a lot about the local real estate landscape and has a ton of knowledge about both the home buying process in general and specific local considerations. She was extremely valuable in our decision making and was always available to chat through our thoughts and provide guidance. We could tell right away that she was truly invested in helping us find our ideal home and would go the extra mile to make that happen. We definitely recommend Morgan to anyone looking to purchase a home in Bellingham!",
        "owner_response": null
      },
      {
        "author": "NICK SMITH",
        "rating": 5,
        "review": "As a first time homebuyer, the initial thought of purchasing a house felt like an overwhelming task. This feeling was wiped away after my first meeting with Morgan. From the very beginning, Morgan thoroughly listened, cared, and paid attention to all my thoughts, (MANY) questions, and concerns. I knew that I had found someone who I could trust, and really understood my needs! This made my house buying experience fun and exciting - something I was sure would be nerve-wracking and stressful.\n\nAs someone who is more analytical, Morgan was very patient and helpful. She let me proceed at a pace that was most comfortable for me, while still making sure we met important deadlines when the time came! At every turn, she was always available for any questions I had, and was always quick to get showings lined up.\n\nThanks to Morgan's experience, knowledge, and connections, I was able to find the perfect house for me, and my budget! I am so grateful to have had Morgan's help and would highly recommend her to anyone thinking about purchasing a home.\n\nThank you, Morgan!  You have a customer for life.",
        "owner_response": null
      },
      {
        "author": "Grant Brunton",
        "rating": 5,
        "review": "Morgan was so Great to work with! She made us feel supported throughout the whole process and was able to answer any questions clearly. She is THE person to have on your side when buying or selling a home.",
        "owner_response": null
      },
      {
        "author": "Deb Eberhardt",
        "rating": 5,
        "review": "Morgan is the best! I moved up here in June and I could not have done it without her! We spent 6 months looking for my home. I had her doing cartwheels since I didnt really know exactly what I wanted. Every time I pivoted so did Morgan. She listened, she asked questions, she gave me insight into locations and properties and she held my hand when I sold my previous home (even though she wasnt involved in that sale!) I appreciated her patience, ability to break down terms I was not familiar with and how darn calm she stayed even when it seemed things were going the wrong direction! You cannot go wrong with Morgan!!!",
        "owner_response": null
      },
      {
        "author": "Missy The Peoples Realtor Walden",
        "rating": 5,
        "review": "We met Morgan when we went to Bellingham to visit our son and his fiancee. When we saw where they were living and what they were having to pay for rent we decided to just take a peek at the market in the area. After checking out a resale with Morgan we had some reservations due to the age, stucco exterior, and the asking price. Morgan opened the thought process of new construction to us which I am a total fan of especially in the last quarter of the year. (I am a realtor in Virginia and totally believe new construction with realtor representation is the way to go in this market). We were excited to use an investors DSCR loan which was the learning curve! After a couple of big bumps in the road we finally closed this past week and our kids are going to have a safe, clean home to live in AND they will help pay our investment home mortgage instead of someone else's!\nMorgan was extremely skilled in negotiating and keeping a crazy situation cool and in control! I cannot say enough to share how grateful we are that she was the one that showed us that first house! I honestly believe the right people come into your world at the right time for the right reasons!\nThank you Morgan!\n#bemissy",
        "owner_response": null
      },
      {
        "author": "Brody Loy",
        "rating": 5,
        "review": "Full disclosure: recent client/proud parent. You can quickly conclude that Morgan is very good at what she does just by reading her reviews. The best part of our recent home purchase was seeing it firsthand. Smart, informed, connected, patient, engaged, attentive, communicative, willing to have tough conversations. She is the person you want to have as your advocate through the real estate transaction process. We walk away so impressed. (And a little confused. Not sure where she learned all that.)",
        "owner_response": null
      },
      {
        "author": "Elaine Marshall",
        "rating": 5,
        "review": "Morgan was incredibly knowledgeable,  helpful, and patient. As first time home buyers, we had no idea what to expect, but we couldnt have imagined a better experience! Morgan was quick to communicate with us, answer any questions we had, and get us more information as needed. She was great at listening to us and understanding what we were looking for during our search. We felt supported throughout the offer and negotiation process, and were very confident in Morgans ability to advocate for us. We wholeheartedly recommend working with Morgan!",
        "owner_response": {
          "text": "Thank you for sharing your experience! I really enjoyed helping you and Sam through the entire process!"
        }
      },
      {
        "author": "Patrick Azzara",
        "rating": 5,
        "review": "Morgan does an absolutely amazing job. We did a deal cross country & it was seamless Very professional, highly recommend!!!",
        "owner_response": null
      },
      {
        "author": "Melissa Bursch",
        "rating": 5,
        "review": "My husband and I would recommend Morgan to anyone. Shes honest, professional, prompt, and thoughtful. We first contacted Morgan when inquiring about a house for sale. She became our real estate agent in short order, and were happy we went with her.\n\nAs first-time home buyers, I imagine we werent easy to help. We had no idea what we really wanted in a house, where we really wanted to live, or how much of a project we were willing to take on. She never showed even the slightest irritation as we cast about trying to figure out what we wanted. She was understanding, professional and prompt in getting us details about any house we were interested in.\n\nI also really appreciate that Morgan always informed us what kinds of risks might be present. We could so easily have walked blindly into buying a home and regretted it if it werent for her. We couldnt have asked for a better real estate agent. Well be contacting her again if we ever decide to sell.",
        "owner_response": {
          "text": "Melissa, thank you for taking the time to share your experience! I'm thrilled we made your dream of homeownership happen."
        }
      },
      {
        "author": "Nam Anh Johnson",
        "rating": 5,
        "review": "We could not give Morgan more praise for her hard work in making our house dreams come true.  Morgan was always the right choice for real estate agent when we decided to move.  She knows Whatcom County, she has connections, and she is aware of the market. Her input and expertise was immensely valuable.  She is also super easy to work with, very responsive, and incredibly strategic when it came to listing our home and helping us get another home.  Especially in this market! You cannot go wrong if you choose to work with Morgan Loy!",
        "owner_response": {
          "text": "Thank you for sharing your experience, Anh! So stoked for you and your family!"
        }
      },
      {
        "author": "Lyndsey Inslee",
        "rating": 5,
        "review": "Working with Morgan was the best part of selling our house. She has infinite knowledge and experience in every facet of the process. She found all the outside help we needed (ie landscaping, cleaners, handyman) and made sure we were 100% happy with the results. I truly cannot say enough about Morgan and if we hadnt moved out of state, we would have kept her as our one and only realtor forever.",
        "owner_response": {
          "text": "WA misses the Inslee family! It was so great being a part of your sale, I truly enjoyed getting to help you with the big move."
        }
      },
      {
        "author": "Savannah Jones",
        "rating": 5,
        "review": "Morgan made our home buying experience better than we ever could have imagined! As first time home buyers with lots of questions, she was incredibly patient and diligent in answering them all, always readily available and responsive. Morgan was willing to work with us outside of Bellingham into areas that we were interested in. When beginning to home search from outside of the state, Morgan was able to accommodate by working with our schedules and time differences to view properties for us, while being extremely honest about details that we may not have even thought of or noticed. Morgan is incredibly kind and a true pleasure to work with - we could not recommend Morgan more and look forward to working with her in the future for all of our WA real estate needs!",
        "owner_response": {
          "text": "It was such a joy helping you find the right home! Thank you for trusting me in the process! :)"
        }
      },
      {
        "author": "Deanna Medina",
        "rating": 5,
        "review": "If you aren't into reading long reviews, we give Morgan a 1000/10, 5 stars, etc. Morgan went above and beyond our expectations as our realtor for buying our home. We initially started the process thinking we would be purchasing land to build on. She was very prompt with finding information and providing recommendations for all aspects of the building process. We decided to go the route of purchasing an existing home and she helped us switch gears right away. At the time, we were still a few weeks out from listing our condo so when we started looking at houses we did not expect to fall in love with the first home we toured in Sudden Valley. Due to needing time to list our condo on the market, Morgan negotiated an amazing contingency deal which ended with us being able to purchase our dream home! Morgan was amazing to work with. She is honest, personable, and kind. She made sure we understood all aspects of contracts and agreements and gladly answered all of our questions. I'm so grateful we were able to work with her!",
        "owner_response": {
          "text": "Deanna, thank you so much for your thoughtful review! Your family is the sweetest and Bellingham is lucky to have you!"
        }
      },
      {
        "author": "Shaun Kirchgessner",
        "rating": 5,
        "review": "I was super impressed working with Morgan to buy a home in Bellingham. Since I was moving from Seattle, she did a bunch of video tours for me to help narrow down possible homes and gave me great insight into each one. Her expertise in writing competitive offers in a very tough market allowed my first and only offer to be accepted, which was a huge relief. She also did an awesome job communicating with me to keep me informed during every step of a stressful process and make home buying as easy as possible.",
        "owner_response": {
          "text": "I appreciate your kind words! It was so great getting to know you and helping you buy your first Bellingham home!"
        }
      },
      {
        "author": "BJ McMillen",
        "rating": 5,
        "review": "We're so thankful that we decided to have Morgan be our agent. She went above and beyond. Meeting with us often to make sure we were comfortable and informed along the way. Morgan worked hard to get our home staged and sold in just a couple days. She also helped us find our new house that we love to call our home. We highly recommend Morgan to anyone that's looking to buy or sell.",
        "owner_response": {
          "text": "Thank you, BJ! I'm so glad your family is loving the new home!"
        }
      },
      {
        "author": "Sara Elkinton",
        "rating": 5,
        "review": "Morgan demonstrated exceptional professionalism throughout our transaction. Her attentiveness and proactive approach made me feel well-supported at every step. Morgan anticipated my needs with remarkable accuracy and efficiently organized multiple companies to address inspection findings. She personally oversaw their visits, sparing me the inconvenience of taking time off. Furthermore, she skillfully negotiated with the seller to cover all repair costs.  I am confident that without Morgan's expertise, I would have paid more for the house and had way less fun.",
        "owner_response": {
          "text": "This means a lot coming from an industry colleague! Thank you, Sara!"
        }
      },
      {
        "author": "Bryce Dickerson",
        "rating": 5,
        "review": "As a first time home buyer we were lucky to have Morgan working for us. Morgan was super responsive and always extremely professional. She walked us through the entire process start to finish and helped us navigate a very competitive housing market, If you're looking to buy or sell I would highly recommend working with Morgan.",
        "owner_response": {
          "text": "It was so much fun helping you become homeowners! Thank you for sharing!"
        }
      },
      {
        "author": "Morgan Parker",
        "rating": 5,
        "review": "Morgan Loy is amazing! We found ourselves needing to buy a house rather quickly while still living in a different state. Morgan jumped right into our search, giving us insight into what would help make our offer competitive! Once we signed on a house, Morgan went above and beyond to make it feel like ours, even though we had never seen it. She was in constant communication, measuring spaces for us, sending us vendor recommendations and giving us a video tour so we could feel like we were there in person. Not to mention the BEAUTIFUL welcome basket we found when we moved to the house (it even included gifts for our son and dog!!).\n\nBuying a house can be so scary, especially in a new city. Working with Morgan made the process so easy and comfortable!",
        "owner_response": {
          "text": "It was SO fun helping your family make their way back to Bellingham. I appreciate your trust and the referrals you've sent my way!"
        }
      },
      {
        "author": "Megan Velthuizen",
        "rating": 5,
        "review": "Morgan is the secret weapon to having a positive real estate experience! Her professionalism, proactive approach, and positive attitude made our hunt for a home so smooth and painless! Morgan is also incredibly well-connected and knowledgeable, which turned out to be a crucial part of our success in finding a house. I would highly recommend her services for anyone looking to buy or sell a home!",
        "owner_response": {
          "text": "I appreciate your feedback and am so thrilled for you and Cody! Congrats on your new home!"
        }
      },
      {
        "author": "Sam Illies",
        "rating": 5,
        "review": "Morgan helped us buy our first home and we could not have asked for a better experience. We had no idea what to expect, but she streamlined the process for us and had our back the entire time. Morgan was very available, responsive, and knowledgeable about every aspect from loans to types of windows. We strongly recommend her to anyone.",
        "owner_response": {
          "text": "Thank you for sharing your experience! It was an honor to help you with your important purchase!"
        }
      },
      {
        "author": "Amy Stell",
        "rating": 5,
        "review": "We had a wonderful experience working with Morgan Loy as our realtor. Morgan's excellent communication skills kept us well-informed and at ease throughout the entire process. I highly recommend Morgan Loy to anyone seeking a professional, personable, and thorough real estate agent.",
        "owner_response": null
      },
      {
        "author": "denise miller",
        "rating": 5,
        "review": "Together my husband and I have purchased 7 properties and we can easily say that our experience with Morgan was by far the best. Generally, we like looking for a home without being beholden to a realtor, but when we met Morgan everything changed. We finally felt as though we had someone in our corner. She is knowledgeable, thorough, thoughtful and always professional.\n\nDue to a variety of events our needs changed dramatically during the buying process. We were the clients an agent could easily push to the back burner, but not Morgan. She was always understanding and easily regrouped. She did not try and \"sell\" us on a house that simply wasn't right for us and therefore we felt we could truly trust her judgement. After all was said and done, we felt as though we'd made a real friend. We would highly recommend her without hesitation.",
        "owner_response": {
          "text": "Denise, it was such a joy getting to help you and Tom find the right home! Thank you for sharing your experience!"
        }
      },
      {
        "author": "Caleb Crockett",
        "rating": 5,
        "review": "Morgan rocks! On top of being a pleasure to work with, she is responsive, timely, organized, helpful, and approachable. Couldnt ask for a better person to guide me through the first time home buying experience.",
        "owner_response": null
      },
      {
        "author": "Sammy Murry",
        "rating": 5,
        "review": "Morgan was more helpful than I could have imagined. She is kind, friendly, and so experienced in this field. I appreciated her always giving her personal opinion and ideas while also being so respectful of our thoughts and ideas. Morgan made this process so easy that at times we literally wondered if it was supposed to be so smooth!! I also appreciated how responsive Morgan was. We never (I mean never) waited more than a few minutes to hear back from her when we had a question, it was like we were her only clients although I know she was simultaneously placing multiple offers the same day we placed ours. I'm not sure how she does it, but Morgan was so impressive, and such a joy to work with! Highly recommend, and we will always use her in the future.",
        "owner_response": {
          "text": "Thank you for the thoughtful feedback! I am SO excited for you and your new home!!"
        }
      },
      {
        "author": "Jessica Dickerson",
        "rating": 5,
        "review": "From the very beginning, Morgan was 100% engaged and made us feel like we were her first priority, day or night! She was positive, encouraging, and informative throughout the process, which was huge for us since we were first-time home buyers. In a competitive, multiple-offer scenario, she helped coach us through how to be competitive, yet make an offer that we were comfortable with. When our offer was accepted over the others, it was noted that the way our offer was written by her was part of the reason why it was chosen! We never dreamed we could get the home we did, and we feel very thankful to Morgan for that fact that we did.",
        "owner_response": {
          "text": "I am SO THRILLED for you and Bryce! Thank you for trusting me throughout the process!"
        }
      },
      {
        "author": "Tracy Svanda",
        "rating": 5,
        "review": "Morgan is an outstanding choice to guide you in your home search.  She has strategies in this competitive market, her advice was on point, and she got us our house when we were ready to act.  Morgan is thorough and went above and beyond to address our questions.  She even played with our kids in the yard while I was running through houses during COVID-19 limitations!",
        "owner_response": {
          "text": "I appreciate your feedback and really enjoyed helping your family settle into Bellingham! Thank you!"
        }
      },
      {
        "author": "WOOF WOOF",
        "rating": 5,
        "review": "I have worked with many realtors in the past and I must say that Morgan is amazing. She has all the qualities I love when working with a business.  She exceeded my expectations in her professionalism, excellent communication skills, extremely knowledgeable and even answered some of my questions before I even asked them. I definitely would recommend Morgan. I live in another state and so glad I put all my trust in Morgan.",
        "owner_response": {
          "text": "Thank you for sharing your experience! It was so fun getting to know you and making a friend through the process! :)"
        }
      },
      {
        "author": "Megan Morris",
        "rating": 5,
        "review": "Working with Morgan was a seamless process. She is extremely informative, always available for communication, straightforward, and incredibly organized. She sold our house in 2 days! (bidding war and over asking price!) all while working with us as buyers on our new home. Her managment skills, negotiation experience and profesionalism make her our top choice!",
        "owner_response": {
          "text": "Thank you very much for the kind review! It is so appreciated!"
        }
      },
      {
        "author": "Tyler Bredman",
        "rating": 5,
        "review": "Morgan was super helpful throughout this whole process. Finding a house in Bellingham is a struggle as you know but she somehow always finds a way. She got myself and my wife the perfect house. It was exactly what we were looking for and was right in our budget. Couldnt of asked for a better overall experience and would definitely recommend for anyone looking into purchasing a home whatcom county!",
        "owner_response": null
      },
      {
        "author": "Isabell Dirling",
        "rating": 5,
        "review": "I met Morgan at the beginning of my \"forever\" home search. I was very honest with her about my situation and though I wasn't in love with the first place and chose to pass on it, she kept looking for me. She showed me a home that I truly do love and she fought for me to get it and today I'm proud to say I own the home that I love thanks to Morgan Loy. Thank you Morgan for representing me and for fighting for me to get my beautiful home. You truly know your stuff and I will recommend you to anyone looking for an agent. Windermere...you did it again! Thank you for hiring talented, smart caring realtors. I appreciate you and them! ",
        "owner_response": {
          "text": "It was so great getting to know you and help you settle in to your dream spot! Thank you for the kind words!"
        }
      },
      {
        "author": "Jeff Campbell",
        "rating": 5,
        "review": "Unfortunately I lost both my Mother and Father in 2020, both of whom were longtime Bellingham residents. My wife and I live out of state and needed all the help we could get upon their passing, especially with the house and property.\n\nIt would be difficult for me to overstate how incredibly helpful Morgan  was throughout the process. To say she went above and beyond would be understating what she actually did to help us from 1500 miles away.\n\nFrom sound pricing advice based upon strong local market knowledge, to connections with local contractors who made necessary upgrades to the house, and to a sale that was quick and well above listing price, Morgan consistently went the extra mile and was amazing to work with, both  before and after the sale.\n\nMorgan has my sincerest gratitude and my highest recommendation.",
        "owner_response": {
          "text": "Thank you very much for the thoughtful review - I'm so glad the process was as stress-free as possible for you and Leanne"
        }
      },
      {
        "author": "Emily Webster",
        "rating": 5,
        "review": "As first time home buyers we feel so lucky to have had Morgan walking us through the process and ultimately find the home that checked all of our boxes! She took the time to educate us throughout the process and answered our (many) questions with informed and honest responses. We are so appreciative of her attention to detail, communication and availability during this crazy market.  Thank you Morgan!",
        "owner_response": {
          "text": "I really appreciate you sharing your experience! Congrats on your new home!!"
        }
      },
      {
        "author": "Elizabeth Curl",
        "rating": 5,
        "review": "We worked with Morgan to buy our first home and we could not have asked for a better experience! Her communication was on point the entire time, along with her negotiation and transaction management skills. Such a personalized and professional experience!",
        "owner_response": {
          "text": "It was so great helping you through the process! Enjoy your new home!"
        }
      },
      {
        "author": "Laura Dykshoorn",
        "rating": 5,
        "review": "Navigating the \"Hunger Games\" of the Bellingham Real Estate market was an adventure.  Morgan did a fantastic job of explaining what I needed to do  and when I needed to do it.\n\nShe talked me off the ledge several times!  (Thank you Morgan!)  She will respond quickly and professionally at all times of the day (even when I told her it could wait!).  If she didn't know the answer, she would dig and find it for you!\n\nWould not have been able to get our house without her guidance.",
        "owner_response": {
          "text": "It's been so fun helping you and watching you settle into your new Bellingham life. Thanks for choosing me to be a part of the process!"
        }
      },
      {
        "author": "Lacey Greene",
        "rating": 5,
        "review": "Morgan did an exceptional job selling my property - it was not an easy sale either.  She went above and beyond working with the county to make sure the wetlands study complied with the land surveyor's markers for the buildable area.  Every step of the way, she kept me informed!  Thank you, Morgan!",
        "owner_response": {
          "text": "Thank you for sharing your experience and for your trust during the process!"
        }
      },
      {
        "author": "justin ferguson",
        "rating": 5,
        "review": "I would recommend Morgan 11/10 times if I ever move back or need to sell a place in Washington ever again. She is high energy, very informative, and very transparent. She really went above and beyond to make sure we closed on time when we had already moved out of state.",
        "owner_response": {
          "text": "Justin, I appreciate your feedback! It was a pleasure meeting you and helping make your cross-country move happen!"
        }
      },
      {
        "author": "Kevin Parker",
        "rating": 5,
        "review": "Morgan Loy Is a ture Real Estate Professional. Seamless, Responsive and attention to details throughout the sale of the Farm House. You'll be hard pressed to find a better Real Estate Agent.\nOne of the BEST in Whatcom county.",
        "owner_response": {
          "text": "Thanks so much for your words! Your family was amazing to work with, and I really appreciate your trust in me throughout a unique sale!"
        }
      },
      {
        "author": "jami altschuler",
        "rating": 5,
        "review": "Morgan was amazing! She answered every question at any time, helped coordinate between all parties, and got to know me so well to help me find the perfect place for me. Anyone would be lucky to have her on their search for a new home.",
        "owner_response": {
          "text": "So happy I had the opportunity to help you find \"home!\" Can't wait to see how you make it your own!"
        }
      },
      {
        "author": "kurt licence",
        "rating": 5,
        "review": "Morgan is an amazing resource! She was professional, attentive, thoughtful and helped us find our dream home during short and rigid timeline. I highly recommend her services.",
        "owner_response": {
          "text": "Kurt, thank you for your review! It was a blast getting to help you!"
        }
      },
      {
        "author": "Mircedez Falcone",
        "rating": 5,
        "review": "Morgan was hands down amazing and went above and beyond. We had a harder situation than usual to deal with it and she did so professionally and literally treated us like we were top priority. I dont know a better agent.",
        "owner_response": {
          "text": "Thank you very much for sharing your review! You are all rockstars and such amazing clients through a unique situation; I appreciate your trust in me along the way!"
        }
      },
      {
        "author": "Alison Steel",
        "rating": 5,
        "review": "Morgan is everything you would want in a realtor:  informative (great communication), informed (she knows her market), a good listener (to our needs), transparent (she looked for potential gotchas, so we wouldn't be surprised by them), patient and wise (she took a lot of time walking us through the offer process, ensuring we were put in the best position for success), and a lovely person too!",
        "owner_response": null
      },
      {
        "author": "Ashley Little",
        "rating": 5,
        "review": "Morgan helped us buy our first home and was very patient, informative, and helpful throughout the entire process.  She was very available and very good at communicating with us. We highly recommend her!",
        "owner_response": {
          "text": "Thank you for putting your faith in me; I hope youre LOVING the new home!"
        }
      },
      {
        "author": "Silvija Grossman",
        "rating": 5,
        "review": "We just finished the process of buying a house from Morgan, she was very consultative, and very patient with us being first time buyers. Very responsive, and helpful through the entire process!",
        "owner_response": null
      },
      {
        "author": "Lukerative Holdings",
        "rating": 5,
        "review": "Morgan is very down to earth and easy to work with. She has a genuine spirit. She is honest & ethical and I highly recommend her.",
        "owner_response": null
      },
      {
        "author": "Sydney Hastie",
        "rating": 5,
        "review": "Dont look any further because Morgan is truly the best of the best! She is incredibly professional, knowledgeable, and always willing to go all-in for her clients. So thankful for her!",
        "owner_response": {
          "text": "I appreciate it, thank you Sydney!"
        }
      },
      {
        "author": "Deja Brandeis",
        "rating": 5,
        "review": "We highly recommend Morgan!  She is patient and supportive, and her local expertise was so helpful for us since we were new to the area and searching from out of state.",
        "owner_response": {
          "text": "Thank you for the kind words! I hope you are LOVING your new home!"
        }
      },
      {
        "author": "Hannah Loy",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Carter Loy",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cody Velthuizen",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Brody J",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Shanelle Loy",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Sydney Loy",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 49,
  "adjusted_average_rating": 5.0,
  "distribution": {
    "1": 0,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 55
  },
  "summary": {
    "created_timestamp": 1739205521,
    "text": "<section id=\"good\"><h2>Good</h2><p>Morgan Loy's services have been frequently praised by clients who commend her dedication and professional approach. Based on user reviews, one common theme is her remarkable ability to make clients feel at ease during the stressful home-buying process. Many first-time buyers appreciated how she transformed what is typically an anxiety-inducing task into an enjoyable and efficient experience. Her attentiveness and patience have been highlighted multiple times, with clients appreciating how she takes the time to educate and guide them every step of the way.</p><p>In user reviews, Morgan is repeatedly recognized for her thorough communication. Clients noted that she maintains constant contact, ensuring they are always informed and comfortable. This aspect of her service is significant in real estate, where quick decision-making is often required. Her ability to procure showings on short notice and provide comprehensive answers to even the most trivial queries significantly boosts client trust. Her willingness to work outside of typical hours to meet client needs certainly sets her apart.</p></section><section id=\"great\"><h2>Great</h2><p>User reviews frequently mention Morgan Loy's exceptional negotiation skills and her strategic approach to closing deals. Clients noted that her expertise allows them to secure favorable terms and even acquire homes they initially deemed unattainable. Several reviewers detailed scenarios where her well-crafted offers and understanding of the market dynamics gave them the edge in competitive situations, leading to successful closings where offers were chosen over others.</p><p>Furthermore, Morgan's effort to go beyond real estate transactions to offer a personalized experience for her clients stands out. For instance, she is often described as being 'invested' in her clients, whether by finding childcare so buyers can view homes peacefully or compiling welcome baskets tailored to family members, including pets. Her willingness to manage and coordinate local services, like landscaping and repairs, demonstrates her commitment to ensure a smooth transition for buyers and sellers alike.</p></section><section id=\"bad\"><h2>Bad</h2><p>As of now, user reviews do not reveal significant problems or issues relating to Morgan Loy's services. Given the data provided, there is no indication of dissatisfaction with her real estate services. Indeed, all recorded reviews highlight only positive experiences and outcomes with a perfect five-star average rating across all responses. This suggests that past clients have found little to complain about in their interactions with her.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Based on the user reviews available, there are no recorded instances of any egregious behavior or significant lapses in service from Morgan Loy's real estate practice. The reviews reflect highly satisfied clients who express appreciation for her professionalism and dedication. As a result, this article notes a total absence of negative or troubling reports in the feedback from clients. The overwhelming consensus remains one of trust and satisfaction without any mention of disservice or misconduct.</p></section>"
  }
}