{
  "name": "Muljat Group Realtors",
  "slug": "muljat-group-realtors",
  "company_type": "Company",
  "address": "510 Lakeway Dr Bellingham, WA 98225",
  "review_count": 4,
  "average_rating": 4.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Miqua C.",
        "rating": 5,
        "review": "Sophia Evans of the Muljat group Bellingham was incredible as our agent from start to finish! She was highly recommended from our mortgage broker as someone who had the right amount of push and pull and a \"bull dog\" as they put it.  She was exactly that, just when you needed her to be. Sophia communicated impeccably, with us and the other agents involved and she was truly great at getting the necessary information to put forth the strongest and best offer on our behalf. We always knew she had our absolute best interests at heart and she was never willing to let us settle during moments of anxiety or fear. We couldn't have asked for more from our agent and we are forever thankful to her and Muljat for helping find us our dream home in a housing market where that seemed nearly impossible.",
        "ownerResponse": null
      },
      {
        "author": "Andrew E.",
        "rating": 5,
        "review": "Working with Peter from the Muljat Group was an amazing experience. He was incredibly knowledgeable, prompt, compassionate and understanding of what our wants and needs were and went over and above any expectations we had. I would readily recommend him to anyone and everyone!",
        "ownerResponse": null
      },
      {
        "author": "Xichen J.",
        "rating": 5,
        "review": "So I found a great realtor, Gordon Neufeld, to help me purchase my first home in Bellingham. He is extremely patient and thoughtful, and will answer all of your questions, no matter how trivial. He was recommended to me by two other faculties from WWU who have purchased homes with him and were very satisfied. His knowledge of the area and diligence is what sets him apart from others. Lastly, he does not pass off as \"slick\", unlike some of the other realtors. However, I have had no experience working with other people from the Muljat Group so I cannot say for the others.",
        "ownerResponse": null
      },
      {
        "author": "Richard J.",
        "rating": 1,
        "review": "Their agent, Jon Rockwood, lied to me, telling me I would get the winning bid on a house if I increased my offer by $1500. The next morning he said someone else had increased their bid by $5000 and I needed to do the same, so he just used me to start a bidding war. So I told my realtor they will not only get my money for this house, but they wouldn't for any future real estate transaction. I don't mind looking out for the best interests of your seller, but not at the cost of lying.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 4,
  "adjusted_average_rating": 4.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>User reviews highlight positive experiences with Muljat Group Realtors, particularly noting that their agents are communicative and genuinely invested in the clients' best interests. One client shared their journey of finding a dream home in a challenging market, attributing their success to their agent's tenacity and exceptional communication skills, which fostered strong negotiation and guidance throughout the process. Another client emphasized the importance of their agent's understanding and compassion, celebrating the personalized attention to their needs and desires in finding the perfect property.</p><p>Clients repeatedly mention the professionalism and knowledge possessed by the agents of Muljat Group Realtors. Specific accolades were given for an agent's patience and thorough responses to all questions, demonstrating a level of attention that reassures first-time homebuyers. Agents are recognized not just for their exhaustive knowledge of the local market, but also for their diligent work ethic and trustworthiness, which stands out to clients and their peers alike.</p></section><section><h2>Great</h2><p>Certain agents at Muljat Group Realtors have earned exceptional praise for going above and beyond expectations. Clients describe experiences with agents who provided an outstanding balance of assertiveness and subtlety in negotiations. These agents were not only trustworthy but were also recommended by other professionals in the industry, further solidifying their reputation for excellence. One agent, in particular, received recommendations from university faculty members, emphasizing their distinguished service and insight into the housing market.</p><p>The attributes that define the great aspects of dealing with Muljat Group Realtors include agents' abilities to align closely with the needs of their clients. Agents are celebrated for not just fulfilling basic requirements but for adding a personal touch to their service that reflects depth of knowledge, relatability, and a lack of superficiality. These traits created a comfort level for clients and instilled confidence in their decision-making - a critical factor in real estate transactions.</p></section><section><h2>Bad</h2><p>However, not all experiences with Muljat Group Realtors have been positive. One user review from a client who engaged with an agent described a frustrating situation where they felt misled during a bidding process. The client accused the agent of dishonestly initiating a bidding war, leading to a loss of trust and the decision to discontinue working with the company for any future real estate needs. This particular instance shows a departure from the highly praised characteristics of other agents at the firm.</p></section><section><h4>Ugly</h4><p>While most user reviews are positive, the \"ugly\" side surfaced in an allegation of deception in the review data. Although it's an isolated incident in the context of the four reviews, it's significant enough to impact the company's image. A client narrated an unsatisfactory encounter with an agent who purportedly manipulated a bidding scenario, which resulted in the client vowing to avoid engaging with the company for any further transactions. This accusation, if true, presents a grave concern regarding ethical practices within some quarters of the company.</p></section>"
  },
  "timestamp": "09/07/2024"
}