{
  "name": "Navigate Community Management",
  "slug": "navigate-community-management",
  "company_type": "Company",
  "address": "113 Cherry St Seattle, WA 98104",
  "review_count": 233,
  "average_rating": 4.52,
  "reviews": {
    "google_reviews": [
      {
        "author": "Jonathan Wo",
        "rating": 5,
        "review": "We are new owner of the Jade Residences, and we are just so glad to have Pricilla Africa at NCM, who has been super helpful all along.  She promptly helped us set up HOA account, helped us sort out utility accounts set-up, and answered all those \"new owner\" questions.  Her service really exceeds my expectation!",
        "owner_response": null
      },
      {
        "author": "June",
        "rating": 5,
        "review": "I am just so happy with the customer service I received from Charmaine. She is prompt, professional and was extremely helpful with my concerns. Thank you so much for your help Charm!",
        "owner_response": null
      },
      {
        "author": "Sheryl Paulson",
        "rating": 5,
        "review": "I want to publicly thank Jebril Torres for handling my concern and solving my HOA issue for me. He was friendly, professional, knowledgeable, and knew exactly what to do.",
        "owner_response": null
      },
      {
        "author": "J Price",
        "rating": 5,
        "review": "I called Navigate today and asked Mary Joy to send an email out to all  homeowners regarding winterization. It was a last minute request and Mary Joy got the job done within 30 minutes!\nI was so impressed with very relieved to know it was taken care of. Way to go MJ! Thank you!!",
        "owner_response": null
      },
      {
        "author": "Jane Horn",
        "rating": 5,
        "review": "Shout out to Jebril Torres at Navigate for his tremendous help today on the phone as well as with a few emails as we are getting established in a new condo building.  It's so refreshing to work with a management company that has people who truly care about their clients. Big thanks to Jebril and Navigate!",
        "owner_response": null
      },
      {
        "author": "prateek gupta",
        "rating": 5,
        "review": "I had an exceptional experience with Navigate Community Management, thanks to their dedicated and professional team. I want to extend a special thank you to Ella, who provided outstanding support throughout my recent interaction. Her attention to detail and timely responses ensured everything was in order without delay, making the process much smoother.\n\nEllas swift assistance in providing the necessary documents for the renters was invaluable. She handled everything with such efficiency and professionalism, making the entire experience stress-free. Her prompt follow-up to confirm that the renter information on my account was updated was greatly appreciated.\n\nI highly recommend Navigate Community Management, and Im grateful for Ellas exceptional service. Thank you for making a potentially challenging process so much easier!",
        "owner_response": null
      },
      {
        "author": "Anne Sela",
        "rating": 5,
        "review": "I reached out to Mary Joy Galvez about a concern I had with my HOA payment. Her quick attention and response to the situation was so appreciated. She set my mind at ease and I will make sure if I ever need any help with anything,  she will be the one I will contact. Thankyou for your help.",
        "owner_response": null
      },
      {
        "author": "Pakun Sin",
        "rating": 5,
        "review": "Thank you very much Carmela Aguilar\nFinance Team for your help with reset my online account to the new email. You are very supportive and professional.\n\nPakun Sin",
        "owner_response": null
      },
      {
        "author": "Tyler Watada",
        "rating": 5,
        "review": "Mary Joy is great to work with.  She is very responsive to email and delivering on requests.  She helped me with a time sensitive Questionnaire document needed.  She helped expedite that delivery and was nice enough to follow up once it was delivered.  I appreciate her communication and timely response.",
        "owner_response": null
      },
      {
        "author": "cheri knutson",
        "rating": 5,
        "review": "Ella provided amazing customer service getting back to me on my questions and assisting me where she could.  I found her to be very helpful!",
        "owner_response": null
      },
      {
        "author": "Crystal Park",
        "rating": 5,
        "review": "I recently reached out to Navigate Community management regarding HOA resale demand. Both Jessica Cahoy and Ferrari Tan supported me with an issue I was experiencing. I was surprised by their promptness and received a response immediately. Both Jessica and Ferrari took time to understand my issue and provide a solution immediately. They genuinely cared about my issue and well being. I highly recommend their customer support to others",
        "owner_response": null
      },
      {
        "author": "Amanda Smyth",
        "rating": 5,
        "review": "I have worked on several projects big and small with Navigate as a maintenance vendor and have always had a wonderful and collaborative experience.  Specifically I have worked with Domonique and Mary Joy over the past year.  They are always quick to respond to questions or requests. They truly care about taking care of their properties and homeowners correctly and quickly. I look forward to continuing to work with them!",
        "owner_response": null
      },
      {
        "author": "Brandy Sun",
        "rating": 5,
        "review": "I have contacted Mary Joy about the mailbox key since I couldnt come to pick it up. Mary helped me to receive it by FedEx. I really appreciate her professional and prompt assistance!",
        "owner_response": null
      },
      {
        "author": "Anne Hill",
        "rating": 5,
        "review": "Great company to work with!  Pricilla Africa was excellent.  She responded quickly to emails, was professional, friendly and our service work was scheduled easily.",
        "owner_response": null
      },
      {
        "author": "Christy Donovan",
        "rating": 5,
        "review": "Great Experience with Navigate!\nI had the pleasure of working with Pricilla Africa many times, most recently during the sale of my condo. She was always very peasant and professional, but especially during the sale when there were many tasks that needed to be done quickly and accurately. Ellas knowledge, efficiency and her willingness to help were invaluable. It is not exaggerating to say that without Ella, my condo sale would have been significantly delayed.\nThank you Ella!",
        "owner_response": null
      },
      {
        "author": "Irwin Gatchalian",
        "rating": 5,
        "review": "Mary Joy Galvez provided great and quick support. Her communication skills are awesome!",
        "owner_response": null
      },
      {
        "author": "Garrett Olsen",
        "rating": 5,
        "review": "Received the information needed for the project and was able to get questions answered quickly.  Mary joy was supportive in getting the job scheduled and completed.  MJ worked with us on issues and did not shy away from working with the residents and the project needs.",
        "owner_response": null
      },
      {
        "author": "Linda K. Lee",
        "rating": 5,
        "review": "Very friendly and helpful staff. Appreciate how kind the staff member was when he answered the phone right when they opened operations. I believe his name was Jebril. Helped answer all my questions.",
        "owner_response": null
      },
      {
        "author": "Joseph Dannenberg",
        "rating": 5,
        "review": "MJ and the team at Navigate are pure excellence! From communication, to top tier customer service. Always a pleasure dealing with MJ. Definitely a winner. Five stars in every category.",
        "owner_response": null
      },
      {
        "author": "Ron Hoffman",
        "rating": 5,
        "review": "Fast response.  She was thorough. She got back to us with helpful answers and was very nice.",
        "owner_response": null
      },
      {
        "author": "J Carlson",
        "rating": 5,
        "review": "I dealt with Charmaine today regarding a problem I had with a questionable charge on my account; she was quick to respond to my questions and requests, and she resolved the issue for me same day!",
        "owner_response": null
      },
      {
        "author": "Jitka Urban",
        "rating": 5,
        "review": "Mary Joy,\nthanks so much for fast responds to the leaky pipe problem.\nBoth City and plumber arrived within an hour from my report to you.\nAwesome service.\nThanks,\nEastbridge, 13A",
        "owner_response": null
      },
      {
        "author": "Diana Lin",
        "rating": 5,
        "review": "Pricilla Africa provided timely response with precise information to my concern and questions regarding HOA and closed the issue efficiently. Pricilla gave me a very pleasant experience.",
        "owner_response": null
      },
      {
        "author": "Chengang Zhang",
        "rating": 5,
        "review": "Pricilla Africa was quick to address my concerns and followed up to make sure everything was going well. I appreciate Pricillas attention to detail and willingness to go above and beyond",
        "owner_response": null
      },
      {
        "author": "Grigory Lyakhovitsky",
        "rating": 5,
        "review": "I served on the HOA board of one of the townhome complexes managed by Navigate. My interactions where with Sydney Calderon and Ella Pricilla. Both of them were responsive and professional. Navigate's web portal is easy to use, too.\n\nOne downside is that the CondoCerts service that Navigate uses to allow homeowners to order resale certificates fails to deliver documents on time. I had to escalate to Navigate to get them filled with urgency.",
        "owner_response": null
      },
      {
        "author": "chew see chan",
        "rating": 5,
        "review": "Navigate Community Management team members always provide good service to Crossroad HOA; in which Ric did an excellent job with quick respond to send the right application form, friendly advice on how to attach the required doc, and  also follow up with HOA board members to get their approval signatures in a timely manner on the request project. Thanks!",
        "owner_response": {
          "text": "Hi, Chew. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Carmen Fike",
        "rating": 5,
        "review": "We have had a really good relationship with Navigate CM for a few years now.  I really appreciate Carmela; she is responsive and helpful when it comes to payment questions and helping with invoicing.",
        "owner_response": null
      },
      {
        "author": "Tony Fredregill",
        "rating": 2,
        "review": "2 stars for now..\n\nMy homeowners association switched to this new company. However, our fees are roughly $35 per month. Yet, somehow I paid this, and now my bill is $170. Not sure how it got to that point. Probably a glitch within the system. Regardless, to get a brand new reputable company and get charged over $100 extra, kind of sucks.",
        "owner_response": null
      },
      {
        "author": "Atta Boy",
        "rating": 5,
        "review": "Carmela was very helpful in setting up payment for a large job we did and prompt with her communication. My experience with other Navigate representatives has been less endearing but hopefully Navigate can get more employees like her.",
        "owner_response": null
      },
      {
        "author": "Bruce Yeadon",
        "rating": 5,
        "review": "Carmela with Navigate Community Management was helpful with addressing our needs regarding our yearly HOA fees.",
        "owner_response": null
      },
      {
        "author": "Pk Kanavan",
        "rating": 5,
        "review": "Great service received by Mary Joy, who answered my call live and resolved my issue within the same day!!  Great employees make the difference.",
        "owner_response": null
      },
      {
        "author": "Manoj Tyagi",
        "rating": 5,
        "review": "Victoria Manzano is prompt in guiding and helping ACC requests and she helped me get the approval in a timely manner. Thank you very much!",
        "owner_response": null
      },
      {
        "author": "Lior Pinhas",
        "rating": 5,
        "review": "Jessica was so helpful and patient. I was able to get help fast and professionally with everything I needed!",
        "owner_response": null
      },
      {
        "author": "Andrew Stern",
        "rating": 5,
        "review": "Carmela was able to assist us with the unpaid invoice in a really helpful way. She did a great job updating us on the payment status.",
        "owner_response": null
      },
      {
        "author": "Dakota Combelic",
        "rating": 5,
        "review": "I have worked with Hazel Maquito and Pricilla Africa extensively as a vendor and both of them have always been incredibly prompt and detailed with service requests. It's always a pleasure to work with them due to their thorough communication, friendly attitude, positivity, and open feedback. Looking forward to working with Hazel, Pricilla, and Navigate for years to come!",
        "owner_response": {
          "text": "Hi, Dakota. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Fischer Electric Office",
        "rating": 5,
        "review": "We did a project of replacing some existing exterior lighting. I worked with Ella Africa throughout this project on project scope, getting the appropriate bid approvals, and scheduling to complete the work. She had a lot of patience and grace with us on scheduling when the light fixtures had a delayed delivery date. Throughout this process Ella was polite, friendly and made me feel great about working with Navigate. I would be happy to continue doing projects in the future with this management team.",
        "owner_response": {
          "text": "Hi, Fischer. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "D C",
        "rating": 5,
        "review": "I am incredibly impressed with Navigate. I had to make several phone calls and emails to resolve a few issues because of our condo purchase, and every contact was met with friendly and knowledgeable service. We recently purchased a condo and the HOA switched over to Navigate the day after our condo closed. This resulted in an issue with our homeowner dues. In addition, we were left without keys for the mail and gym. They were calming and comforting as they walked me through all of our issues. More specifically, I worked with Ella Africa much of the time. She was so calm and reassuring, I knew I was in good hands. The whole matter took about two weeks, and she was amazing at keeping me updated; taking time to email me with any new developments, in addition to answering any questions I had during the process. I know this issue was resolved quickly because of Ella. I appreciate how responsive she was, always replying within 24 hours. She is a true professional; kind, helpful and thorough, she gets the job done, and done well. Ella is beyond reproach. Thank you Navigate team for being outstanding in your field.",
        "owner_response": {
          "text": "Hi, D. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Courtney Brown",
        "rating": 5,
        "review": "I've worked with Hazel Maquito now on several projects and can honestly say her communication and customer service it truly 5 stars!\n\nCourtney Brown, Owner\nNorthwest Play Safe, LLC",
        "owner_response": {
          "text": "Hi, Courtney. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Pamela Kidd",
        "rating": 5,
        "review": "Mary Joy is a pleasure to work with.  Her response time is great!",
        "owner_response": null
      },
      {
        "author": "Vijay Kulkarni",
        "rating": 5,
        "review": "MJ (Mary Joy) has been prompt and incredibly helpful every time Ive reached out to her.",
        "owner_response": null
      },
      {
        "author": "Maria Feliz",
        "rating": 5,
        "review": "This was my 3d attempt to get an issue resolved and decided this would be my final call before going to collections. When answering she said her name was Carmela and asked how she can assist me I told her what I was calling about instead of placing me on hold or transferring me she took care of me asked the proper questions that I somehow knew this was the day I would get the proper assistance. Long story short within 48hrs this was handled. GREAT JOB CARMELA!!!!!",
        "owner_response": null
      },
      {
        "author": "Arzaquel Anzures",
        "rating": 5,
        "review": "Mary Joy from the Navigate Community Management quickly helped me with the process for renting the cabana in the community for a birthday party. And everything went smoothly. Thanks again for your help!",
        "owner_response": null
      },
      {
        "author": "Sid Dev",
        "rating": 5,
        "review": "Mary Joy was helpful in resolving a payment hiccup quickly and making it easy to switch payment systems. What could have been a complicated and expensive mixup was resolved with ease.",
        "owner_response": null
      },
      {
        "author": "Susan Kim",
        "rating": 5,
        "review": "Carmela was very helpful in responding to questions via email, and sending the appropriate documents quickly  to confirm a special assessment amount, an issue that took other staff several months to answer for me before contacting Camela.",
        "owner_response": null
      },
      {
        "author": "Elliot Golan",
        "rating": 1,
        "review": "Unfortunately, there is no way to give zero stars. This company is fleecing the HOA and doing nothing at all beyond lying about efforts to do its job, which it clearly doesnt take seriously.\nDO NOT consider working with these incompetent crooks!",
        "owner_response": null
      },
      {
        "author": "Ellie Chambers",
        "rating": 3,
        "review": "Carmela provided exceptional service in helping me with my payment to the HOA on line.  Previously the HOA had sent our annual assessment by mail,  I called to find out why  I had not received the letter this year, and found out that I was nearly late as dues were due but they were using a portal now.  She was well informed and helped to complete the process.  Grateful for the helpful customer service!",
        "owner_response": null
      },
      {
        "author": "Aldwin Ronald A. Peredo",
        "rating": 5,
        "review": "Carmela Aguilar did a great job...excellent customer service. She was quick to provide the information I requested.",
        "owner_response": {
          "text": "Hi, Aldwin. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "ricky Lopez",
        "rating": 5,
        "review": "MJ (Mary Joy) was great to work with. Her communication was phenomenal thought the whole process. If you are thinking about working with Navigate I definitely would recommend!",
        "owner_response": {
          "text": "Hi, Ricky. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Custom Tech Install LLC",
        "rating": 5,
        "review": "Seamless Support: Carmel Kiwas at Navigate Community Management\n\nWorking with Carmel Kiwas at Navigate Community Management was a breeze. Her quick email responses and clear instructions regarding old equipment made communication seamless. Carmel's professionalism and friendly approach made the whole process enjoyable.\n\nAdditionally, David provided invaluable assistance with the old equipment and training on the new system. His expertise and willingness to help ensured a smooth transition.\n\nOverall, Carmel and David's support was exceptional, and I highly recommend Navigate Community Management for their outstanding service.",
        "owner_response": null
      },
      {
        "author": "me ow",
        "rating": 3,
        "review": "It's been an interesting experience dealing with our HOA mgmt company.  At first they seemed friendly and sounded promising.  But week after week went by and no action.  A couple people, Beth and Hazel did respond to my request for updates, but still nothing was actually happening.  Months went by.  As the winter months began to approach, I finally gave up trying to follow procedures and had the dangerous tree removed on my own dime.\nAbout a month later, my local HOA board told me to go ahead and submit the paid invoice to Navigator for reimbursement, which I did, though I wasn't holding my breath.\nAbout a week after that I was contacted via email by Carmela from the finance dept. telling me a check to reimburse my cost of the tree removal was in the mail and should arrive in 5-10 days.  I about fell off my chair, but was glad to hear it!\nA week later I did receive the check and quickly deposited it.  I'm pretty sure pressure from other property owners in our neighborhood is the only reason there was finally movement on the reimbursement.  Pretty frustrating for months, but finally had a happy ending!",
        "owner_response": null
      },
      {
        "author": "Andrew Arpin",
        "rating": 5,
        "review": "Our condo recently was dropped by different property management company in the area and it was always a tough relationship because it always took a few days to get a response from someone. Navigate was the management company we were transferred to and so far it has been a great experience. I called and Ella Africa was able to answer my questions, guide me through the process of getting set up on their platform, and even provided a ledger and documentation related to a charge I owed but was not aware of. Great experience thus far and love their portal you get access to.",
        "owner_response": {
          "text": "Hi, Andrew. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Hung Nguyen",
        "rating": 5,
        "review": "I'm pleased that Carmela answered my phone call. She guided me through the process and helped me set up the new payment portal. Her assistance ensured I had all the necessary details, including my account number, and reminded me to keep the login credentials secure. Thank you, Carmela, for your help.",
        "owner_response": null
      },
      {
        "author": "Brenda Lee",
        "rating": 2,
        "review": "Editing - unfortunately, although MJ helped me with the issue at the time, the follow through from the Navigate Management was not thorough, and I ended up getting charged additional. Then, I once again went through the entire process (call customer help, talk to a new agent, describe the issue, get put on hold, repeat....) to figure out a resolution. We will see in the coming days if the issue actually gets fixed.\n\n--\nI talked to MJ from Navigate today, who helped me with a payments issue as well as some concerns and questions. She was patient/understanding and I'm thankful I got her help!",
        "owner_response": {
          "text": "Hi, Brenda. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Tulin Ozturk-Balkis",
        "rating": 5,
        "review": "Pricilla Africa was great at solving the invoice problem that I had with the online payment. She took the time to understand what the problem was and helped me with my payment. Thanks!",
        "owner_response": null
      },
      {
        "author": "Lena Levashova",
        "rating": 5,
        "review": "I had a pleasure of working with Charles and Carmela on a recent project, and I must say, it was an outstanding experience from start to finish. Carmela demonstrated impeccable professionalism and timely communication throughout the process of collecting the final payment. This made the entire process efficient and stress-free. A good example for how business interactions should be!",
        "owner_response": {
          "text": "Hi, Lena. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Maryam Hayati",
        "rating": 5,
        "review": "We had a great experience with Navigate Community Management. Mary Joy is very professional and an excellent communicator. She helped us to fix a plumbing issue that we had in our unit.",
        "owner_response": {
          "text": "Hi, Maryam. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Hyong Yun Kim",
        "rating": 4,
        "review": "Great help in getting my HOA dues paid.\nThere was a change in the payment system and I was unclear on how to get it done.  I decided to call the management and get some help. M.J. was so friendly and helped me through each step...waiting for me to get on the computer and help me through each step until it was paid and I got registered for the future payments. Thank you for the great help.",
        "owner_response": null
      },
      {
        "author": "Holly Dunn",
        "rating": 5,
        "review": "I had a difficult time registering an account with Pacific Pay for deductions of my condo association fees and spent over an hour of time creating an account and logging in.   I emailed Charmaine Lambinicio at Navigate for assistance.  Not only did she quickly respond to my plea for help, she gave me the correct ID account to place for the registration.  Thank you Charmaine and Navigate.",
        "owner_response": {
          "text": "Hi, Holly. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Tim Liaw",
        "rating": 5,
        "review": "My community have been working with Navigate for management services for the past few years. Like other reviews have said, they are very professional and responsive to any concerns. I especially want to highlight our main contact MJ (MaryJoy). Since she took over our account, I only have pleasant working experiences with her. Quick to respond to my questions (even when I have no idea what the right procedure is or where to submit request). Always follow up with next steps (and the gentle reminder when our HOA is late to approval work orders). All in all, very happy with the management company.",
        "owner_response": {
          "text": "Hi, Tim. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "maansi modi",
        "rating": 5,
        "review": "We worked with Mary Joy at Navigate Community Management to select a landscaping vendor for our community. Mary was very helpful with getting bids from different contractors, relaying messages to vendors, and coordinating walk throughs. We thoroughly appreciated Mary's professionalism and sincerity.",
        "owner_response": {
          "text": "Hi, Maansi. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Deana McGrew",
        "rating": 5,
        "review": "Working with Mary Joy was very pleasant and professional. I look forward to working with her in the future. Deana United Pest Solutions Office Lead",
        "owner_response": {
          "text": "Hi, Deana. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Naomi Webb",
        "rating": 5,
        "review": "I was blown away at the outstanding service I received from Jessica at Navigate. She went above and beyond in working with me! She truly defines customer satisfaction. Look no further if you are considering working with her. She is amazing!!",
        "owner_response": {
          "text": "Hi, Naomi. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Chris Ardillo",
        "rating": 5,
        "review": "I had a great experience with Navigate Community Management. Rick was very professional and is an excellent communicator. He helped me with an issue I had with paying my HOA dues, within the portal of Navigate Community Management. He understood and took care of the issue right away.",
        "owner_response": {
          "text": "Hi, Chris. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Jessica A.",
        "rating": 5,
        "review": "Navigate Community Management is one of our customers and is a sincere pleasure to work with.  Mary Joy is an excellent communicator and always provides us all the info we need in order to provide them exactly what their properties require.  It's always a pleasure working with Mary Joy and her colleagues.",
        "owner_response": {
          "text": "Hi, Jessica. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Flavio E. Rattazzi",
        "rating": 5,
        "review": "My company is new to Navigate CM. We had some invoices that needed to be processed and Carmela helped get things set up and processed in a timely manner. She was quick to respond and provided me with the information necessary.",
        "owner_response": {
          "text": "Hi, Flavio. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Jorge Aviles",
        "rating": 5,
        "review": "Caramela was excellent to work with, very responsive and friendly with questions I had asked for fencing. Upon completion they were quick to assist our company for payment and scheduling, which I really appreciated from Caramela.\n\nAmazing company with lots of friendly staff helping out with customer needs. I would definitely recommend them.",
        "owner_response": {
          "text": "Hi, Jorge. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Siddharth Raghavan",
        "rating": 5,
        "review": "I have had a really good pleasant experience working with the Navigate Management, especially Verna. As a home owner, who did a remodel project for the first time, they actually helped me a lot asking the right questions and patiently answering all of my questions in helping me with the HOA approval. They genuinely want to help the home owners and are very organized and on top of things. Because of pandemic, contractor/engineering supply shortages etc, my permit took more than a year. Verna was very patient and helped me through out. I wanted to thank the Navigate management for the support.",
        "owner_response": {
          "text": "Hi, Siddharth. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Bonifacio Peralta",
        "rating": 5,
        "review": "I'd like to take a moment to really appreciate and thank Hazel M. for her outstanding work. She really makes communication a breeze and scheduling any work with her is really fast without a hassle, she is incredibly easy to work with. She is very clear when communicating and always replying promptly. THANK YOU FOR YOUR GREAT WORK!",
        "owner_response": {
          "text": "Hi, Bonifacio. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Michael Weisinger",
        "rating": 5,
        "review": "Mary Joy Galvez has been amazing to work with.  She is always very fast with replies.  Very easy to work with.   Mary is always friendly and gets all the information needed.  Thank you for all the support and I look forward to working with you for a very long time.",
        "owner_response": {
          "text": "Hi, Michael. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "N K",
        "rating": 5,
        "review": "I had a very satisfying experience working with Mary Joy (MJ). After she listened to my query and concerns she worked with her finance department to fix the issue related to my account. And she promptly called me back confirming that the issue was fixed. Very good customer service. Thank you MJ.",
        "owner_response": {
          "text": "Hi, N. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Jemma Bockenkamp",
        "rating": 5,
        "review": "Navigate is very communicative and has multiple forms of communication, they are very flexible in how you can connect with them whether its text, portal, or phone. Christine is amazing! Love her! Very professional responds quickly and easy to talk to! We are a small community but she makes us feel important and dont let things slip through the cracks. Yall need a Christine in your life!",
        "owner_response": {
          "text": "Hi, Jemma. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "T&O Landscape LLC",
        "rating": 5,
        "review": "We have a great experience with Navigate Community Management. Carmela Aguilar is always a professional and excellent communicator. She is friendly and knowledgeable. We love working with her. She is a great asset for your busieness",
        "owner_response": {
          "text": "Hi, T&o. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Lauri McBeath",
        "rating": 4,
        "review": "Navigate has been reasonably easy to deal with compared to other managment companies. Carmela was so helpful today. My issue was resolved by the end of the phone call.",
        "owner_response": {
          "text": "Hi, Lauri. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Joleen k",
        "rating": 5,
        "review": "Navigate has helped our HOA get organized and obtain contractors. The portal is great. Mary Joy has been such an excellent communicator and has gone above and beyond to help with an issue I have had in my unit.",
        "owner_response": {
          "text": "Hi, Joleen. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Whlin",
        "rating": 5,
        "review": "Have worked with several HOA management companies before and I really like how Navigate handles things.  Their Homeowner Portal is really easy to use and makes correspondence and uploading documents for project approvals really easy.  I recently had a billing question and I received a reply within an hour.  Great customer service experience overall.",
        "owner_response": {
          "text": "Hi, Wahlin. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Precise LLC",
        "rating": 5,
        "review": "We work with many companies, but Navigate Community Management is by far the best! They are respectable, professional and courteous. They go above and beyond for clients and vendors alike. Absolutely love them! We worked with Mary Joy Galvez =)",
        "owner_response": {
          "text": "Hi, Precise. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Samatha Kaza",
        "rating": 5,
        "review": "Navigate community management customer experience is top notch. They're very responsive and helpful. Especially Christine Besas has been amazing to work with, she has helped me process my request within extremely short notice. I am very glad that our HOA is managed by Navigate Community! Thank you Navigate (Christine) for your prompt response and support!",
        "owner_response": null
      },
      {
        "author": "Jordan Dickerson",
        "rating": 5,
        "review": "Navigate Community Management is great I recommend their service! Im a contractor and work with Navigate Community Management. Mary Joy is very good at communicating with us about issues surrounding repairs, maintenance, and remodels. Making sure the needs of their tenants and vendors are met.",
        "owner_response": {
          "text": "Hi, Jordan. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Fabio Sound Cleaning",
        "rating": 5,
        "review": "I needed Mary Joy Galvez help to schedule gutter cleaning maintenance work and I needed her to get in touch with the residents of this condominium to provide instructions and details on how this service would be carried out, such as scheduling days and times and I was surprised by her cordiality, speed, attention and especially communication with which she handled and concluded these issues in hours.  So as a thank you, I leave here my 5 star review for everyone at AAMC and especially to her.",
        "owner_response": {
          "text": "Hi, Fabio. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Tina Kunz",
        "rating": 5,
        "review": "Navigate has provided me with excellent service, specifically, Christine.  We have some down trees in our neighborhood needing to be removed and although we have discovered that this is an issue for the City of Mill Creek to take care of, Christine assisted me and has continued to follow up on the issue.  I was very impressed with her customer service.",
        "owner_response": {
          "text": "Hi, Tina. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Reiner Esser",
        "rating": 1,
        "review": "For Maples at Cordata in Bellingham, WA: there is lack of informative communication. A gutter cleaning was scheduled a month in advance. I was expecting a manual cleaning and did not move my car. They blew all kinds of grime, dirt and pine needles on my car which was parked in front of my garage. It took me hours to clean, my car, my patio and my breezeway. There should have been a reminder a day before cleaning. The original date was also postponed due to rain. There was nothing.\nI wrote this email:\nOn October 18, 2023 we received emails alerting us to gutter cleaning on October 6.\n\nNot too many will remember an event alert that was issued 3 weeks ago and on top of that did not take place on that day.\n\nA professional management company would send out emails the day before as reminders and to inform of any date changes.  (just like doctors do prior to an appt)\n\nA professional and responsible management company would have pointed out to park cars in the garage or across the street so they wouldn't be inundated with dirt and grime from the roof. The same is true for outside seat covers.\n\nTo their credit, the handyman company apologized and did a haphazard cleanup. I had to go back and do the final cleaning.\n\nYou have to do better next time.\n\nNo response, no apology.",
        "owner_response": null
      },
      {
        "author": "Rene Crawford",
        "rating": 5,
        "review": "Hazel , our property manager, was wonderful to work with and coordinated /selected Alpine Tree Service to cut back trees that were a hazard to our property.",
        "owner_response": null
      },
      {
        "author": "Uyeta Landscape",
        "rating": 5,
        "review": "Mary Joy Galvez with Navigate Community Management is very prompt and always follows up with her clients and vendors. She is focused on quality customer service, attention to detail, and always a pleasure to work with. We look forward to working on more projects with them!",
        "owner_response": {
          "text": "Hi, Uyeta. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Pamela Kidd",
        "rating": 5,
        "review": "MJ/Mary Joy is a pleasure to work with.  She is professional, thorough and follows thru on the task at hand.  You can really depend on her!",
        "owner_response": {
          "text": "Hi, Pamela. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Chelsea Bergstedt",
        "rating": 5,
        "review": "I've been working with Navigate Community Management to complete some repairs at one of the communities they manage. They are responsive and worked closely with me and the HOA Board to get the work that was needed completed. Thanks Ella!",
        "owner_response": {
          "text": "Hi, Chelsea. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Chiu Lung Tang",
        "rating": 5,
        "review": "Navigate is super helpful in providing the escrow demand during the sale of my client's condo in Seattle! They work late into the night and keep us updated throughout the process and deliver the doc in time! Cannot be happier!",
        "owner_response": {
          "text": "Hi, Chiu. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Bennett Haselton",
        "rating": 5,
        "review": "It was easy to communicate with Navigate Community Management about the plans to have a plumber come and do a repair on the house.  (The plumber needed to shut off water to the whole building so this required communication with management.)  MJ/Mary Joy was easy to coordinate with.  Thanks!",
        "owner_response": {
          "text": "Hi, Bennett. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Qi Qi",
        "rating": 5,
        "review": "It is a great joy to have Navigate Community Management help us! MaryJoy Galvez from the team always beyond my expectation: reply email right away, send request to service crews immediately and solve issues quickly! We sent request to cut a dead big bush on 11/01/22, got immediate response and one day later the big bush is gone! Highly recommend and appreciate your help!",
        "owner_response": {
          "text": "Hi, Qi. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Steven Coe",
        "rating": 5,
        "review": "We worked with Mary Joy and Navigate on a pruning project in a large, multibuilding HOA community. This particular project was difficult because there were parking lots in all the areas where we needed to work. Mary Joy and the team at Navigate did an amazing job coordinating with the HOA to make sure the parking areas were cleared ahead of our crew. I'm very pleased with the communication on this project and it was a pleasure to work with Mary Joy and Navigate.",
        "owner_response": {
          "text": "Hi, Steven. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Nick Goodman",
        "rating": 5,
        "review": "Mary joy was really great to work with! I am helping put with some handyman services and shes been friendly and professional in all of the interactions Ive had!",
        "owner_response": {
          "text": "Hi, Nicholas. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Jeani Kwik",
        "rating": 5,
        "review": "My condo association, Eastbridge, has worked with Navigate Community Management since the company was formed. We have been happy with the service and expertise that we have received. The staff, including property manager Haley, and her assistants Hazel and MJ, along with Jerody, have been pleasant to work with and are highly capable and responsive to our needs.",
        "owner_response": {
          "text": "Hi, Jeani. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Birte Nielsen",
        "rating": 5,
        "review": "Very helpful and efficient in handling changes to our contact information. Their Portal is easy to use too. We really appreciated the extra efforts made by Pricilla Africa. She ensured that all of the data was accurate and was very prompt in her reply.",
        "owner_response": null
      },
      {
        "author": "Abby Deaton",
        "rating": 5,
        "review": "We work with Navigate on a lot of projects. Mary Joy and the rest of their team is always very quick to respond to questions and get back to us right away. Great customer service & great to work with!",
        "owner_response": {
          "text": "Hi, Abby. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Celeste & Shane South",
        "rating": 5,
        "review": "Our community switched to Navigate this year and so far so good.  The online portal is convenient and I've spoken to someone at the office 2x now and they've been very helpful with answering my questions.  Shout out to Ric for his help in getting our issue resolved quickly and even called to follow up.  Thank you.",
        "owner_response": {
          "text": "Hi, Celeste. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Joe Mica",
        "rating": 5,
        "review": "I would to commend the new Navigate HOA management company serving the Sunset View Condo Association in Renton, WA.  They have been a breath of fresh air.  Jessica Cahoy has been especially amazing and offers excellent customer service and follow up with an wonderful positive attitude.  She is in incredible asset to her company.",
        "owner_response": {
          "text": "Hi, Joe. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Natalie Eason",
        "rating": 5,
        "review": "This company helps manage our HOA. I used  the online portal for the first time to request architecture changes to be approved.  I found the portal easy to use and the instructions were very clear. I liked seeing the updates and everything regarding this matter in one place. The turnaround time was fast. I wasnt  expecting a response on the weekend, but there it was. This helped me to turnaround the necessary documents with minimum delay.",
        "owner_response": null
      },
      {
        "author": "Doris Schick",
        "rating": 5,
        "review": "As a board member we recently made the decision to move to Navigate. We couldn't be happier. Best communication ever!! MJ has been handling some of our task and am thrilled with her level of communication and staying on top of things until things are resolved! Thank you MJ for all your efforts!",
        "owner_response": null
      },
      {
        "author": "Retired Navy",
        "rating": 5,
        "review": "Have dealt with a number of HOA Management companies in the past.  They far outshine everyone else in terms of customer service.  The Owner Portal makes it easy to communicate maintenance  requests.  Mary Jo, kept us up to date by email as to the status from initiation, in process and completion.",
        "owner_response": {
          "text": "Hi, Retired. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Mary Krinbring",
        "rating": 5,
        "review": "Mary Joy with Navigate CM was a pleasure to work with.  She was responsive and courteous and was very easy to schedule our repair with here at AAA Fire Protection.  We would recommend them as a property management company.",
        "owner_response": {
          "text": "Hi, Mary. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Kartik Talamadupula",
        "rating": 5,
        "review": "I wanted to leave a note of appreciation for Hazel Maquito, who assists our community and HOA in community management. Hazel was extremely prompt in communications, and ensured that we received the right service from contractors in a timely manner. Hazel also followed up after the service to ensure that things were done properly and on time. Great service!",
        "owner_response": {
          "text": "Hi, Kartik. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Jeff McKillop",
        "rating": 5,
        "review": "We had the pleasure of working with Mary Joy Galvez. She was beyond wonderful and so easy to work with.  I would recommend her to anyone I know!  Thank you again! Look forward to working with you again!",
        "owner_response": null
      },
      {
        "author": "Judy Richardson",
        "rating": 5,
        "review": "I must say I am amazed with Navigate Community Management. The staff is very helpful, caring, and ready to listen to our concerns.  Bridget Shearin, and Mary Joy Galvez (MJ) responses is quick and ready to solve situations that arise.  Our HOA is lacking with support from other owners. The ladies are always willing to step in with support with information to balance out situations or concerns.\n\nJudy Richardson",
        "owner_response": {
          "text": "Hi, Judy. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Jack Armstrong",
        "rating": 5,
        "review": "While I have only been working with Navigate Community Management for a short time, I have found them to be exceptionally responsive and have followed through on all issues.\nI have been working with Mary Joy in particular, she is very professional and friendly.",
        "owner_response": {
          "text": "Hi, Jack. We are thrilled to learn that you had a positive experience with us in such a short time!"
        }
      },
      {
        "author": "Brent Ware",
        "rating": 5,
        "review": "I have been working with Mary Joy at Navigate on a couple HOA's and she is amazing. Great communication and very pleasant to work with. Highly recommend them.",
        "owner_response": {
          "text": "Hi, Brent. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Kaitlyn Miller",
        "rating": 5,
        "review": "Navigate came on board at our HOA during a somewhat complex time, and there were a lot of things we had to work through/correct to bring our community back up to pristine operating levels. The Navigate team was patient, helpful, and resourceful in identifying problems and proposing solutions to issues as they arose, and remained both positive and friendly despite initial resistance to change from the broader community. I am grateful for the great work the Navigate team put in to helping our HOA be the best it could be!",
        "owner_response": {
          "text": "Hi, Kaitlyn. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Craig Mueller",
        "rating": 5,
        "review": "I spoke with Pricilla Africa in their customer service helping me with my HOA billing as this is the first time with this company after we switched.  Based on our previous HOA, I figured I would never hear back, but within 20 minutes there was a detailed email response from Pricilla telling me exactly what happened and what I needed to do to fix it.  So happy!",
        "owner_response": {
          "text": "Hi, Craig. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "david david",
        "rating": 5,
        "review": "I have recently had a tree problem gladly resolved by Christine Besas from Navigate. She is focused, helpful, informative and always keep things on track and organized. As a resident living in the community serviced by Navigate and Christine, I don't want to move any more. 5-star to her if I could not give more than that!",
        "owner_response": {
          "text": "Hi, David. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Louis Terdan",
        "rating": 5,
        "review": "We recently hired Navigate for our HOA and have been happy with them so far. MaryJoy has been our primary contact and has had good communication and effort with our account.",
        "owner_response": {
          "text": "Hi, Louis. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "LINDA KLEPPE-OLSON",
        "rating": 5,
        "review": "Dear Folks at Navigate,\nI am adding a positive review representing the Meadows at Enumclaw for several staff people who have been extra-ordinary in their level of service , both in efficiency and patience, with several different issues since our HOA joined Navigate Community Management in April 2022.\nVery special appreciation goes to WENDI TAN, who is so very efficient and kind through several different issues in the last months. Kudos to her for her great help, especially as we are new clients who have needed our hand held several times.\nThe same comments apply to Bridgette Shearin, who helped us so tremendously through our first annual meeting, and so many other issues in our first ten months.\nThe third person I want to be sure to mention, in particular and more recently is Christine Besas, who spent so MUCH time, with kindness and patience through an event with one homeowner, who no longer lived in our HOA, but who was quite delinquent for annual dues, which took way more time for her and us, due to the circumstances.\nWHAT WONDERFUL REPRESENTATIVES they are for your Company.\n\nMy deepest appreciation to you all.\n\nLinda Kleppe-Olson, President",
        "owner_response": {
          "text": "Hi, Linda. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Emilia White",
        "rating": 5,
        "review": "Hazel helped us by providing smooth communication in assisting us with an outdoor lighting project. She was clear, concise and prompt in her responses. It was a delight to work with her and we look forward to working alongside her in the future!",
        "owner_response": {
          "text": "Hi, Kelsey. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Rosa Kwan",
        "rating": 5,
        "review": "MJ/Mary Joy and her team were super helpful and understanding.  They made sure I received what I requested and offered any other help as well.\n\nI really appreciate their help.",
        "owner_response": {
          "text": "Hi, Rosa. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Chris Price",
        "rating": 5,
        "review": "Navigate is awesome. Mary Joy is so easy to work with and is very responsive and professional in her dealings. I appreciate dealing with someone who cares so much about what she does.",
        "owner_response": {
          "text": "Hi, Chris. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Jorge Santos",
        "rating": 5,
        "review": "Mary Joy is a pleasure to work with and is always very helpful and courteous. Her communication is outstanding and she always keeps me in the loop with timely notices.",
        "owner_response": {
          "text": "Hi, Jorge. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "John P",
        "rating": 5,
        "review": "Our HOA in Kent has been using Navigate for almost a year. Our primary contact is Mary Joy and her quick responses and professionalism has been outstanding. Navigate has been a huge help to use with their knowledge and experience in managing HOAs.",
        "owner_response": {
          "text": "Hi, John. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Jeffrey Corneil",
        "rating": 5,
        "review": "Just went through our first approval process for getting a new roof installed after changing HOA companies.  Working with Navigate Community Management during this process has been great!  Verna Hurboda's help and quick responses to our questions and concerns has been great and much appreciated.",
        "owner_response": null
      },
      {
        "author": "Lin Lin",
        "rating": 5,
        "review": "They have smooth on line potal to do maintaince. My tenant report the front porch light bulbs not working and I submit request through on line portal.  They arrange the contractor next week and send update email to confirm the completation.  I would suggest Navigate Community Management.",
        "owner_response": {
          "text": "Hi, Lin. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Patrick Andre",
        "rating": 5,
        "review": "Having had a poor relationship with a previous management company, and hearing stories of how difficult it was to work with other management companies, we found Navigate to be a refreshing change.  The team is responsive, and show care to our residence.  They have been very professional when issues arose.  Nicolas Marin has been helpful to keep us up to date and in compliance with the latest state regulations.  I can recommend them.",
        "owner_response": null
      },
      {
        "author": "Kashyap Uppuluri",
        "rating": 5,
        "review": "I worked with Mary Joy to get information about my HOA and she was patient and very helpful. She went above and beyond to provide all the necessary documents. Great service.",
        "owner_response": {
          "text": "Hi, Kashyap. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Andres Vergara",
        "rating": 5,
        "review": "Excellent service by Navigate and specially by Hazel Maquito for handling time-sensitive issues with speed and professionalism. During a wind storm, a tree behind my house developed a large crack and was in real danger of falling squarely on my house that day due to the high winds. My son noticed the crack mid afternoon. I called Navigate almost at 4pm and a message was relayed to Hazel, my community manager. Hazel acted immediately and contacted the tree company which came around 5:30pm to evaluate. They came back a bit later and cut down the damaged tree in the dark in the middle of the wind storm. Wow! Could not have asked for a better outcome. Navigate and Hazel took the situation with the seriousness it required, took action immediately, and avoided a catastrophe. Great service!",
        "owner_response": {
          "text": "Hi, Andres. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Mike Zhang",
        "rating": 4,
        "review": "Thank you Ella Africa for taking my call to clarify HOA late fees and send an updated HOA ledger for our condo units. She is nice, professional and very responsive to taking calls and responding to emails.",
        "owner_response": {
          "text": "Hi, Mike. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Patti Gilman (Patti)",
        "rating": 5,
        "review": "MJ did an awesome job taking care of multiple tech issues I had.  She was overly helpful and pleasant to talk to!  Thanks for having such a wonderful employee!!!",
        "owner_response": {
          "text": "Hi, Mary. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Carlos Moncada",
        "rating": 5,
        "review": "Mary Joy was a pleasurer to work with. Very professional and responsive. We at McLeod Construction will look forward to working with her and the Navigate team again soon!",
        "owner_response": {
          "text": "Hi, Carlos. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Barbara Somerville",
        "rating": 5,
        "review": "Our HOA has used Navigate Community Management for many years, and we have been quite happy with their service. Nicholas Marin runs a company that is efficient and honest. Communication is open and frequent. Christine Besas in particular keeps the HOA Board well informed, and handles our needs and requests promptly. I recommend Navigate highly.",
        "owner_response": {
          "text": "Hi, Barbara. We appreciate the kind words and are glad we could provide you with a positive experience over the past several years and we hope for many years to come."
        }
      },
      {
        "author": "Isaac Contreras Sandoval",
        "rating": 5,
        "review": "Hazel Maquito has been nothing but great taking my requests for my neighborhood HOA.\nShes been awesome, made it so that the HOA made changes to their contracts and took care of my requests immediately. Great service and very grateful",
        "owner_response": {
          "text": "Hi, Isaac. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Linda Short",
        "rating": 1,
        "review": "Our experience with Navigate started off quite well.  We had a manager we liked, things were getting done, and we had good communication.  This went well for the first year and a half.  Then things deteriorated.  Two of our managers left the company and we were left with no one to speak with.  Projects started were not completed, such as changing our lighting at garages and outdoor lighting, which started in the summer of 2019.  We were assured it would be completed by the end of the year, and it is still not completed.  The board's instructions for a fence to be replaced at the south end of the property weren't adhered to, the fence didn't extend as far as we wanted to and we got no satisfactory answer from the manager.  No annual meeting was ever set up for our community and questions went unanswered.  Navigate fired us as a client in March, saying we weren't paying them enough, among other things.  This is not a management company I would recommend to anyone.",
        "owner_response": {
          "text": "This review is from a Board member from an Association from which Navigate decided to terminate its contract due to a breach of fiduciary duty.\n\nHi Linda,\n\nThe Board of Directors hired us in the fall of 2018 and we found the Association in disrepair and with multiple insurance claims pending and legal claim against the Association. In just a year, we performed multiple items that were outstanding for months.\n\nThe Board also distinctively hired us for our technology approach and our Board portal, then the Board changed and no longer wanted to use our portal. Our financial reports are posted to the Board portal only to avoid any financial information and/or bank account information to be transmitted by email to protect.\n\nIn addition, it is in my strong opinion that the Board was in breach of its fiduciary duty with a reserve that is less than 10% funded and did not have a desire to address a lack of reserve funding and several deferred maintenance items. Because of that, we decided to terminate our management agreement.\n\nI wish you the best for your Association.\n\nRegards,\n\nNicolas Marin"
        }
      },
      {
        "author": "Michael Cawley",
        "rating": 5,
        "review": "Karren at Navigate helped us with an issue with our HOA.  She kept us informed and coordinated the entire process from start to finish.  We appreciate the friendly and professional manner Navigate handled this situation.",
        "owner_response": {
          "text": "Hi, Michael. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Meri McCormick",
        "rating": 1,
        "review": "WARNING TO ALL BOARD MEMBERS CONSIDERING NAVIGATE! Navigate Community Management is a corporate operation that makes money with every service they provide. While overall excessive, nothing is more violating than the fees they charge for a homeowner to sell their own. In a homeowner association a Resale Certificate and Demand Certificate is needed by WA law to complete a real estate sale transaction. Not only does owner Nicolas Marin, charge the law required $275 for the Resale Certificate, he adds extra fees amounting to $360. Then Marin charges an extra $320 for the Resale Demand Certificate necessary for escrow to close. The escrow company told me Navigate holds up many home closings by demanding this extra money for the Demand Certificate. For comparison, Windermere charges zero for the Demand Certificate. Since a seller needs to close by the contract date, you end up paying for the Demand Certificate including Rush fees of $140. In total to close escrow on our home, we had to pay $918.85 to Navigate Community Management and we are not alone. This company holds sellers hostage to these extra fees. BEWARE! This will happen to you as a seller under Navigate Community Management! They are capitalism at its worst. Do not use this Management Company. Your costs as an association will skyrocket and your homeowners will be burdened with these unnecessary real estate sale charges.",
        "owner_response": null
      },
      {
        "author": "Jeanne Strand",
        "rating": 5,
        "review": "I reached out to the Redmond Ridge East HOA on 2 occasions and both times, they were incredibly responsive and helpful.  The most recent was when I reported the Chickadee trail being overgrown after our luscious spring rains.  I got a response back the same day that they would check with their landscaper and when I went out 3 days later to trail ride my horse - it was already cleared and ready for use.  They do an awesome job maintaining the trails which are used by horses, walkers and bicyclists alike, creating an awesome sense of community and providing amazing trails to explore in the peace and tranquility of the woods.  Best HOA I have ever had the pleasure of working with.",
        "owner_response": null
      },
      {
        "author": "RW Anderson Services",
        "rating": 4,
        "review": "We work with Navigate and Mary Joy on multiple projects.  They are professional, responsive and reliable.  It is a pleasure to do business with all of their managers.",
        "owner_response": {
          "text": "Hi, Rw. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Tom Butler",
        "rating": 5,
        "review": "If you are an HOA and want to have a quality management team, call on Claire Beszhak. This review is a little different perspective as we are a Fire Suppression contractor for her and the Navigate team. One of the properties in her portfolio, Grand Bay, has had the worst luck with Fire Sprinkler breaks over the cold winter.\n\nOne unit had a finishing nail embedded in the sprinkler piping and when the homeowner was remodeling the nail was pulled out and water began to leak significantly. Her quick action of getting the contractor to send us pictures, allowed us to get out there to shut the system down until repairs could be made.\n\nAnother instance at this location involved frozen dry sidewall pipes and more water damage but her quick response to us, getting us keys and access to the location saved the facility money.\n\nWhat sets Claire apart from the rest, is her willingness to learn about the fire sprinkler, fire alarm and backflow systems. She has a basic understanding of how they work and what to look for when there are potential problems. Her overall understanding of the entire facility, calling to ask questions if she is unsure saves needless service calls to the HOA thus saving them money\n\nWhen we perform annual systems testing, the smoother the testing goes the lower the price. She always has keys for us and access to commercial units making our job easier and the cost lower. She always is price checking and recently switched fire alarm monitoring to Washington Fire Safety Supply Co. We gave her the best price possible which was lower than the competition which just saves the HOA money.\n\nI would highly recommend Claire and Navigate Community Management to manage and care for your HOA.",
        "owner_response": {
          "text": "Hi, Tom. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "John Smith",
        "rating": 5,
        "review": "Navigate has been the management company for our HOA since the summer 2019 when Navigate acquired the management company we had at the time. We immediately jumped in the 21st century: online portal with free online payment, text notifications of meetings, and our budget packet for 2020 was the most detailed budget we ever had. We have been really pleased with their services!",
        "owner_response": {
          "text": "Thank you John for your review."
        }
      },
      {
        "author": "Lisa Aplin",
        "rating": 5,
        "review": "Our HOA recently changed management companies and I needed some historic information on my account.  MJ was super helpful and got me what I needed right away.  I appreciate how responsive she was!",
        "owner_response": {
          "text": "Hi, Lisa. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Carol Arkell",
        "rating": 5,
        "review": "Was very impressed with the help ang courtesy with your team, especially Victoria, who helped me get an approval on an exterior painting project.  She was very professional & kind.  Thanks again!",
        "owner_response": {
          "text": "Hi, Carol. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "brandon g",
        "rating": 5,
        "review": "Mary at Navigate has been great for communication and promptness. She really gets out in front of things.... Look forward to working together!",
        "owner_response": {
          "text": "Hi, Brandon. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Decebal Cheldiu",
        "rating": 5,
        "review": "We finally got our landscaping modification project approved (it took a bit, so we had to be patient).\nVerna, we appreciate your timely communication and diligent approval process. Please send our thanks to the Board and keep up the good work!",
        "owner_response": {
          "text": "Hi, Decebal. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Daphne Knoll",
        "rating": 5,
        "review": "We always get timely and accurate responses from Carmela Aguilar whenever we have any kind of payment/accounting questions.  She is very responsive and easy to work with.  We appreciate this so much.  Daphne",
        "owner_response": {
          "text": "Hi, Daphne. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Elias & Helena Nemr",
        "rating": 5,
        "review": "Navigate manages our HOA at The Parks in Mill Creek.  We recently wanted a tree removed in our side yard and Victoria at Navigate was instrumental in ensuring that the project was approved in a timely manner.  She stayed on top of her game, communicated our needs with our HOA and assisted us in obtaining the city permit to remove the tree.\nThanks Victoria for the support and for keeping us constantly appraised of the progess of the permitting effort.",
        "owner_response": {
          "text": "Hi, Elias. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Willard's Pest Control",
        "rating": 5,
        "review": "Carmela with the Navigate Team is fantastic! Very quick to respond to our questions and helped us get the job done quickly and efficiently! Thanks again Carmela!",
        "owner_response": {
          "text": "Hi, Willard's. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Alex Lasko",
        "rating": 5,
        "review": "Great team to work with! MJ Galvez was fantastic in assisting with our project for the HOA and we were able to complete it timely and with all petites happy with the end results!",
        "owner_response": {
          "text": "Hi, Alex. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Olga Ch",
        "rating": 5,
        "review": "Mary Joy was very pleasant to work with. This community will soon have 1GB symmetrical Fiber internet from Ziply Fiber which will add more internet choices for the residents! Olga.",
        "owner_response": {
          "text": "Hi, Olga. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Ashwini Vaidya",
        "rating": 5,
        "review": "The HOA was extremely helpful in addressing my needs.  A shoutout especially to Christine Besas for her quick responses as well as for every effort she made to help me. She truly is outstanding!",
        "owner_response": {
          "text": "Hi, Ashwini. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Karen Wang",
        "rating": 5,
        "review": "Ms. Katrina Cabanela is one of the most efficiency persons that I have ever met, she's so professional and responsive, it's a great pleasure to have her in HOA, wonderful!  Very much appreciated! Also great appreciation to her manager Ross too! Thank you very much!",
        "owner_response": null
      },
      {
        "author": "Matthew Harris",
        "rating": 5,
        "review": "Navigate Community Management has provided fantastic service for our HOA.  In the first six months our cost were reduced and the services we received increased.\nNot only was the management fee reduced but, by bidding out our services, Navigate reduced our operating costs.  This allowed us to expand some services for the HOA.\nNavigate has also helped our board find contractors and services for new projects.  Some of which, are clearly out of the realm of a management service but, they still put in to effort into assisting us.",
        "owner_response": null
      },
      {
        "author": "Lee Swanson",
        "rating": 1,
        "review": "One star because zero isn't an option.  Navigate purchased our account when our previous property manager opted to sell her firm.  They have been unreliable and have failed to perform.  We have yet to successfully schedule a budget meeting - they failed to send out notifications the first time, then when the meeting was actually set up, they failed to actually hold the one-line meeting as planned.  They offered nothing but excuses and refused to accept responsibility.  They charged an owner late fees in late 2019, reportedly because they failed to draft her account as scheduled, then charged the HOA for repayment of the owner's late fees.  We attempted to change property managers, but they hide behind the contract they bought from our previous management company - essentially, they have no need to perform to continue to recieve payment.  I certainly don't recommend using this firm.  Steer clear.",
        "owner_response": {
          "text": "Hi Lee,\n\nThe information in your review are incorrect.\n\nYour Association was set up on financial services only, with services outside of your contract being charged on an hourly basis.\n\nNavigate Community Management does not have any 'draft (ACH)' program. We do not collect bank account information. We offer a free payment option via our homeowner portal where the homeowner is completely in control of the payment process.\n\nRegards,\n\nNicolas Marin"
        }
      },
      {
        "author": "Customer Service (Meredith Orpilla)",
        "rating": 5,
        "review": "From an accounting point of view, Ashford Chase HOA has been wonderful to work with.  Carmela A. responds quickly and stays in constant communication.",
        "owner_response": {
          "text": "Hi, Customer. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Amber Ghosh",
        "rating": 5,
        "review": "Very precise and quick in Approval for project. Victoria guided me through the process as it was very convenient for me to fill up the required applications and other required documents, and I could get started with my projects as per my plan.",
        "owner_response": {
          "text": "Hi, Amber. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Ramesh Galgale",
        "rating": 5,
        "review": "I have worked with MJ/Mary Joy for one of the event in our community. We got great help and support during the process and very prompt inputs all the questions. Thank you Mary for the help !",
        "owner_response": {
          "text": "Hi, Ramesh. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Carol Schellinck",
        "rating": 5,
        "review": "MJ was extremely helpful today  getting me the information I needed. She was very polite and understood exactly what I was looking for and promptly e-mail it to me. Thank you MJ !",
        "owner_response": {
          "text": "Hi, Carol. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Sangam Motgi",
        "rating": 5,
        "review": "I had a very nice experience with my interaction with Ella Africa. She very polite and prompt in helping me.",
        "owner_response": {
          "text": "Hi, Sangam. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "sc",
        "rating": 1,
        "review": "I live in Highland Vistas Community ( a Beautiful Townhome Community in the Snoqualmie area ) and our  HOA is currently managed by Navigate.  I really wish we were under a better HOA company\n1. These guys have no accountability whatsoever and never bring any value to the table and their only interest seems to be in misleading the board in not doing anything that way their workload is significantly less\n2. Any homeowner request that was submitted (Even after several follow-ups) takes several months/if not years to get an update or answer (forget about resolving it  ).\n3. Another big negative is these guys have no network of contractors, landscaping companies, or any other company that HOA needs.  I always find better companies/contractors and cheaper prices as an individual vs when working with th",
        "owner_response": null
      },
      {
        "author": "Kelli Bergen",
        "rating": 4,
        "review": "Very polite and helpful although was unable to return my call after being disconnected in the middle of looking up information. I called right back and they sent me to voice mail. Then called back at the end of the day. Would have been nice to wrap it up while we were talking and looking it up.",
        "owner_response": {
          "text": "Hi, Kelli. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Aravindan Rangarajan",
        "rating": 5,
        "review": "Ezekiel/Ric helped guide me through the HoA approval process for architectural review/heat pump installation. He is friendly, patient and professional. Thanks.",
        "owner_response": {
          "text": "Hi, Aravindan. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Lawrence Hui",
        "rating": 5,
        "review": "Our roofing application was handled by Victoria Manzano, she was very helpful and quick response to our application. It was a five star experience.",
        "owner_response": {
          "text": "Hi, Lawrence. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Bradley Bliven",
        "rating": 5,
        "review": "Carmela was great to work with and made the entire billing process smooth and seamless, I highly recommend working with Navigate!",
        "owner_response": {
          "text": "Hi, Bradley. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Cheri Jiang",
        "rating": 5,
        "review": "I received email said, I paid May HOA due late. I found out that was Navigate made error. I called support line. I get resolved in about one hour.",
        "owner_response": {
          "text": "Hi, Cheri. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Anna Mattiello",
        "rating": 5,
        "review": "MJ/Mary Joy Galvez at Navigate Community Management was very helpful with a schudeling problem I was having.   MJ was knowledgable, and professional.",
        "owner_response": {
          "text": "Hi, Anna. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "Leslie Strong",
        "rating": 5,
        "review": "Carmella did a great job helping me with a rejected autopay issue.  Thank you Carmella!",
        "owner_response": {
          "text": "Hi, Leslie. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Chief Gurgurlo Tahiru",
        "rating": 5,
        "review": "I had a hard time, Robin and MJ where very kind in helping me download and install the app. They where on the fon with me for over 45 minutes. Please anyone out there just ask for these 2 wonderful ladies.",
        "owner_response": {
          "text": "Hi, Chief Gurgurlo. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Petra Schuler",
        "rating": 5,
        "review": "Obed with Navigate was very helpful and friendly and helped me resolve my issue with just one short phone call. I'm very impressed!",
        "owner_response": {
          "text": "Hi, Petra. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Anmol Boparai",
        "rating": 5,
        "review": "My experience with the Navigate Community Management was wonderful today. Ms. Mary Joy helped me a very well. Thank You.",
        "owner_response": null
      },
      {
        "author": "Dylan M",
        "rating": 5,
        "review": "I spoke with Hazel over the phone when I had some questions. She was kind, professional, helpful, and a pleasure to speak with.",
        "owner_response": {
          "text": "Hi, Dylan. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Hai Vu",
        "rating": 5,
        "review": "I requested for a roof replacement using the web and the experience was painless. The people there were responsive, kind, and professional.",
        "owner_response": {
          "text": "Hi, Hai. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Kaumudi Karnik",
        "rating": 5,
        "review": "Very helpful and prompt staff. Priscilla Africa was quick in responding and helped us with our querries.",
        "owner_response": {
          "text": "Hi, Kaumudi. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "aksha Gowtham",
        "rating": 5,
        "review": "Good customer service, quick reply. I have good working experience with Christine Besas, she was very helpful with my queries.",
        "owner_response": null
      },
      {
        "author": "Zhifang Yang-denor",
        "rating": 5,
        "review": "Great service",
        "owner_response": null
      },
      {
        "author": "Sigrun Denny",
        "rating": 5,
        "review": "Navigates staff was very helpful - responded to my email quickly even though it was a holiday weekend, and got everything sorted out.",
        "owner_response": {
          "text": "Hi, Sigrun. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Sara",
        "rating": 5,
        "review": "They answered all of my questions and were so helpful with everything I needed. I would definitely work with them again! Thank you so much.",
        "owner_response": {
          "text": "Hi, Sara. Thanks for taking the time to share your positive experience. We truly appreciate it!"
        }
      },
      {
        "author": "sridhar",
        "rating": 5,
        "review": "Thank You Mary Joy, for quick and precise communication in helping me rent cabana and walking me through the rules.",
        "owner_response": {
          "text": "Hi, Sridhar. Your feedback is highly appreciated. Thank you for the review!"
        }
      },
      {
        "author": "Sandy Marshall",
        "rating": 5,
        "review": "Mary Joy is very pleasant and helpful to work with. All questions are answered immediately! Thank you",
        "owner_response": null
      },
      {
        "author": "Hilde Meadow",
        "rating": 5,
        "review": "Prompt, professional and caring.  Problem solved the same day. I am very pleased.",
        "owner_response": {
          "text": "Hi, Hilde. Thank you so much for leaving us a stellar review!"
        }
      },
      {
        "author": "Xuecheng Zhu",
        "rating": 5,
        "review": "MJ has helped with billing questions fast to solve the problem",
        "owner_response": {
          "text": "Hi, Xuecheng. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Jose Mari Okol",
        "rating": 4,
        "review": "Great service and responded well with our request for a project.",
        "owner_response": {
          "text": "Hi, Jose. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Natarajan Parameswaran",
        "rating": 5,
        "review": "Mary is excellent in communicating and resolving my issues.",
        "owner_response": {
          "text": "Hi, Natarajan. We are thrilled to learn that you had a positive experience with us!"
        }
      },
      {
        "author": "Angie Palafox",
        "rating": 5,
        "review": "MJ was very helpful. Thank you for helping me!",
        "owner_response": {
          "text": "Hi, Angie. We appreciate the kind words and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "George",
        "rating": 5,
        "review": "Very fast respond.",
        "owner_response": {
          "text": "Hi, George. We appreciate the rating, and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Dj GUGA",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Brooke Bloomquist",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Hari Narasimhan",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi, Hari. We are delighted that you had a great experience with us. Thank you for taking the time to rate us!"
        }
      },
      {
        "author": "Sue H",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jiawei Rong",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mike Cheng2",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi, Mike. We appreciate the rating, and are glad we could provide you with a positive experience!"
        }
      },
      {
        "author": "Amaury Pantoja",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi, Amaury. We must have done something right to get such a good rating from you. We really appreciate you taking the time!"
        }
      },
      {
        "author": "Anuj Surana",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi, Anuj. Thank you so much for rating your experience with us so highly!"
        }
      },
      {
        "author": "Vasu Bhim",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi, Vasu. Thank you so much for rating your experience with us so highly!"
        }
      },
      {
        "author": "Khaldoun Bata",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "This review is related to a delinquency. The homeowner has paid its HOA Assessment late in multiple occasion and requested a late fee removal.\n\nThe Board is responsible to apply the rules uniformly and fairly across all homeowners. Since there was no valid reason to remove the late fees/interest, the request was denied."
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Guyle F.",
        "rating": 5,
        "review": "Ric (Ezekiel) did great to coordinate my Arch request.  These steps can be emotional, but necessary to facilitate maintaining our neighborhood.  Ric helped me with the necessary documents and kept me informed on updates thru portal.",
        "owner_response": null
      },
      {
        "author": "Annie F.",
        "rating": 1,
        "review": "For over two months, Navigate has owed me money that they erroneously took from my bank account following the sale of my condo. They will not provide me with info regarding this. I have emailed them several times and they have stopped responding.\nI'm reaching out to the Attorney General and the Bellingham Herald.",
        "owner_response": null
      },
      {
        "author": "Crystal F.",
        "rating": 5,
        "review": "Anytime I have had a concern, Christine Besas, Navigate Community Management rep is so quick to take action to mitigate the issue or find a solution to the problem. \n\nFor example, I had sent a message about horseback riders leaving their horse's manure on our roads and sidewalks and within three hours she had the landscapers clean it all up,\n\nFeeling grateful for her care and responsiveness!",
        "owner_response": null
      },
      {
        "author": "v h.",
        "rating": 5,
        "review": "Raycor has been amazing and very customer service oriented.  He helped me with my architectural change application by guiding me to obtaining the required form, and outlining all the needed steps and estimated turnaround time (review and approval by the board) so that I could plan in detail for the project including to accept the price quotation before the expiry.  Thanks so much, Raycor!  You have been a godsend!",
        "owner_response": null
      },
      {
        "author": "Christine D.",
        "rating": 5,
        "review": "I have had the pleasure of working with Pricilla Africa while selling my condo. She has always been very professional and pleasant to speak with; most importantly she is very capable and knowledgeable. There were a few times that I needed something resolved immediately. Consistently, she listened to my needs and was able to accomplish the task quickly. I am not exaggerating to say that without Ella's help, there might have been significant delays in my sale!\nThank you Ella!\nChristine D.",
        "owner_response": null
      },
      {
        "author": "Dave L.",
        "rating": 5,
        "review": "Ella's been great to work with! She's really responsive and very professional. Working with her and Navigate made selling our property much easier. \nThank you!",
        "owner_response": null
      },
      {
        "author": "Sushama C.",
        "rating": 5,
        "review": "Friendly, professional and caring! I called Navigate Community Management for a quick review of repainting home. Had only a day for approval to stay on task with the project. They understood the time sensitivity, called up the rest of Management team and approved within the hour. Thank you A J for you wonderful customer service!!!",
        "owner_response": null
      },
      {
        "author": "Mary G.",
        "rating": 5,
        "review": "Navigate has provided great support for our condominium complex. Recently, Carmela helped me with a payment issue and was efficient and professional resolving the problem immediately. Chelsea has also been very responsive and supportive during a difficult situation here at our complex.",
        "owner_response": null
      },
      {
        "author": "Katherine Y.",
        "rating": 5,
        "review": "Pricilla Africa was extremely helpful in resolving my issue. She responded quickly, provided detailed solutions, and followed up throughly.",
        "owner_response": null
      },
      {
        "author": "Bryson G.",
        "rating": 1,
        "review": "Navigate has been the absolute worst company to deal with. Much like the other reviews, this company is fast to promise amazing things and extremely disappointing when actually trying to get things done. Their communication is extremely bad and slow to get back to you, and when they do it's pretty much worthless. \n\nThey will NOT try to help but they will do anything to get out of doing actual work. They are an absolute waste to time and money and I pray you take your business elsewhere. Like the other gentleman who posted he wished he could give 0 stars, I too would give 0 stars if possible.",
        "owner_response": null
      },
      {
        "author": "Dorothy N.",
        "rating": 5,
        "review": "I phoned Navigate to check on the status of my HOA dues and spoke to Ella.  She was professional, polite and efficient in getting my question answered.  Dot N",
        "owner_response": null
      },
      {
        "author": "Tamara N.",
        "rating": 5,
        "review": "Had the pleasure of working with Pricilla Africa this week. She was knowledgeable and courteous. She answered all my questions quickly and followed up to make sure I had all the information I needed!",
        "owner_response": null
      },
      {
        "author": "Dune I.",
        "rating": 5,
        "review": "MJ/Mary Jo helped to schedule and fix an irrigation zone that was not turning on. It us urgent due to heatwave in PNW earlier in the month. Excellent communication throughout process to book, fix and check back all good. Also, very timely service.",
        "owner_response": null
      },
      {
        "author": "Shreyas K.",
        "rating": 5,
        "review": "I worked with Pricilla Africa during our initial account setup for our new home. She was timely in communication and helped us get the account setup pretty quickly.",
        "owner_response": null
      },
      {
        "author": "Laura C.",
        "rating": 1,
        "review": "Absolutely FLEECE owners on condo transfer fees.  SHAME ON YOU!\n\n$700 + just to sell my condo because you need to charge fee after fee after fee to fleece the people in your \"community\".\nYou just took over for a different management company that charged 1/3 the price for this.",
        "owner_response": null
      },
      {
        "author": "Derek S.",
        "rating": 5,
        "review": "Charmaine Lambinicio was really helpful in getting my account set up for multiple properties at the same community.",
        "owner_response": null
      },
      {
        "author": "Peter C.",
        "rating": 5,
        "review": "Recently, I was stressed because changed to a new management company, but thanks to the kind and prompt handling of Navigate management (Robie), I am very grateful for the clear handling. \nI would like to thank you (Robie) for purifying my heart with such kind laughter.\nThanks Robie.",
        "owner_response": null
      },
      {
        "author": "David C.",
        "rating": 5,
        "review": "I am a vendor and Mary Joy has been great to work with. As someone who has worked with numerous management companies over the years, I must say her responsiveness and attention to detail is refreshing!",
        "owner_response": null
      },
      {
        "author": "Mike O.",
        "rating": 1,
        "review": "Navigate has got to be the absolute WORST property management company on the face of the earth!!!! \n\nFirst off, they aren't even located in Mill Creek as their Yelp page Indicates. They're in Bellingham!!! As a result, they have NEVER attended a single one of our HIA meetings!!!\n\nThey don't seem to understand HOA law at all!!! There is almost ALWAYS a delay in receiving any sort of response or action from them!!! \n\nRUN don't walk, but RUN QUICKLY away from Navigate or you'll truly be sorry!!!",
        "owner_response": null
      },
      {
        "author": "Karen D.",
        "rating": 1,
        "review": "This business has terrible business practices. They have terrible communication and are completely useless, I could've paid a 10 year old to do the work they do. They are incompetent along with using systems that are old and inefficient. I have so much more to add but to be honest I'm so done putting energy into doing the work for them. Please steer clear of this management company as they will take money from your account and take 20 years to give it back! DONT DO BUSINESS WITH THESE PEOPLE!!!",
        "owner_response": null
      },
      {
        "author": "Avijit G.",
        "rating": 5,
        "review": "Appreciate all the help Navigate community management gave us for getting home improvements approved with the hoa. Special thanks to Ric and Ezekiel for responsive and timely follow ups.",
        "owner_response": null
      },
      {
        "author": "Scott D.",
        "rating": 4,
        "review": "I just had a very kind and knowledgeable person, Christine , help me through understanding some things about payments. she's the greatest.    Scott",
        "owner_response": null
      },
      {
        "author": "Vishal S.",
        "rating": 5,
        "review": "Been couple of months with Navigate for our community. I can see things have changed for better with the change. Navigate's online portal makes everything about HOA centralized. No tracking emails for communications. And, Navigate has been quick to respond to any queries. This is a pleasant surprise compared to previous community managements. Now it falls of Navigate to keep up the good work",
        "owner_response": null
      },
      {
        "author": "Kathleen B.",
        "rating": 5,
        "review": "This is a great management team.  Everyone is professional and very helpful taking the time to make sure all concerns and questions are resolved.  MJ (Mary Joy) was especially helpful with talking me through the process of sending our condo newsletter to them via pdf using a website to help streamline the procedure.  I have nothing but good things to say about all of my interactions with the staff at this company!",
        "owner_response": null
      },
      {
        "author": "Doug R.",
        "rating": 4,
        "review": "Carmela was very helpful in sorting out some payment issues we had, after mistakenly making a double payment.",
        "owner_response": null
      },
      {
        "author": "Jie Y.",
        "rating": 5,
        "review": "My approval request to HOA was reviewed promptly, Raycor has been assisting with clear instructions and communicate information timely to me before the work is started. I really recommend Raycor and fast responding and friendly in customer support.",
        "owner_response": null
      },
      {
        "author": "Catherine B.",
        "rating": 1,
        "review": "Very poor and expensive services with lack of detail mindedness such as mailing out the wrong date for our annual homeowners meeting. I have been extremely disappointed with the inability of the staff to provide details concerning a drastic negative change in the homeowner's financial balance. I would recommend not using this business.",
        "owner_response": null
      },
      {
        "author": "Jesus S.",
        "rating": 5,
        "review": "I really recommend Mary, it fast on responding and friendly, great on customer service",
        "owner_response": null
      },
      {
        "author": "Creanga C.",
        "rating": 5,
        "review": "Had a request for an architectural request. \nEzekiel was helpful and quick in communication.\nThank you.",
        "owner_response": null
      },
      {
        "author": "M K.",
        "rating": 5,
        "review": "I have been pretty impressed with Navigate Community. Management. My interactions have been with Christine Besas. She is always there to assist us when we had any questions. She is knowledgeable, prompt, always available and more importantly handles in professional manner. Big shout out to her. Thank you Christine for what you do.",
        "owner_response": null
      },
      {
        "author": "Gee G.",
        "rating": 1,
        "review": "You're not getting a hold of anyone they rarely call you back they love to text you on parking fees that are so confusing and no one can say they handle the appropriate action I've been transferred to somebody that handles violations but not somebody that handles the parking now what the heck is it buildings have not been on for the last 2 months I've made numerous requests and nothing's changed so at night time we have no lighting whatsoever on the property except for the head of the HOAs carport",
        "owner_response": null
      },
      {
        "author": "Palak A.",
        "rating": 5,
        "review": "Charmaine was exceptional in communicating and helping us out during our countertop installation. she was prompt in responding and addressing it as well. we have never before received so much support from HOA. We had a situation with our neighbors that was very well handled and managed. so grateful to have this support.",
        "owner_response": null
      },
      {
        "author": "Nicki A.",
        "rating": 5,
        "review": "I would like to thank Ezekiel for responding so quickly to my request for getting a tree taken down in my yard, he has also been a huge help with my noisy neighbors, he deserves a raise for being efficient and doing his job well, hard to come by that lately.",
        "owner_response": null
      },
      {
        "author": "Richard L.",
        "rating": 1,
        "review": "IGNORE THE SINGLE STAR ABOVE, YOU CAN'T LEAVE A ZERO STAR RATING.\n\nZero stars for service but five stars for crapping all over an HOA Board Member having to submit multiple technical service requests due to them sending \"Links\" that either result in a blank screen or request that you change your password by clicking a link. You guessed it, that link doesn't work either. \nWhen I complained about the lack of timely response, the owner sent me a condescending email stating that in fact, they had not only responded within the promised time but any confusion was due to my not answering a call from them and he listed the day and time of that call.  It was from an unknown nuymber. Who answers their phone when \"Scam Likely\" is displayed on the phone? \n\nI checked my phone log and yes there was a call, BUT NO VOICEMAIL WAS LEFT. I don't know if this clown did or didn't know that his employee declined to leave a voicemail, and I guess it doesn't matter to him.  If that voicemail had been left, this current situation (the friggin links still don't work) could have been avoided. No admission of any lack of service by the owner though. \n\nWe have been with Navigate for less than three weeks and it appears that the uncomplimentary reviews left by others are indeed accurate. \n\nI have chosen to resign from the Board as these bozo's seem only to excel at selling while not committing adequate resources/training to provide the promised level of service.  I thought we hired this management company to assist HOA Board members and homeowners. Guess we will have to live with this unless the Board contacts legal representation to see if we can cancel the contract.\n\nOne thing you can count on with Navigate is that you will have to prove them wrong multiple times before they respond and then you are not even remotely assured that the situation will be resolved. \n\nWhen contacting Navigate, you will not speak with someone, you will be given the option of leaving a voicemail. Then, when they \"think\" they have addressed your concern, you will just get another text or email that, in my experience, will result in the same or very similar result-Not able to sign in. Again, when you try to follow up with them, you will not speak with anyone and be forced to email again to let them know that they have not resolved the issue. \n\nI wish I could blow off troublesome customers as Navigate does, but I don't think my owner would like that.\n\nHaving read the response below, here are my thought on my experience with the company. The owner is not proactive but reactive. He is very good at gaslighting. Here are the facts relevant to the client:\n\nBe proactive. A text prior to or a voicemail at the end of the first call would have resolved this issue and you would not be reading any of this.\nOwner didn't text prior to calling, resulting in the same missed connection. His voicemail was more gaslighting, just like his email. \n\nThe effort to rebut my review has consumed more time and resources than just doing what works the first time and keep at it. \n\nI guess if you gave a scrabble game worth of letters after your name, it's safe to assume people will pay a premium for bovine excrement.",
        "owner_response": {
          "text": "Hello Richard, \n\nThank you for your feedback and comment. \n\nI am happy to post here the same information that I responded to you by email. \n\nIn regards to the timeline of communication, our goal is to respond within 1 business day to voicemails and emails. Our office is open Monday through Friday. \n\nYou emailed our office over the weekend that you couldn't register to the homeowner portal. You called Monday afternoon toward the end of the day (3:51 pm) and your first call Tuesday morning was at 8:45 am before our opening time of 9am.  \n\nFrom your voicemail Monday afternoon to my return call Tuesday afternoon, it has been less than 24h. I personally left you a voicemail indicating that I had resend the registration information by both email and text message. Your email was  also responded to in 1 business day as our staff responded on Tuesday morning. \n\nI don't see how we failed to answer your call in a timely manner. I returned your call in less than 24h. \n\nWhen calling our office, you have the option to press 0 to get to support, our support team is available to answer these type of questions/issues.\n\nYour previous management company provided just 30 days' notice and we were given less than 10 days to do a transition (which would normally require 45 days) to avoid any gap of management for your Association. Our staff transition a majority of the preliminary information for your community in less than 2 weeks.\n\nRegards, \n\nNIcolas Marin, Owner."
        }
      },
      {
        "author": "Daytobe S.",
        "rating": 1,
        "review": "After payment we realized there was an $30 credit card fee. ( Credit 3% and Debit 9%) I called them right away and ask for transaction cancellation, which never happened as they will send only check ( with out transaction fee) but I need to pay my HOA dues immediately.\n\n\nThis is worst mechanism, if they are well established why can't they have thier own payment gateway/system set up. I don't see from any small business owners charging from the credit card fee. I will try my best not to encourage this mgnt system next year on words.",
        "owner_response": null
      },
      {
        "author": "Levi C.",
        "rating": 5,
        "review": "We are going to paint our house and when we Sent the approval request in, we had an answer in 1 day.  No delay is great!",
        "owner_response": null
      },
      {
        "author": "Sam S.",
        "rating": 1,
        "review": "I live in Highland Vistas Community ( a Beautiful Townhome Community in the Snoqualmie area ) and our  HOA is currently managed by Navigate.  I really wish we were under a better HOA company\n1. These guys have no accountability whatsoever and never bring any value to the table and their only interest seems to be in misleading the board in not doing anything that way their workload is significantly less\n2. Any homeowner request that was submitted (Even after several follow-ups) takes several months/if not years to get an update or answer (forget about resolving it  ).  \n3. Another big negative is these guys have no network of contractors, landscaping companies, or any other company that HOA needs.  I always find better companies/contractors and cheaper prices as an individual vs when working with this HOA Company.",
        "owner_response": null
      },
      {
        "author": "Abhishek C.",
        "rating": 5,
        "review": "I recently worked with MJ for multiple questions and MJ was great in answering all the questions. I look forward to working with her in the future.",
        "owner_response": null
      },
      {
        "author": "Ben G.",
        "rating": 1,
        "review": "Worst company management company. I used the saved bank account information and they systems didn't take my payment and got $35 charge dir NSF and I retired again with same saved account information and worked. I called them they and they said they will check this and call me back, I never got call back. After calling again they said nothing they can do and I have to pay that extra $35 charge. I wish I could use different company but sadly my HOA is with them. I will talk about this on on board meeting to see if can switch the company.",
        "owner_response": {
          "text": "Dear Ben G,\n\nWe apologize for any inconvenience caused due to the NSF charge on your account. We have investigated the matter and can confirm that the NSF charge was valid as the payment processor could not locate the account, this usually means that the account information was entered incorrectly. The payment process is entirely under the control of the homeowner and we cannot modify, edit or see the bank account information of homeowners for your protection.\n\nWe understand that this situation was frustrating for you, and we apologize for any miscommunication from our end regarding the follow-up call. We assure you that our team is committed to providing prompt and efficient customer service, and we regret any lapses in this instance.\n\nWe want to reassure you that we are always willing to work with our customers to find a satisfactory resolution.\n\nWe appreciate your feedback.\n\nSincerely,\n\nNicolas Marin, Navigate"
        }
      },
      {
        "author": "Gotham C.",
        "rating": 5,
        "review": "I have had a few interactions with Navigate and in all of them found their customer service to be very good. A recent interaction was with a customer support person there named Ric - who was very quick and efficient in helping me with my requests.",
        "owner_response": null
      },
      {
        "author": "Alex Z.",
        "rating": 2,
        "review": "The truth is that they start strong, with a lot of promises, but the disappointment comes later. No follow up on issues, managers that leave the company and nobody tells you until weeks later, issues pending that pile up on their plate, and on top of the above, they hate when you want the control of your HOA back. They are not collaborative with the HOA board, but more an obstacle to get things done on time. They should work more with the HOA board members instead of keeping full control of everything, maybe afraid of losing business opportunities.\nWe have changed recently of management and were with them now, but after a year were considering to switch again to another vendor.",
        "owner_response": null
      },
      {
        "author": "Meri M.",
        "rating": 1,
        "review": "WARNING TO ALL BOARD MEMBERS CONSIDERING NAVIGATE! Navigate Community Management is a corporate operation that makes money with every service they provide. While excessive charging, nothing is more violating than the fees they charge for a homeowner to sell their own. In a homeowner association a Resale Certificate and Demand Certificate is needed by WA law to complete a real estate sale transaction. Not only does owner Nicolas Marin, charge the law required $275 for the Resale Certificate, he adds extra fees amounting to $360. Then Marin charges an extra $320 for the Resale Demand Certificate necessary for escrow to close. The escrow company told me Navigate holds up many home closings by demanding this extra money for the Demand Certificate. For comparison, Windermere charges zero for the Demand Certificate. Since a seller needs to close by the contract date, you end up paying for the Demand Certificate including Rush fees of $140. In total to close escrow on our home, we had to pay $918.85 to Navigate Community Management and we are not alone. This company holds sellers hostage to these extra fees. BEWARE! This will happen to you as a seller under Navigate Community Management! They are capitalism at its worst. Do not use this Management Company. Your costs as an association will skyrocket and your homeowners will be burdened with these unnecessary real estate sale charges.",
        "owner_response": null
      },
      {
        "author": "Indranee S.",
        "rating": 5,
        "review": "Good customer service by Mary Joy. Put in a request in the online portal for a service request which was promptly scheduled. This is my second time raising an issue which was handled smoothly. Happy with the service",
        "owner_response": null
      },
      {
        "author": "Roni M.",
        "rating": 5,
        "review": "MJ provided was very helpful in going over account balance questions.",
        "owner_response": null
      },
      {
        "author": "Keven B.",
        "rating": 1,
        "review": "Navigate is a new management company for the residents at Highland Vista Townhomes in Snoqualmie. We have been through several companies and residents were excited to have a management company that really cared about us. Unfortunately this has not been the case. First of all they have gone through 3 different managers over the last 4 months. They do not keep us updated and we have to find out on our own that there is a new person working for the company. We had a meeting with Nicholas and his manager and was promised they would look into all the requests that had been neglected  by the first company along with Pulte. Unfortunately again, nothing that we talked about has been addressed. We have asked to have a follow up meeting regarding our requests, but nothing has been offered. They sent out some rule and regulations for the homeowners, but they aren't backing them up especially in regards to short  term leasing and Airbnb's.\nThey seem to be onlinterested in the bottom line, and taking our money, and not fixing the requests that we have asked them to do. \nIf you can use another home owner company. do so. This one doesn't seem to care about its residents. \n\n\nWe have emailed all 3 board members, but have not received follow up on when issues will be responded to or when our next meeting will occur. \nStill with Airbnb's which says no short term leasing. \nStill without a meeting date. \nTemporary sprinklers remain even after Pulte gave money to have them removed.\nNot keeping residents updated on personnel changes\nNot fixing walk area backing up to green area.\nNot looking into our boundaries in same area and who is responsible for what\nNot looking into wild life fence backing up to green area.",
        "owner_response": {
          "text": "Keven, \n\nWhile we always welcome constructive criticism so we can continually improve our services, the information you are sharing in your review is incorrect. I have personally responded to several of your emails over the past few months and my response will remain the same. \n\n1) Rules and regulations: the rules and regulations were drafted by the previous management company (Palette Property Management) for the developer and not by us. The rules were drafted in 2016 when the Association was being built by the developer. \n\n2) Airbnb: As mentioned to you by email several time, there is a hierarchy of documents within an Association. Rules and Regulations are at the bottom of the hierarchy of documents and cannot be more restrictive than the CC&Rs of your Association. The CC&Rs of your Association do not prohibit leasing and do not prohibit vacation rentals/short term lease. I have provided you the section of the CC&Rs and provided you with the following article (https://wscai.org/getting-away-in-an-hoa-what-can-associations-do-about-vacation-rentals/= to provide you with more information about the issue of vacation rentals in HOAs & Condos. In order to restrict the rental of units, the Board would have to hire an attorney, draft an amendment to the CC&Rs and get a super-majority approval from the homeowners to approve the change. \n\n3) 'They don't keep us updated'. Our company reports on issues to the Board of Directors. The Board is the elected party who receives the manager report, guidance and information. You are free to attend the open board meeting, and two have already been held (one in July, one in September). \n\n4) 'Not fixing the requests that we have asked them to do': Again we take our directions from the Board of Directors. The Board of Directors is the party making the decisions for your community and we implement them based on the specific directions given by the Board. We have already addressed several outstanding items, including replacing the landscaping company. \n\n5) 'Taking our money'. The Assessments of your Association are collected in a specific account held by the Association in the name of the Association. The board receives a full financial report monthly, including bank statements. \n\n6) 'We have gone through 3 different managers over the last 4 months': that is incorrect as well. I personally came to the meeting in July after the start of our management and was attended by another manager as well. We have a collaborative approach and work as a team. I am personally involved in many aspects of all communities.\n\n7) 'We have been through several companies': Palette Property Management was the only management company. They were hired by Pulte and we acquired Palette over the summer.\n\nYour additional comment/review proves that you dont understand how an Association works even though I have provided information to you.\n\n1) Board meeting: meetings are set and called by the board. Our office has no authority on scheduling meetings. The board met already 3 times this year and the average board meets quarterly.\n\n2) Personnel changes: we work as a team. The homeowners can report issues for the common areas in various ways through our portal, email and phone. The board was made aware of the most recent change.\n\n3) Other landscaping issues: these are being discussed by the board and worked on. The board chose a new landscaping company after we provided multiple bids as directed by the board.\n\n4) In regards to Airbnb, you clearly still have not read the CC&Rs of the Association. There is no restriction in CC&Rs about Airbnb rentals and the rule drafted by the previous management company is not enforceable. \n\n\nRegards, \n\nNicolas Marin, Owner & President"
        }
      },
      {
        "author": "Stephen L.",
        "rating": 5,
        "review": "Navigate took over the management of the condominium complex last year from our previous management company. The owner, Nicolas was hands-on, was able to take on all of the workload. That included understanding the variety of on-going and upcoming projects, the rental situation and the many other aspects of managing a community with 120+ units. Navigate also modernized the way our meetings were run by moving much of the detail we looked at online, including moving our membership to an online payment that included sharing important documents with the membership. Overall, I'm very pleased with they way Navigate has transitioned management, the improvements they've brought both to our board meetings and the everyday running of the complex.\nWith a community as large as ours there are always a small percentage of units that require greater attention for a variety of reasons. This particularly, has been an area of improvement from my perspective. Nicolas and his team are able to engage with the issue/owners and get to a timely resolution that leaves the membership in a better place. I highly recommend Navigate community management if you're looking for great management services.",
        "owner_response": null
      },
      {
        "author": "Patrick A.",
        "rating": 5,
        "review": "Having had a poor relationship with a previous management company, and hearing stories of how difficult it was to work with other management companies, we found Navigate to be a refreshing change.  The team is responsive, and show care to our residence.  They have been very professional when issues arose.  Nicolas Marin has been helpful to keep us up to date and in compliance with the latest state regulations.  I can recommend them.",
        "owner_response": null
      },
      {
        "author": "Linda S.",
        "rating": 1,
        "review": "I'm with Alex Z. in his assessment of Navigate Community Management.  We have had the exact same experience.  They started out strong; however, it soon became clear that they wanted to force our HOA into using all their vendors and not continue with ones we have had for years.  The first manager we had went behind the board's back to get another pool servicing company involved when we were perfectly happy with our current one.  They she mysteriously walks out of their office on a Friday afternoon and never returned.  She screwed up our fencing project here by not having it completed far enough on the premises, after specific instructions from the board.  Our second manager also left mysteriously, with no word to the board.  \nThen Navigate decided to adopt a \"team approach\" for our complex rather than one manager we could speak with.  The only communication we were to have was by email.  We didn't care for that approach.  It's the end of February and we haven't had our annual meeting which is supposed to be in early January.\nSo because Navigate felt we weren't paying them enough, and that we didn't care for the \"team\" approach, and that we didn't care for their policy of sending out approvals that we had to get on their \"portal\" to look at, they fired us effective the end of March.  It actually worked out perfectly for us because we were in the process of speaking with our former management company.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 223,
  "adjusted_average_rating": 4.55,
  "distribution": {
    "1": 22,
    "2": 4,
    "3": 2,
    "4": 9,
    "5": 196
  },
  "summary": {
    "created_timestamp": 1739205536,
    "text": "<section id=\"good\"><h2>Good</h2><p>Navigate Community Management has received numerous positive reviews, highlighting their excellent customer service and efficient handling of tasks. Many reviews commend specific staff members for their dedication and prompt responses. For instance, users have praised Mary Joy for her quick resolution of issues and exceptional communication skills, often receiving feedback within a day, which has been greatly appreciated by customers who find her services reliable and professional.</p><p>Customer satisfaction is further illustrated by the effective management of various processes, from setting up HOA accounts to resolving maintenance issues swiftly. Navigate's online portal also comes in as a handy tool, facilitating seamless communication and easy access to necessary documents. Many users express gratitude for the ease and clarity with which projects are handled, emphasizing the team's commitment to maintaining high levels of service, making the whole experience with Navigate smooth and reassuring.</p></section><section id=\"great\"><h2>Great</h2><p>Going beyond basic expectations, Navigate Community Management has exceeded in areas of proactive problem-solving and personal touch in customer interactions. One reviewer specifically mentioned that the staff was instrumental during a condo sale, significantly cutting down potential delays with their informed and efficient approach. This level of responsiveness and commitment to meeting deadlines showcases Navigate's dedication to supporting their clients.</p><p>Moreover, Navigate has been recognized for their professionalism and courteous interactions. For example, when faced with an urgent irrigation issue during a heatwave, the team acted swiftly, coordinating repairs in a very tight timeframe. Such instances underline the company's ability to operate under pressure and maintain high standards, ensuring issues are addressed promptly without compromising on quality or customer support, thereby strengthening their reputation as a trusted property management service.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite an overall positive image, some user reviews indicate areas where Navigate Community Management could improve. A frequent concern is the communication delays and lack of follow-through on reported issues. Several reviewers mentioned that their queries took a long time to receive responses or felt the assistance provided did not meet their expectations, citing instances where feedback seemed unsatisfactory or incomplete.</p><p>Another recurring theme in these reviews is the pricing for certain services, particularly related to transactions required to sell a property within an HOA. Customers have expressed frustration over the high fees associated with document processing, describing them as excessive compared to other management services. This dissatisfaction suggests a need for Navigate to evaluate its cost structure and ensure clarity and fairness in its billing practices to foster better client relations and satisfaction.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Negative reviews have highlighted some serious grievances with Navigate Community Management, pointing to critical failures in service delivery and client satisfaction. For instance, one user noted a prolonged issue with unauthorized bank charges that the company was slow to resolve, resulting in plans to escalate the matter to legal authorities due to unresponsiveness. Such incidents reflect poorly on Navigate's ability to manage financial transactions and customer trust effectively.</p><p>Another severe complaint involves the management of vendor relationships and maintenance timelines. Users have reported long delays in addressing vital community issues, such as unresolved contractor projects that stretched over several years without satisfactory communication or completion from Navigate. These situations highlight significant areas in need of substantial improvement to restore confidence and trust among HOA boards and property residents in Navigate's management capabilities.</p></section>"
  }
}