{
  "name": "New England Apartments",
  "slug": "new-england-apartments",
  "company_type": "property",
  "address": "2524 Douglas Ave, Bellingham, WA 98225",
  "review_count": 6,
  "average_rating": 3.83,
  "reviews": {
    "google_reviews": [
      {
        "author": "Leo Spencer",
        "rating": 5.0,
        "review": "The management is wonderful.  When a pipe burst and two buildings were left without water for about a day, they quickly delivered gallons of water to each apartment and set up plenty of outhouses.  They also kept us updated via email throughout the whole day.  Plus, they gave everyone pizza gift cards.  Super thoughtful and professional.\n\nThe apartments themselves are in good condition and the maintenance guy is quick and friendly.  Rent isn't too bad, either.\n\nNew England Apartments is definitely a  good housing option in Bellingham.  10/10 would recommend.",
        "ownerResponse": null
      },
      {
        "author": "Kate Welch",
        "rating": 3.0,
        "review": "I lived in the New England Apartments for 2 years while I was a student, and while overall it was a decent experience, there are some definite pros and cons.\nThe apartments themselves are nice enough, clean and spacious. But they're built pretty cheaply so things tend to need lots of repairs or just don't work quite right. I'm talking doors that were shady at best, locks that were installed incorrectly, windows that got stuck and toilets that leaked. They were pretty good about doing repairs quickly and were always very polite about letting you know when they'd be doing complex wide repairs, such as painting or checking on carbon monoxide alarms.\n\nThe staff is very friendly and helpful... but only for a few hours a day. RPM has extremely limited and unhelpfully short office hours, and they aren't the best about answering the phone during those office hours (which were reduced to around 4 hours a day recently), and the emergency off-hours phone number doesn't always work, and sometimes just rings their regular voicemail, which is highly unhelpful.\n\nThe pricing on these apartments is a bit much for what you're getting, but it's not a bad place to live and they're close to campus.",
        "ownerResponse": null
      },
      {
        "author": "Marie Sullivan",
        "rating": 4.0,
        "review": "Ive lived in the New England Apartments for almost a year now. Weve had a lot of things that needed to be fixed, (sink replacement, refrigerator replacement, etc), but it was always done in a timely manner and the maintenance guy is so so friendly and pleasant. Theyre very good at responding to emails and concerns during the hours they are available, but those hours are quite limited. As far as I know its the only apartment complex they manage, so everything is very personal and I feel like they truly care about their tenants. The walls are thin, but not too thin, just hope you dont have noisy neighbors. I always feel safe in these apartments (we even fell asleep with the door unlocked by accident and nothing happened), and during winter break there was a package outside one of the doors that wasnt touched by ANYONE for nearly a month. I can walk to and from school in roughly 20 minutes. All around good apartments, only real complaints is that its pretty pricey for college students but its in a very convenient location, and parking can be pretty annoying (spots are small and people park like idiots sometimes) but there is a lot of street parking available. I plan to live here for the rest of my college career at Western.",
        "ownerResponse": null
      },
      {
        "author": "Gavin Green",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shakiya Griffith",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Natasha Nieman",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 4.0,
  "summary": "<article>  <section>    <header>      <h2>Disclaimer</h2>    </header>    <p>This article is generated by ChatGPT and is intended to be a tool to help readers evaluate local property management companies or rental properties. It summarizes user reviews for New England Apartments without providing any identifiable information regarding the reviewers. The intention of this article is to provide a balanced view based on these reviews, covering both positive and negative aspects as discussed by past and current tenants.</p>  </section>  <section>    <header>      <h2>Good</h2>    </header>    <p>The management at New England Apartments has garnered praise for their attentiveness and professionalism, particularly in times of unforeseen incidents. For example, in a response to a burst pipe, the management team was reported to have delivered gallons of water to each affected apartment swiftly and established temporary outhouses, while maintaining consistent communication updates. Additionally, their gesture of offering pizza gift cards was viewed as a thoughtful compensation for the inconvenience caused.</p>    <p>Apart from crisis management, regular operations also seem to be commendable. The apartments are described as being in good condition, and the maintenance staff is lauded for their prompt and friendliness in addressing issues. User reviews highlight the work of maintenance personnel who are not only quick to respond but also bring a pleasant demeanour to the job, making routine repairs a less disruptive task for residents.</p>  </section>  <section>    <header>      <h2>Great</h2>    </header>    <p>Amidst the broad spectrum of feedback, certain reviews shine a light on the beneficial attributes of the property. Members of the staff have been recognized as very friendly and helpful, which can be of significant importance when it comes to tenant satisfaction. As the company appears to manage only this property, a personalised approach to tenant relations is noted, leading to a community where residents feel genuinely cared for.</p>    <p>The proximity of New England Apartments to campus is another commendable aspect frequently mentioned in user reviews. This convenient location is advantageous for students and is a strong selling point for those considering housing options in Bellingham. Furthermore, despite thin walls being mentioned, tenants report a general sense of safety and quiet within the apartments, further contributing to a positive living experience.</p>  </section>  <section>    <header>      <h2>Bad</h2>    </header>    <p>However, not all aspects of New England Apartments are met with approval. Some user reviews discuss the frustration with poorly installed fixtures and frequently requiring repairs, such as leaky toilets, defective locks, and windows that stick. These issues suggest a lower quality of construction materials or craftsmanship within the apartments. Additionally, while management has been noted to address repairs quickly, there are concerns regarding their designated open hours and availability, which are described as extremely limited and inconvenient for the residents.</p>    <p>Communication with the property management company has been a point of contention, specifically regarding their responsiveness during office hours and the functionality of the emergency off-hours phone service. Residents have experienced difficulties in reaching the management, exacerbating situations where immediate assistance is necessary. Moreover, user reviews imply dissatisfaction with the price point of the apartments, indicating that the cost may not fully align with the value received, especially considering the reported issues and the property's appeal to a student demographic.</p>  </section>  <section>    <header>      <h2>Ugly</h2>    </header>    <p>The adverse reviews for New England Apartments highlight significant drawbacks that can notably impact the quality of life for tenants. Parking challenges are a recurring topic of discontent, with complaints about the size of parking spots and the resulting difficulties residents encounter. The inconsiderate parking habits of others contribute to an already strained situation, although street parking is mentioned as a somewhat viable alternative.</p>    <p>A deeper concern comes with the sound insulation within the property. Several reviews mention thin walls as an annoyance, which can be a significant downside for those seeking peace and quiet, particularly if neighbors happen to be noisy. This acoustic transparency could severely diminish the privacy and comfort of tenants, potentially becoming an unforeseen ongoing nuisance for some residents of New England's Apartment complex.</p>  </section></article>"
}