{
  "name": "New England Apartments",
  "slug": "new-england-apartments",
  "company_type": "Property",
  "address": "2524 Douglas Ave, Bellingham, WA 98225",
  "review_count": 6,
  "average_rating": 3.83,
  "reviews": {
    "google_reviews": [
      {
        "author": "Leo Spencer",
        "rating": 5.0,
        "review": "The management is wonderful.  When a pipe burst and two buildings were left without water for about a day, they quickly delivered gallons of water to each apartment and set up plenty of outhouses.  They also kept us updated via email throughout the whole day.  Plus, they gave everyone pizza gift cards.  Super thoughtful and professional.\n\nThe apartments themselves are in good condition and the maintenance guy is quick and friendly.  Rent isn't too bad, either.\n\nNew England Apartments is definitely a  good housing option in Bellingham.  10/10 would recommend.",
        "ownerResponse": null
      },
      {
        "author": "Kate Welch",
        "rating": 3.0,
        "review": "I lived in the New England Apartments for 2 years while I was a student, and while overall it was a decent experience, there are some definite pros and cons.\nThe apartments themselves are nice enough, clean and spacious. But they're built pretty cheaply so things tend to need lots of repairs or just don't work quite right. I'm talking doors that were shady at best, locks that were installed incorrectly, windows that got stuck and toilets that leaked. They were pretty good about doing repairs quickly and were always very polite about letting you know when they'd be doing complex wide repairs, such as painting or checking on carbon monoxide alarms.\n\nThe staff is very friendly and helpful... but only for a few hours a day. RPM has extremely limited and unhelpfully short office hours, and they aren't the best about answering the phone during those office hours (which were reduced to around 4 hours a day recently), and the emergency off-hours phone number doesn't always work, and sometimes just rings their regular voicemail, which is highly unhelpful.\n\nThe pricing on these apartments is a bit much for what you're getting, but it's not a bad place to live and they're close to campus.",
        "ownerResponse": null
      },
      {
        "author": "Marie Sullivan",
        "rating": 4.0,
        "review": "Ive lived in the New England Apartments for almost a year now. Weve had a lot of things that needed to be fixed, (sink replacement, refrigerator replacement, etc), but it was always done in a timely manner and the maintenance guy is so so friendly and pleasant. Theyre very good at responding to emails and concerns during the hours they are available, but those hours are quite limited. As far as I know its the only apartment complex they manage, so everything is very personal and I feel like they truly care about their tenants. The walls are thin, but not too thin, just hope you dont have noisy neighbors. I always feel safe in these apartments (we even fell asleep with the door unlocked by accident and nothing happened), and during winter break there was a package outside one of the doors that wasnt touched by ANYONE for nearly a month. I can walk to and from school in roughly 20 minutes. All around good apartments, only real complaints is that its pretty pricey for college students but its in a very convenient location, and parking can be pretty annoying (spots are small and people park like idiots sometimes) but there is a lot of street parking available. I plan to live here for the rest of my college career at Western.",
        "ownerResponse": null
      },
      {
        "author": "Gavin Green",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shakiya Griffith",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Natasha Nieman",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 4.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>The user reviews for New England Apartments highlight several positive experiences with the property management. Tenants commend the management's responsiveness, particularly in crises, noting that during an incident with a burst pipe, management acted swiftly. They provided residents with water, alternative facilities, and continuous updates throughout the issue, even going the extra mile with pizza gift cards as a gesture of goodwill. This proactive and considerate approach to tenant relations sets a high standard for service excellence.</p><p>Additionally, the maintenance staff is praised for their speed and friendliness. Despite the challenges that come with repairs, the maintenance team is reported to address issues promptly. This responsiveness, paired with the personal touch mentioned in the reviews, suggests that New England Apartments takes tenant concerns seriously and works hard to maintain a positive living environment and good condition of the apartments.</p></section><section><h2>Great</h2><p>As for the 'great' aspects, residents appreciate the sense of community and security that comes with living at New England Apartments. One tenant recounted feeling safe enough to accidentally leave their door unlocked without any negative repercussions. Furthermore, the examples show a commitment to creating a secure environment, such as a package left unattended for a long period without being disturbed. This highlights a trustworthy community within the complex, which is a significant benefit in urban living situations.</p><p>The location of New England Apartments is also frequently praised in user reviews for its convenience, particularly for students who find its proximity to campus beneficial. The location enhances the appeal of the apartments, offering a blend of comfort and practicality for those looking to live close to educational institutions or central amenities, factors that can be crucial for college students seeking to balance academic and personal life.</p></section><section><h2>Bad</h2><p>On the downside, some residents find the construction quality of the apartments to be lacking. Reviews mention issues such as cheaply made fixtures and frequent repairs, indicating that while the staff is quick to address problems, the building itself might benefit from improvements to prevent the regular need for maintenance. Despite quick repair work, this perceived lack of quality can detract from the overall living experience and potentially raise concerns about long-term sustainability and comfort.</p><p>Another point of contention is the limited availability of the property management staff. Office hours are described as limited and unhelpful, creating frustration for residents who need assistance during off-peak hours. This problem is exacerbated by reported difficulties in reaching staff by phone, even during designated office times. An unreliable emergency contact system adds to the inconvenience, suggesting that while staff may be friendly, accessibility and communication could be improved.</p></section><section><h2>Ugly</h2><p>The ugly aspects reflect significant tenant grievances primarily revolving around financial considerations. Pricing is described as comparatively high given the quality and size of the apartments, posing a particular burden on college students who make up a portion of the tenants. This suggests that there might be a mismatch between the cost of living at New England Apartments and the perceived value provided. Furthermore, difficulties with parking, such as small parking spots and inconsiderate parking by others, have been highlighted, indicating that infrastructural elements of the property could be better managed to enhance tenant satisfaction.</p></section>"
  },
  "timestamp": "09/07/2024"
}