{
  "name": "Newport Apartments Bellingham",
  "slug": "newport-apartments-bellingham",
  "company_type": "Property",
  "address": "602 32nd St, Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 2.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Cecilia Smith",
        "rating": 3.0,
        "review": "These apartments get the job done, and while you aren't getting high quality, the prices are good for this area. When I moved into my unit last year, my unit contained fleas, which the property management company appeared to have known about. While the situation was handled promptly, it was an unpleasant experience for me, and irresponsible on their part to not inform me. Additionally, the carpets in my unit were absolutely atrocious looking, with numerous stains. The laundry machines are coin operated and do not work well, requiring several drying cycles before your clothes will actually dry. Some pros of this unit are that the one bedrooms pretty good in size, with it's best features probably being the balconey and it's convinient location to WWU. It's located right in front of a bus lines that goes up to WWU, and it's a month to month lease after six months. As a graduate student in a budget, I felt that these apartments served their purpose well. However, I would advise renters to just be aware of some of the issues I mentioned above too.",
        "ownerResponse": null
      },
      {
        "author": "Olivia Stark",
        "rating": 1.0,
        "review": "I love the community and area. This complex has ruined the experience Bellingham had to offer due to the unprofessional staff who chose to not abide by the RCW codes they so rudely told me to \"look up.\" On one hand they're billing me after sending emails stating the property is in my possesion while simultaneously entering the premise without a 30-day notice to remove personal property and change the locks. They also will not inform you of their policies unless at their discretion and do not allow complaints/grievances. I would not trust this establishment.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 2.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>The Newport Apartments in Bellingham seem to offer the basics that some residents might look for in a living space. A particular user review appreciated the apartment size and found the balcony and location convenient, especially the proximity to Western Washington University (WWU) and access to bus lines. Additionally, while the apartment quality is not regarded as high, the relatively good pricing for the area seems to make it an adequate choice for those on a budget, particularly students who may find the month-to-month lease option after six months to be flexible and accommodating.</p></section><section><h2>Great</h2><p>Despite the limited number of reviews, it seems the Newport Apartments may have some redeeming qualities that cater to those in need of simple, no-frills accommodation. In particular, a review highlighted that the one-bedroom units are quite spacious, which suggests that tenants have room to make the space their own. Moreover, the favorable location is frequently pointed out, indicating that tenants appreciate the easy access to local amenities and university facilities—a significant plus for many residents.</p></section><section><h2>Bad</h2><p>While the affordability of Newport Apartments is noted, there are several drawbacks that have been apparent in user reviews. A tenant experienced a flea infestation upon move-in, which, although promptly addressed, raises concerns about the company’s preparation for new tenants. Concerns about the cleanliness and state of the premises, such as severely stained carpets, were also alarming to some individuals. The laundry facilities were criticized for being inefficient, often requiring multiple cycles, which can be both inconvenient and costly for residents.</ reasoned, honest approach to the\"></section><section><h2>Ugly</h2><p>The most serious accusations pointed to professional conduct and adherence to regulations. One user review expressed disappointment over the staff's unprofessional behavior, alleging that they failed to comply with relevant codes. Moreover, these concerning claims include mishandled billing, unauthorized entry, and lock changes without the appropriate notice, as well as a lack of transparency regarding policies. Such experiences, as shared by a reviewer, suggest a trust issue between the management and residents, which is essential for a harmonious living environment.</p></section>"
  },
  "timestamp": "09/07/2024"
}