{
  "name": "Newport Apartments Bellingham",
  "slug": "newport-apartments-bellingham",
  "company_type": "Property",
  "address": "602 32nd St, Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 2.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Cecilia Smith",
        "rating": 3,
        "review": "These apartments get the job done, and while you aren't getting high quality, the prices are good for this area. When I moved into my unit last year, my unit contained fleas, which the property management company appeared to have known about. While the situation was handled promptly, it was an unpleasant experience for me, and irresponsible on their part to not inform me. Additionally, the carpets in my unit were absolutely atrocious looking, with numerous stains. The laundry machines are coin operated and do not work well, requiring several drying cycles before your clothes will actually dry. Some pros of this unit are that the one bedrooms pretty good in size, with it's best features probably being the balconey and it's convinient location to WWU. It's located right in front of a bus lines that goes up to WWU, and it's a month to month lease after six months. As a graduate student in a budget, I felt that these apartments served their purpose well. However, I would advise renters to just be aware of some of the issues I mentioned above too.",
        "owner_response": null
      },
      {
        "author": "Olivia Stark",
        "rating": 1,
        "review": "I love the community and area. This complex has ruined the experience Bellingham had to offer due to the unprofessional staff who chose to not abide by the RCW codes they so rudely told me to \"look up.\" On one hand they're billing me after sending emails stating the property is in my possesion while simultaneously entering the premise without a 30-day notice to remove personal property and change the locks. They also will not inform you of their policies unless at their discretion and do not allow complaints/grievances. I would not trust this establishment.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 2.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 1,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739095106,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Newport Apartments Bellingham offers a reasonable option for budget-conscious renters, particularly students at the nearby Western Washington University (WWU). A user review noted the convenience of the location, which is right in front of a bus line that services WWU, making it ideal for those attending the university. Additionally, some tenants find the one-bedroom apartments to be adequately sized, making them suitable for individuals looking for a modest living space. The ability to sign a month-to-month lease after an initial six-month term is also seen as a positive, offering flexibility for renters unsure of their long-term plans.</p><p>Despite the apartment complex having its challenges, some users believe it does fulfill its purpose as a functional living space. One user highlighted that the pricing is competitive for the area, suggesting that while it may not boast luxury features, it effectively meets basic housing needs. Prospective renters should weigh this aspect against other reported issues but can find some redeeming qualities in terms of affordability and location.</p></section><section id=\"great\"><h2>Great</h2><p>While there are limited reviews praising the Newport Apartments, it does receive commendation for its strategic location close to amenities and educational institutions. The community around the apartments offers a solid living environment, which some users seem to appreciate. This can enhance the living experience for those who prioritize being near campus or public transportation. Given the overall sentiment, those who value location may find Newport Apartments a suitable choice amidst the other issues reported.</p><p>Tenants have pointed out the adequate size of the one-bedroom apartments, particularly for individuals or students. This feature could be appealing to those looking for a manageable space without excessive costs. In essence, while not overwhelmingly praised, there are aspects like location and size that some users find beneficial.</p></section><section id=\"bad\"><h2>Bad</h2><p Numerous complaints have surfaced regarding the Newport Apartments, ranging from maintenance issues to problematic communication from management. One tenant reported an unpleasant experience with fleas present upon moving in, which suggests a lack of proper maintenance and oversight prior to new tenants moving in. Additionally, the condition of the carpets in at least one unit was deemed unsatisfactory, indicating that property management may be neglecting the upkeep of the apartments, which can detract significantly from the overall living experience.</p><p>The laundry facilities have also been criticized for their poor functionality, requiring multiple cycles for clothes to dry completely. Such ongoing maintenance issues can frustrate residents and reflect negatively on the management's attention to detail. Overall, while some positive aspects exist, the recurring shortcomings in maintenance and amenities highlighted in user reviews are significant points of concern.</p></section><section id=\"ugly\"><h2>Ugly</h2><p The tenant experience at Newport Apartments has been marred by reports of unprofessional management practices and a lack of transparency in operations. One user described a scenario where they were billed despite being assured the property was in their possession, which raises questions about administrative efficiency and integrity. Instances of property management entering units without proper notification and changing locks further compound these issues and reflect poorly on how tenant rights are respected.</p><pFurthermore, complaints suggest that management does not adequately communicate policies or provide avenues for grievances, leaving tenants feeling unsupported and vulnerable. Such experiences can create a stressful environment for residents, overshadowing the otherwise appealing aspects of the apartments. The overall feedback paints a troubling picture of tenant relations, with many feeling distrustful of the establishment.</p></section>"
  }
}