{
  "name": "Northbrook Place Apartments",
  "slug": "northbrook-place-apartments",
  "company_type": "property",
  "address": "3615 Bennett Dr, Bellingham, WA 98225",
  "review_count": 8,
  "average_rating": 4.38,
  "reviews": {
    "google_reviews": [
      {
        "author": "Bonnie Garrison",
        "rating": 4.0,
        "review": "I wrote a review about three years ago. Everything in that review still stands.  At the time I didn't have any pets. I now have two cats  which I love very much. The pet policy here is very good. You can only have two, but who needs more in an apartment? If you're looking for a place to live and you have pets, kids, come here. (There may be weight/breed restrictions on certain dogs I'm not sure.)",
        "ownerResponse": null
      },
      {
        "author": "GregG.",
        "rating": 4.0,
        "review": "good neighbors friendly staff the only bad thing is first come first serve for parking. not enough spaces so ppl park anywhere they can.",
        "ownerResponse": null
      },
      {
        "author": "Bonnie Garrison",
        "rating": 4.0,
        "review": "I have lived at Northbrook for 25 years. It's not a bad place. Very quiet despite fact that Bennett Drive is  the road right in front. It's close to the airport but very little nose. The manager Joy is great. Friendly and upbeat. If you have the attitude that you want to work with her things will get done. Maint         guy is good and reliable. He gets repairs done quickly. (He even unclogs my bathroom sink. I have very long hair.) My neighbors are  nice and friendly.  Less than a mile from Fred Meyer and close to Bellis Fair and the freeway on ramp going both north and south.",
        "ownerResponse": null
      },
      {
        "author": "Phil I-P",
        "rating": 4.0,
        "review": "Anyone know how to get ahold of Doreen, the previous landlord, I know she works for the Cooperate now. I am needing to contact asap thank you it is important. I would forever  grateful and comment on here if you do know and I'll keep checking. Thanks again so much!",
        "ownerResponse": null
      },
      {
        "author": "ms grundy",
        "rating": 4.0,
        "review": "Great place but getting noisy.",
        "ownerResponse": null
      },
      {
        "author": "Joey Morrison",
        "rating": 5.0,
        "review": "I like living here",
        "ownerResponse": null
      },
      {
        "author": "Al Colon",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joseph Morrison",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 6,
  "adjusted_average_rating": 4.17,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT and is only intended to be a tool to help in finding a property management company or rental property. The summary provided encompasses diverse opinions and experiences shared in user reviews, and does not reflect the views of the writer.</p>  </section>  <section>    <heading><h2>The Good</h2></heading>    <p>Residents of Northbrook Place Apartments find the community to be very accommodating, especially for those with pets or children. The pet policy is lauded as very reasonable, allowing for two pets, which users find is an adequate limit within the space of an apartment. Residents appreciate that while located close to an airport, there is minimal noise disruption, enabling a quiet living environment.</p>    <p>The management team, specifically mentioned is Joy, is described as friendly and upbeat. Residents who have a cooperative attitude report that requests and repairs are tended to efficiently, mentioning that the maintenance staff are reliable and quick to resolve issues, such as unclogging sinks caused by long hair.</p>  </section>  <section>    <heading><h2>The Great</h2></heading>    <p>Long-term residents indicate that living at Northbrook Place Apartments is generally a positive experience. One user review mentions a 25-year residency, claiming the place to be quiet and praising the on-site manager for excellent service. The team's willingness to work with residents on maintenance concerns seems to contribute positively to the living experience.</p>    <p>Residents also mention the convenience of the location, with proximity to essential shopping venues like Fred Meyer and the Bellis Fair, along with easy access to freeway ramps. These factors contribute to the ease of day-to-day living and are appreciated by those living in Northbrook Place Apartments.</p>  </section>  <section>    <heading><h2>The Bad</h2></heading>    <p>Some user reviews indicate drawbacks regarding parking availability with a system that operates on a first-come, first-served basis leading to insufficient parking spaces. It appears that these parking limitations cause residents to find alternative spots, potentially leading to disorderly parking or a challenge finding nearby parking.</p>    <p>An increase in noise levels has also been indicated in user reviews as a downside of the living experience at Northbrook Place Apartments. While exact sources or reasons for the noise increase are not detailed, this concern suggests that there may be occasional disturbances that could affect the quiet enjoyment of some residents.</p>  </section>  <section>    <heading><h2>The Ugly</h2></heading>    <p>There has been no mention of any 'ugly' aspects of Northbrook Place Apartments in the user reviews provided. However, it is important to note that the absence of such comments might not rule out potential issues that have not been shared or have occurred outside the scope of these reviews.</p>    <p>Moreover, while this article aims to encapsulate the range of experiences, the limited number of user reviews could mean that not all experiences or incidents at the property are thoroughly documented or reflected. Prospective residents are encouraged to seek additional information and perform their due diligence.</p>  </section></article>"
}