{
  "name": "Northbrook Place Apartments",
  "slug": "northbrook-place-apartments",
  "company_type": "Property",
  "address": "3615 Bennett Dr, Bellingham, WA 98225",
  "review_count": 8,
  "average_rating": 4.38,
  "reviews": {
    "google_reviews": [
      {
        "author": "Bonnie Garrison",
        "rating": 4.0,
        "review": "I wrote a review about three years ago. Everything in that review still stands.  At the time I didn't have any pets. I now have two cats  which I love very much. The pet policy here is very good. You can only have two, but who needs more in an apartment? If you're looking for a place to live and you have pets, kids, come here. (There may be weight/breed restrictions on certain dogs I'm not sure.)",
        "ownerResponse": null
      },
      {
        "author": "GregG.",
        "rating": 4.0,
        "review": "good neighbors friendly staff the only bad thing is first come first serve for parking. not enough spaces so ppl park anywhere they can.",
        "ownerResponse": null
      },
      {
        "author": "Bonnie Garrison",
        "rating": 4.0,
        "review": "I have lived at Northbrook for 25 years. It's not a bad place. Very quiet despite fact that Bennett Drive is  the road right in front. It's close to the airport but very little nose. The manager Joy is great. Friendly and upbeat. If you have the attitude that you want to work with her things will get done. Maint         guy is good and reliable. He gets repairs done quickly. (He even unclogs my bathroom sink. I have very long hair.) My neighbors are  nice and friendly.  Less than a mile from Fred Meyer and close to Bellis Fair and the freeway on ramp going both north and south.",
        "ownerResponse": null
      },
      {
        "author": "Phil I-P",
        "rating": 4.0,
        "review": "Anyone know how to get ahold of Doreen, the previous landlord, I know she works for the Cooperate now. I am needing to contact asap thank you it is important. I would forever  grateful and comment on here if you do know and I'll keep checking. Thanks again so much!",
        "ownerResponse": null
      },
      {
        "author": "ms grundy",
        "rating": 4.0,
        "review": "Great place but getting noisy.",
        "ownerResponse": null
      },
      {
        "author": "Joey Morrison",
        "rating": 5.0,
        "review": "I like living here",
        "ownerResponse": null
      },
      {
        "author": "Al Colon",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joseph Morrison",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 6,
  "adjusted_average_rating": 4.17,
  "summary": {
    "text": "<section><h2>Good</h2><p>In this article, tenants have noted that Northbrook Place Apartments stand out for being a peaceful community despite its proximity to the road and the airport, with very little noise disturbance. The pet policy is appreciated by pet owners, allowing for two pets which is reasonable for apartment living, although limitations on weight and breed may apply for dogs. Additionally, the proximity to local amenities like Fred Meyer and Bellis Fair, as well as access to the freeway, is seen as a convenient feature by the occupants.</p><p>Users have expressed a long-term satisfaction with living at the complex, citing one tenant's 25-year residence as a testament to the community's quality of life. The management, particularly the manager Joy, is described as friendly and cooperative, contributing to a harmonious living environment. Tenants have also complimented the maintenance staff, noting their reliability and expedience in handling repairs, a key factor in tenant satisfaction.</p></section><section><h2>Great</h2><p>The staff's friendliness stands out in user reviews, highlighting a welcoming and neighborly atmosphere that has been fostered by both the management and the residents. Residents describe good interactions with neighbors, which contributes greatly to the overall contentment with their living situation. Moreover, the management's openness to work with tenants to resolve issues collaborates with the feeling of a closely-knit community.</p><p>Though detailed narratives are limited, the general sentiment from the feedback is that tenants experience an enjoyable living environment. A review expressed sentiments as succinctly as \"I like living here,\" which, despite its brevity, could reflect a general contentment that does not necessitate further elaboration, pointing to the 'great' aspects of the Northbrook Place Apartments' management and overall living experience.</p></section><section><h2>Bad</h2><p>Some residents have brought up issues regarding the parking policy at Northbrook Place Apartments. With a system based on first-come, first-serve, the lack of sufficient parking spaces causes frustration among residents who are forced to find parking anywhere they can. This situation often leads to disorganized parking and can be an inconvenience for those owning vehicles.</p><section><h2>Ugly</h2><p>While most of the reviews are positive, there is a small mention of the complex becoming noisy, which can be a drawback for residents seeking a tranquil living space. As this is only a singular mention, it doesn't appear to be a widespread issue, but it is worth noting as potential room for improvement in maintaining the peaceful environment that has been a characteristic strength of the property, according to other reviews.</p></section>"
  }
}