{
  "name": "Old Mill Village",
  "slug": "old-mill-village",
  "company_type": "property",
  "address": "2100 Electric Ave, Bellingham, WA 98229",
  "review_count": 16,
  "average_rating": 4.56,
  "reviews": {
    "google_reviews": [
      {
        "author": "Maya Buhler",
        "rating": 2.0,
        "review": "Ive lived here 2.5 years now. This place is a great location and there  are tons of amenities nearby in terms of parks and nature. Great apartment to have a dog in.\n\nThat being said, the management switched over a few months ago and things have gone downhill. Rent went up 300 a month, which was over 20% in just one year. Many neighbors on fixed income who have lived here 5-10 years have been forced to move because of it. Very sad.\n\nWe had a meeting with the prop manager about getting the extremely old windows replaced before winter. Currently, they are single pane, meaning they hold condensation after showers and whatnot. That has caused a rather bad mold problem each winter. We were told replacing them over summer was the plan, and a priority. We followed up multiple times, got window measurements ect. It is now November, the rainy season is upon us, and the property manager has ghosted us regarding the issue. Very frustrating, especially considering the ostentatious rent increase.",
        "ownerResponse": {
          "text": "Thank you for sharing your experience living at Old Mill Village. We appreciate your positive comments about the great location and the abundance of nearby amenities, especially for dog owners. We understand that rent increase can be challenging. We strive to maintain a balance between providing quality service to our residents and ensuring affordability for our residents. We appreciate your feedback on this matter. Regarding the issue with the windows, we sincerely apologize for any misinformation or lack of communication, as well as any frustration this has caused. Peak Management is actively looking at ways to improve the community, addressing items of most importance first. This year, weve addressed several concrete steps in need of replacement (a project still in progress) and allowed the electric company to upgrade their infrastructure. We are aware of the windows, and it is a high priority item on our list. We have collected bids from multiple contractors for this project, and we look forward to providing more information on this soon. If you have any further questions or concerns, please do not hesitate to reach out to us directly at 360-295-8200 or oldmill@peak-management.com. We appreciate your feedback!"
        }
      },
      {
        "author": "Darlene R. Baumann",
        "rating": 5.0,
        "review": "Beautiful place to live. Feels like in country setting with grounds to walk,feels like a preserve  with geese,deer,squirrels  and rabbits. I noticed 2 resident herons earlier this summer. People friendly.  Good access to two roads into town and freeways. Great donut shp,coffee and philly cheese sandwiches closeby.",
        "ownerResponse": null
      },
      {
        "author": "Lauren Baker",
        "rating": 5.0,
        "review": "Jourdan and her husband are extremely helpful and truly care about your experience! They helped to make our day more beautiful than I could have imagined.",
        "ownerResponse": null
      },
      {
        "author": "Kyle Chapman",
        "rating": 4.0,
        "review": "Amazing apartments that are slightly off the beaten path. Sandwiched between two beautiful parks with a amazing lakeside views and beach access. Good pricing, good people, and beautiful grounds for an affordable lease.",
        "ownerResponse": null
      },
      {
        "author": "Uno Mundo",
        "rating": 4.0,
        "review": "The only issue is my upstairs neighbor\nmakes noise during quiet time 10pm to 8am.",
        "ownerResponse": {
          "text": "We're very sorry to learn that you're experiencing frustrations due to noise transfer. That's never the type of feedback we want to hear from our guests. Please be assured that our residents' satisfaction is among our top priorities. Should this issue persist, please let us know right away by reaching out to us at 360-295-8200. We'll do all we can to help ensure you have a pleasant and comfortable living experience with us at Old Mill Village. Thank you.\n"
        }
      },
      {
        "author": "Vincent Regimbal",
        "rating": 5.0,
        "review": "Beautiful place to live right on lake whatcom",
        "ownerResponse": null
      },
      {
        "author": "Jay",
        "rating": 5.0,
        "review": "Beautiful,  Wonderful,  clean, picturesque!!!",
        "ownerResponse": {
          "text": "Dear Jay, thank you so much for adding this 5-star rating of Old Mill Village. We work hard to provide a quality, enjoyable living experience for our residents, and we truly appreciate seeing that effort recognized. \n"
        }
      },
      {
        "author": "Sergio Arce",
        "rating": 5.0,
        "review": "My family lives there",
        "ownerResponse": null
      },
      {
        "author": "Laurie Lusk",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for your review! If there is anything we can do for you, just let us know!"
        }
      },
      {
        "author": "kelsey cartwright",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you very much for this 5-star review of Old Mill Village! We try our best to provide a fantastic living experience, and we love to hear that our efforts are paying off.\n"
        }
      },
      {
        "author": "Sarah Davidson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Were happy to see that you had a 5-Star experience at Old Mill Village!\n"
        }
      },
      {
        "author": "Maya McFadden",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for awarding Old Mill Village a five-star rating, Maya. We're thrilled that we exceeded your expectations! If you ever need anything, don't hesitate to get in touch."
        }
      },
      {
        "author": "Arvid Lindstrum",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Wilson Bui",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Matt McC",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jim Carlson",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 4.38,
  "summary": {
    "text": "<section><h2>Good</h2><p>Residents of Old Mill Village have voiced appreciation for the location, with its proximity to parks, nature, and amenities that are ideal for pet owners. A sense of community is also present as tenants describe the environment as friendly, with positive interactions among neighbors. The picturesque and serene setting boasts wildlife and scenic views that contribute to a peaceful living experience, adding charm to the residents' daily life.</p><p>The property's access to various town roads and its country-like setting are assets that have been praised. Additionally, the availability of delicious local food options has been highlighted, indicating that Old Mill Village not only offers a comfortable living space but also a convenient and enjoyable lifestyle.</p></section><section><h2>Great</h2><p>Some user reviews of Old Mill Village have gone to great lengths to highlight exceptional experiences with the property's management. Individual stories of helpfulness and genuine care from the staff, especially where efforts were made to enhance the aesthetics and overall satisfaction with living conditions, point to a commitment to providing a quality living experience. This personal touch contributes to an atmosphere that exceeds just the basics of property management.</p><p>The beauty of the location is frequently mentioned, with one user review expressing delight at the presence of diverse wildlife and the feeling of a natural preserve. This unique aspect of Old Mill Village showcases an integration with the environment that is not only appreciated but also cherished by the residents, providing a tranquil escape within the residential setting.</p></section><section><h2>Bad</h2><p>However, not all aspects of the Old Mill Village experience have been positive. There have been reports of a recent management change leading to undesirable outcomes, including a significant spike in rent, which has put financial pressure on long-term residents, some on fixed incomes. Additionally, communication issues with the property management have led to frustration among tenants, particularly concerning promises made about maintenance improvements that have not been fulfilled in a timely manner.</p><p>The increase in rent and perceived neglect of timely maintenance, such as window replacements that have directly impacted residents' living conditions, raises concerns. This presents a disparity between the cost of living at Old Mill Village and the value received, which, according to user reviews, has been a point of contention and dissatisfaction.</p></section><section><h2>Ugly</h2><p>Most concerning are the reports of property management becoming unresponsive or \"ghosting\" tenants, especially when addressing critical issues such as mold problems caused by outdated infrastructure. For residents affected, this is not only a source of frustration but a health concern that has seemingly been overlooked despite repeated attempts for resolution. Such situations reflect poorly on the responsiveness and responsibility of those in charge of property upkeep and tenant welfare.</p><testdata>.</testdata></section>"
  }
}