{
  "name": "Olympic Management",
  "slug": "olympic-management",
  "company_type": "Company",
  "address": "6820 20th St E B Fife, WA 98424",
  "review_count": 117,
  "average_rating": 2.48,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Veselin A.",
        "rating": 1,
        "review": "Apartment complex in Tukwila WA\nNew movie in!\nI'm serious about this- stay away from thigh management company, very toxic experience.\nMy experience is that new movie in family take the keys and found it very dirty unit never cleaned, all kitchen cabinets doors are lose and  fully ditched a ready to fall apart. wash machine total lost.\nMold, Mold and mildew, under sink cab stink as mildew and mold and leaking.\nEntry door broken and no safe.\nAllot of money for mold and dirt also unsafe unit broken entry door.",
        "owner_response": null
      },
      {
        "author": "Audrey W.",
        "rating": 1,
        "review": "Silverwood Park Apartments in Des Moines is a cute complex so it's too bad their rental process is shady. I applied on Sept 6th, was approved on the 8th, filled out some paperwork and paid the deposit/holding fee on the 15th, and was to sign the lease the 22nd. The property manager contacted my employer on the 20th - two days before I was to move in. Why was I still being screened after being approved and taking my deposit?\n\nOn the 15th I was told I would be contacted about my move-in date. Crickets all week so on the 21st I sent a text to find out what was going on...\n\nI decided that is not the kind of place I want to live long-term so requested my deposit back. Varessa (the property manager) informed me that I would need to go to the office in Fife. I went yesterday and they tried to give me a check for $1076.25 when the apartment deposit was $1335.\n\nDon't give these unorganized people your hard-earned money. I'm probably going to have to take them to court.",
        "owner_response": null
      },
      {
        "author": "Dan G.",
        "rating": 1,
        "review": "This is a very poor management company, they are painting over mold and charging families for mold, claiming that people are not taking care of their apartments. It is a scam to collect more money from working families. What a disgrace! Appliances are outdated as well; maintenance is very poor and does the very minimal to call it \"maintenance\".",
        "owner_response": null
      },
      {
        "author": "Sherri N.",
        "rating": 5,
        "review": "I have lived in my apartment for 10 years. I have NEVER had a problem with anything at Falls Point. This management company ROCKS!!",
        "owner_response": null
      },
      {
        "author": "Nicola T.",
        "rating": 1,
        "review": "Place and company is a joke. You are not a person but a $ value. Standard care..lacking.\nOffic3 management is appaling and very unpleasant.   Pushing good people out and dont care. 5 years and never late on my rent, but being trated like trash.  Do not rent from them!",
        "owner_response": null
      },
      {
        "author": "Faith C.",
        "rating": 1,
        "review": "I took over the lease of an apartment that was then transferred to the awful company. I had a fee schedule and other changes that were made to my lease I had originally signed. I had no choice but to accept these new terms as I hadn't been at my residence for more than 9 months which would have forfeited my deposit. I have recently moved out of this extremely run down property that had been in various states of disrepair for years PRIOR to taking over the lease. The previous managers ran things very casually and as such our move in inspection was not very thorough. Olympic Management is now basing how much of my deposit to keep off of previous casual agreements. They are unprofessional and refuse to communicate what happened with my move out inspection that I had a right to be present for. At this point they will not answer their phone. My building manager has refused to speak to me and her manager (Brandy) has told me I need to wait 21 days to find out the fees. I have never once asked for a dollar amount of what fees I might incur. I am looking to find out if anything was discovered during my move out inspection that I was unaware of. I will be contacting the manager went of the property to inform them the predatory practices of this new building management company. I will be seeking legal advice for my rights as a tenant. I would strongly suggest that any potential tenants avoid this place at ALL COSTS. Any landlords should look elsewhere for someone to manage their property. They are unprofessional, uncommunicative, and fail to follow through with maintenance requests in a timely manner. In my 22 years of renting I have NEVER experienced such poor treatment from a management company/landlord and have not once had any of my deposit withheld. If you value your money do not use this company. - UPDATE: you can \"respectfully disagree\" all you want. It doesn't change the facts of what happened. I would also like to add for all people reading: this place has refused to listen to anything I have had to tell them about the events that have occurred. Brandy, who has claims to be the VP of the company, continued to speak over me when I explained to her he condition of the unit and the way in which the apartment was handled by the previous managers. On multiple occasions I had tried to send documentation of the condition of the unit shortly after they came into control of the property. Many of these discussions were done verbally on the phone while being promised I would receive an email address to share my concerns. She claims that any agreements, discussions, emails, text messages that occurred between the previous managers and myself are \"hearsay\" and are not valid. She is treating the move in inspection as the ultimate deciding factor for how much deposit they will allow me to have back. I have it in writing that the apartment was never \"turned over\" between the previous tenants and the beginning of our tenancy. This includes: painting, professional cleaning, or necessary maintenance, of which did not occur. According to the Washington State Tenant rights I am responsible for returning the unit back in the SAME CONDITION in which it was received. Despite this law, I was told I had to perform a professional deep cleaning of all appliances and surfaces inside the unit. I was threatened with an extensive cleaning fee had this not occurred. This company is well aware of the condition of this unit prior to us taking over the lease, yet they are choosing to disregard written documentation they have on hand and nickel and dime tenants and deny them access to their hard earned money. I also want to stress that I had NO OPTION to vacate the unit at the time they took over management due to a clause that stated I must reside for 9 months to receive my deposit back. I was trapped in a unit that was poorly maintained with the hopes that if I stuck it out I would see my deposit. I strongly believe that this company never had any intention of returning my deposit, and will continue to do the same to other tenants.",
        "owner_response": null
      },
      {
        "author": "Volodymyr D.",
        "rating": 1,
        "review": "I DO NOT RECOMMEND ANYONE to contact this company. We urgently needed to move out of the apartments for family reasons, we had 2 months left to live according to the contract, we were offered the option to pay in one month and if new tenants are found, no fines will be charged. But in fact it turned out that they found people who stopped by and charged us a fine for early termination of the contract, keeping the entire amount of the security deposit. The apartments are called Pacific Height Apartments in Federal Way. Supervisor Brandy who ignored correspondence for weeks and failed to resolve the dispute, Amanda the apartment manager who was very nice in communication, but apart from the verbal agreement between us about the eviction, she did not act at all as described to us. They were supposed to return $3,095, but they returned $113.54. Advice to all refugees, read the contract and don't take the housing manager's word for it.",
        "owner_response": null
      },
      {
        "author": "Joshua B.",
        "rating": 1,
        "review": "I've had several ongoing issues as a resident on one of their properties. We are move out because of black mold, and ongoing issues with a pipe bursting. Apparently Olympic management company thinks the black mold in our residence, is somehow our fault. The mold was all over the walls and in the ceilings. And we have had several issues with leaks. Which were dramatically made worse, because they did not want to follow Washington state law, and hire a certified plumber. Long story short, mistakes were made by the mantaince man, flooding the  entire apartment ON TWO SEPARATE OCCASIONS DAMAGING SOME OF OUR FURNITURE!!!",
        "owner_response": null
      },
      {
        "author": "Brant P.",
        "rating": 1,
        "review": "This is my 2nd 1 star review of Olympic Management Company and I have had to get my real estate lawyer involved just for them to try to make things right. Olympic Management company has now tried to stick me with the bill for a bed bug inspection for the ENTIRE apartment complex. To give you guys the full story, my 5 year old son woke up covered in bug bites from the bugs they FAILED to spray for. I was living with cockroaches in my apartment, I lived with a hole in my ceiling that was leaking water for 4 days before being fixed and had to catch the water falling through my ceiling with a bucket and now most recently, I was charged for a bed bug inspection for the entire apartment complex and billed without giving them any sort of authorization or being told I would be billed $275.5. At this point I am outraged! I have given them an opportunity to try to make this right, but they continue to try to blame me as a consumer. Needless to say, think very long and hard before renting a property that these guys are managing. They are unprofessional to say the very least.",
        "owner_response": null
      },
      {
        "author": "Maliyah R.",
        "rating": 1,
        "review": "I have been at the Willow Green property since 2018 without problems until recently with the management & maintenance turnover. I have had a hard time getting ahold of the leasing office & have sent multiple emails to corporate. The corporate office has not once responded to me. I also transferred to a bigger unit & was moved into a home that was not even ready, till this day things are complete. I also still have not received my deposit from my first unit & was told that it's a 21 day process. It's been 3 months since I transferred and I keep getting told my check is on the way, but from where? Because the main office is down the street from the property I stay at. There is a huge lack of communication when it comes to responding to the residents & at a point we couldn't leave voicemails because it was full.",
        "owner_response": null
      },
      {
        "author": "Shannon H.",
        "rating": 1,
        "review": "I rented an apartment managed by Olympic Property Management. We signed a lease with one manager, and then they got another manager who took care of two properties. The new manager at Sea-Tac Village hasn't done one thing correctly the entire time we lived there. That was one reason out of several we moved out of the property. We paid over $1500 in deposits and fees to move in and received a walk-out estimate upon move out. \n     We were told our deposit refund would be much less than our written estimate. The manager \"forgot we had a cat\" when we did the walk out and there was another fee that somehow $440 in pet fees and deposits didn't cover. I was extremely disappointed with this because if we are told something, in writing especially, it should be honored. \n     I sent an email over 2 weeks ago to Olympic Management Company and left a voicemail to the person I was told could help me. I NEVER heard back. Over 2 weeks from move out, which is later than promised in our lease, we received our deposit refund. It was STILL less than what was discussed, so I called to leave several more messages as well as another email. \n     I finally received a call back after leaving two voicemails at different departments since for some ridiculous reason, there isn't a representative/customer service option...even though it was during regular business hours! I expressed my concern for the lack of follow through to Nancy. \n     She said would need to research some things and asked for a copy of the email I sent. (This makes 3 times I've sent emails in the past 2 weeks) I received a quick email back saying the admin fee I paid doesn't go toward my deposit, she didn't know I paid a pet rent, and would have to do more research. I sent her copies of everything I had issues with as well as proof I was correct and they were incorrect in this situation.\n     I sent a follow-up email yesterday asking if she had looked through the documents I sent to her (even though they are carbon copies of originals they should have). She said \"Yes I did. I have been swamped today and have not had a chance to review anything yet. Hopefully tomorrow.\" I requested she put me on her priority list today...didn't hear anything. \n     I hope they read this and see I was serious about reviewing their company online if I was neglected again. I do not appreciate being ignored when I am in the right and have documents proving so. (Even though they should have the same documents as they are CARBON COPIES!!!) \n\nEdit: I was just told the $440 paid to the property for my cat was for the \"privilege\" of him being on the premises. EXTORTION!!!\n\nSo ridiculous from a company whose front page of their website talks about how great they are. DO NOT RENT FROM THEM! Especially if you are looking at Sea-Tac Village or Steel Lake Plaza (both in Federal Way) Their property manager is ridiculous and will blame everything on the previous manager- SO UNPROFESSIONAL!!\n\nI rented from Olympic Property Management back in 2009 and had a great experience. I received all but $20 of my deposit back (they charged me for a blind my cat messed up) This is why I was happy to rent from them again since I had a good experience last time.",
        "owner_response": null
      },
      {
        "author": "Jeff B.",
        "rating": 1,
        "review": "Looking forward to leaving and would never consider renting from them again. Terrible people to have to deal with.",
        "owner_response": {
          "text": "Hi, Jeff. We are very disheartened to see that you feel this way, and we would like the opportunity to speak with you about what it is that we may be able to do for you. When you are able, please reach out to a team member over the phone at (253) 896-4100 and they will be sure to work with you. Thank you. - Olympic Management Company"
        }
      },
      {
        "author": "Jawad H.",
        "rating": 1,
        "review": "I rented an apartment managed by Olympic Management Co. At the end of the contract not only then didn't return one month security deposit because of noticing only 2 days short of 20 days advanced requirement but also on top of that charged $700 for cleaning. When I talked to property manager, she arrogantly replied that if I complain to her manager, she would add even more. I wrote a complaint letter to the management about property manager's behavior, they came back and said they stand by the charges and no mention of their staff behavior. \nI would never do business or refer my friends to rent properties from this company. they are horrible.",
        "owner_response": null
      },
      {
        "author": "Joshua K.",
        "rating": 1,
        "review": "It pains me to even give Olympic Management one star, I would choose a lower rating if I could. (Where's my negative star option?)  I've have never experienced this level of disrespect and egregious customer service ever before in my life.  My wife and I lived in one of their properties, Cedardale Apartments.  When we first signed our lease it was managed by a different property management company called Bianco Properties (they were great).  After our year lease ended we moved to a month-to-month lease.  It was at this time that Olympic bought Cedardale.  We immediately saw a drop in quality, not just in their service, but the facilities went downhill as well.  Long story short, About 2 months after Olympic Management took over at Cedardale we experienced some problems with the facility that were unacceptable and Olympic Management refused to take care of it.  My wife an I had already been looking to move out and this expedited that process.  We ended up moving out in the middle of the month (we were on month-to-month).  About a month after we moved out we received a notice of move-out charges.  They were trying to charge us over $500 for cleaning and repairs.  We take amazing care of our living spaces and we cleaned every blind and corner in that place.  After challenging these charges Olympic threatened to take us to collections if we did not pay up. So, reluctantly, we made a payment plan with them to pay it all off over a few months.  This brings us to today, we got a notice from a collections agency telling us to pay up in full or we will start getting interest.  So here we are, we haven't even lived on their property for 4 months and they decide that their done honoring our payment agreement and they just send the bill to collections without any notice.  Not only have they been unprofessional from the onset of or dealings with them, they have been downright spiteful and rude.  Nancy one of their office administrators hung up on me multiple times.  Please, do yourself a favor and never... Ever live in a property managed by Olympic Management company.",
        "owner_response": null
      }
    ],
    "google_reviews": [
      {
        "author": "J",
        "rating": 1,
        "review": "Brandi get it together!! Your such a horrible person! Quit having your handyman do Electrical work!!! They have you sign a paper telling you not to then tell you in person to do the work. l&I and the union already got you for this same thing.\nThey make all there managers have the tenants give 5star reviews. I've even seen the managers writing them with the tenants phone.\n\nThey can't charge you for pest control if your connected to another unit\nFlooring deprecates 20% per year after 5 they can't charge you for cleaning or replacement.\nMake sure anyone doing electrical is licensed!!!\nThey have 21 days to return or explain the deposit.\n10% cap on rent increase in most city's\nThis place is a joke and doesn't know how to deal with real problems. Just collect the money.",
        "owner_response": {
          "text": "We respectfully disagree with the content of this review and request it be removed immediately. It is from a disgruntled past employee who continues to harass the Company."
        }
      },
      {
        "author": "Silis V",
        "rating": 1,
        "review": "Crooked company. Liars and illegal business practices.\n\nLooked to rent from here. Paid holding fee. Couldn't move-in by agreed date. Got my holding fee back. Time passes. Receive bill and collection warning for said holding fee of the unit that was not made available for the date of move.",
        "owner_response": {
          "text": "We respectfully disagree with this review and request it be taken down immediately due to libelous content. If you have any questions or require assistance, please reach out to info@omcwa.com and we will promptly respond."
        }
      },
      {
        "author": "Private email",
        "rating": 1,
        "review": "If there's a zero star I would give this management company just that. I live at OK Hotel in Pioneer Square and see how this management failed all its tenants. The hallways, elevator, trash area are always filthy and stinky. The elevator today has piss on the floor. The ceiling in lobby has a hole and black mold. What's up with all these? Get a cleaner in and start doing your job!",
        "owner_response": {
          "text": "Thank you for taking the time to leave a review, as we are always looking for ways to improve. We respectfully disagree with your assessment of the property condition. If you are a resident, please reach out to the Leasing Office or email us at info@omcwa.com and we will promptly respond to your concerns."
        }
      },
      {
        "author": "Dustin Freeman",
        "rating": 1,
        "review": "If i could give less i would. Save your money, bad management, bad properties, slow response time, but they are sure to make sure you handle your end. Go to a different company, and let this one go into the dirt where it belongs.",
        "owner_response": {
          "text": "We respectfully disagree with your assessment. Olympic Multi-Family MGMT works hard to create a community where all residents have a great place to call home. If you have specific concerns, please reach out to us at info@omcwa.com and we will promptly respond and help you address them."
        }
      },
      {
        "author": "June",
        "rating": 1,
        "review": "I would NOT recommend Olympic Management properties to live at or being an employee of Olympic Management. Olympic is the definition of corporate greed and they are shady as hell. I could write a novel but I will keep it short and to the point. Stay far away from them at all costs.",
        "owner_response": {
          "text": "We respectfully disagree with your description of Olympic Multi-Family MGMT and the communities we manage. If you are a resident and have questions or require assistance, please send us an email to\ninfo@omcwa.com and we will promptly respond."
        }
      },
      {
        "author": "Denisha E Wade",
        "rating": 1,
        "review": "(Former Canyon Grove resident) These people do not answer phones or reply to emails. Our apartment was absolutely spotless and they sent a bill stating we owe $4,000 for alleged damages to the property. The proof that was sent were items that we were told to leave in the garage by the new agent Robin. This place is a scam they do not have a physical office so theirs no way of speaking to anyone. We originally were moved in by an agent by the initials of MS who knew were very clean organized residents. However, when we were departing Robin a very dishonest agent was the one to do our walk through. She stated everything was fine to my husband. I am furious that have now added a collection to me and my husbands credit report and have not yet to reach back out to me with a resolution. Beware of this company please!",
        "owner_response": {
          "text": "We respectfully disagree with your statements. We have ample evidence that you damaged the townhome you rented beyond normal wear and tear. The charges are justified. If you have questions about your balance owed to the property, please reach out to us at info@omcwa.com"
        }
      },
      {
        "author": "Kristen Kessler",
        "rating": 1,
        "review": "Not very honest, and would not return my phone calls. My suggestion to anyone who would rent under them is to never do anything over the phone, as conversations cannot be used for documentation. The property manager at Carpenter crest Apartments in 2022 told me that my fee was waived and an entire year later I was sent an email that my fee had gone to collections. No warning, no phone call, no bill sent prior. Just collections. kind of shady.",
        "owner_response": {
          "text": "Thank you for taking the time to leave a review, as we are always looking for ways to improve. We are sorry to hear about possible miscommunication. If you have any questions about your account balance, please email us at info@omcwa.com and we will promptly respond."
        }
      },
      {
        "author": "Ashley Sherman",
        "rating": 1,
        "review": "I currently live at fairway lane apartments and Bremerton and the team here sucks. None of my maintenance requests have been done since one of there maintenance guys quit due to the treatment he was getting from the company. I had interviewed for a job and their community manager shared my private information from my interview with another employee and the upper management did nothing about it. The lead maintenance technician for the kitsap area told us there wouldnt been any damage to our apartment after it was flooded due to a leak from the roof because the roofers didnt cover up exposed holes, when it fact another maintenance technician came in here and had to cut 3 different parts of our ceiling out and had to let it air out for 5 days before being able to make any repairs. Weve had nothing but issues since this company took over this property. Also the property is constantly covered in trash and the so called play ground on the property is unsafe. The slide isnt properly secured to the wooden structure, only the ground, and one of the posts seems to be rotting at the bottom",
        "owner_response": {
          "text": "We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us at info@omcwa.com to let us know how we can do better."
        }
      },
      {
        "author": "mel bennett",
        "rating": 1,
        "review": "shame on you guys first off telling your manager to just send a text to let the tenant know that they will not be renewing there lease and they need to start looking for another place well the is not legal there has to be something posted to the door and there was nothing  then i found somewhere that was going to help with rent well guess what there was nobody in the office then when there was i asked and bagged the new manager to please get the info over to them so that i could get it done and they did not then they were out of funding",
        "owner_response": {
          "text": "Thank you for taking the time to leave a review as we are always looking for ways to improve. It sounds like we missed the mark on communicating with you. Please reach out to info@omcwa.com and we will promptly respond to help you resolve this matter."
        }
      },
      {
        "author": "Katie Durand",
        "rating": 5,
        "review": "Just wanted to first say Mellisa who manages 5th ave in Kent is AMAZING!!!!! This was my first time renting from a property management. She was so patient with my thousands of phone calls never made me feel like I was an annoyance. There maintainince is amazing also. I thank you for our home. And hope that good things to come going forward! ",
        "owner_response": {
          "text": "We're grateful to know that your experience with us was an amazing one! We're always happy to hear appreciation from our customers. We look forward to seeing you again soon!"
        }
      },
      {
        "author": "LM",
        "rating": 1,
        "review": "I rented an apartment in Olympia for over 3 years. Never late on rent, very respectful to the staff and other tenants and left the apartment in pristine condition. The manager even commented on how good the apartment looked upon my departure. I should have received $605 dollars from my deposit within 21 days of moving out. I moved out on 7/31/23 and it is now 9/11/23. They claim the check was mailed,  verified my new address and I have not received the check that is coming from fife.  I have contacted the manager of the apartment complex multiple times, called olympic management company multiple times, left my number for a return call, asked for the previous so called check to be cancelled and for them to send a new check but nobody seems to care and nothing has been resolved. At this point I will give them one more chance to give me the money that is owed to me and drive to fife. I have filed a small claims in Pierce County so if  nothing can be resolved in office I will be proceeding with the legal route for violating RCW 59. 18. 280. This company does not give a damn, unprofessional and breaking laws. Thank god I took my business to a private landlord and wont have to deal with this crooked company ever again.",
        "owner_response": {
          "text": "We apologize for the delay in receiving your refund. You moved out on 7/31/23, were emailed your disposition paperwork on 8/1/23 reflecting the refund owed. Our we have record of our Corporate Office mailing a check to you on 8/13/23. We need to wait for a period of time to ensure that the check was lost before we can recut the check to avoid double payment. We are happy to cancel the previous check and send you another one. Would you prefer to come pick it up form our Corporate Office in Fife to ensure that it is not lost in the mail? Please reach out to us at info@omcwa.com letting us know and we will promptly respond."
        }
      },
      {
        "author": "Deborah Kuhn",
        "rating": 5,
        "review": "I've lived here for seven years, the apartments are roomy, and the entire complex is well maintained and quiet. I am so pleased, just recently the mgmnt. started all the Spring edging and moss and weed control. In doing so, I was concerned for my pet who utilizes and walks through these areas. I asked Lynda Shamblin, the mgr. if she knew if the organics the landscapers were using were safe? She was so very great about my concern. She got on the phone directly and got the msds safety sheets, and emailed them to me the very same day!! Turns out, the materials were all organic and extremely safe! This type of management is hard to find, but we have it here at Lakeview South, we are lucky to have it in Ms. Shamblin. Our maintenance staff are always walking the parking lots, and common areas checking for debris. Any apartment maintenance issues are addressed promptly.\nI just want to say if you are a senior like me, these apartments are safe, quiet and reasonably priced. The utilities are very manageable, and the laundry areas clean and well lit.\nLakeview South is the quiet little surprise in Lakewood!",
        "owner_response": {
          "text": "Wow! We cannot thank you enough for your review and for taking the time to shed such a positive light on our team and the positive impact they have had on you and your time here! It has been our pleasure to have you with us for the past four years. As always, we are here for you if you were to need anything going forward."
        }
      },
      {
        "author": "Heather Olney",
        "rating": 1,
        "review": "The management part of this company name should be changed to mismanagement. The contractors they continue to hire continue to refuse to do their jobs. Their residential properties have garbage dumped on them and they know. They don't care about the people living on their properties. Only about new paint to cover up the old issues.\n5/7 Do Not Recommend\n\nEdit: They claim to \"care deeply about their residents\", so of course they threaten them for saying anything negative. Retaliation for a bad review is low. And they don't clean up the garbage, they look at it and keep walking instead of managing the contracts they choose to pay for not doing their jobs.",
        "owner_response": {
          "text": "We respectfully disagree with your assessment. Olympic Multi-Family MGMT successfully completed a substantial renovation that benefits the entire community at that property. While we cannot control illegal dumping on any property, we promptly schedule removal of such items as soon as possible. We care deeply for all our residents and are sorry to hear that we did not meet your expectations. Please reach out to the Community Manager at your Leasing Office or email us at info@omcwa.com to let us know what we can do to make it right."
        }
      },
      {
        "author": "John Longoria",
        "rating": 5,
        "review": "I live at Madrona Estates Townhomes in University Place Wa. A residence that is managed by Olympic Management Co. It has been my experience that Olympic Management Company has always gone above and beyond for their tenants. Great management team!!",
        "owner_response": null
      },
      {
        "author": "Zoe Worley",
        "rating": 1,
        "review": "The worst experience I have had with a rental agency. I rented from them for approximately 3 months and had to leave due to noise and safety problems. The fire alarm panel in my building malfunctioned and beeped for an entire month daily right outside my door, plus the fire alarms themselves would randomly go off at odd hours with no way to address the issue than to waste King Co Fire's time and resources to send a crew out. (A neighbor reported living there for 20 years and that this is a yearly occurrence at the property during the winter.) Management gave me a slew of confusing excuses as to why this was never fixed. My neighbors made constant noise day and night, which management also made excuses for and failed to adequately address. The one maintenance person at the property quit a month into me living there, so there has apparently been no maintenance happening outside of instances deemed \"emergencies\". The mailboxes were also broken into at least half a dozen times while I lived there. I felt uncomfortable being at home and equally as uncomfortable leaving my place unattended when I lived there. Management would constantly send out mass texts harassing residents about parking improperly and throwing garbage away improperly. I moved out at the end of Jan, and now mid-February I have received notice of cleaning charges that they've expected me to pay and gave me no other indication of. Since this letter dated Jan 31st says \"you have 7 days before we send to collections/our lawyers\" and I didnt receive it until mid-month, I can only assume they've already done so. Please save yourself the stress and money and do not rent from them.",
        "owner_response": {
          "text": "We are sorry to hear your stay with us was not as expected. We work hard to provide the best living experience possible and would appreciate an opportunity to earn your business in the future. Please note that we have looked into your concerns and taken appropriate action where necessary. If you would like to discuss any of the issues you have raised please reach out to the Steel Lake Plaza Leasing Office at your earliest convenience."
        }
      },
      {
        "author": "Matthew Sanchez",
        "rating": 5,
        "review": "Dylan & Jerry with corporate maintenance were very helpful in inspecting and solving issues related to my unit. I look forward to having them around again and would refer any neighbor under management to have them as well.",
        "owner_response": {
          "text": "we strive for 100% satisfaction, and it is great to see you had such a positive experience with Olympic Management Company. We can't wait to see you again, have a great day!"
        }
      },
      {
        "author": "Faith Matthews",
        "rating": 1,
        "review": "I took over the lease of an apartment that was then transferred to the awful company. I had a fee schedule and other changes that were made to my lease I had originally signed. I had no choice but to accept these new terms as I hadnt been at my residence for more than 9 months which would have forfeited my deposit. I have recently moved out of this extremely run down property that had been in various states of disrepair for years PRIOR to taking over the lease. The previous managers ran things very casually and as such our move in inspection was not very thorough. Olympic Management is now basing how much of my deposit to keep off of previous casual agreements. They are unprofessional and refuse to communicate what happened with my move out inspection that I LEGALLY had a right to be present for. At this point they will not answer their phone. My building manager has refused to speak to me and her manager (Brandy) has told me I need to wait 21 days to find out the fees. I have never once asked for a dollar amount of what fees I might incur. I am looking to find out if anything was discovered during my move out inspection that I was unaware of. I will be contacting the manager went of the property to inform them the predatory practices of this new building management company. I will be seeking legal advice for my rights as a tenant. I would strongly suggest that any potential tenants avoid this place at ALL COSTS. Any landlords should look elsewhere for someone to manage their property. They are unprofessional, uncommunicative, and fail to follow through with maintenance requests in a timely manner. In my 22 years of renting I have NEVER experienced such poor treatment from a management company/landlord and have not once had any of my deposit withheld. If you value your money do not use this company.\n\n- UPDATE: you can respectfully disagree all you want. It doesnt change the facts of what happened. I would also like to add for all people reading: this place has refused to listen to anything I have had to tell them about the events that have occurred. Brandy, who has claims to be the VP of the company, continued to speak over me when I explained to her he condition of the unit and the way in which the apartment was handled by the previous managers. On multiple occasions I had tried to send documentation of the condition of the unit shortly after they came into control of the property. Many of these discussions were done verbally on the phone while being promised I would receive an email address to share my concerns. She claims that any agreements, discussions, emails, text messages that occurred between the previous managers and myself are hearsay and are not valid. She is treating the move in inspection as the ultimate deciding factor for how much deposit they will allow me to have back. I have it in writing that the apartment was never turned over between the previous tenants and the beginning of our tenancy. This includes: painting, professional cleaning, or necessary maintenance, of which did not occur. According to the Washington State Tenant rights I am responsible for returning the unit back in the SAME CONDITION in which it was received. Despite this law, I was told I had to perform a professional deep cleaning of all appliances and surfaces inside the unit. I was threatened with an extensive cleaning fee had this not occurred. This company is well aware of the condition of this unit prior to us taking over the lease, yet they are choosing to disregard written documentation they have on hand and nickel and dime tenants and deny them access to their hard earned money. I also want to stress that I had NO OPTION to vacate the unit at the time they took over management due to a clause that stated I must reside for 9 months to receive my deposit back. I was trapped in a unit that was poorly maintained with the hopes that if I stuck it out I would see my deposit. I strongly believe that this company never had any intention of returning my deposit, and will continue to do the same to other tenants.",
        "owner_response": {
          "text": "Thank you for the feedback. While we respectfully disagree with your characterization of events. We have taken steps to resolve your concerns, If you have any further questions please contact us at info@omcwa.com"
        }
      },
      {
        "author": "heather edmundson",
        "rating": 2,
        "review": "Disappointed. I hate to do this. I have been living at a complex in Fife for 5 years. The first 3 were fabulous with one manager. These last 2 have been horrendous. We have had 3 or 4 managers in these 2 years, none of which wants to or can take control of this smaller property. Several maintenance changes, majority are lazy and dont want to work. The grounds stay littered and trashed. Smokers in the stairwells/decks on a non smoking property.  Car Break ins and crime is rising. We are supposed to have security. The office and after hours maintenance emergency phone number is always full. We can never leave a message. Calls wouldnt be returned anyway. I have recently been living with mold in my closet where the water heater is (due to a leak a few months ago) because of short staffed and major renovations on certain units. My water heater is 13 years old and needs to be replaced before it makes a bigger mess. Thats not a concern right now. I always pay rent on time even during the major crisis over the last two years. I am being asked to new my lease with a $200 increase, mind you my unit is not renovated either. Or continue paying $200MTM fees. I used to love living here. My neighbors are great. They are fed up too. I am looking to purchase a home, hopefully sooner than later , I am out of here. ** the only good thing, it stays pretty quiet around our property**",
        "owner_response": {
          "text": "We apologize for any inconvenience and would like to discuss how we can provide a better service for you and the apartment community. Please contact the Community Manager at the Leasing Office at your earliest convenience. We look forward to hearing from you."
        }
      },
      {
        "author": "Cara Banks",
        "rating": 1,
        "review": "Roach infest rain on the inside air conditioner leaks all over the floor maintains is trash it smells like a dead body over there. Branches growing through Drains not fit for children nor adults. And management dont answer the phones. I have video for the courts. The same carpet and flooring thats been there from day one. Toilet rocks side to side. Do not move to Coventry gardens and those that are there get you some attorneys I promise you its not up to livable codes",
        "owner_response": {
          "text": "Hello Cara, I am sorry but we do not manage any property named Coventry Gardens, We are located in Washington State. We also do not have you in our system as a resident for any of our properties. Could you please remove this review as it does not pertain to our company or any of our properties that we manage. Thank you."
        }
      },
      {
        "author": "Matthew Harris",
        "rating": 5,
        "review": "I have rented from Olympic for three years and have had an amazing experience with them. They are very responsive and genuinely care about their tenants requests/concerns. All the processes they have in place are seamless and make the tenants experience easy and headache free. I highly recommend renting from them!",
        "owner_response": {
          "text": "We are so grateful for your continued loyalty to our community. Thank you for taking the time to detail your experience. We hope you stay with us for many more years to come!"
        }
      },
      {
        "author": "Alexis Cox",
        "rating": 5,
        "review": "I have lived at Sherwood Glen for 8 years now and I love it, its very quit here a great group of people live here and it is beautiful in the summer time when everything is in bloom. The apartments have full size washer and dryers, fireplace, covered parking, walk in closets and are laid out very nicely. Your within a mile of any shopping you might want to do, your on the bus line and close to the police station and courthouse. There is a nice fitness center and racquetball court too. The staff is very pleasant to work with and professional. I would highly recommend  if your looking for a new place to call home.",
        "owner_response": null
      },
      {
        "author": "Brandy Guilliot",
        "rating": 1,
        "review": "Before renting under them please reconsider especially if you have children. I lived at Heather Courts in Parkland for 6 years until they took over. The old tenants had to move out because of remodeling and increase rent prices. Understandable, however, they didn't give us relocation funds, which they don't have to, neither enough time to look for another apartment.\n\nEvery tenant got a twenty day notice to move at the end of the month. Luckily, I moved on my own terms before getting a notice. I have a child and I didn't want him stress about us finding a place.\n\nI moved on May 20th and gave my keys on May 22nd, they sent me my deposit refund 3 days later, however this is where the shadiness happens,  the check bounced the next week, two days after cashing it. (I couldn't get to the bank until memorial day weekend was over)..\n\nI called immediately to let them know that their check bounced and that I literally had no funds in my account from it happening. They asked for proof and I gave them my bank statement, after that, no responses to emails or phone calls. I have been waiting and checking the mail everyday hoping I can pay my bills and have received nothing.\n\nIts really unfortunate that they don't care about families or what happens when their mistakes can cost someone their livelihood.\n\nI stress talking to the current tenants if you plan on moving to any apartments managed under them.",
        "owner_response": null
      },
      {
        "author": "Kay H",
        "rating": 1,
        "review": "Bought out morning star but kept the same unprofessional employees refusing to return a deposit that is illegal without sending a statement they told me to dispute it but then stopped replying and tried to use the excuse of being a new company but they still had old employees here even spoke to their legal team who said they were not in compliance . But I guess Ill have to waste everyones time in court.",
        "owner_response": {
          "text": "Thank you for taking the time to leave a review as we are always looking for ways to improve. We are sorry to hear that we may have missed the mark on our communication with you regarding your deposit and would like to help. Please reach out to us at info@omcwa.com and we will promptly respond."
        }
      },
      {
        "author": "Zach Burns",
        "rating": 5,
        "review": "The team at Olympic has done nothing short of impress. Their responsiveness and professionalism fosters an incredible environment for all tenants. The management team offers personal support to all tenants, always exemplifying sound and fair judgement. Would highly recommend their services!",
        "owner_response": {
          "text": "We are so grateful for your continued loyalty to our community. Thank you for taking the time to detail your experience. We hope you stay with us for many more years to come!"
        }
      },
      {
        "author": "Bianca Harrison",
        "rating": 1,
        "review": "I rented from this company 2yrs ago, and signed the lease over to the other person because of personal situation. As of July 2022, I received a collection on my credit report from this company, without any given notice!! Just straight to collections. Now Im trying to dispute this, and nobody is picking up the phone, or returning my calls. This is wrong on all levels!! How do you send somebody to collections without sending them any notice or any calls!!",
        "owner_response": {
          "text": "Our team wants to extend our sincerest apologies concerning the issues that you have faced. We pride ourselves on maintaining the highest quality standards for our customers/clients; we hope you will give us an opportunity to discuss your concerns further with you. You can reach out to us at (253) 896-4100 ext. 1. We hope to find a solution promptly."
        }
      },
      {
        "author": "Brennan Naylor",
        "rating": 5,
        "review": "Olympic Management Company displays their experience through the incredible service they provide. I am consistently impressed with the quick response time and organization of the group. As a result, the property has attracted a friendly tenant base of thoughtful and respectful neighbors.",
        "owner_response": {
          "text": "We love to see that your time here has been nothing but positive, and we look forward to doing all we can to make sure it continues. Please let us know if you were to need anything from us going forward"
        }
      },
      {
        "author": "Shannon Haley",
        "rating": 1,
        "review": "I rented an apartment managed by Olympic Property Management. We signed a lease with one manager, and then they got another manager who took care of two properties. The new manager at Sea-Tac Village hasn't done one thing correctly the entire time we lived there. That was one reason out of several we moved out of the property. We paid over $1500 in deposits and fees to move in and received a walk-out estimate upon move out.\nWe were told our deposit refund would be much less than our written estimate. The manager \"forgot we had a cat\" when we did the walk out and there was another fee that somehow $440 in pet fees and deposits didn't cover. I was extremely disappointed with this because if we are told something, in writing especially, it should be honored.\nI sent an email over 2 weeks ago to Olympic Management Company and left a voicemail to the person I was told could help me. I NEVER heard back. Over 2 weeks from move out, which is later than promised in our lease, we received our deposit refund. It was STILL less than what was discussed, so I called to leave several more messages as well as another email.\nI finally received a call back after leaving two voicemails at different departments since for some ridiculous reason, there isn't a representative/customer service option...even though it was during regular business hours! I expressed my concern for the lack of follow through to Nancy.\nShe said would need to research some things and asked for a copy of the email I sent. (This makes 3 times I've sent emails in the past 2 weeks) I received a quick email back saying the admin fee I paid doesn't go toward my deposit, she didn't know I paid a pet rent, and would have to do more research. I sent her copies of everything I had issues with as well as proof I was correct and they were incorrect in this situation.\nI sent a follow-up email yesterday asking if she had looked through the documents I sent to her (even though they are carbon copies of originals they should have). She said \"Yes I did. I have been swamped today and have not had a chance to review anything yet. Hopefully tomorrow.\" I requested she put me on her priority list today...didn't hear anything.\nI hope they read this and see I was serious about reviewing their company online if I was neglected again. I do not appreciate being ignored when I am in the right and have documents proving so. (Even though they should have the same documents as they are CARBON COPIES!!!)\n\nSo ridiculous from a company whose front page of their website talks about how great they are. DO NOT RENT FROM THEM! Especially if you are looking at Sea-Tac Village or Steel Lake Plaza (both in Federal Way) Their property manager is ridiculous and will blame everything on the previous manager- SO UNPROFESSIONAL!!\n\nI rented from Olympic Property Management back in 2009 and had a great experience. I received all but $20 of my deposit back (they charged me for a blind my cat messed up) This is why I was happy to rent from them again since I had a good experience last time.",
        "owner_response": null
      },
      {
        "author": "Jermone Jackson",
        "rating": 1,
        "review": "Please Do Not Move Here If Peace And Comfort Is Your Goal. They Do Not Uphold Their Tenant Agreements As Ive Been Dealing With A Recording Studio Directly On The Opposite Wall Plus Verbal Almost Physically Altercations That Ended Up With Police Being Called. After Months Of Numerous Reports Of Fear Of Safety And Harassment From Day One Of Moving In, Ive Had Enough And Asked To Be Relocated To Another Unit Or Property That Was Agreed Upon One Day But The Next Day I Was Told That I Would Basically Have To Be Physically Assaulted Before I Can Be Moved. After Them Dropping The Ball For Months Of Reporting. No Rent Adjustments Or Early Lease Termination. To Avoid Anything That May Come Of The Situation, and  Protect Myself and Family. Im Basically Paying 1300 To Be Bullied Nd Harassed. Ive Got Videos Of The Excessive Noise As Proof Update 3/24  I Went To The Companys Office Only To Be Immediately Dismissed By The Bigot, JAYMEE(ASSET MANAGER)  She Have No Regard For Human Life. She Almost Physically Assaulted Me Jst To Prevent Me From Entering The Building And Speaking With Her Superiors.",
        "owner_response": {
          "text": "We are sorry to hear that you are not satisfied with your experience and we would like to make it right. Please email us at info@omcwa.com and we will quickly find a reasonable resolution to this issue."
        }
      },
      {
        "author": "V Cubed",
        "rating": 1,
        "review": "They claimed they would honor our city's requirement for affordable units, then did not.They raised rents by several hundred dollars in the buildings they just  bought.They turned the pet policy from open to any well behaved pets of any size (we're near an off-leash beach), to \"20 lb weight limit\" on pets.  They destroy diversity, are indifferent to the needs of the disabled and elderly, evict good people, and push out even more good people, just to raise rents. They kept the deposit of a neighbor who left their apt pristine. They put illegal eviction notices on good tenants the first week they bought our complex, had to withdraw them when we called lawyers. They took 3 months to clean our buildings. They illegally tore down the playground, with zero notice. They had workers in the store at ground level work nights, gave tenants no warning, so at 1 a.m. we hear banging, objects fall in the apts above the store.",
        "owner_response": null
      },
      {
        "author": "Julian Eyer",
        "rating": 5,
        "review": "My family and I moved up to Olympia for a job opportunity and I have had the fortunate opportunity to have moved to Sherwood Glen.  Alexis, our apartment manager, was very helpful and accomadating with our transition from out of state.  Alexis is so great and made our stay at Sherwood very comfortable.\n\nThe apartment was just right according to the price.  I like the wood panel flooring in the kitchen and the full washer and dryer included in the apartment.  Maintenence is also speedy and thorough.  When our dishwasher broke they replaced it with a new one immediately.\n\nSo, for our first home in Olympia it was a pleasant and peaceful experience.",
        "owner_response": null
      },
      {
        "author": "spc wadhams",
        "rating": 1,
        "review": "If I could give them no stars I would. First we were overcharged on our itemized list of things we owed so the property manager made a revised statement that was approved via Olympic Managment Co. It was mailed June 8th and was received today, June 12th. I called today to let them know I would be mailing my check in and they told me it was already sent to collections...seriously!!! I wasnt even given the chance to pay them before they threw me out like garbage. I'm not going to sit here and pay hundreds more than I should to you vultures when I only owe you a small amount. Never once did I get any other correspondence from them either about the issue. Still waiting on a call back from upper management.",
        "owner_response": null
      },
      {
        "author": "Teri Ann",
        "rating": 4,
        "review": "I love living under this management team. Ive lived at 3 of their properties and my fianc worked for them at 2 for a few years. We always love the staff and somehow their properties are always a little oasis from loud noises and the city hustle and bustle.",
        "owner_response": {
          "text": "Teri, Thank you for taking the time to leave us a review! We appreciate the feedback."
        }
      },
      {
        "author": "Joseph Nelson",
        "rating": 5,
        "review": "Great Management Company. I brought up some concerns that I had and they acted fast and efficient. They helped my family out a lot. And made my experience with them way better. I would definitely recommend anyone to go with this company when it comes to rentals or anything",
        "owner_response": null
      },
      {
        "author": "KayleeM Smith",
        "rating": 4,
        "review": "I have lived at Olympic heights in Olympia for about a year now, friendly maintenance staff who get things done fast and efficient. Very informative office staff. Great location, everything within a walking distance. Just wish more people picked up after their dogs.",
        "owner_response": null
      },
      {
        "author": "jayce Lee",
        "rating": 1,
        "review": "Cherry Tree Apartments have been wonderful until about a month ago when Olympic took over. The new apartment manager named Debra has been very rude, discriminative, and has harassed my family on seperately occasions. Debra has expressed to me that multiple men walk out of my apartment every single morning (as if I was promiscuous) and it very much offended me as I have my 2 children living in my home. Debra let my roommate and I know that she sees who comes out of my apartment. The crazy thing is, from where her office is located, she cannot see my door and at the bottom of our steps, is a walkway that leads to other apartments. When having a one on one meeting with Debra, she expressed to me that she and the owner of the apartment complex did not like certain residents within the building. In more detail, residents who are on section 8 and residents who work in the community garden (which she made sure to underline that she will be knocking down). As she further went on to give me information that I did not want to know about residents, Debra mentioned that my rent was going up a couple of hundred dollars when my lease is up which I believe is ridiculous as the apartment is falling apart.",
        "owner_response": null
      },
      {
        "author": "TTT Bennett",
        "rating": 5,
        "review": "Andrea, has been a great addition to the Westview Terrace community. She is efficient and professional. Keep doing a great job!",
        "owner_response": {
          "text": "Thanks so much for taking the time to share this short but sweet feedback! We're happy to hear that you had a great experience with us and hope to see you again; take care!"
        }
      },
      {
        "author": "Laura B",
        "rating": 1,
        "review": "We rented from them a couple years ago and they gave us a itemized list of what we owe. The first thing they charged us for was to fix a hole in the wall, that they made to test for mold. They charged us for a pet cleaning fee for the carpets, somehow the huge pet deposit we paid didn't cover it. Then they decided to replace the entire carpet and charged us for that. Oh the renters above us moved out and the guy cleaning the apartment would just sweep trash off the balcony onto mine below. We dealt with a crazy guy and after him harrassing multiple people, including us, everyone was told there was nothing could be done. Kept having a mental guy play with himself in the middle of the street when i would go outside, but he was constantly let onto the property and management wouldn't make him leave. We had to move to a lower apartment because everyday i was getting called by the manager because the downstairs lady would constantly call her and tell her my kids where running around all night, they where not, but it didn't matter even though there was no proof i still got harassed by the apartment manager. The same lady below me would party all night, yell, and scream and after numerous police visits and notifications, the manager did nothing and never called them.",
        "owner_response": null
      },
      {
        "author": "Marie M",
        "rating": 1,
        "review": "Disappointed !!! Im currently a resident at Southside apartments in puyallup and the management on this property is not only rude to their residents but don't know how to run this apartments complex the manager here her name signdey or cindy however you spell her name is rude and disrespectful we had my husbands van parked in front of the office where they have cameras everywhere his van was broken into thats past Saturday made a police report and i went into the office to see if they could realse footage to the police she says oh cameras are fake you should of locked you can excuse me but we did lock our van she should have running working cameras so rude",
        "owner_response": null
      },
      {
        "author": "Nathan Goodwin",
        "rating": 1,
        "review": "Terrible Management Company. Discriminatory, callous and rude. There have been more complaints about this company than almost any other HUD approved building in Washington State. If you hear of this building as the management property for a building youre looking into, I highly suggest that you look somewhere else.  Disgraceful.",
        "owner_response": null
      },
      {
        "author": "Alice Hubbs",
        "rating": 5,
        "review": "Happy Holidays To All\nThis is the time of year when we look back at how our year went. I live at Falls Points In Tumwater Wa. This year brought us new people Debra.Kimberly,Todd and now Edgar. It is the place i have raised my son for the last 7 yrs. We love it here Love the staff who are ALWAYS friendly warm and happy to see us and hear our chitter chatter. the way they handled the pool and all the rules was the best I have ever seen here in all of my years The staff treats us very well and gives us the feel of family. I could not ask for more and still love living here where they put our safety first as well as our concerns..I have never heard anyone on the office phone be rude to another resident and doubt I will ever hear that. Thank You for our wonderful Team u have brought together for us here at falls Points I just cannot express how very grateful i am for them this Holiday season. You know they say count your blessings..Well when I do I count them twice..Thank you Happy at the falls........Alice Hubbs and Richard Hoover  Happy Holidays To All",
        "owner_response": null
      },
      {
        "author": "Jules F.",
        "rating": 1,
        "review": "I tried calling the main office and left a voicemail message to question a charge from the property manager at Westridge Apartments Naomi wrongfully charged me on but no one seems to answer their phone at this main  Corporate office. I even left a voicemail for a Felicia to have at least someone return my call but no one ever called back. Very unprofessional business.",
        "owner_response": null
      },
      {
        "author": "Tireless Leader",
        "rating": 1,
        "review": "I called the given number to check the status of a payment, and Brenda, who answered the phone, seemed annoyed right off the bat. She had a terrible attitude throughout the conversation and hung up the phone while I was still talking. When I called back, she denied hanging up and refused to give me her full name. Terrible customer service. If you don't want to help people, you should find another job.",
        "owner_response": null
      },
      {
        "author": "Jose Guerrero",
        "rating": 1,
        "review": "This company does not respond. I have called every extension available and have been sent to voicemail each time. Ive left countless voicemails and have not been called back. This company is avoiding dealing with a lease they illegally terminated",
        "owner_response": {
          "text": "We appreciate your honest feedback, as we are always looking for ways to improve. Thank you for bringing this experience to our attention and would appreciate an opportunity to improve your experience with us. We do not have record of you leaving a voicemail. Please reach out to us at info@omcwa.com at your earliest convenience and we will promptly respond."
        }
      },
      {
        "author": "Meghan",
        "rating": 1,
        "review": "The walls are super thin and you can hear everything. They overcharge and try to nickel and dime you. The apartment was cheap but you get what you pay for and then dont get your damage deposit back ",
        "owner_response": {
          "text": "Hi Meghan. We are disappointed your experience was not more enjoyable. We are committed to addressing all resident concerns, and we wish we could have parted on better terms with you. Our resident experience is our number priority, and we seek to improve with every interaction. We wish you the best.  - Olympic Management Company"
        }
      },
      {
        "author": "S BLW",
        "rating": 5,
        "review": "Excellent management by Glenn at Scandia Knolls in Poulsbo. Always kind, always going above and beyond for his tenants. Highly recommend anywhere Glenn happens to be working. This man really does care about his tenants.",
        "owner_response": null
      },
      {
        "author": "Jason Shappee",
        "rating": 1,
        "review": "Would give 0 if possible. Unpleasant people to work with. Didn't return phone calls or emails and had problems with landlord since day one of renting. Would highly recommend finding somewhere else to rent from.",
        "owner_response": {
          "text": "Hi, Jason. We are deeply dismayed to hear this has been your experience. Quality communication is of the utmost importance to our team, so we are sorry to hear we've missed the mark regarding our level of service. Our team appreciates your feedback and would like to work with you in any way we can. Thank you and we hope to speak with you soon. - The Team at Olympic Management Company"
        }
      },
      {
        "author": "Latreya Sanders Starks",
        "rating": 1,
        "review": "Nancy was VERY rude to me over the phone. I was very surprised by the way she cut me off as I was talking and bluntly told me they would not be paying for anything before I could even finish my sentence!  The reason for my call was based on inquiry. To seek additional information and hopefully figure out what my options are. I hope you see this Nancy. You were very nasty over the phone, and I dont appreciate the service you provided. I felt like I was being scolded for asking a question. This was TERRIBLE service!",
        "owner_response": {
          "text": "Hi, Latreya. We are deeply dismayed to hear this has been your experience. Quality communication is of the utmost importance to our team, so we are sorry to hear we've missed the mark regarding our level of service. Our team appreciates your feedback and would like to work with you in any way we can. Thank you and we hope to speak with you soon. - Olympic Management Company Management"
        }
      },
      {
        "author": "Sunny Girl",
        "rating": 5,
        "review": "I've rented from 2 Olympic Management properties over the past 12 years. Nice communities, responsive staff, quality maintenance repairs. Highly recommend.",
        "owner_response": {
          "text": "Thank you for taking the time to briefly share with us that you have enjoyed the service from our management teams over the past 12 years! We greatly appreciate your recommendation and welcome you to reach out to us at any time if you were to ever need anything. Thanks again! - Olympic Management Company"
        }
      },
      {
        "author": "Blake Fulton",
        "rating": 5,
        "review": "Ive had nothing but a good experience with Olympic. Prompt response time and professional.  I would rent from them again",
        "owner_response": {
          "text": "We strive for 100% satisfaction, and it is great to see you have had such a positive experience. We appreciate your feedback and please do not hesitate to reach out if you ever need anything."
        }
      },
      {
        "author": "Gigiboobs 24@gmail.com Gigiboobs@gmail.com",
        "rating": 1,
        "review": "Move in charge 950 pet rent 300 utilities  150 then 2230 on top this is crazy back to California",
        "owner_response": {
          "text": "Thank you for taking the time to leave a review, as we are always looking for ways to improve. We are sorry to hear that the community you visited did not hit the price point you are looking for. Please see our website olympicmgmt.com to find nearly 100 different communities with a range of options and prices. If you need any assistance finding an apartment to rent, please email us at  info@omcwa.com and we will promptly respond."
        }
      },
      {
        "author": "Ed Vander Meulen",
        "rating": 5,
        "review": "I known this company for over 34 years.  They strive to serve well and take care of their customers and investors.   Residents have come to trust and expect fair and professional service.  Would'nt look anywhere else....",
        "owner_response": {
          "text": "Hi, Ed! Thank you for taking the time to acknowledge our team and their commitment to providing nothing but the best service and care. If there is anything we can do for you going forward, please be sure to let us know. Thanks again! - Olympic Management Company"
        }
      },
      {
        "author": "MustBe Dizz",
        "rating": 5,
        "review": "Great team, great people. Great company. I recommend them to anyone. If you have problems or concerns they address them in a timely fashion. Have lived and known them for couple years now..",
        "owner_response": null
      },
      {
        "author": "johnny gonyeau",
        "rating": 5,
        "review": "I just moved in to Scandia knolls and Glen was very helpful and nice the apartment was the perfect size and they help us and was very accommodation you could not ask for a better place and nicer people and staff",
        "owner_response": null
      },
      {
        "author": "Tiffany Walker",
        "rating": 1,
        "review": "Worst apartment rental management I have ever dealt with. Don't rent from Olympic at any of their properties.",
        "owner_response": {
          "text": "Move out photos show ripped up flooring and a hole in the bedroom door, amongst other issues. Please make arrangements to pay your remaining balance for damages by reaching out to the Leasing Office or sending us an email at info@omcwa.com."
        }
      },
      {
        "author": "CJ Do Werk",
        "rating": 1,
        "review": "These people do NOT return calls and don't take tenet complaints seriously. I've never dealt with a property management company with such bad communication.",
        "owner_response": {
          "text": "Cj, we take these reviews seriously and apologize for any issues you may have had trying to reach our office. All calls and any issues brought to our attention are valued and we will be sure to attend to each of them. When you are able, please try giving us another call and a team member will be sure to assist you. - Olympic Management Company"
        }
      },
      {
        "author": "Amanda Williams",
        "rating": 5,
        "review": "My application was quickly approved and when I move out my refund check was also quickly returned. No complaints",
        "owner_response": {
          "text": "Hi, Amanda! Thank you for briefly sharing with us how satisfied you were during both the application and the move out process! Thank you for your time working with us, and we wish you the best going forward. Thanks again! - Olympic Management Company"
        }
      },
      {
        "author": "Raquel Tania Khanoyan",
        "rating": 5,
        "review": "Great experience for my first apartment rental! The conditionals were clean and management was friendly and on point!",
        "owner_response": null
      },
      {
        "author": "Mizz Tizzy",
        "rating": 5,
        "review": "Great company. Great people. Great team. Highly recommend!.. check them out! Decent prices. Nicely renovated units. Onsite maintenance and onsite management. Always on top of things.",
        "owner_response": null
      },
      {
        "author": "patrick murray",
        "rating": 5,
        "review": "Couldnt be happier with Olympic management. All employees have been responsive, accommodating and respectful. Class act organization.",
        "owner_response": {
          "text": "Thanks so much for taking the time to share this short but sweet feedback! We're happy to hear that you had a great experience with us here at Olympic Management and hope to see you again; take care!"
        }
      },
      {
        "author": "Eddie Turner",
        "rating": 5,
        "review": "Marta is the ladie that were working with super nice ,we fell behind and they were willing to work with usgreat people the ladie at the front desk is kinda rude but seems harmless ",
        "owner_response": null
      },
      {
        "author": "Borui Wang",
        "rating": 1,
        "review": "I just wanna ask if I can rent a parking spot, been already a week, 10+ phone calls on four numbers and no one ever answered, including the \"emergency line\"",
        "owner_response": {
          "text": "We are more than happy to rent any resident a parking space at the property where they reside. We tried to reach out but do not have you registered in our system as a tenant. Please send us a message at info@omwa.com with your address and we will assist you."
        }
      },
      {
        "author": "CatScratchy",
        "rating": 1,
        "review": "My landlord is putting tenants' lives at risk and the company only takes complaints in writing. I pay over $1000 a month. Sounds like America!",
        "owner_response": null
      },
      {
        "author": "Alex Berman",
        "rating": 5,
        "review": "Great management and very professional in the way they do business. Would highly recommend!",
        "owner_response": {
          "text": "Thank you for taking the time to leave us a five-star review. We love hearing positive feedback about our community!"
        }
      },
      {
        "author": "Patti Mccormick",
        "rating": 5,
        "review": "I lived here for 7years it's a great place for low income apts.",
        "owner_response": {
          "text": "Thank you for the feedback Patti! We appreciate the five star review!"
        }
      },
      {
        "author": "Tyler Durden",
        "rating": 1,
        "review": "They have a very rude receptionist. Its only one woman that answers the phones but shes the rudest person Ive had to deal with in a long time.",
        "owner_response": {
          "text": "Hi, Tyler. We are disappointed in this characterization of our staff and community. We are committed to treating all residents and guests with the utmost respect and impeccable service. Wed like to work with you to improve your experience and hope to speak with you directly. Please reach out to us in the office at (253) 896-4100. Thank you. - Olympic Management Company"
        }
      },
      {
        "author": "JoAnn Rittel",
        "rating": 1,
        "review": "I am illegally locked out of my apartment via wa state law RCW 59.18.290",
        "owner_response": null
      },
      {
        "author": "SEAN DAWSON",
        "rating": 5,
        "review": "Great management friendly staff and very clean atmosphere",
        "owner_response": {
          "text": "Thank you for taking the time to leave us a review! We appreciate the feedback!"
        }
      },
      {
        "author": "Nikki Hope",
        "rating": 5,
        "review": "I Love the Sumner Squares Town Homes. Management are wonderful and helpful",
        "owner_response": null
      },
      {
        "author": "Jamie Griffin",
        "rating": 5,
        "review": "Amazing family oriented business that takes pride in quality service and professionalism.",
        "owner_response": {
          "text": "Thanks so much for taking the time to share this short but sweet feedback! We're happy to hear that you had a great experience with us."
        }
      },
      {
        "author": "F Cruz",
        "rating": 3,
        "review": "Decent initial customer service but need to work on follow through",
        "owner_response": null
      },
      {
        "author": "Joe Dick",
        "rating": 1,
        "review": "Absolute garbage. Does not maintain property.",
        "owner_response": {
          "text": "Please reach out to info@omcwa.com and explain to us how we can make things right. Thank you."
        }
      },
      {
        "author": "Haley Olson",
        "rating": 5,
        "review": "First year renting from them and its 10/10 experience!!",
        "owner_response": {
          "text": "Wow! We cannot thank you enough for your review and for taking the time to shed such a positive light on our team and the positive impact they have had on you and your time here! It has been our pleasure to have you with us for the past year. As always, we are here for you if you were to need anything going forward."
        }
      },
      {
        "author": "Nick Berman",
        "rating": 5,
        "review": "Great service, even better people!",
        "owner_response": {
          "text": "Thank you for taking the time to leave us a 5-star review. We love hearing positive feedback about our company!"
        }
      },
      {
        "author": "Rishabh Malhotra",
        "rating": 1,
        "review": "No buddy answers the call. I have been trying get in touch with them from pas two weeks. very irresponsible behavior.",
        "owner_response": null
      },
      {
        "author": "Grase And POWERz",
        "rating": 1,
        "review": "Very unprofessional. They practice unethical reporting.",
        "owner_response": null
      },
      {
        "author": "sweet T",
        "rating": 1,
        "review": "Very rude and unprofessional people that work for Olympic.",
        "owner_response": null
      },
      {
        "author": "Tonya Jones",
        "rating": 1,
        "review": "Never received a response from them",
        "owner_response": {
          "text": "We apologize for any issues you may have encountered. We want to be sure to better understand your concerns and assist in resolving them as best as we can. Please reach out to a team member over the phone and they will be sure to assist you. you can reach us at 253-896-4100."
        }
      },
      {
        "author": "Sean Nickerson",
        "rating": 1,
        "review": "Maintenance team are poor!!!",
        "owner_response": {
          "text": "We apologize any inconvenience as we are doing our best to meet all maintenance requests. At present we are undergoing significant renovations at the property including, new siding, new windows, new roofs, and interior improvements. Please contact the leasing office at your earliest convenience and we will address your concerns."
        }
      },
      {
        "author": "karen bilyeu",
        "rating": 5,
        "review": "Professional and supportive management",
        "owner_response": null
      },
      {
        "author": "Cheryl Murray",
        "rating": 1,
        "review": "Drove past this place",
        "owner_response": null
      },
      {
        "author": "Jason M",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Please reach out to info@omcwa.com and explain what we can do to help!"
        }
      },
      {
        "author": "P Logan",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "We do not have any record of your affiliation with the property i.e. tenant, prospective tenant, or other related party. It is likely that you have left this review in error. If you have any questions please email us at info@omcwa.com."
        }
      },
      {
        "author": "Sa M",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "We strive to exceed expectations so that all residents have an exceptional experience. Please let us know how we missed the mark with your experience by contacting the Leasing Office or emailing us at info@omcwa.com and we will see what we can do to make it right."
        }
      },
      {
        "author": "Tammy Carpenter",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "John Longoria",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Rombo TV",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Thank you for your feedback. We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us and let us know how we can do better."
        }
      },
      {
        "author": "Chad Neilson",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for taking the time to leave us a five star review!"
        }
      },
      {
        "author": "Jennifer Torquato",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Thank you for your feedback. We aim to provide an exceptional experience for all customers. We're sorry we may have missed the mark with your visit. Please reach out to us and let us know how we can do better."
        }
      },
      {
        "author": "WEEZER",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Thank you for your feedback. We aim to provide an exceptional experience for all of our customers. We're sorry we may have missed the mark with your visit. Please reach out to us at (253) 896-4100 to let us know how we can do better."
        }
      },
      {
        "author": "Ian VanHyning",
        "rating": 2,
        "review": "",
        "owner_response": {
          "text": "Ian, we are a little disappointed to not obtain the 5 stars that we are always working for. When you are able, please reach out to our office over the phone to discuss any concerns you may have. Thank you."
        }
      },
      {
        "author": "Ella",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Karen Sue Bilyeu",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Karen, thank you so much for the 5-star rating of our community! - Olympic Management Company"
        }
      },
      {
        "author": "Joshua",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi, Joshua. We are always looking to improve, and we hope to speak with you directly to see what we can do better. We can be reached at (253) 896-4100. Thank you. - The Team at Olympic Management Company"
        }
      },
      {
        "author": "Brant Powers",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Thank you for reaching out, Brant. Due to the nature of your concerns, we feel it would be best if we spoke with you directly. Please give us a call at (253) 896-4100 when you have the time. Thank you.  - The Team at Olympic Management Company"
        }
      },
      {
        "author": "Michael Acfalle",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "You're excellent, Michael! Thanks for the 5-star rating. Please let us know if there is anything we can do for you in the future. Thanks again! - Olympic Management Company Team"
        }
      },
      {
        "author": "DM Voss",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the all-star rating, DM! We really appreciate you taking the time to leave us a review. - Olympic Management Company Team"
        }
      },
      {
        "author": "Summer Jones",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Summer, we're very sorry to know that your experience has been so negatively impacted. If you have any outstanding questions or concerns, please do not hesitate to give us a call at 253-896-4100 when you have the time. Thank you. - Olympic Management Company"
        }
      },
      {
        "author": "Alyssa Burton",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Silverwood Park",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jillian Rose",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "shawna pierce",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Eastwynd Apartments",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "TJ",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 94,
  "adjusted_average_rating": 2.46,
  "distribution": {
    "1": 71,
    "2": 2,
    "3": 1,
    "4": 3,
    "5": 40
  },
  "summary": {
    "created_timestamp": 1739205545,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite the overwhelming number of negative reviews, some residents have cited positive experiences with Olympic Management. A handful of reviews mention quick response times and caring staff, highlighting specific instances where management accommodated tenant requests efficiently. One resident praised the management for maintenance services and appreciated the well-maintained environment. Additionally, another tenant enjoyed their stay for years, describing the complex as peaceful and the management as supportive and responsive to issues when they arose.</p><p>Another positive review emphasized the quiet and friendly neighborhood fostered by the management. Tenants appreciated the spacious living spaces and the extra amenities like a gym and reserved parking. A tenant lauded a particular community manager for going out of their way to address safety concerns regarding landscaping materials, showcasing an attentiveness to resident needs. Such instances serve as rare examples of the management's potential when operational at their best.</p></section><section id=\"great\"><h2>Great</h2><p>Despite its challenges, Olympic Management has received stellar reviews from certain tenants who experienced exceptional service from individual staff members or encountered consistently high maintenance standards. For instance, one resident noted seamless communication and excellent customer service throughout their stay, shedding light on the potential advantages of engaging with certain properties managed by Olympic. Another tenant described living in their complex as akin to dwelling in an oasis, thanks to the professional and efficient handling of property management tasks by team members who they found to be compassionate and dedicated.</p><p>One outstanding review highlighted the long-term satisfaction of a tenant who found their property well-maintained and enjoyed professional interactions with the management team, illustrating a markedly different experience from the prevailing negative reviews. Other positive testimonials emphasized the effective resolution of issues, responsiveness to tenant needs, and the effort to maintain a clean and safe living environment, which contributed to an enjoyable rental experience for a select number of residents.</p></section><section id=\"bad\"><h2>Bad</h2><p>Numerous reviews point to common issues such as poor communication, unreturned security deposits, and maintenance challenges that have plagued many tenants at different properties managed by Olympic. Some residents reported delayed maintenance responses, causing simple issues to escalate into larger problems. Others noted a lack of transparency in billing, leading to unexpected charges and fees, which soured their experience with the company. Several reviews also highlighted alleged incidents of mismanagement, from incorrect billing to inadequate handling of tenant concerns, contributing to tenant dissatisfaction.</p><p>Many residents expressed frustration with broken promises, citing instances where agreed solutions were either delayed or not implemented at all. This includes prolonged delays in repair work despite numerous follow-ups, which led to deteriorating living conditions for some tenants. Additionally, communication breakdowns, both at the property level and from corporate offices, compounded the issues, leaving tenants feeling neglected and undervalued. Such experiences reveal systemic issues within the company's operational processes, which need to be addressed to improve tenant satisfaction.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Some reviews paint a dire picture of living conditions and tenant treatment, describing experiences that involve legal disputes, severe maintenance neglect, and unethical business practices. Numerous tenants shared horror stories about mold issues being superficially addressed or entirely ignored, ultimately endangering their health and safety. A consistent complaint involves mismanagement related to security deposits; several tenants have alleged that their deposits were unfairly withheld or deductions were made with little justification. One reviewer tragically noted their experience with mold and mildew that went untreated even after multiple maintenance claims, leading to further property damage.</p><p>Particularly troubling are the allegations of illegal evictions and the withholding of legal documents needed to resolve disputes, which have driven some tenants to seek legal assistance. The impression left by these stories is one of a management company often acting in its own interests at the expense of tenant welfare, damaging trust and prompting public warnings against renting from their properties. Plagued by accusations of breach of contract and poor ethical standards in handling tenant funds, the credibility and reputation of the company have been severely affected among its clientele.</p></section>"
  }
}