{
  "name": "OMNI Property Management",
  "slug": "omni-property-management",
  "company_type": "company",
  "address": "909 Squalicum Way STE 107, Bellingham, WA 98225",
  "review_count": 68,
  "average_rating": 4.12,
  "reviews": {
    "google_reviews": [
      {
        "author": "Haven Skye",
        "rating": 5.0,
        "review": "Ive been renting from Omni since mid December and have found them to be a great company. I read the few low ratings sitting at the top of their most recent (as any property management is bound to have) but felt happy to move forward and see a lease through.\n\nIm happy I have chosen Omni and so grateful for their amazing staff. I have found Jessica to be so extremely helpful and friendly. Shes truly a gem and it makes me happy to be renting from this company. They are on top of their response time to questions and concerns and have always gotten back to me promptly.\n\nI recently had been having my difficulties with my autopay and was given grace to be refunded for late fees so kudos to their understanding!\n\nAs someone in service industry it can be daunting to rent from a property management and prove income, but Omni (specifically Jessica) worked with me to find ways to provide proof of income which took a heap of stress off the process.",
        "ownerResponse": {
          "text": "Haven, \nThank you so much for your kind words. Jessica is certainly a blessing to this office.  This can be a thankless job and I know she will be pleased to see her hard work appreciated.  We hope that our work will continue to support you with this rental journey. \nBest, \nLacey, OMNI Property Management"
        }
      },
      {
        "author": "Jennieyz B",
        "rating": 2.0,
        "review": "Great place to live.BUT they make sure Their office parking lot Is completely free of snow But their tenants parking lot Are not shoveled or plowed and completely forgotten about ! Snow and ice everywhere,parking is awful. People cant move their cars! Would be really nice if that could get taken care of!",
        "ownerResponse": {
          "text": "Jennieyz B, \nThere are often challenges during times of inclement weather. We do our best to address them in a timely manner and as vendors are available to do so. I am unsure which location you reside in but several of our properties have narrow driveways and/or parking lots which make it difficult to impossible to plow. Our priority in these situations is to address walkways and entry points first with hand shoveling and ice-melt application. When the snow and ice are only expected for 24-48 hours there is not always time or a need to go beyond basic remediation. \nIn contrast, the parking lot where our office is located has a large parking lot that is empty during non-business hours which allows for a plow to access it easily. (This is also a commercial complex of which we have no ownership or management of.)\nAs always your feedback is valuable and we appreciate your time in leaving this message. If you have further concerns we encourage you to reach out to us directly through our office. \nThank you, \nLacey, Owner and Operations Manager\nOMNI Property Management\n360-746-9613"
        }
      },
      {
        "author": "K T",
        "rating": 5.0,
        "review": "OMNI took over our lease a few years ago and we have been very pleased throughout. Everyone we have dealt with in the office has been professional, pleasant and responsive. We had some mildly serious maintenance concerns that were addressed immediately, even at times when finding a contractor is hard.\n\nI feel like OMNI is above board and doing their best to be fair to both tenants and landlords , as well as following fair housing regulations and practices. In general, it is a relief to have a property management company that is conscientious about their work and offers  consistently professional responses.",
        "ownerResponse": {
          "text": "KT, \nYour kind words are certainly a pleasure to receive. We hope that you will continue to enjoy your tenancy with us as much as we enjoy having great tenants like yourself. \nKind Regards, \nOMNI Property Management Team"
        }
      },
      {
        "author": "Corinne Hill-James",
        "rating": 1.0,
        "review": "I had an incredibly poor experience renting through Omni. Communication throughout our whole lease cycle was inconsistent and unprofessional. I loved the property I rented but if I hadn't been moving out of state I would have moved to a property managed by anyone else, without hesitation, and paid more to avoid the loopholes of an Omni leasing experience. I've rented from private landlords and other management companies in other areas and never felt as taken advantage of as I did by Omni. If you are considering renting with them I would highly advise you to consult the Washington State tenancy laws before you sign anything that will minimize your rights.",
        "ownerResponse": {
          "text": "Corinne, \nWe are truly sorry that you felt that we were not consistent in our communication with you.  We make every effort to explain the lease agreement and requirements in a clear way as we understand that the legal wording required can be confusing. I see we went back and forth multiple times by email/text during this transaction. Roommate switches and lease changes can add to the confusion with so many parties involved.  Our hope is that if you feel there is something more we could have done you would reach out to us directly to try and rectify the situation. However, I understand that there is not always a completely satisfactory solution for all parties involved.  All leases have costs involved for certain items and we make best efforts to remind tenants what is written in their signed lease agreement as soon as these situations come up. \nWe hope that you have found a more satisfying living arrangement for yourself.\nBest Wishes, \nLacey Lutjemeier, Operations Manager\nOMNI Property Management LLC"
        }
      },
      {
        "author": "Corey Havens",
        "rating": 1.0,
        "review": "When the owner of our rental home called to tell us our contract was being transferred to OMNI, she said they would contact us 'well in advance' before the transition. I waited three months and was never contacted. Finally I contacted OMNI days before rent was due to figure out how to pay them. I was told it was their busiest week of the year.\n\nWe were told rent would increase and six months before it happened they quoted us about a 20% increase. Then, two months before they doubled it to a 43% increase.\n\nWhen I asked if this was a mistake, I was told that 'the house could be rented for more if it were marketed today.'\n\nNice",
        "ownerResponse": {
          "text": "We appriciate your feedback and we certainly understand that the rent increases in this area have been more difficult for some more than others.  \nI hate to have this converstaion in a public forum but this is how you have choosen to proceed. \nAs you noted you were give 6 month's advanced notice of the increase and ample opportunity to discuss the situation, sign the offered renewal and lock in the rate offered or find other accomidations. After much work on the home and changes in city requirements you were give 2 additional months at the same very low rate. We then again negotiated the offer for a discount for another 3 months. Even currently your rent is several hundred dollars lower than market rent. \nWhat many renters do not understand is that the cost of ownership has increased greatly over the past several years in Tax increases, Insruance increases and the cost of labor and materials to make repairs.  Taxes alone have increase around 30% over the past 3 years. And though this is not the case for you, many owners also lost month's of unrecoverable rent during Covid. Some even lost their property because they were unable to pay their mortgages. \nWe understand that rent increases can be challenging, and we want to assure you that we have made an effort to keep this adjustment reasonable. We value our tenants, and we are committed to providing them with a well-maintained and comfortable living environment.\nPlease feel free to contact us directly to continue this conversation in a private arena. \nSincerely,\nLacey Lutjemeier, \nOwner, Operation Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Arielle Mehl",
        "rating": 5.0,
        "review": "I have been renting through OMNI for 10 months and it has been the most positive renting experience I have had! When we were looking for a new rental I was hesitant to go through another property management company due to some bad experiences we had with a different company in the past, but now I can say I wouldn't want to rent through anyone else! They have fixed all maintenance repairs quickly and have been very pleasant to work with. Everyone is kind and professional and the rental was in great shape when we moved in. As a renter, I would recommend working with OMNI Property Management.",
        "ownerResponse": {
          "text": "Arielle,\nWe are sorry to hear that you have had bad experiences with management in the past and we will continue to do our best to care for you and your family for as long as you are with us.\n\nLacey Lutjemeier\nOwner, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Jenyfer Lindahl",
        "rating": 5.0,
        "review": "Signing up with this company was one of the smartest business decisions I made.\n\nLiving long distance it's difficult to manage my property, so I require a company that does it all.\n\nI don't worry about a thing:  Lacey and her crew take care of every detail professionally and promptly.\n\nTheir services are ridiculously cheap, especially for the peace of mind I have.\n\nVery much recommend this company!",
        "ownerResponse": null
      },
      {
        "author": "J S",
        "rating": 5.0,
        "review": "I have been very happy as a home owner that hired Omni Property Management to manage my rental for two years.\nLacey and the team of ladies are super responsive and professional.",
        "ownerResponse": {
          "text": "Thank you so much for your kind words. It was an absolute pleasure working with you and we wish the best of luck on your next adventure. \n-Lacey"
        }
      },
      {
        "author": "Jan Humphrey",
        "rating": 5.0,
        "review": "As property owners we have been dealing with OMNI Property Mgt. for 8 years. Lacey\nand the staff are always quick to assist us or our tenants with any issues. Never have to ask a second time for results. Lacey is professional and polite and always ready to figure out the best solutions. We receive our income from our rental on time and are always made aware of any problems. Lacey has top notch contacts whi can provide maintenance or repairs in a timely manner.\nWe are happy to continue our relationship with Lacey and OMNI far into the future.\nThanks Lacey and all the OMNI staff!\nJan Humphrey",
        "ownerResponse": null
      },
      {
        "author": "Paula Crutchley",
        "rating": 5.0,
        "review": "We have a rental in Blaine and Lacey and her team helped us evict the tenants.  Lacey and her team were AMAZING throughout the eviction process and went above and beyond while we were remodeling the property; I mean above and beyond.   Once the property was put on the market, they found wonderful tenants who are taking care of our property as if it was their own.  I only wish we had found OMNI Property Management years ago.",
        "ownerResponse": {
          "text": "Paula,\nYou are always a pleasure to work with and we are happy to continue to do what it takes to care for you and your property.\n\nLacey Lutjemeier\nOwner, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Bill Lilleness",
        "rating": 5.0,
        "review": "Lacey and Omni Property Management have done an outstanding job of managing our property for over 3 years. Being a \"remote\" building owner that rarely visits the property, the level of trust and communication expectations are high.\n\nThey assumed the management responsibilities from a previous company and increased communications and correspondence.  A wonderful improvement! I also have some property in Seattle that I use with other PM companies to which Omni outperforms them also - too bad they are not in Seattle!",
        "ownerResponse": null
      },
      {
        "author": "Janel Warrington",
        "rating": 5.0,
        "review": "OMNI recently took over managing the building I live in and they have been nothing but responsive and professional. I've had a few minor maintenance needs and they were fixed within a few days. By comparison to other property management companies in the area, they are flexible & communicative and I've enjoyed living in a building managed by them.",
        "ownerResponse": null
      },
      {
        "author": "DaddyKrabs",
        "rating": 1.0,
        "review": "Im so tired of seeing your overpriced listings in my community. No one wants you here. All you do is nickel and dime people to death.",
        "ownerResponse": {
          "text": "You clearly know nothing about our company and make these comments purely for your self-importance. It is far too easy to make one-lined comments on the internet but finding real solutions is far more time-consuming. We are always open to suggestions from the community for a way to better serve.  I implore you to offer suggestions and thoughts on change as opposed to negative comments that do nothing to further the growing housing problems. \nI hope the rest of your week is joyful and accomplished. \n\nLacey, OMNI Property Management. "
        }
      },
      {
        "author": "Carmen Williams",
        "rating": 5.0,
        "review": "Working with Lacey at OMNI Property Management has been a delightful, stress free experience! She is professional, straightforward, and easy to communicate with. We look forward to working with her for many years to come and highly recommend OMNI Property Management.",
        "ownerResponse": {
          "text": "Carmen,\nThank you for taking the time to leave this lovely review! We hope you are enjoying your home and we look forward to working with you as well.\n\nThanks,\nLacey Lutjemeier\nOperations & Property Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Ben Moeling",
        "rating": 5.0,
        "review": "From an owner's perspective, Omni has been excellent. They managed a quick and effective marketing effort and found good tenants. They seem equally concerned about our tenants' well-being and comfort, and helped us act fast to solve a furnace problem. They provided good, reasonable advice on rental price point. I anticipate a long relationship with Omni.",
        "ownerResponse": null
      },
      {
        "author": "Debora Halbert",
        "rating": 5.0,
        "review": "The people at OMNI have been amazing and always have the expertise and people on hand to help when something goes wrong with our property.  Their professional staff is responsive and has made the management process stress free for us. They go above and beyond, especially during the last year when COVID made everything so difficult.  The best decision we made was entrusting our property to OMNI.",
        "ownerResponse": {
          "text": "Debora\nWe love working with you and we look forward to continuing to do all we can to take care of you and your property!\nLacey Lutjemeier\nOwner, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "a lopez",
        "rating": 2.0,
        "review": "I called OMNI to inquire about their properties and processes but Lacey was less than helpful. She seemed short and rude.  No customer service whatsoever, straight to nonsense.  I had to repeatedly rephrase the question for her to understand what I'm asking. I wanted to know more about OMNI minimum qualifications but got no where.  We definitely did not hit it off, so I thought I should speak to someone else, but guess what?  Lacey is the Property Manager, making her the face of the company.  Not a good impression, so talking to someone else would do me no good.  I told Lacey that we were not communicating effectively and therefore it's best to stop here.  To her response; \"okay and bye\".   There you have it, OMNI best!",
        "ownerResponse": {
          "text": "Ms. Lopez,\nI apologize that you were not satisfied with your interaction with myself and our company today. I was having a hard time hearing your questions as you were asking them due to our connection which is why I was asking them to be repeated. I also wanted to clarify the questions being asked so that I could properly answer them.  I believe the other miss understanding may have stemmed from, based on what you told me, you are relocating here from out of state and things run a bit differently in WA.\nI would be happy to try and assist you in anyway we can if you would like to phone back.\n\nThank you,\nLacey Lutjemeier,\nOperations Manager\nOMNI Property Management LLC."
        }
      },
      {
        "author": "Kevin Coggan",
        "rating": 5.0,
        "review": "We have been renters with OMNI for two years and they have always been professional, courteous and responsive. Fortunately, there have only been a few minor problems with our rental unit (mostly plumbing). They were fixed in a timely manner and everyone involved was friendly.\n\nPrior to this rental and OMNI, we were in a new unit with another Mgt. Co., and electrical problems, broken windows (from settling), swarms of ants, refuse, etc. were very slowly or never fixed.",
        "ownerResponse": {
          "text": "We are sorry to hear you had such a bad previous experience and we hope that we will continue to fulfill your expectations and beyond. Thank you!"
        }
      },
      {
        "author": "Kelley Jasper",
        "rating": 5.0,
        "review": "Between my roommate and I, we've experienced 5, perhaps 6 different Bellingham property management companies - more if you count when they changed hands - in 10 years.\nWe lucked into Omni several years ago, and have decided we won't rent from anyone else.\nOmni's staff of property specialists and maintenance people are top-notch. They do what they say they will, when they say they will. Very fast action if appropriate. Always pleasant folks who fix stuff. No surprises, I get an invoice each month and I pay the rent easily via the electronic portal.\nI count on Omni to have quality properties, an easy to understand rental agreement and the perfect place for our next move.\nI won't rent it unless Omni is managing it. 5+ stars.",
        "ownerResponse": {
          "text": "Kelley, it is always a pleasure to have long term clients like yourself and hope to continue on for many more years. Cheers!"
        }
      },
      {
        "author": "Luke LeViere",
        "rating": 5.0,
        "review": "We've rented with Omni for over two years now. It has always been simple and easy communicating with Lacey. When there were problems with the heater they sent someone out right away to fix the problem. They've also been on top of minor things like trimming an overgrown bush and fixing the blinds.",
        "ownerResponse": null
      },
      {
        "author": "joseph tedesco",
        "rating": 5.0,
        "review": "Omni has been managing my rental home for almost three years. Whenever I have a repair problem, Lacey has gotten people to the house quickly and the problems have been satisfactorily resolved. I'm thinking about purchasing another home in Bellingham, and if I do, I would have Omni manage it.",
        "ownerResponse": {
          "text": "Joe, thank you for your kind review. It is easy to do great work when you have great clients. Cheers!"
        }
      },
      {
        "author": "Coley Armijo",
        "rating": 1.0,
        "review": "Dealing with Omni was the absolute worse experience I have ever had renting. Lacy is a nightmare to deal with. Upon moving in we noticed the thermostats did not work, which means if you turned it on to a temperature the apartment would just continue to heat and would never shut off. We put in a work order to have them fixed, not only did they not fix it but the maintenance man told my girlfriend to Google how heat works. Lacy then took it upon herself to come to the unit and turn them on to prove a point. Basically we had on off switches for thermostats, on top of that they charged us $55 for the maintenance response.\nFast forward to month three of the lease, we paid rent on their website (the same site and card number that we had used the two months prior), Lacy calls us half way through the month to tell us that there was a $150 late fee for rent not being paid. Lacy could not give me a reason why it did not go through. She basically told me I had to pay $150 for a glitch in their system. After arguing with her for 20 minutes she finally told me to bring in a paper check that day only to wave the fee. We moved and are now seeing the charges for deposit.\nWe were charged 17 hours of labor for the unit Cleanup which is ridiculous, the pictures she sent us of our \"excessively dirty\" were straight up laughable. It was just some sweeping that needed to be done. So that means we don't get a deposit back. Ridiculous.\nI am extremely happy to be done with this property management company. Anyone thinking of renting with them I would just say beware.\n\nAlso, one of the 5 star rating is from a current employee, so that's misguiding and unprofessional.",
        "ownerResponse": {
          "text": "Thank you for sharing your feedback. Were sorry your experience didnt match your expectations. It was an uncommon instance and we will strive to do better in the future.\n\nPlease feel free to reach out to me directly with any further comments, concerns, or suggestions you wish to share. We would love for you to give us another chance, but understand that not all business relationships are able to be resolved in a way that feels positive for all parties involved. We truly wish you the best of luck and happiness in your endeavors.\nLacey Lutjemeier\nOperations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Russell Chan",
        "rating": 5.0,
        "review": "I own property at a condominium in Birch Bay and a house in Lynden.  Although you aren't supposed to discriminate when it comes to housing, I also feel that you don't have to tolerate the bullsh!t from bad tenants wrecking a place.  I talked with Lacey L from Omni Property Management and explained that I wanted a win-win situation.  She was able to narrow down tenants who had responsible and courteous lifestyles (OMG, that actually exists!) and we have not had any problems.  Of course, I also did my part by checking out the units and making sure things were clean, working, and passed inspection.  I would also get my hands dirty and scrub, vacuum, and clean. Still...I might be able to change a lightbulb, but I'm no handyman.  Also, I've heard horror stories about tenants behaving badly, not paying rent, and then claiming they are the poor, helpless victims against the Evil Landlord (Lordy...grow up and save that drama for your next Oscar).  So, I don't have time for that.  I mean, really...how hard is it to pay one's rent on time, keep the noise down, and not demolish a place?  My friends and I were able to do these basics growing up.  Then again, I was an Eagle Scout, so perhaps my values are slightly different.\nAnyway,  thank you, Lacey and Omni Property Management, for making sure that I don't have to put up with that baggage.  I've got more important and fun things to do.  Lacey has always been available when I've phoned or emailed, and has returned my phone calls if she could not pick up right away.  It's been 5 years so far and no complaints from me or my tenants.",
        "ownerResponse": null
      },
      {
        "author": "robert warren",
        "rating": 5.0,
        "review": "Omni property recently took over the management of my property in Bellingham and soon after my tenant of many years relocated for work. In less than 10 days Lacey had found me new and even better tenants and took care of all the details. Since Im currently living 3 thousand miles away from this property its nice to know its in good hands and I dont have to worry about anything. I look forward to a long and prosperous future with this company.",
        "ownerResponse": {
          "text": "Bob,\nThank you so much for such a lovely recommendation. We love working with you and look forward to many years more.\n\nThank you,\nLacey Lutjemeier\nOperations & Property Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Linda Tolin",
        "rating": 5.0,
        "review": "Omni Property management has listed and has been managing our rental for a short time but so far everything has been clear and professional. They have gotten back to me with questions and updates quickly. They were helpful is getting blinds into our rental as it is a new townhome so they didn't have any currently installed. We would recommend this company for other home owners or renters.     Linda and Robert",
        "ownerResponse": {
          "text": "Linda,\nYour kind words are appreciated and we look forward to continuing to work hard for all our great clients like you!\nLacey Lutjemeier\nOwner, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Drew Gorman",
        "rating": 5.0,
        "review": "Omni Property Management has been a great company to rent from. They are responsive to any questions and care/maintenance that has been needed. I look forward to a long relationship with you guys in staying at my rental.",
        "ownerResponse": {
          "text": "Thank you for your kind words. We hope to have more wonderful tenants like yourself."
        }
      },
      {
        "author": "cantcopythis",
        "rating": 5.0,
        "review": "Omni has been extremely patient with us as first time landlords- explaining the ins and outs renting our house. They have take care of any issues that have arisen quickly and professionally. Highly recommended.",
        "ownerResponse": {
          "text": "Thank you for your kind review."
        }
      },
      {
        "author": "Falicia Schallenberger",
        "rating": 1.0,
        "review": "They were horrible to communicate with, for some reason she would only reply to my husband when I was the one messaging her. Also, the deposit was very high. And when we wanted to clean the carpets before we left they said we couldnt, then they went and used all 1500 dollars just for that and we got nothing back. Me and my husband were not dirty. And when I confronted her about the place not being clean, and that they basically stole from us, she left me on seen. Now waiting to see if she will answer my husband like usual. i Highly DO Not recommend!!",
        "ownerResponse": {
          "text": "Falicia,\nI am sorry to hear that you had a bad experience, but I believe it may have been with a different OMNI Property Management. I do not have any record of you in our system. We are located in Bellingham WA. Also as a woman own and run company I can assure that we respect women and do not have any disillusionment about men being superior or the \"Head of the house hold.\" I hope that you will have better luck with rentals in the future.\nBest of Luck,\nLacey Lutjemeier\nOwner/Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Sheri Rego",
        "rating": 5.0,
        "review": "Lacey is very professional and efficient.  She gave us choices as a landlord that other property management companies did not.  She listens to concerns and ideas, and she always responds promptly to questions and comments.",
        "ownerResponse": {
          "text": "Sheri,\nThank you for taking the time to leave us a review! You are always such a delight and I am happy to be on this rental journey with you.\n\nBest,\nLacey Lutjemeier\nOperations & Property Manager\nOMNI Property Management"
        }
      },
      {
        "author": "L Hanson",
        "rating": 5.0,
        "review": "Excellent property managers in Bellingham!!!\n\nThe property is well maintained and the few questions and very small problems we experienced were resolved quickly by the local Bellingham office.\n\nEveryone is the office is flexible, professional and courteous.",
        "ownerResponse": {
          "text": "Thank you so much for your kind words. We look forward to continuing to work with great clients like you!\nLacey Lutjemeier\nOwner, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "TIM James",
        "rating": 5.0,
        "review": "Omni has been very easy to work with and has allowed me to rent my property worry free. Lacey at Omni has had great communication and been able to find great tenants.",
        "ownerResponse": {
          "text": "We appreciate your kind words. Great communication from our clients is always helpful and you have been no exception. Thank you!"
        }
      },
      {
        "author": "Jenny Tang",
        "rating": 5.0,
        "review": "Im a property owner and have great experience with Omni management so far. My previous tenants moved out due to COVID and they were able to find another tenant within a month without me losing rent income. I had a nightmare experience with Windermere in the past and this is much better and I recommend it.",
        "ownerResponse": null
      },
      {
        "author": "Susan Plumb",
        "rating": 5.0,
        "review": "We have had an excellent experience with Lacey at OMNI Property Management. She works well with renters and is very professional.  from is! Bob and Susan ",
        "ownerResponse": {
          "text": "Bob & Susan,\nYou are a blessing to our company and we look forward to many great years to come. THANK YOU!\n\nLacey Lutjemeier\nOperations & Property Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Kristen Swinford",
        "rating": 5.0,
        "review": "I have been very pleased with OMNI Property Management. They have been very easy to work with and responded to my requests almost immediately. I hope to continue with them for years to come.",
        "ownerResponse": {
          "text": "Kristen,\nThank you for such a lovely compliment! We enjoy working with you as well.\n\nLacey Lutjemeier,\nProperty and Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Kayla Lambert",
        "rating": 5.0,
        "review": "Great management company to work with.  I was a first time renter but they made the process super easy and were very friendly, especially while I was trying to find a place during the peak of the pandemic.  Thoughourghly enjoyed my year with them!!  I'd highly recommend them for any future renters  ",
        "ownerResponse": {
          "text": "Kayla, thank you for taking the time to leave such kind word. We wish you all the best in your current endeavors and hope you will come see us again if you need a rental in the Whatcom County area! Thanks!"
        }
      },
      {
        "author": "Yep Thats Right",
        "rating": 1.0,
        "review": "These guys rarely know what is going in in their own office and delight in screwing tenants over. If your looking to waste your time give these guys a call!",
        "ownerResponse": {
          "text": "We do apologize that you felt we were unable to address your concern proficiently. I hope that you will afford us the opportunity to remedy whatever situation you find yourself in. If we are beyond the time of helping you I hope that you were able to find a solution that was satisfactory. Please feel free to reach out to me directly if there is some way I can help. \nLacey Lutjemeier\nOwner/Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Kyle Rickards",
        "rating": 5.0,
        "review": "It has been a breath of fresh air working with a property management company that has integrity. The team at Omni has been responsive and communicated clearly in all of our interactions.",
        "ownerResponse": {
          "text": "Thank you so much for your kind words! We love helping all our clients and look forward to work with you further."
        }
      },
      {
        "author": "Glenn Josund",
        "rating": 5.0,
        "review": "As an absentee landlord Ive been very happy with Omni Property Managements services. I appreciate their diligence and professionalism. Highly recommended.",
        "ownerResponse": null
      },
      {
        "author": "Marta G",
        "rating": 5.0,
        "review": "As property owners we are impressed with OMNI Property Management's top-notch professionalism and courtesy.  We are also glad to know our tenants are receiving the same service.",
        "ownerResponse": null
      },
      {
        "author": "Don Bakkensen",
        "rating": 5.0,
        "review": "The rental market is tough for finding a place with good neighbors.  I was not only treated with the outmost respect I was put in a building with great neighbors at a decent rent.  So far I have had a good response for any issues I have had.",
        "ownerResponse": null
      },
      {
        "author": "addie moa",
        "rating": 3.0,
        "review": "It was a complicated situation but it was okay.. they handled our landlords pretty well. This comment wasn't anything bad against omni. And that is why I stated it was complicated.. im sorry you feel it was unfair.",
        "ownerResponse": {
          "text": "Addie, \nA review of our company where the issues predated our involvement seems a bit unfair. We did our best to handle the difficult situation that we came in on as professionally as possible. \nWe wish you the best of luck in your future endeavors. \n\nOMNI Property Management"
        }
      },
      {
        "author": "Brady Bishopp",
        "rating": 5.0,
        "review": "Omni has a prompt and courteous dealing with property tenants.  Lacey has gone the extra mile to resolve any outstanding issues.",
        "ownerResponse": {
          "text": "Brady,\n\nThank you for your support and we hope to continue our great working relationship with you and all our tenants.\n\nLacey Lutjemeier\nOperations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Betty Adam-Diaz",
        "rating": 4.0,
        "review": "Very Good Management Company.  Always ready to address concerns and problems.  Courteous, compassionate, wanting what's best for the renters and owners.  Thank you.",
        "ownerResponse": {
          "text": "Thank you Betty! You are a great tenant and we look forward to a long rental relationship with you!\n\nLacey Lutjemeier\nOperations & Property Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Ryan Jungquist",
        "rating": 5.0,
        "review": "Omni property management is awesome. Very easy to deal with and very professional. Always there to help. I would recommend them to anyone.",
        "ownerResponse": {
          "text": "Ryan,\nThank you for your review and we look forward to continuing to work with you.\n\nLacey Lutjemeier\nProperty & Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Albert Aslanyan",
        "rating": 5.0,
        "review": "Friendly representative showed us a nice house in Blaine.",
        "ownerResponse": null
      },
      {
        "author": "Katie Bechkowiak",
        "rating": 5.0,
        "review": "I don't have a single complaint about working with OMNI...the people at OMNI that I've interacted with have been friendly, patient and treated me with respect.",
        "ownerResponse": {
          "text": "Katie,\nThank you so much for your kind words. We look forward to continuing to work with great clients like you!\nLacey Lutjemeier\nOwner, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Kyle McCrain",
        "rating": 5.0,
        "review": "Omni has been a great company to rent from and I look forward to releasing with them this following year.",
        "ownerResponse": null
      },
      {
        "author": "Mehak Gill",
        "rating": 5.0,
        "review": "Always helping all the time....when ever we had issues with our home always helping  right a way..Thank u for always be there for us....u gys are so amazing  ",
        "ownerResponse": {
          "text": "Thank you so much. We enjoy working with you as well. \nBest wishes, \nOMNI Property Management"
        }
      },
      {
        "author": "Iggy MacIsaef",
        "rating": 4.0,
        "review": "Haven't had to much interaction yet but all interaction so far have been wonderful. Friendly and helpful staff.",
        "ownerResponse": {
          "text": "We look forward to getting to know you and your Association better.\nHappy New Year,\nOMNI Property Management"
        }
      },
      {
        "author": "Jamey Smith",
        "rating": 5.0,
        "review": "Very friendly people. Always helpful and courteous.",
        "ownerResponse": null
      },
      {
        "author": "Pros Rv Repair",
        "rating": 5.0,
        "review": "Its been a pleasure working with Lacey at Omni Management.   Its been a great experience.  Thank you.....",
        "ownerResponse": {
          "text": "You are a pleasure to work with as well and I hope you are enjoying your home! Thank you for taking the time to leave a review.\n\nLacey Lutjemeier\nOperations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Cole Dumbass De Zarn",
        "rating": 1.0,
        "review": "Horrible Customer service. Not easy to deal with & very unprofessional.",
        "ownerResponse": {
          "text": "Cole, It seems unprofessional to quit a job and then 3 years later leave a bad review for a company that you never rented from. I hope your life choices have brought you to a better employment situation that suits your professional aspirations. We truly wish you the best of luck. \n~Lacey Lutjemeier, Operations Manager\nOMNI Property Management"
        }
      },
      {
        "author": "Jennifer Feagles",
        "rating": 5.0,
        "review": "Lacey has been wonderful, easy to reach and professional.",
        "ownerResponse": {
          "text": "Jennifer,\nThank you for your kind words! We enjoy working with you.\n\nLacey Lutjemeier\nOMNI Property Management"
        }
      },
      {
        "author": "Nolan Stidham",
        "rating": 5.0,
        "review": "They quickly respond to maintenance requests",
        "ownerResponse": {
          "text": "Thanks Nolan. Always great to have wonderful and attentive tenants. "
        }
      },
      {
        "author": "Trudi Hess",
        "rating": 5.0,
        "review": "They are always on top of things!",
        "ownerResponse": {
          "text": "Thanks Trudi!"
        }
      },
      {
        "author": "Jessi M",
        "rating": 5.0,
        "review": "Always friendly and helpful.",
        "ownerResponse": null
      },
      {
        "author": "Mindy Mathis",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sasa Lin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Katelyn Ralston-Gerhardt",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tiffany Lynn",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "John Jones",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Michael Pollard",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joshua Ross",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Anon C.",
        "rating": 1,
        "review": "Quite possibly the worst management staff i have seen, yet.  Submitted an app and was told i was declined because they couldnt verify my business whis has been registered in Washington for 13yrs. Income verified over $8k/mo good references, zero late payments ever-  i habe never been denied and was confused, however after such a poor response, i have found it to be a blessing- professionals should be able and expected to locate a business at very least.",
        "ownerResponse": {
          "text": "We are sorry that you do not agree with our interpretation of the information submitted to us. I too do not agree with the information you have presented here. We do our best to evaluate the information presented and unfortunately, not all applications meet our qualifications. However, if an error was made and a correction and re-evaluation needs to be completed we are happy to do so.  Please feel free to reach out to our office and we will do our best to assist you in this matter. \nThank you, \nOMNI Property Management"
        }
      },
      {
        "author": "Christophe C.",
        "rating": 1,
        "review": "This company removed my google review. I will instead post it here since they are trying to silence me. \n\nI have text proof from an abusive, threatening, & insulting tenant in a condo unit that I legally own, that this company has been slandering me behind my back - which has also caused issues with this problem tenant becoming emboldened to think he can act like he owns my property and break contractual agreement while citing that the property management is in agreement that I am a \"problem\" (but how, as an owner of the condo, I never broke any rules and always paid HOA fees and never did anything for them to have a good reason to slander me?) is the gist of it. \n\nTo the point this problem tenant's threatening interactions with me lead me to believe I may need to contact police when going to inspect my own property. And I have already contacted Bellingham police.\n\nCompletely unprofessional and could be interpreted in court of law as committing slander/libel against me when interacting with my tenants - on my own legally owned property, and adversely affecting my ability to manage tenant living on my property that I legally own according to state and USA federal law.\n\nAnd.... it seems they pay google to get rid of negative reviews and artificially curate, or else why was my google review removed?",
        "ownerResponse": {
          "text": "It is unfortunate that this is the impression you perceived from the interactions you have had with our company.   We certainly have not conducted business in the way you have described. As we represent the Association Board in this situation and not you as the owner we do not have direct knowledge of your tenant relations.  Our company and the Board Association we represent have not had any such interactions with you or your tenant as you described. As we did not represent you in any way it is unclear what may have transpired between you and your tenant. We hope that this situation has been resolved and a more favorable tenant has been acquired by you.  We wish you the best of luck and look forward to continuing to assist you in the capacity of Association Manager."
        }
      },
      {
        "author": "Kevin S.",
        "rating": 5,
        "review": "Omni helped me out a lot when I first moved to Bellingham in July 2020. They provided me with a solid, affordable rental with minimal hassle, which is far from the experiences I had with other property management agencies who jerked me around and one of which even stole money from me. Omni, on the other hand, conducted themselves with integrity and were very easy to work with for the duration of my lease. When something needed to be fixed, they got it fixed. If there was some sort of miscommunication, they did not hesitate to clear it up. They were always very kind with me, and when I moved out, I received my entire security deposit back; apparently this is rare among Bellingham rental agencies, but I wouldn't know because I've only ever rented from Omni and they were awesome. If you are an honest, respectful person, they will provide those same qualities in return. Don't hesitate to reach out to them if you need a place to rent!",
        "ownerResponse": null
      },
      {
        "author": "Kyle L.",
        "rating": 1,
        "review": "OMNI declined rental application based on arbitrary requirements. Don't expect to be treated with respect or for the company to follow rental requirements when deciding to rent out a unit. According to the owners we were not the \"right\" tenant for the place and the owners just didn't like us. I wish I would have gotten to talk to the manager Lacey, because apparently she is the person to talk to but I was given the run around by Katy.",
        "ownerResponse": {
          "text": "Thank you for the feedback. It is unfortunate that you had such an unpleasant interaction with our company and if there is anything specific we can do to make any future interactions more pleasant I hope that you will reach out to us directly. I assure you that we follow all state and federal guidelines when reviewing applications and unfortunately in this competitive market we are unable to place everyone in the unit they desire. Thank you!"
        }
      },
      {
        "author": "Mark M.",
        "rating": 4,
        "review": "The ladies and Omni are very polite and helpful. They are following up on questions and the requests we have asked of them, it is night and day from our previous management company! THANK YOU!",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 61,
  "adjusted_average_rating": 4.16,
  "summary": "<article>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>This article is a summary generated by ChatGPT and intended as a tool to aid individuals in finding a property management company or rental property. It synthesizes user reviews into a well-balanced overview of OMNI Property Management, highlighting both positive and negative aspects that customers have experienced. Please note that this article doesn't include all possible reviews due to condensation for brevity, and personal experiences with the company may vary.</p>  </section>  <section>    <heading>      <h2>Good</h2>    </heading>    <p>Many customers have reported satisfaction with OMNI Property Management's staff, citing their professionalism and responsiveness. Tenants have expressed gratitude for the helpfulness of the management, especially when dealing with maintenance requests. Speedy responses to problems and a clear concern for tenant and owner welfare were frequently mentioned. OMNI’s ability to resolve maintenance concerns promptly, even during challenging times when contractor availability was scarce, has been a source of relief for several tenants.</p>    <p>Landlords and property owners have praised OMNI for its superb management services. The company has been commended for taking care of every detail, allowing property owners to have peace of mind, especially those living at a considerable distance from their properties. Homeowners have felt reassured by OMNI's professionalism and quick assistance on issues. The proactive approach to management and consistent on-time delivery of rental incomes was also appreciated.</p>  </section>  <section>    <heading>      <h2>Great</h2>    </heading>    <p>Among the compliments, customer reviews often highlighted individual staff members for their contribution. For example, Jessica was noted for her exceptional service, demonstrating the company's dedication to hiring staff who truly care about clients' experiences. Furthermore, the company has been responsive to reviews and customer feedback, indicating they value their customers' input and are willing to engage with and address any concerns raised publicly.</p>    <p>From a business standpoint, some property owners regarded hiring OMNI as one of the best business decisions they made, applauding the company for its affordability and the comprehensive attention given to their properties. The quick turnaround between tenants and the securing of reliable and responsible residents have also been points of high praise, helping property owners to minimize loss of income and maintain their properties well.</p>  </section>  <section>    <heading>      <h2>Bad</h2>    </heading>    <p>Unfortunately, not all experiences with OMNI Property Management have been positive. Some users have encountered difficulties, particularly with communication, finding it inconsistent and unprofessional at times. This has resulted in frustrations and left certain tenants feeling taken advantage of or inclined to move elsewhere. Additionally, specific concerns related to tenant rights and proper understanding of lease documents have been raised, with suggestions to consult state tenancy laws before signing agreements with OMNI.</p>    <p>There were also mentions of dissatisfaction with the handling of maintenance, specifically snow removal during the winter. The perceived neglect of tenant parking lots, in contrast to the well-maintained office parking, led to discontent about the company's prioritization. Such incidents have stirred up feelings of neglect among the tenants, who expected the company to apply similar standards of care to all managed properties.</p>  </section>  <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>Some blistering reviews characterized OMNI as negligent in their duties, with reports of rudeness and unprofessionalism from staff, including from higher levels of management. These negative experiences caused some reviewers to caution others against renting through OMNI, citing their own bitter experiences with the company. Furthermore, one tenant encountered a significant rent increase with what was deemed an unsympathetic response from the management when questioned.</p>    <p>Issues with handling security deposits have also emerged as a contentious point, with accusations of unfair charges being levied against former tenants. These charges, described as excessive by some, have led to disputes and profound dissatisfaction with OMNI's management practices. The tensions have been exacerbated by accounts of one-sided communication, with responses being provided selectively, contributing to an overall perception of unaccountability and lack of empathy from the management.</p>  </section></article>"
}