{
  "name": "Optimus Property Solutions",
  "slug": "optimus-property-solutions",
  "company_type": "Company",
  "address": "5711 Vista Dr Ferndale, WA 98248",
  "review_count": 48,
  "average_rating": 3.1,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Magdalena M.",
        "rating": 1,
        "review": "Worst property management company. We left the place we rented spotless and they withheld upwards of $500 from us. We were only in the place one year and were assigned a new property manager halfway through the year who never saw the property. I asked for an itemized list of what the costs were and they would not provide. Aside from their unprofessional manner they handled the situation, there was never a walkthrough done with us before or after we left. Would definitely not recommend as I believe we were cheated out of hundreds of dollars.",
        "owner_response": null
      },
      {
        "author": "Josh U.",
        "rating": 1,
        "review": "Overcharges people and rips off hardworking citizens. Will never have this company manage any of my properties again. Has had multiple situations arise where profits over quality appear the be the company's modus operandi.",
        "owner_response": null
      },
      {
        "author": "Scott E.",
        "rating": 1,
        "review": "Be careful if you rent a property through Optimus. They charged us $315 of our security deposit for \"general cleaning\" despite that we left the property spotless. The lease allowed cleaning only if we left the property dirty and we provided an extensive number of photos proving the property did not need cleaning (we spent hours scrubbing the house and leaving it clean). We asked them what needed to be cleaned by them and they were unable to answer that and said that since the cleaners were already paid there is no way to refund us. I would not rent through them again given what feels like a deceptive and dishonest business practice.",
        "owner_response": null
      },
      {
        "author": "Mark P.",
        "rating": 1,
        "review": "House was supposedly being actively managed by Optimus (Suzzanne Medina). Took the house back after several years as a rental and found several problems that had never been mentioned.  Some examples:\n\n1. No pets allowed: Renters obviously had a cat that severely urinated in several rooms. Had to rip out all flooring, baseboards, curtains.  The intensity (after cleaning) indicates it had been going on for a while.  \nObviously no one monitors the property well enough to know what's going on with the property.  \nCleaning had been done by Optimus but the stench was still overwhelming and NO mention was ever made of this problem.\n\n2. Inside door to the garage had been kicked in at some point as the frame was split, door cracked around the latch, latch plate area destroyed and plate gone.  The quality of the repair was apparently someone just driving two nails into the frame to try to hold the splintered wood together.\n\n3. Myriad of smaller poorly done repairs and ignored broken items NONE of which had ever been detailed to us.  \n*Microwave door had been damaged so it wouldn't latch.  I guess you can use it by standing there and holding the door shut with your hand while it runs.  \n*Toilet handle/lever was wrong.  Its on an angled part of the tank and the wrong handle with a straight arm was used so the arm scrapped the inside of the tank.  It bound up when flushed so the handle never pops back.  After the renters moved out the toilet had been running for a solid month in the midst of local water restrictions.\n*Outside outlet box had come loose due to damaged wooden plate and was hanging out of the wall.\n*Furnace had not been inspected in over 4 years per maintenance label.\n*Mold (light but still mold) growing in the master bath shower upper wall/ceiling.\n*Bottom of a kitchen cabinet drawer was separated from the back and was coming apart.\n\nYou get the picture.  Choose wisely if you actually want a management company that actively looks out for the property.",
        "owner_response": null
      },
      {
        "author": "Kenzi L.",
        "rating": 1,
        "review": "absolutely TERRIBLE company to rent from. They keep changing the rules for the complex and suzanne is extremely insensitive and unprofessional. our management changed to this company and i have never been more prepared for my lease to end until now. absolutely AWFUL.",
        "owner_response": null
      },
      {
        "author": "Don D.",
        "rating": 5,
        "review": "Please confirm your account to post your review\n\n\n\n\n\n\n1/6/2020\n\n\n\nI hired this company, with Suzzanne as our manager of 24 units, and she has done a great job. As I have 44 years of apartment operating experience I am used to disgruntled tenant voices. It's just what happens even if the property is managed well.\n At our property Suzzanne has aided in roof and gutter cleaning, complete repair of the building drainage system, a parking lot reseal and restripe, deck repair and painting, a complete hallway painting including colorful doors and new base trim, new hallway carpet, heater repairs, broken window seal repairs, numerous flooring jobs, a re-cert of the fire alarm system, replacing a tub/shower enclosure and catching up to 2+ years of deferred maintenance. Vacancies have been promptly filled. A job well done and that's just the first 6 months!",
        "owner_response": null
      },
      {
        "author": "Holle S.",
        "rating": 1,
        "review": "Nothing but headaches and dealing with Julia Olsen and the people from this company. I've been lied to I've been robbed and now in an effort to get out of the money she owes me I got a 60 day notice. This woman is nothing less than a liar and a thief not only to the renters but also to the homeowners",
        "owner_response": null
      },
      {
        "author": "Sarah W.",
        "rating": 1,
        "review": "Do NOT use this rental company. Suzanne, the lady I worked with was very slow at getting repairs done for the year I rented through them. I had to fully clean the place before I moved in, removing drug paraphernalia and painting the WHOLE condominium myself. Upon move out, she preceded to charge me for things such as putting closet doors back on track and an OLD shower head!!! This place was a dump when I moved in and I left it 1000x better upon move out. She doesn't \"do,\" a move out walk through with you and conveniently LOST my move in check list. What a horrible experience this was. Although, I did learn a lot about renting through this rental company, and am highly motivated to buy now......I still feel sick to my stomachache.",
        "owner_response": null
      },
      {
        "author": "Terry F.",
        "rating": 5,
        "review": "We have rented with Optimus for a couple of years now.  I have been in PropertyManagement for 25 plus years, so I can say with certainty that this company is very professional in every thing they have done for us.  If you're looking for a rental, this is the best company to rent from, and if you're selling or buying...Julia is the best to work with.",
        "owner_response": null
      },
      {
        "author": "Mary H.",
        "rating": 1,
        "review": "As a tenant I recently vacated a residence being managed by this company. I must advised they are poor communicators, with no response or calls returned. I dealt with Julia who failed to communicate that my security deposit had been returned to me on a specific date. What I received was \"your security deposit was returned a copy of days ago.\" however they never asked for an address to send the deposit. In addition, when asked where it was sent, the response was \"the last known address\". Again, what did they consider the last known address?? I called to inquire when email was not returned but was unable to speak with Julia, she was supposedly in a meeting with the owners??  I left a voicemail. Shortly after received an email that indicated that it had been sent to the address which I had just vacated.  Does that really make sense, or is this just a ploy to delay.  Would have been more professional to advise me of the date the deposit was sent,  as well as the address it was sent to. Unfortunately it was similar to what is referred to as pulling teeth to get a simply answer. \nI hope that you do not have to experience but I am guessing you will.",
        "owner_response": null
      }
    ],
    "google_reviews": [
      {
        "author": "A G",
        "rating": 1,
        "review": "Refused to fix issues during my one year lease and decided to fabricate charges after I left. Claimed I took down shower doors when they were in the garage from day one. Claimed a screen was missing when it was in the garage. Handed me the Without cleaning it and now wants to bill me seven hours for cleaning it at the end. No one is in their office on the weekends and they expect Im supposed to wait until Monday to return the keys. The bare minimum contact I had was with Kashia DeMerice who provided zero support.",
        "owner_response": null
      },
      {
        "author": "Allison Jones",
        "rating": 1,
        "review": "Do not rent from Optimus. They work with a verbally abusive and threatening property owner named Iva Smetana who lives in Ferndale. She owns the apartments at Eagle Pkwy in Ferndale, under the name Smetana 1 LLC, which is publicly available information on the assessors website. At least several former tenants have witnessed her be cruel to a disabled person, and yell at a mother in front of her children, and Iva calls the cops on tenants if they put too much in the dumpster. She will be looking through the dumpster with a flashlight late at night to find out who it was. Optimus has always done her bidding, posting notes on doors when shed get mad and tell them to. They probably dont stand up to her because theyre afraid of her too. Do not rent from Optimus. Anyone who cant stand up to Iva shouldnt be operating a property management business. And, if you value your safety, DO NOT MOVE TO EAGLE PKWY.",
        "owner_response": null
      },
      {
        "author": "Boney Tiger",
        "rating": 1,
        "review": "They are a-holes, lack social skills when dealing with tenants. They don't solve simple problems that take very little effort. The trash is constantly everywhere can't even walk in that area to toss it, very hazardous. Take long time to respond to time sensitive problems or basic maintenance. They are running out the long time tenants with rent increases every year and a ton of legal paperwork just to maintain a lease, but you will never hear from them unless it's a mean text talking down on tenants like we're children.",
        "owner_response": null
      },
      {
        "author": "Riley Ball",
        "rating": 1,
        "review": "During the last month in my studio apartment, they left me without a garbage disposal for a month. After move out, they charged me $175 for 4 electric stove drip pans, and an $80 cleaning fee when the place was spotless. There were two tiny spots on the wall that needed touch ups. Stay away from these people and avoid the headache. Kashia was my property manager.",
        "owner_response": null
      },
      {
        "author": "Hansen Curt",
        "rating": 1,
        "review": "Bad place to rent from they never communicate or do nothing to fix anything. My rental was a dump had no ventilation whatsoever. Keisha is the worst person to work with she is very unprofessional she doesn't have any communication skills. I have been sending in request for repairs for over three years and they tried to make it seem like it was our fault. Never rent from Optimus Property Solutions. They wrongfully evicted us we our disabled and we were behind on rent. I refuse to pay rent for filth and black mold. We our now homeless because of Optimus Property Solutions. They should be called Optimus Property destroyers .",
        "owner_response": null
      },
      {
        "author": "Whitney Misja",
        "rating": 5,
        "review": "We rented from here for 7 years. Julia was our property manager and we cannot say enough good things about her! She is kind, friendly, approachable and  quick to respond and take care of whatever needs to be taken care of. Highly recommend Optimusbonus if you get to work with Julia!",
        "owner_response": null
      },
      {
        "author": "Julie Roman",
        "rating": 5,
        "review": "Julia went above and beyond today in walking us though a solution to a problem we were having with flooding in a unit.  She was very knowledgable and patient with us as she thoroughly explained the process.\n\nWe have used Optimus for several years, both as property managers and as a service to find and vet potential renters for our properties.  We have been very pleased with their services and highly recommend them.",
        "owner_response": null
      },
      {
        "author": "Ezra Moore",
        "rating": 5,
        "review": "\"Optimus Property Solutions? More like Optimus Prime of property management! As their IT vendor sidekick, I've gotta say, these folks are top-notch. Professionalism? Check. They sync up with our team like a dream. And kindness? Double check. When tech gremlins attacked, they didn't just stand by; they dove into the trenches with us, showing patience and support that would make your grandma proud.\n\nBut it's not all serious business. Their team has a way of making even the driest property management talk feel like a chat over coffee. They've mastered the art of being pros while keeping it light and human, which in my book, makes them property management rockstars. If you're on the hunt for a property management crew that brings both brains and heart to the table, along with a few laughs, look no further than Optimus Property Solutions. They're not just managing properties; they're elevating the game.\"",
        "owner_response": null
      },
      {
        "author": "Caryn Scheffer",
        "rating": 4,
        "review": "Response time is considerably slow once you become a tenant.  Almost as if you are intentionally being ignored.  However, when washer and dryer didn't work to complete a single load, service was contacted immediately.  When the dryer was identified as non-repairable, a new one of a similar model was ordered and delivered within 3 days.  Housekeeping/ cleaning service hired to clean the home prior to move-in date did a horrible job.  They should find a different cleaning company.",
        "owner_response": null
      },
      {
        "author": "Lauren Rogers",
        "rating": 4,
        "review": "We've had our ups and down  (who hasn't with property management at a mobile home park?) but when it comes down to it, Julia has been an understanding and reasonable property manager, and not to mention, kind. She is always calm and clear with her expectations and that is vital as sometimes emotions can run a little high if issues arise! She is definitely very good at her job in that way, I can truly attest to that. I think lots of the issues we've dealt with in our park have been outside of the scope of Optimus' management of the park. While that's been hard to navigate, it's not their fault. She has shown that she cares and is willing to work with people, especially us. We know that she didn't need to be as understanding and patient as she has been with us over the years, and since our livelihood literally depends on it, we are grateful to her for sure.",
        "owner_response": null
      },
      {
        "author": "Scott",
        "rating": 1,
        "review": "Be careful if you rent a property through Optimus. They charged us $315 of our security deposit for \"general cleaning\" despite that we left the property spotless. The lease allowed cleaning only if we left the property dirty and we provided an extensive number of photos proving the property did not need cleaning (we spent hours scrubbing the house and leaving it clean). We asked them what needed to be cleaned by them and they were unable to answer that and said that since the cleaners were already paid there is no way to refund us. I would not rent through them again given what feels like a deceptive and dishonest business practice.",
        "owner_response": null
      },
      {
        "author": "Ellen Yacknin",
        "rating": 5,
        "review": "As B'ham property owners, we feel lucky to be able to work with and rely on Suzzanne at Optimus.  She is professional, easy to work with, extremely responsive to our concerns, always cheerful (even when she is having a bad day!), and always offers sensible advice. Our tenants have never complained that problems are not resolved quickly. Thank you.",
        "owner_response": null
      },
      {
        "author": "Terry Fine",
        "rating": 5,
        "review": "We have rented with Optimus for a couple of years now.  I have been in PropertyManagement for 25 plus years, so I can say with certainty that this company is very professional in every thing they have done for us.  I've read all these reviews and honestly believe these people that make complaints have issues...not Optimus....  If you're looking for a rental, this is the best company to rent from, and if you're selling or buying...Julia is the best to work with.",
        "owner_response": null
      },
      {
        "author": "Edwin Sepos",
        "rating": 4,
        "review": "Showed up on time, knew what the homeowner wanted and brought to our attention, pleasant to speak with. However we drove across the country to see a home that had a line of people already waiting, if I would have known that I would have saved a lot of gas and the yard hadn't been cleaned up to the point I couldn't really see what was going in on. Didn't get the house, but that's not any fault of Optimus",
        "owner_response": null
      },
      {
        "author": "just me",
        "rating": 1,
        "review": "I've been renting with Drayton harbor realty for about 10 years till Monte past away and Optimus took over. I'll say as soon as that happened my rent went up $200 and I'll say Julia was the worst person you can ever communicate with. We finally found a house we bought and gave them a notice of vacancy. Recently Julia came by  and was taking pictures of the house and my wife asked what's going on thinking it was the HOA. Unfortunately the reply my wife gets is \" mind your own f@#$ business\". So my wife takes a few pictures of her just in case and Julia stops her truck, sticks her head out and rudely shouts \"you want me to get  out and pose?\"  I then called and headed to the office to have a conversation with Gary I believe..by the time I arrived office was closed and no one was there @1pm.. interesting how 10 minutes was a hard time to wait for me to arrive? Since then I haven't had a phone call back or no answers of why Julias actions were so unprofessional and rude.",
        "owner_response": null
      },
      {
        "author": "Velvet Humphres",
        "rating": 5,
        "review": "This is the best company I have ever rented from in whatcom county. The receptionist is so kind and very helpful. The person who works on finances/book keeping is a gem. The lease was very straight forward and not in anyway overbearing to read. If we need to end up moving and we choose to rent again, I will look at what they have available first. I wish more real estate management companies in whatcom were like this!",
        "owner_response": null
      },
      {
        "author": "Matt",
        "rating": 1,
        "review": "Shady dealings and slum lords, fix 3 year old problems and have them stick worker with the bill and parts. Trailer parks are filled with used needle rigs and overflowing trash.",
        "owner_response": null
      },
      {
        "author": "Ava Sakowski",
        "rating": 5,
        "review": "These folks are an excellent property management company. They are extremely responsive. However I know that has a lot to do with the landlord who is also very responsive to property needs.",
        "owner_response": null
      },
      {
        "author": "Pierre Constantin",
        "rating": 5,
        "review": "Julia and her entire staff are very professional, prompt to respond and smart in their managerial decisions.  I highly recommend Optimus Property Solutions",
        "owner_response": null
      },
      {
        "author": "Jeremiah Keenan",
        "rating": 5,
        "review": "Julia and the staff are honest and easy to deal with. You can only do good business with good people and they are great.",
        "owner_response": null
      },
      {
        "author": "James Morland",
        "rating": 1,
        "review": "This property management company is one of the worst ones Ive ever had to deal with. They dont listen to their clients, they dont even care to be on the property and they dont fulfill maintenance orders.",
        "owner_response": null
      },
      {
        "author": "Amanda Hasbrouck",
        "rating": 3,
        "review": "So far ok. They just took over managing our apt complex so still transitioning.",
        "owner_response": null
      },
      {
        "author": "Pat James",
        "rating": 1,
        "review": "My opinion with my experience with Suzanne was that she was unprofessional,  arrogant,\ncondescending,  and rude.",
        "owner_response": null
      },
      {
        "author": "Greg Spencer",
        "rating": 4,
        "review": "Super friendly staff, took plenty of time showing me the unit and answering my questions.",
        "owner_response": null
      },
      {
        "author": "Alexis Tejeda",
        "rating": 5,
        "review": "Great member service very helpful i went ask for questions and i got all the answers to it",
        "owner_response": null
      },
      {
        "author": "Maddy",
        "rating": 5,
        "review": "Lisa has been so helpful with me in answering all my questions, she is kind, understanding and very quick to respond. I have never dealt with a property management company like this before. Give Lisa a raise!!!",
        "owner_response": null
      },
      {
        "author": "Tom Rea",
        "rating": 5,
        "review": "Always very courteous staff to assist with any ?",
        "owner_response": null
      },
      {
        "author": "Aleksander Greenleaf (Alek)",
        "rating": 5,
        "review": "Very friendly. Super direct about expectations.",
        "owner_response": null
      },
      {
        "author": "Jodie James",
        "rating": 4,
        "review": "Thank you Suzzane for everything!",
        "owner_response": null
      },
      {
        "author": "Smiley Face",
        "rating": 1,
        "review": "Rich company, poor values.",
        "owner_response": null
      },
      {
        "author": "Sharon Hughes",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kristin Covell",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Marie B",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Loren Walker",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jeremy Burger",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mike Roze",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Andrew Marante",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Victoria Smith-Pullman",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 40,
  "adjusted_average_rating": 2.92,
  "distribution": {
    "1": 20,
    "2": 0,
    "3": 3,
    "4": 5,
    "5": 20
  },
  "summary": {
    "created_timestamp": 1739205538,
    "text": "<section id=\"good\"><h2>Good</h2><p>User reviews highlight several positive aspects of Optimus Property Solutions. Customers have voiced their appreciation for staff members who are friendly and helpful, demonstrating a professional attitude while also handling inquiries promptly. Specifically, multiple users have praised Julia and Lisa for their responsiveness and thoroughness, which has made dealings with the company smooth and commendable experiences. Additionally, the company has garnered praise for handling complex maintenance and repair issues efficiently. Successful management of tasks such as roofing, gutter cleaning, and resolving drainage issues, as well as improvements in various rental units, has been highlighted in some reviews. Clients acknowledge their satisfaction with the enhancements brought to properties under Optimus Property Solutions' management.</p></section><section id=\"great\"><h2>Great</h2><p>Optimus Property Solutions has received glowing recommendations from some reviewers for their comprehensive property management services. Tenants have celebrated the company for its dedication to maintaining and upgrading properties, exemplified by major updates like parking lot resealing and interior renovations, including new carpets and paint jobs. These updates have been completed efficiently, prompting several customers to commend the company's capacity to maintain low vacancy rates and its proactive approach in catching up on years of deferred maintenance. Reviewers with a long-term relationship with the company appreciated Julia's managerial acumen and communication prowess, noting the excellent turnaround on maintenance requests. The commitment in these cases has led clients to highly recommend Optimus to others seeking property management expertise.</p></section><section id=\"bad\"><h2>Bad</h2><p>There have been various critical user reviews citing significant issues with Optimus Property Solutions. One recurring theme is poor communication, with tenants often indicating that their inquiries or maintenance requests remained unanswered or were met with considerable delays. In particular, several reviewers found it challenging to have maintenance issues resolved timely, which made their living situations uncomfortable. Another prominent concern expressed is the deduction of security deposits for unwarranted reasons. Multiple accounts describe instances where tenants are charged for cleaning or repairs supposedly covered or which were unfounded, despite photographic evidence provided by tenants contradicting these claims.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>More severe criticisms have been directed at Optimus Property Solutions regarding unethical practices and unprofessional behavior. One alarming narrative reported involves tenants feeling cheated due to large sums being withheld from security deposits without proper justification or walkthroughs before and after occupancy, raising suspicions of deceptive practices. Other negative experiences include property negligence, where tenants unearthed significant wear and tear or damages not disclosed by property managers, such as unreported pet damage or poorly executed repairs. Additionally, there are disturbing accounts where communication from property managers was not only lacking but also unprofessional and combative when approached about issues, creating a fraught living experience for tenants who expected reasonable support from their management company.</p></section>"
  }
}