{
  "name": "Pacific Continental Realty LLC",
  "slug": "pacific-continental-realty-llc",
  "company_type": "company",
  "address": "114 W Magnolia St Suite 201, Bellingham, WA 98225",
  "review_count": 32,
  "average_rating": 4.19,
  "reviews": {
    "google_reviews": [
      {
        "author": "Destiney Chavez",
        "rating": 5.0,
        "review": "My experience with PCR has been great! Gabby is the sweetest property manager EVER! She will take care of your needs. The maintenance guys are also very friendly and helpful!! They will take good care of you! Thanks again GABBY for everything you do & taking care of my family :)",
        "ownerResponse": null
      },
      {
        "author": "india burgin",
        "rating": 5.0,
        "review": "My familys experience with Pacific Continental Realty (specifically our property manager with Gabby) has been very pleasant. We have been lucky enough to be working with Gabby, who quickly processed our applications and was extremely accommodating. She provided consistent communication throughout the entire process and made our transition to Bellingham one of the best experiences that we have had with renting a property. If your looking to move within Bellingham I would highly recommend renting through PCR.",
        "ownerResponse": null
      },
      {
        "author": "Ryan Reynolds",
        "rating": 5.0,
        "review": "Property management companies can be good and bad, but often it comes down to a combination of a management company and owner. Gabby is the glue that brings these two things together correctly. She is prompt when I have concerns and communicates in a very direct and understandable way. I enjoy working with her much more than other property managers from different companies over my life time. Keep up the good work Gabby!",
        "ownerResponse": null
      },
      {
        "author": "Christina Engel",
        "rating": 5.0,
        "review": "I have been using PCR going on 3 years now for commercial office space. Ben Black in particular. They are great. I usually communicate through email & always get a response in a timely manner. The rent is fair & reasonable. They do a great job of solving any issues that arise. I would highly recommend PCR. Ask for Ben, he's really easy to work with.",
        "ownerResponse": null
      },
      {
        "author": "Tiana Brennan",
        "rating": 5.0,
        "review": "Ive had an amazing experience renting from PCR, especially working with Gabby as my property manager. She is SO kind and respectful. She is prompt in responding to requests and urgent needs and always goes above and beyond. Out of all the experiences Ive had with rental companies in Bellingham, PCR has felt the most personal, unlike a lot of those big companies that only value profit. I would recommend Gabby to anyone looking to sign with PCR. She will take care of you!",
        "ownerResponse": null
      },
      {
        "author": "A M",
        "rating": 5.0,
        "review": "We turned to PCR a year ago to manage our 50+ unit residential complex. They have transformed the entire property, well beyond expectations. Gabby Marcuzzo, our agent, is efficient, detail-oriented, and unflappably courteous. She's at ease working with tenants, contractors, agencies, and colleagues. She's organized and always ready to offer tenants a good experience backed by good boundaries. Best of all, she works closely with Richard Bonham, head of maintenance and renovation (PCM). Richard manages a sizable team expertly and is so experienced himself it's scary. Under his watch, building issues always get resolved--from ad hoc service calls to multi-phase projects. Both Richard and Gabby are establishing processes to monitor the health of our buildings and manage repairs and renovations in a predictable way. We're grateful that PCR invests in high-quality people for their teams--it's made all the difference for our residential property.",
        "ownerResponse": null
      },
      {
        "author": "June Quick",
        "rating": 1.0,
        "review": "PCR took over management of my building and raised the rent by over 30% in less than two years while maintaining it worse than the previous company. After moving out they illegally tried to keep part of my deposit without providing a statement.",
        "ownerResponse": null
      },
      {
        "author": "Rick Hippe",
        "rating": 5.0,
        "review": "My wife and I have interacted with the principals at PCR (KC Coonc and Ryan Martin) for over a decade and more recently with Gabby Marcuzzo as our current property manager. Throughout this relationship, initially with acquisition of the commercial investment and currently with Gabby providing property management, the focus has been to provide outstanding value to our student tenant population.  Upgrades over the years have included exterior painting, kitchen countertops, cabinets and luxury vinyl flooring to provide our students a very modern, clean and crisp living experience.  With Gabbys leadership we strive to maintain a quality product.",
        "ownerResponse": null
      },
      {
        "author": "Tyler Moritz",
        "rating": 1.0,
        "review": "I am writing this review because the company seems to respond more to bad reviews online than they do to emails from their tenants. The unit was advertised to have a dishwasher on multiple rental sites, when we moved in we found out that there would not be a dishwasher and that we would have to pay the same as other units that did include a dishwasher. In addition to that the apartment was very sloppy on move in day. There is paint on almost every window, paint on the bathroom mirror, as well as some painted spots on the floor. There is also hair painted onto the wall in multiple places. The kitchen was disgusting- me and my partner spent hours cleaning it, the cabinets still had things from the previous tenant inside. There was gum on the floor that I had to scrape off. The rental company says they charge the previous tenant for cleaning, but the cleaning was clearly not done in our unit. The screen for the sliding door has multiple holes in it and gets stuck, and the blinds are cracked and damaged. After we told our complaints to the company they only offered a 1 time 100$ prorate on our rent which quiet frankly is not a fair amount for the state our apartment is in. After we contacted both of the supervisors they told us it was not there responsibility. Very unprofessional. Do not recommend this company.",
        "ownerResponse": null
      },
      {
        "author": "Jeannie Cox",
        "rating": 5.0,
        "review": "I had an awesome experience working with PETE WASLEY! He was very personable and professional. Pete prepared a thorough evaluation of my propertys value and explained everything clearly, answering all of my questions and giving helpful advice. I highly recommend him!",
        "ownerResponse": null
      },
      {
        "author": "mackenzie carlton",
        "rating": 5.0,
        "review": "I love living in the apartment that we are renting. I love my property manager and shes super responsive. They take great care of our building and are always looking out for the tenants. I would definitely recommend renting from them.",
        "ownerResponse": null
      },
      {
        "author": "Lori Wise-Dowd",
        "rating": 5.0,
        "review": "An amazing experience! Richard and Gabby are an explosive team! They made me feel like my time matters. Deadlines were met and I was treated very professionally.",
        "ownerResponse": null
      },
      {
        "author": "Katy Henderson",
        "rating": 5.0,
        "review": "Recently rented my first apartment with the help of Gabby and she has been amazing so far! Very helpful, efficient and will go the extra mile to answer all of my questions!",
        "ownerResponse": null
      },
      {
        "author": "Manuel Castellon",
        "rating": 5.0,
        "review": "Recently got an apartment with the help of Gabby, she was very helpful knowledgeable and made the process of finding an apartment lot less stressful. Would highly recommend.",
        "ownerResponse": null
      },
      {
        "author": "Ben Black",
        "rating": 5.0,
        "review": "Worked at PCR for over three years as a commercial property manger. Learned a lot and was always treated fairly. You will have to put in the effort, but you will be rewarded!",
        "ownerResponse": null
      },
      {
        "author": "Bradley Ebinger",
        "rating": 5.0,
        "review": "My experience for getting into my apartment has been a smooth process. Thanks go to Gabby for her incredible help and guidance. Thank you Gabby!",
        "ownerResponse": null
      },
      {
        "author": "Bri Hackler",
        "rating": 1.0,
        "review": "poor business practices, poor management, unrealistic expectations for employees, not all necessary tools provided for jobs in order to complete necessary tasks, barely if any training. property management company should not offer janitorial services without proper employees/ equipment.",
        "ownerResponse": {
          "text": "We are sorry your employment at Pacific Continental Maintenance did not work out. We wish you the best and hope you find what you are looking for."
        }
      },
      {
        "author": "Ann Brandi Campanilla",
        "rating": 1.0,
        "review": "Pacific Continental is super unprofessional, Im really upset we signed a lease with them. I don't even make reviews but I'm stuck with them for a year and they continue to be disrespectful even after complaints. They only care about their status and wallet. Their response to our concerns was ridiculous. After signing the lease, she asked if we could push back a couple days for maintenance, so we asked to be put in a hotel since we really needed the place the day we signed and had paid for already. She then said maintenance will push through and we can move-in the same day. But when we saw the place, there was gum on the floor, kitchen was dirty with last tenants items including a reusable straw, food spills or something leaked inside the fridge, and you can tell everything was rushed and sloppy. Our place also noted to have a dishwasher and were paying the same price as tenants with, but dont have one. Our apartment neighbors also thought they would have a dishwasher due to the misrepresentation- only 2/52 units have a dishwasher but they advertised it on several rental sites (4+) that the units came with it. When they note \"Not all units alike\", you'd expect a different floorplan not a loss in amenities! We're paying the same price as those with a dishwasher! When we talked to the co-owner of PCR, they just pointed fingers at another company, and then pointed more fingers at their maintenance crew rather than taking accountability. They refused to reduce the rent so I asked if they could at least install and still no answer- longest she hasnt responded but was quick to respond that she wont reduce rent. Our current landlord after that one left, has shut off our water multiple times due to construction, without any prior notice. We have gone hours without water. Also, they don't care about the tenants at all and wont make any effort to rectify their wrongdoings and the breaches in the lease they have made. They also did not have enough accessibility, including parking, and just now made more room after expressed concern from another party. Also, our place has unassigned parking but there aren't enough spots for everyone so more than half the days of the week we are forced us to find parking elsewhere, and there are tow zones all around us. There have been multiple complaints about this by many, including myself, but they don't care because they're not the ones living there, they're the ones making money off us living there. They don't care about their tenants and will continue their scamming. Save yourself and don't sign with PCR!",
        "ownerResponse": {
          "text": "Hi Brandi,\nWe are so sorry to hear that you have had a 1-star experience with us! You are correct that it was a rush to meet the timeline and we are pleased that we were able to meet that expectation. We are in the process of remodeling all the units in your apartment complex and Skye advocated on your behalf to personally make sure that your unit was completed and delivered on time. My understanding is that you were compensated for and issue with the cleaning.\nI believe that there may have been confusion about a dishwasher. Only 2 of the 52 units in your complex that have a dishwasher. We do not market that the units have a dishwasher. One of the photos in our marketing has a dishwasher visible in the photo, however, there is a disclaimer that Photos marketed for this property may not be of the actual unit available.\nSkye has reached out to you with my direct contact information if you have any questions or additional concerns.\nBest\nRyan"
        }
      },
      {
        "author": "Keone Henry",
        "rating": 5.0,
        "review": "Richard Bomhard is the best maintenance manager I have ever worked with,his knowledge and experience are second to none he's very pleasant and helpful all while being extremely professional",
        "ownerResponse": null
      },
      {
        "author": "Dakota Vondrachek",
        "rating": 5.0,
        "review": "Richard with Pacific Continental  Maintenance was very professional with his work, and his communication while performing the job was amazing!!! Thank You",
        "ownerResponse": null
      },
      {
        "author": "NIK STRUBLE",
        "rating": 2.0,
        "review": "Typical property management they dont care about you just fleecing people for as much as possible for sub par properties.",
        "ownerResponse": null
      },
      {
        "author": "Pacific NorthWest ProWash",
        "rating": 5.0,
        "review": "Talk with SCOTT WALKER!! He is the man!! Scott has a serious business background and can help you find the best solution to your situation!! Call him today dont delay!!",
        "ownerResponse": null
      },
      {
        "author": "Duane Glass",
        "rating": 5.0,
        "review": "Richard Bomhard works hard and gets it done. Cant thank him enough for such great work!",
        "ownerResponse": null
      },
      {
        "author": "Savanna Balfour",
        "rating": 5.0,
        "review": "Professional and convenient! Everyone in the office is super friendly and helpful!",
        "ownerResponse": null
      },
      {
        "author": "Jesse Gaona",
        "rating": 5.0,
        "review": "They were super helpful in answering questions when I was trying to find my first place",
        "ownerResponse": null
      },
      {
        "author": "Marianne Uhrig",
        "rating": 5.0,
        "review": "Wonderful company to work for!",
        "ownerResponse": null
      },
      {
        "author": "Sean Cummings",
        "rating": 5.0,
        "review": "Very responsive and professional company.",
        "ownerResponse": null
      },
      {
        "author": "Matthew Moritz",
        "rating": 1.0,
        "review": "This place is dirty and smells funny",
        "ownerResponse": null
      },
      {
        "author": "Sharon Moritz",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "FatherChris Laine",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "kara marklin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Echo Mae",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 28,
  "adjusted_average_rating": 4.18,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is generated by ChatGPT and is intended to be a tool to help potential clients and renters evaluate Pacific Continental Realty LLC. The summary is based on user reviews and does not include personal information or subjective interpretation. This article's intent is to provide a balanced overview, taking into account both positive and negative aspects as described in the user reviews.</p>  </section>  <section>    <h2>Good</h2>    <p>Many users have shared positive experiences with specific staff members at Pacific Continental Realty LLC. Property managers, particularly Gabby, have been consistently praised for providing exceptional care and prompt service. Users appreciate that needs and maintenance requests are handled swiftly, showcasing a commitment to tenant satisfaction. Furthermore, these favorable interactions have often led to personal recommendations, highlighting the trust and rapport built with the property management team.</p>    <p>Another aspect users frequently commend is the professionalism and efficiency of the maintenance team led by Richard. The transformation and upkeep of larger residential complexes have exceeded expectations, displaying the company's ability to manage substantial projects effectively. The team's experience and their inclination to work closely with tenants, contractors, and agencies establish a strong sense of competence and reliability among clients.</p>  </section>  <section>    <h2>Great</h2>    <p>Users have reported that the Pacific Continental Realty LLC management team excels in areas such as property upgrades and proactive maintenance, markedly enhancing the living experience for tenants. Efforts to modernize properties with upgraded amenities such as new kitchen countertops and luxury vinyl flooring have been acknowledged and appreciated. This dedication to maintaining high standards offers renters an upscale and comfortable environment.</p>    <p>Extending beyond residential management, the company's involvement in commercial real estate has also garnered positive attention. Clients have noted timely and efficient communication, especially through email channels, as well as fair rental pricing. Personalized experiences such as thorough evaluations of property values by knowledgeable staff have been noteworthy, contributing to the company’s credibility in the real estate sector.</p>  </section>  <section>    <h2>Bad</h2>    <p>However, there's a contrast in some user reviews that point towards a less positive experience. Issues such as rent hikes and a perceived decline in building maintenance have been raised, resulting in frustration for tenants. Additionally, concerns regarding refund of security deposits in a legal manner have been shared, potentially reflecting a lack of transparency or miscommunication in these procedures.</p>    <p>Some users have voiced criticism about their units not being well-prepared at move-in, with problems ranging from cleanliness issues to incomplete amenities advertised such as dishwashers. These users have expressed a view that management has not adequately addressed these complaints, which exacerbates dissatisfaction and points towards inconsistencies in how properties are presented and maintained.</p>  </section>  <section>    <h2>Ugly</h2>    <p>Reviews also indicate significant distress over what is perceived as an unprofessional attitude from the management company. Specifically, users have reported poor responses to critical feedback or issues raised, including deflection of responsibilities and inadequate resolutions to concerns. The discussion around misrepresenting amenities in advertisements, such as the inclusion of dishwashers, suggests a potential lack of integrity that some users find unsettling.</p>    <p>The company's level of responsiveness and customer care during crisis situations, like unplanned water outages or inadequate parking, has been criticized, with some reviews suggesting these are indicative of a wider disregard for tenant experience and legal obligations of the lease agreement. Despite these points of discontent, it's important to note that the sample size of such criticisms is relatively small compared to the total number of reviews received by the company.</p>  </summary></article>"
}