{
  "name": "Pacific Continental Realty LLC",
  "slug": "pacific-continental-realty-llc",
  "company_type": "Company",
  "address": "114 W Magnolia St Suite 201, Bellingham, WA 98225",
  "review_count": 32,
  "average_rating": 4.19,
  "reviews": {
    "google_reviews": [
      {
        "author": "Ryan Klise",
        "rating": 5,
        "review": "So far so good! Frank was extremely fast and clearly a professional at what he does. Lease takeover process took a matter of days and the steps were extremely clear and simple. Hopeful this trend will continue throughout my tenancy (:",
        "owner_response": null
      },
      {
        "author": "Jerod Hollen",
        "rating": 5,
        "review": "I had such a great experience with PCR. The application process was simple. Frank worked with me through a minor technical difficulty while submitting my application. I've dealt with many property management companies in Bellingham over the years and can honestly say this is the best one and Frank was very helpful and professional!",
        "owner_response": null
      },
      {
        "author": "Peggy Underbrink",
        "rating": 5,
        "review": "Frank was excellent to work with!  Very professional and responsive.  I would definitely work with him again.  Highly recommended!",
        "owner_response": null
      },
      {
        "author": "Destiney Chavez",
        "rating": 5,
        "review": "My experience with PCR has been great! Gabby is the sweetest property manager EVER! She will take care of your needs. The maintenance guys are also very friendly and helpful!! They will take good care of you! Thanks again GABBY for everything you do & taking care of my family :)",
        "owner_response": null
      },
      {
        "author": "Ryan Reynolds",
        "rating": 5,
        "review": "Property management companies can be good and bad, but often it comes down to a combination of a management company and owner. Gabby is the glue that brings these two things together correctly. She is prompt when I have concerns and communicates in a very direct and understandable way. I enjoy working with her much more than other property managers from different companies over my life time. Keep up the good work Gabby!",
        "owner_response": null
      },
      {
        "author": "india burgin",
        "rating": 5,
        "review": "My familys experience with Pacific Continental Realty (specifically our property manager with Gabby) has been very pleasant. We have been lucky enough to be working with Gabby, who quickly processed our applications and was extremely accommodating. She provided consistent communication throughout the entire process and made our transition to Bellingham one of the best experiences that we have had with renting a property. If your looking to move within Bellingham I would highly recommend renting through PCR.",
        "owner_response": null
      },
      {
        "author": "Tiana Brennan",
        "rating": 5,
        "review": "Ive had an amazing experience renting from PCR, especially working with Gabby as my property manager. She is SO kind and respectful. She is prompt in responding to requests and urgent needs and always goes above and beyond. Out of all the experiences Ive had with rental companies in Bellingham, PCR has felt the most personal, unlike a lot of those big companies that only value profit. I would recommend Gabby to anyone looking to sign with PCR. She will take care of you!",
        "owner_response": null
      },
      {
        "author": "Tyler Moritz",
        "rating": 1,
        "review": "I am writing this review because the company seems to respond more to bad reviews online than they do to emails from their tenants. The unit was advertised to have a dishwasher on multiple rental sites, when we moved in we found out that there would not be a dishwasher and that we would have to pay the same as other units that did include a dishwasher. In addition to that the apartment was very sloppy on move in day. There is paint on almost every window, paint on the bathroom mirror, as well as some painted spots on the floor. There is also hair painted onto the wall in multiple places. The kitchen was disgusting- me and my partner spent hours cleaning it, the cabinets still had things from the previous tenant inside. There was gum on the floor that I had to scrape off. The rental company says they charge the previous tenant for cleaning, but the cleaning was clearly not done in our unit. The screen for the sliding door has multiple holes in it and gets stuck, and the blinds are cracked and damaged. After we told our complaints to the company they only offered a 1 time 100$ prorate on our rent which quiet frankly is not a fair amount for the state our apartment is in. After we contacted both of the supervisors they told us it was not there responsibility. Very unprofessional. Do not recommend this company.",
        "owner_response": null
      },
      {
        "author": "Alicia Mahaney",
        "rating": 5,
        "review": "We turned to PCR a year ago to manage our 50+ unit residential complex. They have transformed the entire property, well beyond expectations. Gabby Marcuzzo, our agent, is efficient, detail-oriented, and unflappably courteous. She's at ease working with tenants, contractors, agencies, and colleagues. She's organized and always ready to offer tenants a good experience backed by good boundaries. Best of all, she works closely with Richard Bonham, head of maintenance and renovation (PCM). Richard manages a sizable team expertly and is so experienced himself it's scary. Under his watch, building issues always get resolved--from ad hoc service calls to multi-phase projects. Both Richard and Gabby are establishing processes to monitor the health of our buildings and manage repairs and renovations in a predictable way. We're grateful that PCR invests in high-quality people for their teams--it's made all the difference for our residential property.",
        "owner_response": null
      },
      {
        "author": "Christina Engel",
        "rating": 5,
        "review": "I have been using PCR going on 3 years now for commercial office space. Ben Black in particular. They are great. I usually communicate through email & always get a response in a timely manner. The rent is fair & reasonable. They do a great job of solving any issues that arise. I would highly recommend PCR. Ask for Ben, he's really easy to work with.",
        "owner_response": null
      },
      {
        "author": "Rick Hippe",
        "rating": 5,
        "review": "My wife and I have interacted with the principals at PCR (KC Coonc and Ryan Martin) for over a decade and more recently with Gabby Marcuzzo as our current property manager. Throughout this relationship, initially with acquisition of the commercial investment and currently with Gabby providing property management, the focus has been to provide outstanding value to our student tenant population.  Upgrades over the years have included exterior painting, kitchen countertops, cabinets and luxury vinyl flooring to provide our students a very modern, clean and crisp living experience.  With Gabbys leadership we strive to maintain a quality product.",
        "owner_response": null
      },
      {
        "author": "Ann Brandi Campanilla",
        "rating": 1,
        "review": "Pacific Continental is super unprofessional, Im really upset we signed a lease with them. I don't even make reviews but I'm stuck with them for a year and they continue to be disrespectful even after complaints. They only care about their status and wallet. Their response to our concerns was ridiculous. After signing the lease, she asked if we could push back a couple days for maintenance, so we asked to be put in a hotel since we really needed the place the day we signed and had paid for already. She then said maintenance will push through and we can move-in the same day. But when we saw the place, there was gum on the floor, kitchen was dirty with last tenants items including a reusable straw, food spills or something leaked inside the fridge, and you can tell everything was rushed and sloppy. Our place also noted to have a dishwasher and were paying the same price as tenants with, but dont have one. Our apartment neighbors also thought they would have a dishwasher due to the misrepresentation- only 2/52 units have a dishwasher but they advertised it on several rental sites (4+) that the units came with it. When they note \"Not all units alike\", you'd expect a different floorplan not a loss in amenities! We're paying the same price as those with a dishwasher! When we talked to the co-owner of PCR, they just pointed fingers at another company, and then pointed more fingers at their maintenance crew rather than taking accountability. They refused to reduce the rent so I asked if they could at least install and still no answer- longest she hasnt responded but was quick to respond that she wont reduce rent. Our current landlord after that one left, has shut off our water multiple times due to construction, without any prior notice. We have gone hours without water. Also, they don't care about the tenants at all and wont make any effort to rectify their wrongdoings and the breaches in the lease they have made. They also did not have enough accessibility, including parking, and just now made more room after expressed concern from another party. Also, our place has unassigned parking but there aren't enough spots for everyone so more than half the days of the week we are forced us to find parking elsewhere, and there are tow zones all around us. There have been multiple complaints about this by many, including myself, but they don't care because they're not the ones living there, they're the ones making money off us living there. They don't care about their tenants and will continue their scamming. Save yourself and don't sign with PCR!",
        "owner_response": {
          "text": "Hi Brandi,\nWe are so sorry to hear that you have had a 1-star experience with us! You are correct that it was a rush to meet the timeline and we are pleased that we were able to meet that expectation. We are in the process of remodeling all the units in your apartment complex and Skye advocated on your behalf to personally make sure that your unit was completed and delivered on time. My understanding is that you were compensated for and issue with the cleaning.\nI believe that there may have been confusion about a dishwasher. Only 2 of the 52 units in your complex that have a dishwasher. We do not market that the units have a dishwasher. One of the photos in our marketing has a dishwasher visible in the photo, however, there is a disclaimer that Photos marketed for this property may not be of the actual unit available.\nSkye has reached out to you with my direct contact information if you have any questions or additional concerns.\nBest\nRyan"
        }
      },
      {
        "author": "mackenzie carlton",
        "rating": 5,
        "review": "I love living in the apartment that we are renting. I love my property manager and shes super responsive. They take great care of our building and are always looking out for the tenants. I would definitely recommend renting from them.",
        "owner_response": null
      },
      {
        "author": "June Quick",
        "rating": 1,
        "review": "PCR took over management of my building and raised the rent by over 30% in less than two years while maintaining it worse than the previous company. After moving out they illegally tried to keep part of my deposit without providing a statement.",
        "owner_response": null
      },
      {
        "author": "Jeannie Cox",
        "rating": 5,
        "review": "I had an awesome experience working with PETE WASLEY! He was very personable and professional. Pete prepared a thorough evaluation of my propertys value and explained everything clearly, answering all of my questions and giving helpful advice. I highly recommend him!",
        "owner_response": null
      },
      {
        "author": "Lori Wise-Dowd",
        "rating": 5,
        "review": "An amazing experience! Richard and Gabby are an explosive team! They made me feel like my time matters. Deadlines were met and I was treated very professionally.",
        "owner_response": null
      },
      {
        "author": "Katy Henderson",
        "rating": 5,
        "review": "Recently rented my first apartment with the help of Gabby and she has been amazing so far! Very helpful, efficient and will go the extra mile to answer all of my questions!",
        "owner_response": null
      },
      {
        "author": "Bradley Ebinger",
        "rating": 5,
        "review": "My experience for getting into my apartment has been a smooth process. Thanks go to Gabby for her incredible help and guidance. Thank you Gabby!",
        "owner_response": null
      },
      {
        "author": "Bri Hackler",
        "rating": 1,
        "review": "poor business practices, poor management, unrealistic expectations for employees, not all necessary tools provided for jobs in order to complete necessary tasks, barely if any training. property management company should not offer janitorial services without proper employees/ equipment.",
        "owner_response": {
          "text": "We are sorry your employment at Pacific Continental Maintenance did not work out. We wish you the best and hope you find what you are looking for."
        }
      },
      {
        "author": "Manuel Castellon",
        "rating": 5,
        "review": "Recently got an apartment with the help of Gabby, she was very helpful knowledgeable and made the process of finding an apartment lot less stressful. Would highly recommend.",
        "owner_response": null
      },
      {
        "author": "Dakota Vondrachek",
        "rating": 5,
        "review": "Richard with Pacific Continental  Maintenance was very professional with his work, and his communication while performing the job was amazing!!! Thank You",
        "owner_response": null
      },
      {
        "author": "NIK STRUBLE",
        "rating": 2,
        "review": "Typical property management they dont care about you just fleecing people for as much as possible for sub par properties.",
        "owner_response": null
      },
      {
        "author": "Pacific NorthWest ProWash",
        "rating": 5,
        "review": "Talk with SCOTT WALKER!! He is the man!! Scott has a serious business background and can help you find the best solution to your situation!! Call him today dont delay!!",
        "owner_response": null
      },
      {
        "author": "Duane Glass",
        "rating": 5,
        "review": "Richard Bomhard works hard and gets it done. Cant thank him enough for such great work!",
        "owner_response": null
      },
      {
        "author": "Savanna Balfour",
        "rating": 5,
        "review": "Professional and convenient! Everyone in the office is super friendly and helpful!",
        "owner_response": null
      },
      {
        "author": "Jesse Gaona",
        "rating": 5,
        "review": "They were super helpful in answering questions when I was trying to find my first place",
        "owner_response": null
      },
      {
        "author": "Sean Cummings",
        "rating": 5,
        "review": "Very responsive and professional company.",
        "owner_response": null
      },
      {
        "author": "Matthew Moritz",
        "rating": 1,
        "review": "This place is dirty and smells funny",
        "owner_response": null
      },
      {
        "author": "Sharon Moritz",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "FatherChris Laine",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "kara marklin",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Echo Mae",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 28,
  "adjusted_average_rating": 4.18,
  "distribution": {
    "1": 5,
    "2": 1,
    "3": 1,
    "4": 1,
    "5": 24
  },
  "summary": {
    "created_timestamp": 1739205544,
    "text": "<section id=\"good\"><h2>Good</h2><p>Pacific Continental Realty LLC has garnered positive feedback for several aspects of its property management services. Many user reviews commend property managers like Gabby for her friendliness and efficiency. Tenants appreciate her ability to address maintenance requests promptly and her consistent communication during the rental process, making the transition seamless for many residents. A user highlighted that the lease takeover process was swift and well-organized, indicating a streamlined management approach. Additionally, experienced agents like Frank have also been praised for making the application process smooth despite minor technical challenges. This reliability and professionalism have earned the company a favorable reputation among renters in Bellingham. Reviewers often note that they received exceptional help from PCR staff, who display a willingness to go above and beyond typical expectations, greatly contributing to the overall positive experience.</p></section><section id=\"great\"><h2>Great</h2><p>Pacific Continental Realty LLC has made significant positive impressions on tenants and property owners alike, as evident in user reviews. One property owner shared how PCR, with Gabby as the lead property manager and Richard overseeing maintenance, transformed a 50+ unit complex well beyond expectations. The management team's ability to handle complex projects and maintain excellent tenant relations impressed the owner, who also appreciated the comprehensive improvements and communication strategies implemented by this skilled team.Long-term tenants and those who have interacted with specific agents such as Ben Black also expressed satisfaction, noting the timely resolution of issues and fair rental prices. Users particularly value the personal touch that the company provides, creating a distinction from larger management firms that often prioritize profit. The glowing reviews are testimony to the genuine client-centric approach and organizational efficiency at PCR, instilling confidence and ensuring satisfaction.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the overwhelmingly positive reviews, some users have reported difficulties and dissatisfaction with Pacific Continental Realty LLC. One tenant mentioned a disappointing experience related to the false advertisement of amenities. The unit was promoted with a dishwasher, which was not present upon move-in, and the condition of the apartment was unsatisfactory, with noticeable lack of cleanliness and maintenance issues upon arrival. Attempts to address these concerns seemed to fall flat with the management providing responses considered inadequate by the tenants affected.Another user critique centered on the hefty increase in rent prices following PCR taking over the property management. The individual noted that the increase was over 30% in less than two years, and the level of maintenance did not improve, essentially worsening the relationship with the property owners. Such instances highlight issues with transparency and fulfillment of management responsibilities that have left some tenants discontented.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Several user reviews have pointed out serious concerns about Pacific Continental Realty LLC's management approach. One tenant reported an extremely poor experience, detailing how the company responded more to online reviews rather than tenant emails, shifting accountability rather than addressing their complaints. Deceptive advertising practices were emphasized, which caused false expectations about provided amenities, such as dishwashers, leaving tenants paying identical rates for mismatched amenities.User accounts also included frustrations with the unprofessional handling of significant issues like illegal retention of a security deposit and frequent unannounced disruptions in basic services, like water supply due to ongoing construction. These breaches in convenience and communication, coupled with a lack of accountability, present a concerning image of the company's operations, which can overshadow the positive experiences shared by others.</p></section>"
  }
}