{
  "name": "Pacific Rim Apartments",
  "slug": "pacific-rim-apartments",
  "company_type": "Property",
  "address": "978 Pacific Rim Ln, Bellingham, WA 98226",
  "review_count": 18,
  "average_rating": 2.39,
  "reviews": {
    "google_reviews": [
      {
        "author": "Eva Elise",
        "rating": 1,
        "review": "A friend lived here on a ground floor. In the middle of the night the tub filled with sewage and the toilet overflowed into the bedroom. They never sent anyone to clean the bathroom after the issue was fixed. The outside drain on the patio overflowed from never being cleaned out and the entire apartment flooded and the neighbors. They had neglected cleaning the main drain. They then had the audacity to raise the rent $100 a month for this dump. It's ghetto.",
        "owner_response": null
      },
      {
        "author": "Candace Nash",
        "rating": 2,
        "review": "The current property manager goes out of her way to make sure your day stinks. She's a sticker natzi with those giant neon green warning stickers, that are insanely difficult to remove from your drivers side window. I was helping my daughter move some furniture with a U-Haul, the small sized truck, and I had parked it for a few hours while deciding what to haul away next. She plastered that sticker on the window of the U-Haul truck, stating that I cannot park the vehicle in the parking lot. WHAT??  The following day, she went after another person for the same reason, except while he was getting into his truck to leave, she still attempted to put that sticker on his window.  She also claimed that he was  blocking the side walk, which he was not.  Yesterday, a vehicle pulled in and parked. I'm not kidding when I tell you that 15 minutes later, that car had a sticker for expired tabs. It was a visitor, not a resident, and she had just purchased the tabs but needed to wait for the rain to stop to put them on. People, these aren't ordinary stickers. They adhere to a surface stronger than anything I've ever seen. They're water proof too. She gave my daughter a warning to move her car that she doesnt drive to a different spot or the car will be towed. She moved her car, but it was still towed away, and this manager said it was due to expired tabs. That's not what the warning was about. I also heard this lady threaten to kick a little 4lb dog, because he was not on leash and was sniffing around at her feet.\n\nOther than that, the units are cute, but it's impossible to get maintenance to your place if you don't have a major emergency like a busted pipe or the building caught fire. Anything else, forget about it. Super frustrated with the management and staff. Please don't let this place be your first pick for a new place to live. It's more of a place to go if your only other option is homelessness.",
        "owner_response": null
      },
      {
        "author": "Tania",
        "rating": 1,
        "review": "Disrespectful management especially  muliza  Spanish manager  at Bellingham pacific Rim apartment\nShe treat tenant disrespectfully.\n\nUse words and tone very harsh this is one of the big reason I left the apartment and supper laying woman after soo many calls Maintance guy never call back\nAfter calling to office she always said this is not a right number you people call\nCall Maintance number well\n\nSo disrespectful\nEven I said I can show you pictures I also taken when I leave she lai and speak over on me doesnt want Liston at all I want talk some one else who is the next person of this property\nIs she owner of this property?\n\nHousing pay over portion of rent and some me\nShe treat people very bad\nShe behaves like she God.",
        "owner_response": null
      },
      {
        "author": "Kathy Crawford",
        "rating": 5,
        "review": "Beautiful complex, very clean. Nice 1 bedroom my little brother has. I'm visiting from California and enjoying the nature trail adjacent to the apartments very much  A beautiful area of Washington State. ",
        "owner_response": null
      },
      {
        "author": "Alexis Light",
        "rating": 1,
        "review": "They literally never fix anything a request is put in for, for aboutb3 years. Never answer their phones or responds to emails.",
        "owner_response": null
      },
      {
        "author": "Matthew Pruett",
        "rating": 1,
        "review": "Don't care don't answer calls or emails just horrible",
        "owner_response": null
      },
      {
        "author": "Stephanie Andrade",
        "rating": 1,
        "review": "No one answers the phone here Ive been calling for two days straight and not one time has anybody answered the phone",
        "owner_response": null
      },
      {
        "author": ". .",
        "rating": 5,
        "review": " ",
        "owner_response": null
      },
      {
        "author": "Mustafa Wadalhaj",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Laurie Lusk",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Loren Walker",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kelly Hetrick",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kyle Blackburn",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Michellie",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Vikadoop Vikadoop",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Chila Ortiz",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Owen W.",
        "rating": 3,
        "review": "The staff for Pacific Rim Apartments are great, and the apartments themselves are decent for the price. There is even an on-site gym, and the office is on-site as well. Very convenient. The other renters are great too.\n\nThere are two big problems with this place, though, and it is getting way worse as time goes on.\n\n1. They keep having verifications and inspections like it is going out of style. The people they have come by don't always come by, and sometimes the inspections are going on for two days instead of just one. So if you have a lot of trouble with people you don't know coming into your house, this is just hell.\n\n2. Their maintenance company just decides not to show up sometimes. They do fix things when they come by. But you can never be sure that they will - so if you take off of work to wait for them, hey, you might get to take off yet another day and wait hours. Fun times.\n\nThe office directs complaints to the maintenance company itself, so it's like they have no control whatsoever over the situation. This is extremely frustrating.",
        "owner_response": null
      },
      {
        "author": "Christi K.",
        "rating": 2,
        "review": "We love the area, the managers of the complex are super nice, the only thing is construction & no assigned parking. Some of us works two jobs and works late, when we get off work. We come to a full parking lot. Some don't even live here, they are visiting but the ones who do pay rent has to park on the other side of the complex and walk. By morning you see all the visitors cars gone, so when I get up for work. I have to walk all the way over to the other complex to start my car to warm it up as I finish getting ready for work. It's cold and when your car is that far away from your complex it's hard to glance out and check to see if the car is still there. I end up getting up earlier than I should just to go to work early, I have seen cars taken up two spots, or motorcycles in one spot, cars that hasn't been driven or moved for months. You can tell because the tired are flat. It's hard to unload groceries or anything heavy for that matter. Having to park so far. If there was assigned parking it would be nice for the tenants, besides that, the area is great. It's close to a bust stop, near a college and lots of shopping. There are trails we can walk and a new park they are in the process of building. We love it here. We just don't like the parking, our cars get scratched or door dings. We value what we work hard for. & if having to pay for assigned parking will give us a spot to park, i would pay it. It just makes sense to have assigned parking for tenants who pays FULL rent.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 10,
  "adjusted_average_rating": 2.2,
  "distribution": {
    "1": 8,
    "2": 2,
    "3": 4,
    "4": 1,
    "5": 3
  },
  "summary": {
    "created_timestamp": 1739205557,
    "text": "<section id=\"good\"><h2>Good</h2><p>Pacific Rim Apartments has garnered some positive attention from its residents for the natural environment and amenities it offers. Many appreciate the beautiful location in Washington State, with scenic nature trails adjacent to the complex creating a peaceful living environment, as noted by a visitor who thoroughly enjoyed these features. Additionally, the complex includes convenient amenities such as an on-site gym and office, making daily life more accessible for residents.</p><p>Users have also mentioned the aesthetic appeal of the units themselves, describing them as cute and well-maintained. This creates a welcoming atmosphere for new and current residents alike. Despite several issues concerning management and maintenance, there are those who find their living situations satisfactory, praising the cleanliness and nice design of the one-bedroom apartments available at the complex.</p></section><section id=\"great\"><h2>Great</h2><p>Some residents and visitors have shared highly positive reviews, despite the property's mixed overall rating. Reviewers have highlighted the cleanliness and attractiveness of the complex, praising both the tidy units and the picturesque surrounding area. This positive feedback suggests that the Pacific Rim Apartments' setting and design can exceed expectations for those who prioritize a beautiful environment and well-kept living spaces.</p><p>The sense of community also stands out, with reviewers appreciating the friendly nature of other residents. This positive social environment, complemented by the convenient amenities such as the gym and proximity to bus stops and shopping areas, adds to the complex’s appeal for those looking to integrate comfortably while enjoying beneficial communal resources.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews have highlighted several areas of dissatisfaction, particularly with the property's management. Residents have reported poor communication, citing unanswered phone calls and ignored emails, leading to frustration among tenants dealing with issues that require attention. Maintenance requests are often left unfulfilled or delayed, causing significant inconvenience for those in need of timely repairs.</p><p>Parking has emerged as another point of contention, with several users expressing frustration over the lack of assigned parking. This has resulted in tenants having to park far from their units and deal with crowded lots filled with non-resident vehicles, making daily routines more cumbersome. Suggestions for improvement include implementing a more structured parking system to ensure tenants have reliable access to parking spaces near their homes.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most severe complaints about Pacific Rim Apartments pertain to grave management and maintenance issues that raise concerns about tenant well-being and property standards. One alarming incident involved a ground-floor apartment flooding with sewage, which remained uncleaned by management despite being an urgent hygienic concern. This negligence, combined with the condition of outdoor drains that led to further flooding, suggests a concerning disregard for property maintenance.</p><p>Managerial conduct has also been criticized as excessively authoritative and hostile, with accusations of harassment involving property manager actions that include unjustified vehicle towing and the misuse of impenetrable warning stickers on vehicles. Such interactions have allegedly involved disrespectful and intimidating behaviors, contributing to an uncomfortable living environment for many tenants. These reports underscore serious issues that could deter future residents from considering this complex as a viable living option.</p></section>"
  }
}