{
  "name": "Piazza Realty Property Management Inc",
  "slug": "piazza-realty-property-management-inc",
  "company_type": "company",
  "address": "120 E George Hopper Rd, Burlington, WA 98233",
  "review_count": 60,
  "average_rating": 3.38,
  "reviews": {
    "google_reviews": [
      {
        "author": "Nicole LaCresha",
        "rating": 5.0,
        "review": "Theres a lot of negative comments about piazza. My totally experience has been a blessing, last minute showing for me, communication is on point! They are doing everything in their power to get me into a place. Breanna has been so helpful and supportive with my stress case self the rest of the staff have been wonderful! Sometimes we write bad reviews because we didnt get the answer we wanted. Some stuff isnt in their control FYI they still have to follow through with the owners of the property and their demands. Dont hesitate to give them a call. 10 starts from me! Thank you Breanna and team for all your hard work!",
        "ownerResponse": {
          "text": "Gosh!!! Thank you Nicole, it is our pleasure to help and to work with you on your rental. The review is a huge  bonus, cant wait to share with the staff. "
        }
      },
      {
        "author": "Leslie Martinez",
        "rating": 1.0,
        "review": "By far the worst company to try and rent from. They take their sweet time processing everything. Everytime you try calling to speak to the management person or whatever they are  busy or dont answer the phone. After they finally  approve you they want a double deposit ? A DOUBLE deposit for a place that looks like they havent fixed the kitchen since 1990?! They dont tell you when a place isnt available anymore until you ask and still are waiting on them to do their job and process your stuff. The office people arent the most welcoming either I saw the receptionist talking on the phone with a tenant and rolling her eyes !! I feel like they discriminated us since the other applicant I was applying with is Hispanic with an ITIN but yet we make 7X the rent together ? Thats crazy.\nAnyways goodluck if you apply with them.",
        "ownerResponse": null
      },
      {
        "author": "Danial Osburn",
        "rating": 1.0,
        "review": "Okay so Im amongst friends talking about our experiences with piazza reality. Which triggered me to remember I never got to give my review. I lived at\n13075 Avon Allen rd\nUnit b\nmount Vernon wa\n98273\nThis property has since been sold and hopefully taken from there control as property managers. They were the worst landlords ever upon move in the unit was  unclean and covered in animal hair. And had a very strong Oder. I reported this. At least tried to, I took and provided pictures. Because they say that its mandatory they take some of the deposit for rug cleaning they clearly didnt clean it. I felt as if I deserved to not be charged that. Well they still screwed me out of it. Then also any time something happened they never even attempted to fix it for weeks. Leaving me to do it. Which is fine if I was compensated for things they were responsible for. The grass. There was lawn mower on site and I wasnt given access to mow the lawn and it sat until it was over a foot and a half. Any ways. Honestly. Terrible out fit not honest. And they dont care",
        "ownerResponse": null
      },
      {
        "author": "ryan biggers",
        "rating": 1.0,
        "review": "Got screwed out of money on a background check. Was told I was the fisrt and only one to put in for a rental and then after a month of dodging my calls they emailed me to tell me some one else beat me to the application",
        "ownerResponse": {
          "text": "Thank you for your review but I am unsure as to why you are leaving a review at this time when we have not done business together in 3 years.  I can not go back and tell you why your application was not approved but we do follow sticked guidelines when it comes to approval and/or denial to follow all the laws set forth in our state/county. "
        }
      },
      {
        "author": "Vicky Benson",
        "rating": 5.0,
        "review": "We Are Very Pleased With Piazza Property Management July would be 9 Years Renting From Them Staff Is Wonderful To Maintenance is Prompt as well.....",
        "ownerResponse": {
          "text": "Vicky.  We appreciate you. Thank you for posting this. "
        }
      },
      {
        "author": "Michelle Kerr",
        "rating": 5.0,
        "review": "I love the owner and all of the employees. I felt more like a friend than rather than just a  tenant! Much love ",
        "ownerResponse": {
          "text": "Thank you Michelle.  We feel that way too.  We appreciate you sharing that with us and others. "
        }
      },
      {
        "author": "Kenny Jans",
        "rating": 5.0,
        "review": "Outstanding service from top to bottom.  Staff is knowledgeable, friendly, and very responsive.  10/10 strongly recommend!",
        "ownerResponse": {
          "text": "Thank you Kenny!! We appreciate you and this great review!!!"
        }
      },
      {
        "author": "Cassandra Rauch",
        "rating": 5.0,
        "review": "I've been renting my home through this company for over three years now, and I feel like I've had a rather great experience. They have been responsive when I've needed assistance or information, and they have always been really pleasant to work with. It did take a little bit of time to get a new lease agreement drafted up, and we experienced a mix up in what our rent amount would be due to a clerical error, but that is a small drop in the bucket when compared to the rest of my experiences with them. I really don't have anything to complain about! I've been consistently thankful for my home!",
        "ownerResponse": {
          "text": "Thank you so much Cassandra! We appreciate you so much!"
        }
      },
      {
        "author": "Mike Lowrey",
        "rating": 5.0,
        "review": "I didnt have the best credit history. The staff and Manager were super willing and enthusiast about helping me. They made me feel comfortable and not like less than a person. They gave me the opportunity to have something better newer and nice for my family. Unlike other realty companies in the area that are rude and treat you poorly. By FAR, the best rental application process I have ever experienced. The Manager and her team are above and beyond outstanding customer service. Cant say enough how happy and blessed I feel to have been introduced to This company.\n\nUPDATE: 9/4/19\nI Recently completed the move out process after finishing my lease. And this was just as customer friendly as amazing when I first moved in and went through the application process. In fact, I am only moving because I am relocating, otherwise I would still be there. Kathy is amazing and did everything she could to accommodate me. I a really appreciate. Being a tenant with Piazza and will be referring everyone I know.\n\n-Nick",
        "ownerResponse": {
          "text": "Thank you so much Mike. We really appreciate you taking the time for this detailed review it means so much to our staff."
        }
      },
      {
        "author": "SwC R",
        "rating": 1.0,
        "review": "This place is awful to deal with if you are renting from them. I know numerous ppl that have been screwed by this company. They are a dishonest company. Rented me a home with non stop problems. Sinks not working, rat problems, heating issues along with a huge pile outside of previous tenants garbage that was never dealt with. You can contact them non stop about issues but they don't respond nor care. Said they could send out a maintenance man but after\n3 months waiting I gave up. I took pictures of rats garbage and everything. After moving out, they sent me to collections claiming  I owed for cleaning garbage ect for 1800. Lol Messed up my credit now I will fight them in court. This company is not new to the courts. They all know Piazza and everyone knows they are dishonest and not worth the headache to ever rent from. Wish I knew it earlier.",
        "ownerResponse": {
          "text": "Dear SwC r\nWe do not recognize our name as ever having rented from us.  If you have concerns with Move-out charges, we certainly want you to talk with us and provide us with the photos you say you took.  Please call our office, and let us address this.  We don't rent out properties with other people's trash left behind.  We are very disappointed that we can't speak to this with the information provided.  If you are sharing this information on someone else's behalf, please have them call us.  We take all reviews and feedback very seriously.\nSincerely Kathy Jo Piazza"
        }
      },
      {
        "author": "Debbie Joswick",
        "rating": 5.0,
        "review": "I've been renting from Piazza Realty for over 5-years now and they have been an excellent company to work with. Quick to address any issues we may have and in a timely fashion. Kathy is wonderful, as is her staff!\n\nCan't say enough good things about this company. Give them a try!",
        "ownerResponse": {
          "text": "Thank you, Debbie.   We can't tell how much it means to us to get this kind of review from a long term renter.  We appreciate this very much, from the whole staff."
        }
      },
      {
        "author": "Zack K",
        "rating": 5.0,
        "review": "Kathy Piazza Property Management has been my property manager since 2009 when I had left due to military orders up to the sale of my home in December 2016.  I have not had a problem with them.  They are very professional in everything they do.\n\nThey only charge a small percentage of my rental income which is good because if I don't get rent then they don't get paid.  This is a very fair process unlike some other property managers that charge a fee regardless if it's rented or not.  They routinely checked on my property and made sure it was still in good shape.  I have not had any issues with any tenants over the 8 years it was rented.  If there were any issues with maintenance, they made sure it was taken care of and if it was an expensive fix, they always got my permission first to fix it.\n\nAfter I had listed my house for sale, they continued to work with my relator and I to make sure the property was good to go until the sale went through smoothly, even though they were not obligated to do so.  They went above and beyond their normal duties of a property manager.",
        "ownerResponse": {
          "text": "Thank you Zack.  We appreciate your review and hope you are doing well. Thank you for your service."
        }
      },
      {
        "author": "Sushi Juice",
        "rating": 1.0,
        "review": "Maria, the front office lady who takes phone calls and attempts to help people, is rude and obnoxious - and always seems to be covering for her boss. Kathy, the \"Manager,\" is always so busy yet she leaves early and is routinely unavailable. How this management company operates is beyond me but getting anything done with this place is absolutely ridiculous. We've been waiting for 3 days for a response and Kathy is nowhere to be found - always in \"meetings\" and oops we were so busy but she left early for the day. If you're so busy, why do get to leave early?? This isn't the first time either. Once my lease is up I'm leaving and I'm never coming back...",
        "ownerResponse": null
      },
      {
        "author": "Vincent Sherman",
        "rating": 5.0,
        "review": "Piazza Realty Property management was recommended to me to.manage my rental house in Mount Vernon by a local floor service company. It was one of the best recommendations i have ever recieved.\nPiazza's mangement has been very professional. They have taken good care of the house, my tenants and me. They found me good tenants, who always pay the rent and take good care of the house, and Piazza has been very responsive when maintenance issues have come up, with practical affordable solutions. Their accounting staff has tracked income and expenses very well, and mad preparation of my tax return much easier.\nI highly recommend thier services.",
        "ownerResponse": {
          "text": "Thank you Vincent. It is our pleasure to serve your.  We appreciate you taking the time to share your experience.  It means a lot of us as a small business."
        }
      },
      {
        "author": "Tamie Jensen",
        "rating": 2.0,
        "review": "I contacted them to ask about an apartment listed for rent. A 1 bed/ bath. It's a duplex with laundry in garage. No yard. Front door to building is missing. The outside is covered in moss. It's in a rather shady area of Stanwood. Surrounded by businesses and some drug areas. This tiny place is asking $1200,same for deposit. The realty company was rude. For this price,Mt Vernon has 2 bdrms for the same price in better neighborhoods.\nThanks for the response. Since you didn't bother to address the moss or bother to use the correct spelling of my name,your reply means nothing. There are better price properties in Arlington/ Smokey Point even Stanwood.",
        "ownerResponse": {
          "text": "Greetings Tami. I know its difficult to find affordable housing right now. The rate is actually what it is for that area. We do not set the rental prices that is set by the owners. Mount Vernon is less expensive than Stanwood or Arlington."
        }
      },
      {
        "author": "Juan Jose",
        "rating": 5.0,
        "review": "Great company to work with! I first started as a tenant with them and had great service, then I purchased my first rental property and put it under their management and they have done an exceptional job!  I would highly recommend this company to anyone looking to rent or to have their property managed!",
        "ownerResponse": {
          "text": "Thank you Juan.  We appreciate your business and your review."
        }
      },
      {
        "author": "patti basart",
        "rating": 5.0,
        "review": "I want to thank Piazza Property Management for my wonderful experience in finding a delightful place to live, with their help.  They have been professional, helpful, kind and courteous from my application process to moving in and so responsive to questions and a tiny, tiny item that needed to be fixed -- which was followed up within 2 hours and fixed perfectly by the next day.  They've been respectful, flexible and made my moving experience wonderful.  Not to mention, I am leasing a new townhouse in burlington, with excellent construction,  wood floors, beautiful open floor plan, stunning kitchen with granite countertops, high quality cabinets and, neutral, tasteful colors and a fenced yard.  Plus, the grounds are maintained.  Usually, I like to maintain, but this is a real treat and I am thoroughly enjoying.\n\nI recommend Piazza Realty Property Management in Burlington to anyone who is a friend.  They have been perfect--professional, helpful and delivered everything they said they would.  I am very happy.   -patti",
        "ownerResponse": {
          "text": "Thank you Patti, We appreciate this review!"
        }
      },
      {
        "author": "Angela Prevette",
        "rating": 5.0,
        "review": "I am a long term renter with Piazza.  Kathy-Jo has gone above and beyond helping my family and I during trying times while renting through Piazza.  I would recommend renting through them today!",
        "ownerResponse": {
          "text": "Thanks Angela, I appreciate your review and 5-stars!!  Thanks for being a great tenant!!"
        }
      },
      {
        "author": "Whitney Warsaw",
        "rating": 1.0,
        "review": "Would give them zero if I could. Attitude right when they answer the phone. And apparently the main person u need to talk to.. takes her break 15 min after they open. I called 3 different times and she was 'on break' ...unprofessional...the person who showed me the house was rushing me through, and didn't even say a word while we walked through...these people hate their job and it shows. Plus idk if anyone noticed but they have employees on here rating their own business with 5 stars...bit of a conflict of interest I believe.",
        "ownerResponse": {
          "text": "So sorry Whitney, these processes are sometimes very dissapointing for potential renters for many reasons.  We are a property managers and can only manage for owners based on their specifications and standing rental rules.  We wish you the best of luck with your search and for you and your family."
        }
      },
      {
        "author": "Sean Brenton",
        "rating": 2.0,
        "review": "The web site is never up to date. And sometimes doesn't even work at all. If a property has a pending application ahead of yours we should be able to be told a time frame. There is no reason every County a universal application. And data base to store and maintain up to date information. I'm saying it right here skagit County. I have my will to succeed. And my family gives me that drive . So I am going to do my best and form a bridge between owner and tenant. And make it  easier to have your property viewed. And make applications more easily accessible to owners",
        "ownerResponse": {
          "text": "Thank you Sean for the feedback.  We are constantly updating our technology and website.   Let us know if you have anymore trouble with the site."
        }
      },
      {
        "author": "Madisen Cork",
        "rating": 4.0,
        "review": "Only reason it is 4 stars instead of 5 is because it can be really hard to communicate with them. They work with you with just about anything thankfully, but it can be really hard to get a call back because they always seem to be so busy! Kathy is really kind and seems like she really cares and it seems like she does a lot, and I hope she knows she's appreciated!",
        "ownerResponse": {
          "text": "Thank you Madisen.  We do appreciate you."
        }
      },
      {
        "author": "Cindy De Leon",
        "rating": 5.0,
        "review": "Just started renting under Piazza Realty Property Management Inc in October and so far everything that we've taken to them has been corrected/replaced in a quick manner, with no complaints/arguments.  Very nice staff to work with.",
        "ownerResponse": {
          "text": "Thank you so much Cindy! We appreicate you."
        }
      },
      {
        "author": "Danny Dean",
        "rating": 5.0,
        "review": "Been with them for over a year now, we recently had a big windstorm that caused a tree to fall into our powerlines pse rold us we had to have an electrician come out and repair stuff. Called Piazza at 8am and spoke to them about it and Maria had someone out here within a couple hours to take care of it!!! Thanks for your help!!!!!!",
        "ownerResponse": {
          "text": "Thank you Danny, We appreciate you taking the time leave this great review. It means so much to our staff."
        }
      },
      {
        "author": "Joe",
        "rating": 1.0,
        "review": "Dishonest in the way they do business and known as slum landlords in Skagit. Id stay away and look elsewhere! Not worth it",
        "ownerResponse": null
      },
      {
        "author": "Dylan Husby",
        "rating": 1.0,
        "review": "Everyone I ever know thats rented from here has absolutely hated it. Very rude, condescending staff, will fine you for complaints even if not valid. Multiple friends and family have given me this information. Do not rent from them :)",
        "ownerResponse": {
          "text": "Hi Dylan, I am sorry to hear of your experience with our company.  I have looked for you in our system and do not find you as a current or previous tenant.  I would love to discuss this further with you if you could reach out to me via email at kathy@piazzapropmgt.com or by phone at 360-424-7368.  Thank you."
        }
      },
      {
        "author": "Larry Hilliard",
        "rating": 5.0,
        "review": "I really like working with these people - Biri, Veronica, Kathy and the others working behind the scenes.  They are my \"go to\" team for finding tenants and executing leases. Thanks!  Larry H.",
        "ownerResponse": {
          "text": "Thank you Larry,  We like working with you too.  This review means a lot to all of us."
        }
      },
      {
        "author": "Noirceuil LeSombre",
        "rating": 4.0,
        "review": "Great staff. Very open and efficient. Friendly and helpful. Viewing and application process smooth.",
        "ownerResponse": {
          "text": "Thank you so much we appreciate your feedback."
        }
      },
      {
        "author": "David Torres",
        "rating": 4.0,
        "review": "We have rented for 7+ years with Piazza. Local Family and business, they are good to work with and have done good by us over the years. I would recommend.",
        "ownerResponse": {
          "text": "Thank you David.  We so appreciate our review."
        }
      },
      {
        "author": "Kjersti Mutchler",
        "rating": 1.0,
        "review": "This is the worst management company Ive ever rented from. Expect inspections beyond legal requirements, poor communication with very rude staff and management, unprofessional behavior, rent increases when reporting a problem with the property, and to be treated condescendingly. 0 stars......but in order to post this one star is required.",
        "ownerResponse": {
          "text": "Hi Kjersti, I have looked through our records and do not see you as a current or previous tenant.  If you have things that you would like to discuss I am more than happy to meet with you."
        }
      },
      {
        "author": "Brenda Porter",
        "rating": 1.0,
        "review": "Worst place I have ever rented from. They were never true to their word. Most dysfunctional employees. All were useless my entire time living in my rental. Never again will I rent from them.",
        "ownerResponse": {
          "text": "We are so sorry that you felt that way. Being in the middle between owners and renters is not an easy place but we do the VERY best we can for both. Sometimes there are irreconcilable differences in the relationships between owner and renters. We understand that. We try to carry out our responsibilities to owners as close to letter as we can. We advise owners of situations and recommend solutions. Sometimes it just doesn't work out. In the end, we have to respect the requests of the property owner and follow the letter of law when it comes to rental agreements. Sometimes people being unhappy with us is the price we pay for Property Management. Thank you for your feedback. We take this very seriously. We are evaluating carefully to be sure there are not some areas of opportunity for improvement for us as well.We wish you the best."
        }
      },
      {
        "author": "David Torretta",
        "rating": 5.0,
        "review": "This agencyIs absolutely awesomeIs absolutely awesome.I have five properties with themAnd they have totally been on top of things.",
        "ownerResponse": {
          "text": "Thank you David, your confidence is much appreciate by the whole staff."
        }
      },
      {
        "author": "AMA LUV",
        "rating": 5.0,
        "review": "I have rented from Kathy for 5 years and I would like to say that she is honest, respectful and truly cares about you!",
        "ownerResponse": {
          "text": "We appreciate your review so much. We do try hard to care for everyone.  We appreciate you!"
        }
      },
      {
        "author": "Jason BENSON",
        "rating": 5.0,
        "review": "We have been renting our town house thru piazza for close to three years now.  Any unexpected issues have always been resolved quickly and to our satisfaction.",
        "ownerResponse": {
          "text": "Thanks Jason, it's  been our pleasure working with you!!!"
        }
      },
      {
        "author": "Ezra Epstein",
        "rating": 5.0,
        "review": "They're a great property management team.",
        "ownerResponse": {
          "text": "Thank you so much Ezra!!! This means a ton to all of us. "
        }
      },
      {
        "author": "Johnna Rodriguez",
        "rating": 1.0,
        "review": "Horrible! The owner Paul is more respectful and really cares! Not like the manager Kathy! And all her office worker! They have bad customer service!",
        "ownerResponse": {
          "text": "We are so sorry that you felt that way. Being in the middle between owners and renters is not an easy place but we do the VERY best we can for both. Sometimes there are irreconcilable differences in the relationships between owner and renters. We understand that. We try to carry out our responsibilities to owners as close to letter as we can. We advise owners of situations and recommend solutions. Sometimes it just doesn't work out. In the end, we have to respect the requests of the property owner and follow the letter of law when it comes to rental agreements. Sometimes people being unhappy with us is the price we pay for Property Management. Thank you for your feedback. We take this very seriously. We are evaluating carefully to be sure there are not some areas of opportunity for improvement for us as well.We wish you the best."
        }
      },
      {
        "author": "Loretta Cantu",
        "rating": 5.0,
        "review": "I have enjoyed renting from them. They are friendly and when I need something fixed they get it done.",
        "ownerResponse": {
          "text": "Thank you Loretta.  We really appreciate you."
        }
      },
      {
        "author": "Holly Woodhams",
        "rating": 4.0,
        "review": "I would give them five stars if they had more properties available.  Especially outside of Mount Vernon.",
        "ownerResponse": {
          "text": "Thank you Holly, we appreciate your feedback, keep checking with us as we do get new properties in quite often."
        }
      },
      {
        "author": "Jay Bulworth",
        "rating": 1.0,
        "review": "She was rude. Very unpleasant to deal with over all and we chose to not even peruse business with them because of it.",
        "ownerResponse": null
      },
      {
        "author": "Doug",
        "rating": 2.0,
        "review": "In agreement with the other reviewer, I would have an attorney review any contract with this company before agreeing to lease one of their properties.",
        "ownerResponse": {
          "text": "Contracts should always be reviewed carefully and make sure that you know what you are signing.  We unfortunately are managers and not owners so it is the nature of our business to have to please our owners. We strive to help everyone but are not able to that."
        }
      },
      {
        "author": "Autumn Cameron",
        "rating": 5.0,
        "review": "Professional and friendly staff, will recommend to anyone I know looking for a clean and well managed property",
        "ownerResponse": {
          "text": "Thank you Autumn. We really appreciate you."
        }
      },
      {
        "author": "Aaronations Animations and Art",
        "rating": 1.0,
        "review": "Left mold in the house and spat in our faces 0/10 awful",
        "ownerResponse": {
          "text": "Hi Aaron, I've tried to find you in our system to review your account and was unable to locate your file. We have very few staff that interacts directly with our clients.  None of us would have spat on anyone.  This is a very untrue and unkind accusation.  If you would like to discuss issues with Piazza Realty Property Management please call Kathy at 360-424-7368 and let us know what name was on the rental agreement.  Thank you and Merry Christmas!!"
        }
      },
      {
        "author": "Adam Griffin",
        "rating": 5.0,
        "review": "Great to do business with. Very friendly and honest.",
        "ownerResponse": {
          "text": "Thank you Adam,\nWe appreciate this review very much."
        }
      },
      {
        "author": "Barbara Riley",
        "rating": 3.0,
        "review": "They are very friendly and helpful as can be!",
        "ownerResponse": {
          "text": "Thank you Barbara!"
        }
      },
      {
        "author": "Kevin Tinoco-Chavez",
        "rating": 5.0,
        "review": "Really nice and clean good assistants",
        "ownerResponse": {
          "text": "Thank you Kevin. Accrue really appreciate you taking the time for the review. That means a lot to us."
        }
      },
      {
        "author": "Renee Bradwell",
        "rating": 1.0,
        "review": "Not great property management.",
        "ownerResponse": {
          "text": "We are so sorry Renee.  We are a property managers and not owners.  We can only be an ambassador for the property owners.  We want to help everyone but unfortunatley we can't always do that.  Best of luck to you and your family."
        }
      },
      {
        "author": "Aj Howard",
        "rating": 3.0,
        "review": "Good place to rent from",
        "ownerResponse": {
          "text": "Thank you AJ,  If you need anything let us know."
        }
      },
      {
        "author": "Dianna Blankenship",
        "rating": 5.0,
        "review": "Great staff.",
        "ownerResponse": {
          "text": "Thank you so much Diana. We really apprecaite you taking the time to share this great review."
        }
      },
      {
        "author": "Stephen Murphy",
        "rating": 5.0,
        "review": "Good place to rent from",
        "ownerResponse": {
          "text": "Thank you Stephen, We very much appreciate the review."
        }
      },
      {
        "author": "Nathyeli Santiago",
        "rating": 5.0,
        "review": "The attention in the office is very pleasant",
        "ownerResponse": {
          "text": "Thanks for your review. We appreciate it very much!"
        }
      },
      {
        "author": "Renee Barley",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sonia Scott",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kimberlymarie Wilson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Kim, it has been our pleasure working with you for the last 15 years!"
        }
      },
      {
        "author": "Michelle Perkins",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tony Stokes",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Tony,  our whole staff appreciates your review.  You made our day."
        }
      },
      {
        "author": "Danger Pez",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you."
        }
      },
      {
        "author": "Becky Goodrich",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Our family has been in the property management business all my life.  We are always disappointed when owners and tenants clash over repairs, rules, property upkeep, community areas, owner responsibilities, or tenant accountability during the term of the rental.   As the property manager, we find ourselves sometimes in the unhappy position of delivering unpleasant news and owner expectations to tenants.  We wish your experience and the owner's experience with your tenantship was more amiable.  All we can do is do the best job we can for both our owners and our tenants.  We strive for both daily.   We wish you the best in your future."
        }
      },
      {
        "author": "Loni Osborne",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Loni, Thank you for your feedback.  It is clear you were disapointed but we don't know the reason. Please reach out to us for feedback.  As property managers , we are not owners and do our best to please both tenants and owners.  Best of luck to you."
        }
      },
      {
        "author": "angel west",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you  "
        }
      },
      {
        "author": "The Original Twelve",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Sorry for your experience.  Please contact our office and let us know how we could have done better."
        }
      },
      {
        "author": "sonny lopez",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 49,
  "adjusted_average_rating": 3.51,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is a summary generated by ChatGPT, intended to provide prospective tenants and property owners with insights into Piazza Realty Property Management Inc based on user reviews. It is for informational purposes only and does not serve as an endorsement or a critique of the company. As user experiences can be widely varied and subjective, this article aims to present a balanced view of the company's performance in property management.</p>  </section>  <section>    <h2>Good</h2>    <p>Some user reviews celebrate Piazza Realty Property Management Inc for their responsive and professional service. Several users have reported positive interactions with staff, describing them as helpful, supportive, and prompt in addressing queries and maintenance issues. Examples of efficient problem-solving and care for tenants underscore the company's capability to provide satisfying customer experiences.</p>    <p>Long-term renters with Piazza Realty have commended the company for their ongoing support and attention to issues that arise, pointing to an established relationship of trust and reliability. Positive experiences have not been limited to renters; property owners have also praised the company for managing their properties effectively, finding dependable tenants, and ensuring that their investments are well taken care of over many years.</p>  </section>  <section>    <h2>Great</h2>    <p>There are instances where the company has gone above and beyond expectations, with user reviews mentioning staff who are not only knowledgeable and friendly but also extremely responsive. An instance of a rapid response to an emergency situation, where a tenant reported a fallen tree due to a windstorm, illustrates Piazza Realty's commitment to timely service and tenant safety.</p>    <p>Several users who've transitioned from tenants to property owners entrusting their properties to Piazza Realty have indicated great satisfaction with the management services offered. Highlighting the ease of the rental application process and the company's dedication to treating clients with respect and empathy, these reviews illustrate strong reasons why Piazza Realty has garnered long-standing client relationships.</p>  </section>  <section>    <h2>Bad</h2>    <p>Not all experiences recounted in user reviews reflect positively on Piazza Realty Property Management Inc. There are reports of users experiencing slow processing times, poor communication, and unwelcoming office interactions. Cases where users felt discriminated against or treated rudely over the phone contrast sharply with positive accounts, showcasing areas where the company's service could be perceived as lacking.</p>    <p>Difficulties in getting responses from the management, unexpected rent increases, and discontentment with the lease agreement processing times are some of the concerns voiced by dissatisfied customers. These reviews suggest a need for the company to enhance its customer service and communication strategies to ensure that all clients feel heard and valued.</p>  </section>  <section>    <h2>Ugly</h2>    <p>Some user reviews describe severely negative experiences, detailing instances of neglected maintenance requests, unsanitary move-in conditions, and unreturned deposits. One reviewer in particular lamented the existence of rats and a pile of garbage left by previous tenants, coupled with lackluster responsiveness from the company regarding complaints and maintenance work, highlighting an ugly aspect of the company's service.</p>    <p>Additionally, there are accusations hinting at dishonest business practices and unprofessional behavior, with a reviewer calling Piazza Realty \"slum landlords.\" These serious concerns, combined with stories of financial disputes and credit issues following the lease term, reveal the gravest criticisms the company faces. Despite these accounts, it's important to note that the company has engaged with many of the negative reviews, offering opportunities for dialogue and resolution.</p>  </section></article>"
}