{
  "name": "Pomeroy Court Appartments",
  "slug": "pomeroy-court-appartments",
  "company_type": "property",
  "address": "3100 Ferry Ave Bellingham, WA 98225",
  "review_count": 9,
  "average_rating": 2.89,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "A M.",
        "rating": 1,
        "review": "Went to college up here and made the mistake of living here. They are a scam. If you want your security deposit back, don't count on it. They lie and blame others for something they screwed up. For example: they would say my roommate was lying to me about parking, rent, etc., to get out of the fact that they acted without reason. Seriously WATCH OUT. Luckily as men, we were able to fix stuff on our own, but I know their maintenance man, Daniel, is useless when helping my friends who were other tenants. They are nice to your face, but it's a SCAM. Other tenants are actually taking them to COURT to get their deposits back.  THEY ARE NOT WORTH THE HEADACHE. FIND SOMEWHERE ELSE.",
        "ownerResponse": null
      },
      {
        "author": "Mark B.",
        "rating": 1,
        "review": "To reiterate what the other reviewer said, these people are crooks!  My daughter rented and apartment for two years and we have been fighting to get the security deposit returned.  We left the place in excellent condition and they made up damages to justify retaining 88% of the $800 deposit.  We took them to small claims court and won.  Now they're trying to stiff us on the amount of the original deposit refund.  Unscrupulous, lying, cheating, low down dirty SOB of an owner!  Don't reward this piece of work by renting one of his apartments!",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "maddy white",
        "rating": 5.0,
        "review": "I really love the new management. It seems as though they really care about making sure issues are taken care of in a timely manner. The new property managers are the main reason why my roommates and I resigned our lease for next year.\n\nIt also seems like they are starting to renovate parts of the buildings. We just got new railings for the stairs and balconies and they look great and feel so much safer.",
        "ownerResponse": {
          "text": "Hello Maddy - thank you for the review! We're glad to see that you are choosing to stay another year."
        }
      },
      {
        "author": "R H",
        "rating": 1.0,
        "review": "It took weeks/months for maintenance to fix requests which still were done wrong. There has been on and off construction for a year, the water was shut off randomly because they hit a line, then they boarded off the back doors in each unit so you weren't allowed to use your own porch for a month. They raise rent for their units every year. I got no less than a hundred mass texts about parking while I lived here from management.\n\nUPDATE: the manager took 90% of the entire deposit siting cleaning fees and maintenance for 8 hours worth of work yet the unit was deep cleaned before even leaving which was noted by the manager. The manager then didn't respond to emails asking why they took 1000 dollars and gave back 50. The on-site manager was rude and unhelpful. There are newer and nicer places, I recommend those.",
        "ownerResponse": null
      },
      {
        "author": "Willow Roark",
        "rating": 3.0,
        "review": "I lived there for a 2 years. It wasn't horrible but there were a lot of issues.\nPros: There's a gorgeous trail right next to it that leads right to the interurban system, the high school, and Joe's Garden. There's always bunnies and birds around. Sometimes there was noise from music, but not a lot at all. They gave decent notice for entrances. They allow pets with a fee: it was around 200-300 dollars. Hot water in our unit lasts a surprisingly long time. It's a ~16 minute walk from campus through the beautiful arboretum. There's bus stops around a 4 minute walk away.\nCons: I was never offered a tour of the apartment. The washing machines are often out of service, and only some units have in-unit laundry (highly recommend finding one of those). The dishwasher is inefficient and often leaves food on our plates left to wash. Our hot water heater exploded and flooded our apartment one night. The whole complex is aging and the rent is far higher than it's worth. I believe this used to be primarily a family complex so one room in our two bedroom is much larger than the other. Hagen, the nearby grocery outlet, is not an affordable. The parking is very limited and you need to have guests park a block away. The baseboard heating is inefficient and costs a lot on the energy bill. The bathroom's amenities were aged and our shower ceramic had chips in it. Not secure: we were robbed while we were there. Mildew is almost impossible to prevent and becomes a health hazard. The parking lot has a lot of vertical inclines and is very hard to navigate: folks with mobility related disabilities be advised. No in-unit AC, which becomes a problem as the PNW gets hotter.",
        "ownerResponse": null
      },
      {
        "author": "Jordyn Michelle",
        "rating": 2.0,
        "review": "Not fancy by any means. You can tell management and handymen care, but youre still paying an arm and a leg for four walls and a toilet. Also, dont be surprised if you find bugs if you live in the bottom floor",
        "ownerResponse": {
          "text": "Hello Jordyn - thank you for the kind words for management and maintenance. If you have any issues that you think management can resolve, please do not hesitate to reach out to the on-site office."
        }
      },
      {
        "author": "Gage Hall",
        "rating": 5.0,
        "review": "My Maintenance was scheduled on my time and the handyman, Steve, was extremely kind and outgoing, he made a quick an easy job fixing my bathroom shower head and sink stopper.",
        "ownerResponse": {
          "text": "Thank you Gage for the review"
        }
      },
      {
        "author": "Bim S",
        "rating": 5.0,
        "review": "In a really nice area!",
        "ownerResponse": null
      },
      {
        "author": "Cole Miller",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello Cole - it sounds like there's something we could have done to better accommodate you. Please reach out to the on-site office and let the manager know how we could have done better. Thank you!"
        }
      }
    ]
  },
  "adjusted_review_count": 8,
  "adjusted_average_rating": 2.88,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPH and is intended to serve as a tool to assist individuals in finding a property management company or rental property. The summary is based on local property management company reviews and does not include any identifiable information such as names of the reviewers. The sentiment expressed herein aims to provide a balanced view of the strengths and weaknesses of the company based on user reviews.</p>  </section>    <section>    <heading><h2>Good</h2></heading>    <p>Pomeroy Court Apartments have certainly impressed various tenants with new management that shows dedication to timely resolutions of issues. One user review highlighted how the presence of new property managers was a deciding factor in renewing their lease, demonstrating a level of satisfaction with the current administration. Residents have noticed efforts to upgrade the building, including the recent addition of new railings on staircases and balconies for safety and aesthetic improvements.</p>    <p>Positive interactions with the maintenance staff have been noted, with a tenant stating that their scheduled maintenance was not only timely but also that the handyman displayed a friendly and professional demeanor during the service. This indicates a commendable level of customer service and operational efficiency, contributing to some high ratings in user reviews.</p>  </section>    <section>    <heading><h2>Great</h2></heading>    <p>From the user reviews, it's clear some residents find the location of Pomeroy Court Apartments to be a significant advantage. Descriptions of natural trails close by, access to local amenities, and a generally peaceful environment with little noise pollution have come up in the discourse, painting a picture of a quaint and charming living situation for nature lovers and those who appreciate tranquility.</p>    <p>Furthermore, the management has demonstrated responsiveness to user reviews with prompt and courteous replies, acknowledging positive sentiments and offering assistance for any reported issues. Such interaction could be seen as evidence of an active and attentive administration focused on maintaining tenant satisfaction and upholding the reputation of Pomeroy Court Apartments.</p>  </section>    <section>    <heading><h2>Bad</h2></heading>    <p>On the less positive side, there have been some user reviews indicating dissatisfaction with the management's handling of security deposits. Multiple tenants have reported difficulty obtaining their deposits back after moving out, with some even mentioning that excessive deductions for damages were made unjustly. In at least one case, this led to a small claims court dispute, where the tenant prevailed, suggesting there may be validity to the grievances regarding the deposit practices.</p>    <p>Another issue that has repeatedly come to light is the state of maintenance and service requests, which are reported to take an unreasonably long time to address or are sometimes completed incorrectly. The long wait and inadequate resolution of maintenance problems can significantly impact the quality of life for residents and have contributed to a lower overall satisfaction with the management's performance.</p>  </section>    <section>    <heading><h2>Ugly</h2></heading>    <p>An area of serious concern involves allegations of pest issues, particularly on the ground floor, and infrastructural inefficiencies, as remarked upon by tenants. A resident shared their experience with an exploding water heater which caused flooding—an incident indicative of potentially aging infrastructure. Further compounding these issues are reports of limited parking, inefficient heating, and a suggestion that the rent may not correspond to the value of the living experience offered.</p>    <p>Security too has been called into question, with one user sharing an unfortunate instance of theft, highlighting a need for improved measures. Additionally, the struggle with persistent mildew problems suggests a need for better ventilation or damp proofing, which, if not addressed, can lead to hazardous living conditions. When such critical concerns are aired in user reviews, they point to areas where the property management company may need to invest significantly in improvements to meet the expectations of current and future tenants.</p>  </section></article>"
}