{
  "name": "Pomeroy Court Apartments",
  "slug": "pomeroy-court-apartments",
  "company_type": "Property",
  "address": "3100 Ferry Ave, Bellingham, WA 98225",
  "review_count": 12,
  "average_rating": 4.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Scruffy",
        "rating": 4,
        "review": "I lived at Pomeroy court for 2 years while studying at WWU, and I wanted to share a few thoughts about the place:\n\nManagement: Pretty good, maintenance requests at least get addressed within a week. Im writing this review as my roommates and I have gotten back our deposit (minus a 220$ cleaning fee).\n\nParking: Acceptable, 100ish$ one-time fee, no guest parking, no street parking nearby, tandem parking for units with 2 cars. Its on a slant so its not super safe to get out in the snow.\n\nLocation: Theres a bus-stop about a block away, but since WWU campus is at most a scenic 20 minute walk through the arboretum, I never took the bus. Theres also a lot of shops a few blocks away, so it is feasible to not have a car here. (Haggen is affordable if you buy the right stuff).\n\nThe unit itself: Good, lots of old appliances that work better than new ones, lots of space. We did run into minor issues with mold (windowsill, bathroom ceiling, sink). They made us leave the heat on all winter so pipes didnt freeze. I recommend a unit with a built in washer/dryer.\n\nOverall, this is a good place to live. If the rent is reasonable compared to nearby properties, it is a great choice. Hope this was helpful to someone out there.",
        "owner_response": {
          "text": "Hello! Thanks for leaving a thorough review of your time at Pomeroy Court! It helps us identify areas where we can improve for future tenants."
        }
      },
      {
        "author": "maddy white",
        "rating": 5,
        "review": "I really love the new management. It seems as though they really care about making sure issues are taken care of in a timely manner. The new property managers are the main reason why my roommates and I resigned our lease for next year.\n\nIt also seems like they are starting to renovate parts of the buildings. We just got new railings for the stairs and balconies and they look great and feel so much safer.",
        "owner_response": {
          "text": "Hello Maddy - thank you for the review! We're glad to see that you are choosing to stay another year."
        }
      },
      {
        "author": "Noa Haskell",
        "rating": 5,
        "review": "Great repair services, dusty helped install an emergency toilet in my apartment. It was incredibly quick and he was very friendly",
        "owner_response": null
      },
      {
        "author": "Willow Roark",
        "rating": 3,
        "review": "I lived there for a 2 years. It wasn't horrible but there were a lot of issues.\nPros: There's a gorgeous trail right next to it that leads right to the interurban system, the high school, and Joe's Garden. There's always bunnies and birds around. Sometimes there was noise from music, but not a lot at all. They gave decent notice for entrances. They allow pets with a fee: it was around 200-300 dollars. Hot water in our unit lasts a surprisingly long time. It's a ~16 minute walk from campus through the beautiful arboretum. There's bus stops around a 4 minute walk away.\nCons: I was never offered a tour of the apartment. The washing machines are often out of service, and only some units have in-unit laundry (highly recommend finding one of those). The dishwasher is inefficient and often leaves food on our plates left to wash. Our hot water heater exploded and flooded our apartment one night. The whole complex is aging and the rent is far higher than it's worth. I believe this used to be primarily a family complex so one room in our two bedroom is much larger than the other. Hagen, the nearby grocery outlet, is not an affordable. The parking is very limited and you need to have guests park a block away. The baseboard heating is inefficient and costs a lot on the energy bill. The bathroom's amenities were aged and our shower ceramic had chips in it. Not secure: we were robbed while we were there. Mildew is almost impossible to prevent and becomes a health hazard. The parking lot has a lot of vertical inclines and is very hard to navigate: folks with mobility related disabilities be advised. No in-unit AC, which becomes a problem as the PNW gets hotter.",
        "owner_response": null
      },
      {
        "author": "Raina Hoy",
        "rating": 1,
        "review": "It took weeks/months for maintenance to fix requests which still were done wrong. There has been on and off construction for a year, the water was shut off randomly because they hit a line, then they boarded off the back doors in each unit so you weren't allowed to use your own porch for a month. They raise rent for their units every year. I got no less than a hundred mass texts about parking while I lived here from management.\n\nUPDATE: the manager took 90% of the entire deposit siting cleaning fees and maintenance for 8 hours worth of work yet the unit was deep cleaned before even leaving which was noted by the manager. The manager then didn't respond to emails asking why they took 1000 dollars and gave back 50. The on-site manager was rude and unhelpful. There are newer and nicer places, I recommend those.",
        "owner_response": null
      },
      {
        "author": "Gage Hall",
        "rating": 5,
        "review": "My Maintenance was scheduled on my time and the handyman, Steve, was extremely kind and outgoing, he made a quick an easy job fixing my bathroom shower head and sink stopper.",
        "owner_response": {
          "text": "Thank you Gage for the review"
        }
      },
      {
        "author": "haley newell",
        "rating": 5,
        "review": "Everything went smoothly, Dustin was very helpful and nice!",
        "owner_response": {
          "text": "Hi Haley! We're glad you had such a positive experience with us! We wish you luck in all your future endeavors!"
        }
      },
      {
        "author": "Jordyn Michelle",
        "rating": 2,
        "review": "Not fancy by any means. You can tell management and handymen care, but youre still paying an arm and a leg for four walls and a toilet. Also, dont be surprised if you find bugs if you live in the bottom floor",
        "owner_response": {
          "text": "Hello Jordyn - thank you for the kind words for management and maintenance. If you have any issues that you think management can resolve, please do not hesitate to reach out to the on-site office."
        }
      },
      {
        "author": "Bim S",
        "rating": 5,
        "review": "In a really nice area!",
        "owner_response": null
      },
      {
        "author": "Emma Kozel",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Emma - thank you for the five star review!  We're glad we could provide you with an excellent experience!"
        }
      },
      {
        "author": "anthony arce",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Anthony - thank you for your positive review! We hope that you enjoy your time with us!"
        }
      },
      {
        "author": "Cole Miller",
        "rating": 3,
        "review": "",
        "owner_response": {
          "text": "Hello Cole - it sounds like there's something we could have done to better accommodate you. Please reach out to the on-site office and let the manager know how we could have done better. Thank you!"
        }
      }
    ]
  },
  "adjusted_review_count": 9,
  "adjusted_average_rating": 3.89,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 2,
    "4": 1,
    "5": 7
  },
  "summary": {
    "created_timestamp": 1739095122,
    "text": "<section id=\"good\"><h2>Good</h2><p>Pomeroy Court Apartments has received a number of favorable reviews highlighting a generally positive living experience. Many users noted that management is responsive to maintenance requests, with issues often being addressed within a week. One tenant mentioned that they appreciated the ample living space and the functionality of the older appliances, emphasizing that despite minor issues like mold, the apartment provided a comfortable environment for them during their university years.</p><p>The property is also praised for its location, with easy access to local amenities and public transportation. One resident reflected on the peaceful surroundings, such as the nearby trails and greenery that added to a pleasing atmosphere. Additionally, tenants have reported success in recovering their security deposits, showing that management adheres to some level of accountability regarding tenant finances.</p></section><section id=\"great\"><h2>Great</h2><p>The new management team at Pomeroy Court Apartments has been recognized for their attentiveness and care, sparking enthusiasm among residents. Multiple users have expressed satisfaction with recent renovations, including improvements to stair railings that offer a safer experience for tenants. One tenant highlighted the professionalism and friendliness of the maintenance staff, who effectively resolved issues in a timely manner.</p><pMoreover, several reviews mentioned the convenience of having maintenance scheduled according to tenant availability, enhancing overall customer satisfaction. The property is characterized by a friendly atmosphere and community vibe, which has played a significant role in tenants choosing to renew their leases. This elevates Pomeroy Court as a prime choice for those seeking a supportive living environment.</p></section><section id=\"bad\"><h2>Bad</h2><p>While the property has its strengths, several user reviews have drawn attention to critical issues. Some tenants reported a lack of efficiency in addressing maintenance concerns, with delays of weeks or even months before repairs were completed. For instance, one resident recounted a significant flooding incident due to a malfunctioning hot water heater, which reflects potential gaps in the timely response to serious maintenance issues.</p><pAdditionally, concerns regarding cleanliness and the state of appliances were mentioned frequently. Reviews highlight frustrations with shared laundry facilities, which reportedly were often out of service, and the ineffective dishwashers that left food residue on dishes. This indicates that despite the positive aspects, there are tangible areas in need of improvement to enhance tenant satisfaction.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThe user reviews reflect some deeply troubling experiences that tenants have faced at Pomeroy Court Apartments. One resident shared a harrowing account of their security deposit being significantly reduced, with most of it claimed through unwarranted cleaning fees despite a deep clean performed before leaving. Instances of poor communication from management related to maintenance requests and overall tenant queries exacerbated feelings of neglect among residents.</p><pMoreover, safety concerns have emerged, with reports of theft within the units and insufficient measures taken to address such incidents. Another tenant mentioned frustrating ongoing construction and random water shutoffs, which further damaged the living experience. These issues paint a concerning picture of the management's approach to tenant relations and property upkeep, indicating a pressing need for operational improvements.</p></section>"
  }
}