{
  "name": "Porchlight Property Management LLC",
  "slug": "porchlight-property-management-llc",
  "company_type": "Company",
  "address": "519 Front St suite a, Lynden, WA 98264",
  "review_count": 38,
  "average_rating": 3.63,
  "reviews": {
    "google_reviews": [
      {
        "author": "Michelle Reida",
        "rating": 1,
        "review": "I began renting a property right before the pandemic and my rent was 1600. When my lease was up,  they only allowed 3 month leases and raised the rent and tried to say that I no longer qualified as I didn't make 3 times the new rent(which I didn't make prior to them renting to me)  then when that renewal was up,  they raised the rent again only allowing a 6 month lease renewal,  and then raised it again.  From march 2020 until march 2023, rent went from 1600-2250. And then they refused to renew my lease stating that they were going to remodel the unit (brand new when I moved in). Received a month notice of this and really put myself and my children in a tough spot.  They were great the first year,  compassionate,  great with communication.  But then it just fell off.  I'm disappointed with the direction they went and seems that greed crept in.  They now manage almost all rentals in Lynden and was forced to move outside of my children's home town.",
        "owner_response": {
          "text": "Hi Michelle,\n\nThank you for sharing your feedback. We understand that rent increases can be frustrating, and we always aim to balance affordability with maintaining the property in good condition. Regarding the remodel on your unit, we take these matters seriously and work hard to ensure owners that all tenants are taking good care of their units. You had extensive cat urine throughout the unit, items left behind, damage to bathroom cabinet, trim damage, carpet was shredded, holes in a door, all walls had extensive markings which led to a full repaint of the unit, as well as leaving the unit infested with Fleas. So yes, it was a brand new unit when you moved in, but you left it in poor condition as there was no attempt to clean anything. If you would like to discuss the specifics of your concerns further or if there are any outstanding issues, please feel free to reach out to us directly.\n"
        }
      },
      {
        "author": "Tony Salinero",
        "rating": 5,
        "review": "The Porchlight Property Management team has been excelent. My relocation from out of town was smooth and they worked with me on move in dates. The staff has always been super helpful expecially when showing me properties and knowing the details. They respond quickly to all of my inquiries. I have not had any issues.\nJust recently, due to personal reasons, I had to relocate again across town into a bigger rental. Porchlight helped me identify a location that fit my needs and they quickly assisted in re-homeing me. The paperwork was a breeze. Thank you so much Porchlight for all of the assistance.",
        "owner_response": null
      },
      {
        "author": "Someone",
        "rating": 1,
        "review": "They do not repair anything and when we hound them about it they get annoyed with us, I had to throw away ~300$ worth of food because our fridge belt came off and we had to message them multiple times and my grandparents had to fix the belt, then when the guys came to look at it they said they'll take care of it the next time it breaks, so now I'm in the same situation, threw away more food and my family and I are unhappy. Won't be renting from them again after our lease it up!",
        "owner_response": null
      },
      {
        "author": "Leslie",
        "rating": 1,
        "review": "Horrible management from the start of them taking over La Villa Apartments.\nWouldn't fix anything unless we messaged them multiple times within a week, harassed us for being loud when it was the next door neighbor, didn't notify us about any missing payments till 3 months after so we got stacked over multiple months of late fees which they took all of our security deposit for AND no explanation for a Non-renewable lease.\nWe are no longer there but still getting harassed by them for the \"rest of the payments \".\nAlso talked with tenants who is going through the same thing.\nDO NOT RENT FROM THIS COMPANY",
        "owner_response": null
      },
      {
        "author": "deedee zarate",
        "rating": 1,
        "review": "I hate writing bad reviews but this couldn't go unnoticed. We were excited to move into the La Villa apartments and at first the staff was really helpful and nice. As time progressed, we had a few problems with our upstairs neighbors (a couple of times it was ineed our faults, we got a noise complaint for our FIRST day moving in and for having a party, which we take complete ownership of that) but things progressively started to get worse with them. Like they literally came to our apartment and smashed our pumpkins that we had outside and left a mess. I was then confronted multiple times on different occasions by them as well as another lady who lived a few apartment while I was by myself. Even after seeking help from the property managers, no moves we're made to ensure our safety.\n\nWe've just recently moved out and we're charged a $400 cleaning fee even though we took a few days to deep clean it. They even commented on how clean it was and still charged us. As well as almost charging us for a one of the bedroom lights that stopped working even though I had emailed weeks prior to our move out date. Had it not been for us going to the office and confronting them they most likely would've taken our deposit for something we had no control over. These are just a couple of our experiences.\n\nFor having multiple properties, they really lack on the communication department. I hope the best for them but I 1/10 do not recommend.",
        "owner_response": {
          "text": "We're disappointed to hear you didn't have a great experience with Porchlight. We try to foster good relationships, but always recommend that tenants reach out to law enforcement when they have problems with neighboring tenants or feel threatened. We don't have cameras on a lot of our properties, so it's not always possible to resolve issues when individuals have differing perspectives of events. \nWe make it a general rule never to comment on the cleanliness of a unit prior to keys being turned in, because a unit can appear clean on the surface, but actually still need quite a few hours of work.\nWe recently acquired a new full-time Maintenance Coordinator, so any deficiencies in communications regarding repairs and maintenance have been improved upon!  We're sorry La Villa didn't work out for you long term, but wish you the best."
        }
      },
      {
        "author": "Rashel lyn",
        "rating": 5,
        "review": "This may be a a 2 part review, this is the review for the start of my rental process:\nI had the pleaser in meeting Haleigh for 3 different available apartments- She was super sweet, Kind and a joy to talk to. I originally applied for we will call it \"C\" apartment it was cute small but cozy so I applied. It was painless super easy & on-line love that, the following day I called and asked her if there was a way that I could change my application for a different property sense rent was a little cheaper and I would like to see them she agreed met me there an hour after our conversation. Picked the one I liked the best and with in minuets of getting home my application had been changed. I have emailed her a few time with questions or answer to her questions and she has always been Super sweet.  So far its a 4 star review for me to be continued.......",
        "owner_response": null
      },
      {
        "author": "Angela Huidekoper",
        "rating": 1,
        "review": "DO NOT RENT FROM THIS COMPANY!\n\nThey withheld $430 of our deposit and refused to do a move-out walkthrough. They also never repaired a window that wouldnt close completely the whole 12 months we lived there.\n\nAs for the deposit, $320 was for cleaning even though we cleaned the townhouse thoroughly and paid over $200 for professional carpet cleaning before we moved out. They claim they had to pay a house cleaner for 8 hours at her rate of $40 per hour. Were from Northern California and house cleaners around here dont even make that much. $45 was for a towel bar that apparently came loose from the wall, even though I have pictures that show it was still in place when we moved out. $65 was for blinds that were broken when we moved in. We told them on the move-in checklist and in person, and they never replaced them. They have since returned this $65, but its annoying that they didnt even bother to look at the checklist before returning the deposit. They stopped responding to my emails, so Im now going to have to go through small claims court to get the $365 they still owe.",
        "owner_response": null
      },
      {
        "author": "Kaitlyn Graves",
        "rating": 1,
        "review": "I had applied for a commercial unit porch light was responsible for. After a month of emailing back and forth,  I was informed that I had been approved for the unit and that they would write up the lease for it.  And since i had been approved i had turned down other location availabilities. A few days later I inquired about when the lease would be ready so I could sign it and move forward with planning. They later responded saying that they were no longer going to rent out said unit,  as they were expanding and needed more room for offices (they rent the neighboring unit). They said they had another unit just up the street available, but for a higher rent (over double the original units price).  I stopped and looked at the second unit and low and behold, the unit had an office layout, and was roughly 3x the size of the original unit i wanted. Which I could have made work but the second unit didn't have the amenities that I needed, specifically water and drainage, which the first unit already had in place. So I inquired about what it would take to get unit #2 to a point I could use it for the purpose I needed. They never responded back to me.\n\nOverall I feel like they didn't want my business as a neighboring business. Which I would have understood if they said such a thing right away once i told them my intentions for the unit from the very beginning. But if they needed to expand their business and needed more room for OFFICES, they should have considered moving 100 yards up the street into the building that was significantly bigger and was already set up for offices. Leaving the original unit i had applied (and been approved for) open.",
        "owner_response": null
      },
      {
        "author": "Brenda Calvert",
        "rating": 5,
        "review": "Porchlight was prompt in helping us find an apartment.  Great communication and response time.  Trustworthy establishment that will be easy to work with.",
        "owner_response": null
      },
      {
        "author": "Carrie Carebear Starr",
        "rating": 5,
        "review": "Wonderful experience with the different staff members that I've been able to work with.  Marlae is great at what she does,  but is also a STELLAR HUMAN BEING. The entire experience & time in which I was living in a rental managed by Porchlight, I have had exemplary service.  They are extremely helpful, personable,  responsive and a pleasure to work with. I've never had a problem with them during the 2 years in which they were managing the property in which I was living.",
        "owner_response": null
      },
      {
        "author": "Vitaliy Shtempel",
        "rating": 1,
        "review": "Pure scam - showed me 2 apartments, after coming and seen those apartments, she told me that they are NOT AVAILABLE right away during showings, because someone already applied and been approved. Charged 40$ TWICE for showing UNAVAILABLE TO APPLY APARTMENTS.\nWaste of time and money. STAY AWAY FROM THEM!\n\nUPDATE: Both charges already refunded by my bank!\nThey continue to lie even in their reply. Not even mentioning that their staff been late for a meeting, showing me 2! Apartments that were NOT AVAILABLE. And charging a fee for that! What are you talking about treatment or documentation liars?\nI AM HAPPY NOT TO DEAL WITH YOU PROFESSIONALS. And asking anyone who will read this not to waste their time!",
        "owner_response": {
          "text": "Hi Vitaliy, I'm sorry you had a negative experience with our company. Properties have been renting very quickly lately, and we're not always immediately aware when someone applies online for one of our units. Also, documents we requested from you to support your applications were not provided promptly, which left the opportunity for others to apply. We only charge one application fee, per adult, regardless of how many showings. You applied with another adult, so you were each charged one application fee. After receiving the requested information, our staff person called to offer you a different unit, and was told you had found a different property to rent. Based on your treatment of our staff, we don't regret our hesitancy in approving your applications."
        }
      },
      {
        "author": "Yevgeniy Zadneprovskiy",
        "rating": 5,
        "review": "Best Property Management company weve worked with. They were very professional, response times were quick and when we had a couple issues come up at our rental we had resolution quickly. Both Mitzi and Marlae were awesome and wed happily work with them again.",
        "owner_response": null
      },
      {
        "author": "Sergio Coln",
        "rating": 5,
        "review": "I helped my tenant relocate to a property managed by Porchlight Properties.  Brandee was very professional and informative.  Great communication and very responsive with email and phone.  Thank you!!",
        "owner_response": null
      },
      {
        "author": "Jeff Pygott",
        "rating": 1,
        "review": "I would not use them again.\nLots of tenant damage, and they didn't do a walk through before the tenants left.\nI was left to pursue them on my own.",
        "owner_response": {
          "text": "Our policy is to conduct a final walk-through after the tenants turn in keys. In this case, the tenants dropped the keys through our night slot over a weekend, and by Monday morning, the owners had moved back into the property (without notifying us of their return date). The home was 20+ years old, and had been occupied by the same tenants for 7+ years, and there was undeniably some wear and tear. The home was also quite dated, and the owners had told us they would be remodeling prior to moving back in, so its possible we weren't as diligent near the end of the tenancy (since there had been no obvious damage during any of our visits).The tenants had a mentally disabled child (who grew to maturity) while residing there, as well as an emotional support animal, and there was some pretty significant damage to walls, trim, cabinets, flooring, etc. We sent a contractor to the home to provide an estimate for repairs, but he was turned away. We told the owners we needed to send the tenant a statement, or refund of their deposit within 21 days, but they didn't send their estimated charges until six days after the deadline. Prior to that, we assessed the damages (based on our standardized list of charges), sent the tenant a statement and retained their deposit. We billed the tenant, several thousand dollars, which we believe they would've eventually paid, had the owner not taken legal action. We were legally not permitted to send them to collections, due to Covid-19 restrictions. The owner is pursuing payment of an amount we believe is equivalent to the cost of a significant remodel.\nOur creed has always been \"Adhering to the Golden Rule to provide the gold standard in property management\", and we strive to always treat our people (and our properties) as we would want to be treated. We are disappointed when someone isn't happy with our service, but fortunately that is a rare occurrence!\n"
        }
      },
      {
        "author": "Jan Szczygielski",
        "rating": 1,
        "review": "It's just my personal experience, but when they go and start making false accusations about my dog biting people that is going to far.\n\nOther's might have a completely different experience.",
        "owner_response": null
      },
      {
        "author": "Derek Schranz",
        "rating": 1,
        "review": "These property managers are not professional by any means!!  They wont fix things, wont correspond with you, talk down to you and treat people unfairly!!   I would not recommend renting from them at all!!!  STAY FAR FAR AWAY FROM THEM OR THEIR BUSINESSES!!",
        "owner_response": null
      },
      {
        "author": "Sherryann Johnson",
        "rating": 5,
        "review": "Never rented from a property management co before but they were wonderful and we are very happily settling into our new house  ",
        "owner_response": null
      },
      {
        "author": "cory daniel wolf",
        "rating": 5,
        "review": "I sure appreciate the management team at Porchlight Property Management, they are always very pleasant and helpful if I have any problems!",
        "owner_response": null
      },
      {
        "author": "Timothy Radch",
        "rating": 5,
        "review": "Great company and friendly people, was a pleasure dealing with them.",
        "owner_response": null
      },
      {
        "author": "gunarmc",
        "rating": 5,
        "review": "Excellent people to do with. The office staff is so nice!",
        "owner_response": null
      },
      {
        "author": "Sorceress Mystic",
        "rating": 1,
        "review": "Dishonest if used as a reference once you move from a property managed by them\nreally difficult to deal with when it comes to maintenance issues",
        "owner_response": null
      },
      {
        "author": "Jem Hayes",
        "rating": 5,
        "review": "Much love for porch light property management always there for you, very understanding and flexible",
        "owner_response": {
          "text": "Thanks Jem!"
        }
      },
      {
        "author": "Juniorprincetroyneilesia Loeak",
        "rating": 5,
        "review": "Marlae and the other Lady theyre Personnel friendly and helpful. Would recommend Porchlight management  to anyone.\n\nThanks;setah",
        "owner_response": null
      },
      {
        "author": "1One Love",
        "rating": 1,
        "review": "They lied about renting a unit to me and tried to take my deposit",
        "owner_response": {
          "text": "Since this person provided vague 1-star reviews for several property management firms at nearly the same time, it appears to be an unfounded negative campaign against property managers in general. We only take a deposit after someone is approved for a unit, which holds the unit for up to 10 days, and is applied to first month's rent. "
        }
      },
      {
        "author": "Kennedy Chauvin",
        "rating": 5,
        "review": "I  love these guuuurls! ",
        "owner_response": null
      },
      {
        "author": "DeeNaaLee",
        "rating": 5,
        "review": "These kind folks have been wonderful",
        "owner_response": null
      },
      {
        "author": "G GT T",
        "rating": 5,
        "review": "The best",
        "owner_response": {
          "text": "Thank you Geoff!"
        }
      },
      {
        "author": "Vicki Ballinger",
        "rating": 1,
        "review": "Not very responsive to the tenant.",
        "owner_response": null
      },
      {
        "author": "jose lobo fernandez",
        "rating": 5,
        "review": "Nice and gently people",
        "owner_response": null
      },
      {
        "author": "William Jackson",
        "rating": 5,
        "review": "Would recommend highly",
        "owner_response": null
      },
      {
        "author": "Cody S",
        "rating": 5,
        "review": "Mitzi is very nice",
        "owner_response": null
      },
      {
        "author": "Gurwinder Gill",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Steven George",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mongol Rain Pix",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Daniel Crutchfield",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the review Daniel. We appreciate constructive criticism, and would love to know where we could do to improve and earn that fifth star! "
        }
      },
      {
        "author": "Human",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kylee King",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Charmae Scheffer",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 31,
  "adjusted_average_rating": 3.32,
  "distribution": {
    "1": 13,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 25
  },
  "summary": {
    "created_timestamp": 1739095124,
    "text": "<section id=\"good\"><h2>Good</h2><p>Some users have highlighted the positive experiences they had with Porchlight Property Management LLC, particularly noting their friendly and helpful staff. Many reviews mention the quick response times when inquiries were made, fostering a sense of trust and reliability among tenants. For instance, one reviewer praised the professionalism exhibited by the management team during their relocation process, emphasizing that the paperwork was seamless and the support provided was invaluable.</p><p>Additionally, users appreciate the efforts made by the staff in accommodating tenant needs, with specific mentions of staff members by name who have gone above and beyond to assist. The overall sentiment in these accounts reflects a company that is invested in maintaining positive relationships with tenants, exemplified by multiple reviews expressing gratitude for the attentive service received during their rental process.</p></section><section id=\"great\"><h2>Great</h2><p>The experiences of tenants who found success with Porchlight Property Management LLC point to their ability to effectively address tenant needs and assist them in navigating the challenges of renting. One user recounted a smooth relocation experience, underscoring the helpfulness of staff members and their thorough understanding of the properties on offer. This level of service has certainly contributed to a solid reputation among some tenants who feel valued and heard.</p><p Furthermore, positive reviews often cite responsive communication as a significant asset of the company. Tenants expressed satisfaction with the way their inquiries were managed and appreciated the attentiveness exhibited by the management team. Such consistent attentiveness fosters a good experience for those who utilize their services and aids in establishing a strong tenant-manager rapport.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the positive reviews, several users have reported distressing experiences with Porchlight Property Management LLC, particularly concerning maintenance issues. Many tenants expressed frustration over unresolved repair requests, stating that they needed to repeatedly follow up on maintenance issues, which led to significant inconveniences. For example, one tenant reported losing a considerable amount of food due to a malfunctioning refrigerator that took an unacceptably long time to repair, resulting in significant dissatisfaction.</p><p>Moreover, several user reviews indicated that the management was slow to respond to issues, leading to a lack of trust in the maintenance process. There are also accounts of tenants facing confusion regarding lease agreements and security deposits, leaving them feeling overlooked and misinformed about the terms of their tenancy. This struggle for clear communication can overshadow the otherwise positive aspects of the service provided.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The reviews contain some deeply troubling experiences that paint a harsh picture of the company's service. Many users have alleged unfair practices surrounding the return of security deposits, with instances of being charged for damages that were either pre-existing or unreasonable, such as hefty cleaning fees despite thorough efforts to clean the property upon exiting. One user noted being charged $320 for cleaning, even after having hired professionals to clean carpets, raising concerns about the legitimacy of such practices.</p><p>Worse still, there seem to be accusations of poor management coping with tenant issues, especially regarding disputes with neighbors. One tenant described feeling unsafe due to conflicts with other renters, leading to a lack of management intervention that left them feeling abandoned in a tense living situation. These reviews illustrate a disconcerting trend of miscommunication and unresolved tenant concerns, highlighting significant areas where the company must improve to regain tenant trust and satisfaction.</p></section>"
  }
}