{
  "name": "Property Management Professionals",
  "slug": "property-management-professionals",
  "company_type": "company",
  "address": "818 Alabama St Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Rusty S.",
        "rating": 1,
        "review": "DO NOT RENT FROM THESE CRIMINALS.\n\nI'm reaching into the past to write this review, but considering this shady outfit managed to screw up my credit for several years I think it's only fair...\n\nWhen myself and two other tenants moved out of a house managed by \"Property Management Professionals\" we were given a bill that stated not only were they taking the entire $1000 deposit for the rental but demanding a couple hundred more on top of it.  The itemized list of charges was laughable; this was for a crumbling old house that the landlords had put ZERO money into for years (broken cabinets, faulty fixtures, filthy carpets, etc. when we moved in) and really needed a complete remodel.  \n\nGranted, our use of the space had added to the wear & tear so using some of the deposit money for repairs and cleaning was entirely justified.  Hell, even if they had taken the entire $1000 for this purpose we would have been OK with that.  The problem was that they demanded MORE money and each of us refused to pay it.  They threatened to send me to collections over the bill, and when they did so I received a letter stating that I had 30 days to refute the charges in writing.  You bet your ass I refuted those charges!  Did me no good, though: after repeated attempts through both Property Management and the collection agency to explain the situation and go through the itemized list of charges line by line I was completely blown off and told that I'd better just pay up or sacrifice my credit.  This being my first experience in such a situation I didn't realize what a mess that was going to be so I stood on principle and refused to pay their extortion money.\n\nWell, several years later I've found that NOT paying the $200 or so that this company unfairly charged me with no recourse has probably cost me thousands of dollars due to a lower credit rating.  Thanks a lot, assholes.  I'll never have anything to do with these people again, and I'd urge anyone considering renting space in Bellingham to stay away from Property Management Professionals as well.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT and is intended to be a tool to help potential clients and tenants in their decision-making process when finding a property management company or rental property. The summary provided is based on user reviews and does not reflect the opinions or experiences of the assistant generating this output. It's intended to provide a balanced perspective, taking into account positive and negative comments from the user reviews.</p>  </section>  <section>    <heading><h5>&nbsp;</h5></heading>    <heading><h2>Good</h2></heading>    <p>This article does not contain any positive user reviews since the received data includes only one user review with a one-star rating. Without evidence of satisfactory experiences, it is not possible to comment on what this company might do well in the eyes of their clients. Should additional data become available that reflects positive experiences, this article would be updated accordingly to provide a representative view.</p>    <p>Similarly, as there are no positive remarks to be highlighted, no examples of the company exceeding expectations can be mentioned. It's crucial to recognize that the absence of positive reviews within this article does not inherently mean there are no satisfied clients, but rather that none have been included within the given data set.</p>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>In line with the previous section, there also appears to be an absence of reviews within the provided data that could indicate ‘great’ attributes associated with Property Management Professionals. Therefore, no exceptional qualities or above-and-beyond service instances to report are present. In the interest of an unbiased article, great accomplishments or services will only be mentioned when supported by user reviews.</p>    <p>Future user reviews may indeed paint a different picture, providing evidence of excellent property management practices, remarkable tenant relationships, or great community involvement. This article remains open to incorporating such positive data if and when it becomes available for review.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>Reflecting on the sentiment of the user review provided, there are significant frustrations related to financial dealings, specifically regarding the security deposit. The reviewer speaks of being charged beyond the full amount of the initial deposit upon moving out. According to the review, the property was already in need of significant maintenance and remodeling which suggests that the company might not have been proactive in maintaining the standards of their properties.</p>    <p>Additionally, the user felt the requested extra payments were unjustified, highlighting a lack of fairness or transparency in Property Management Professionals' cost assessments. There is a sense from the review that communication with the company was also a challenge, amplifying the distress felt by the tenant. The reviewer's concerns were reportedly dismissed, and the financial demand remained enforced, which ultimately led to credit score repercussions for the user.</p>  </section>  <section>    <heading><h2>Ugly</h2></heading>    <p>The ‘ugly’ aspect of the user’s experience focuses on the long-term negative impact that the dispute with Property Management Professionals allegedly had on their credit score, described as costing them financially in subsequent years. There is a tone of deep-rooted dissatisfaction and regret over the decision to engage with the company, viewing it as a severely negative experience due to the perceived injustice and lack of recourse offered.</p>    <p>The review concludes with the author expressing a strong recommendation to others to avoid dealing with Property Management Professionals. Unfortunately, it does not appear that the company provided any response to the user's review, which might suggest a need for improvement in responding to and resolving client and tenant concerns. Without a company reply, it is unclear how often the company engages with and addresses such issues.</p>  </section></article>"
}