{
  "name": "Property Management Professionals",
  "slug": "property-management-professionals",
  "company_type": "Company",
  "address": "818 Alabama St Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Rusty S.",
        "rating": 1,
        "review": "DO NOT RENT FROM THESE CRIMINALS.\n\nI'm reaching into the past to write this review, but considering this shady outfit managed to screw up my credit for several years I think it's only fair...\n\nWhen myself and two other tenants moved out of a house managed by \"Property Management Professionals\" we were given a bill that stated not only were they taking the entire $1000 deposit for the rental but demanding a couple hundred more on top of it.  The itemized list of charges was laughable; this was for a crumbling old house that the landlords had put ZERO money into for years (broken cabinets, faulty fixtures, filthy carpets, etc. when we moved in) and really needed a complete remodel.  \n\nGranted, our use of the space had added to the wear & tear so using some of the deposit money for repairs and cleaning was entirely justified.  Hell, even if they had taken the entire $1000 for this purpose we would have been OK with that.  The problem was that they demanded MORE money and each of us refused to pay it.  They threatened to send me to collections over the bill, and when they did so I received a letter stating that I had 30 days to refute the charges in writing.  You bet your ass I refuted those charges!  Did me no good, though: after repeated attempts through both Property Management and the collection agency to explain the situation and go through the itemized list of charges line by line I was completely blown off and told that I'd better just pay up or sacrifice my credit.  This being my first experience in such a situation I didn't realize what a mess that was going to be so I stood on principle and refused to pay their extortion money.\n\nWell, several years later I've found that NOT paying the $200 or so that this company unfairly charged me with no recourse has probably cost me thousands of dollars due to a lower credit rating.  Thanks a lot, assholes.  I'll never have anything to do with these people again, and I'd urge anyone considering renting space in Bellingham to stay away from Property Management Professionals as well.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
    "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1725642000,
    "text": "<section><h2>Good</h2><p>Due to the limited number of reviews available for Property Management Professionals, discerning positive feedback is quite challenging. However, it is essential to acknowledge that this article aims to present a well-rounded view of the company, and in the event of more favorable reviews being available, they would be included here to complement the insights provided.</p></section><section><h2>Great</h2><p>Currently, there is no information from user reviews that highlight exceptional service or experiences with Property Management Professionals. Should more data become available pointing to outstanding practices or noteworthy achievements, this article would be updated accordingly to reflect such accomplishments and contribute to a balanced perspective on the company's performance.</p></section><section><h2>Bad</h2><p>Based on the lone user review provided, Property Management Professionals has been criticized for how they handled the security deposit post-rental period. The user recounts how the company withheld the entire $1000 deposit and even demanded additional funds, citing an itemized list of charges for a property that was described as dilapidated upon move-in. This has raised concerns about the fairness in the application of deposit deductions and additional charges.</p></section><section><h2>Ugly</h2><p>The situation described by the user entails more serious accusations, including claims of the company's actions adversely affecting their credit score for several years. Property Management Professionals allegedly ignored written disputes against the additional costs levied after the deposit was taken, leading to the user's refusal to pay what they considered extortionate demands and resulting in damaging credit implications over time. With no owner response provided to the review, this lack of communication and resolution casts a concerning shadow over the company's customer relations and dispute management practices.</p></section>"
  }
}