{
  "name": "PTLA Property Management",
  "slug": "ptla-property-management",
  "company_type": "company",
  "address": "2020 Pacific St, Bellingham, WA 98229",
  "review_count": 51,
  "average_rating": 1.82,
  "reviews": {
    "google_reviews": [
      {
        "author": "kim meza",
        "rating": 5.0,
        "review": "PTLA has been great so far. Im new to renting from this property management and they have been great with communication! Quick to return calls, emails, viewing properties, etc. The first apartment I looked at wasnt what I needed and my rep (I want to say Jordan?!?!?) was quick to show me alternative locations. I would recommend.",
        "ownerResponse": {
          "text": "Thanks for your review! We're so glad you've been pleased with your experience so far. If anything comes up that we can help with, please let us know!"
        }
      },
      {
        "author": "Dana Huggett",
        "rating": 1.0,
        "review": "I have been trying for days to get in touch with anyone in the office. Our hot water froze during the last cold snap and because of a design flaw the pipes ran in an exterior wall. The only solution was to put a small heater in the garage and it took 3 days for the weather to warm up and the pipes to thaw. By law they have 24hrs to find a solution. Secondly, I live in a 3 story townhome with the lower level consisting of a bedroom/bathroom and entry way. On a normal winter day the temperature cannot get above 62 degrees with full heat going. When it was cold outside it was 48 degrees on that level, I had to move my daughter out of her room and upstairs. On the upper 2 floors the the heat also struggled in the cold with the max heat being 62 on the very cold days. In speaking with others in the same type of unit in my complex they are also having the same difficulties with heat. This is a design flaw and cannot be rectified easily. PTLA has violated the tenancy law but not rectifying the situation in a timely manner. I have put in my notice to terminate my tenancy after 3 days of no hot water/adequate heat and have not heard anything from them. I have emailed, dropped off a letter, messaged through the portal and called and left a message. Not sure what else to do.",
        "ownerResponse": {
          "text": "Dana, thank you for reaching out, and we apologize for the delayed response. A member of our team will reach out to you today to address these concerns. "
        }
      },
      {
        "author": "Megan Andersen",
        "rating": 1.0,
        "review": "PTLA is very difficult to get a hold of and has gone thru at least three community managers for Meadows at June Rd during the last six months. The parking at this property is atrocious and after moving in, they decided to change our assigned parking spot to one that doesnt even fit our stock F150. After three months of being told they will work to find us a new spot, they now refuse to help. The on site garbage bin areas are filled with trash daily and trash all over the ground. Its very clear there has not been a community manager capable of running this property for some time now.\n\nDo not recommend.",
        "ownerResponse": null
      },
      {
        "author": "Trevor M",
        "rating": 1.0,
        "review": "Oh look, they made a new Google account to get rid of all their 1 star reviews! Perfect, I'll just copy and paste from my last 1 star review....\n\nSpend your money elsewhere... We moved into the brand new Crescent building that had and still has more issues than they know what to do with. If you can even get a hold of someone in their office they'll just play dumb and act sorry. Maintenance issues do not get addressed. Take your money elsewhere. They were and are not willing to work with us when we had unexpected life-issues come up forcing us to move, they just care about getting their overpriced rent. Maintenance and snow removal are non existent, this past snow storm the sidewalks and parking spaces weren't touched. Sidewalks were not walkable, and the front door doesn't open so tenants were supposed to walk around the building on ice-covered sidewalks to get inside. One of the two elevators has been broken 6 of the 8 months we've lived here. Heating systems inside units aren't able to keep up, and they won't heat or fix the heat in the buildings hallways and common areas so our electric heat has to run 24/7. The units do not get warmer than 60 degrees. The \"Leasing agent\", Kylie, lied upon move in claiming the units have A/C. They do not. My fault for not checking, I guess I should have known I was being lied to. Winter temps are no warmer than 60 inside while summer temps are 90+ on the 5th floor. I guess I had decent expectations for almost $2000 a month  The grass was never cut in the summer, and poison plants were found around the building that are fatal for dogs. This once again was not taken care of. The walls are very poorly soundproofed so noise and music from neighbors goes right thru falls.\n\nUPDATE 01/06/2023\nPTLA HAS NOT reached out, instead someone got upset that the front door has been faulty for quite some time now, forcing everyone to walk around. The only handicapped door that is. And now someone ripped the door handle off. Id imagine this will take months for them to fix as well. Once again, do not rent here.\n\nUpdate 01/30/23\nThe streetlights and exterior walkway lights have been out for over a week now. You can hardly see anything in the parking lot or behind the building, must walk with a flashlight. Just a matter of time before all the local Bellingham tweekers that live in the woods next to the building come out and start smashing into car windows to steal stuff now that they dont have to worry about streetlights. Have to assume PTLA just hasnt paid the bill, theyre cheap (obviously).",
        "ownerResponse": null
      },
      {
        "author": "Lindsey Hanna",
        "rating": 1.0,
        "review": "Awful customer service. Terrible response time for maintenance issues. basically cannot get anyone to respond to an email or phone call and if they do they usually mess it up. They have VERY sneaky wording in their lease renewals so watch out! They send out renewal contracts six months in advanced with decent deals so just be aware cause if you ignore those you will lose you place at the end of your lease. In regards to the actual unit at Elwood. Its beautiful. Marble counters, stainless steel appliances and in unit washer/dryer. The construction is near finished so you dont hear it that often anymore. Parking sucks but thats typical for Bellingham.",
        "ownerResponse": {
          "text": "Thank you for your review, Lindsey. We are sorry to hear you haven't had a positive experience so far. A member of our team will reach out to you shortly to address your concerns. "
        }
      },
      {
        "author": "Salim",
        "rating": 1.0,
        "review": "Ive been here for 2 months, and I have nothing good to say about PTLA. For starters, the entire apartment was much smaller than advertised on the floor plan. About 2 square feet per room smaller. The washing machines went out for a week, and they did nothing to respond to our calls and emails, so we just had to wear dirty clothes. They didnt charge us for electricity until this month, when they dropped the 2 months of electricity bills on us at once, AFTER our rent had already been paid, then continued to charge us $5 per day of late fees without notifying us. We didnt notice this until it racked up to over $50. Then, of course, theyve continued to not respond to our emails or calls, and continually go out of office for extended periods of time. They are raising the rent, and making us sign the lease for next year in December. If we dont by the 8th, they are going to raise it again. If we don't by the end of the month, they will assume we arent renewing?? PTLA is an awful, selfish, money hungry business. Never trust them.",
        "ownerResponse": {
          "text": "Thank you for your feedback, and we're sorry to hear that you have not had a good experience so far. Unfortunately, the laundry machines at your property are owned and managed by a third-party laundry company who will not allow us to do maintenance on the machines ourselves. However, if you ever have issues with the machines, you can contact their  customer support. We have signs in the laundry rooms with their contact information should you ever need assistance. \nWe did have an issue with the utilities charges this month, which has now been resolved. We are happy to reverse any late fees that were assessed because of this error if your account is otherwise in good standing. It looks like our team already took care of this for you, so please reach out to us if you do not see that on your account. \n\nThank you for your understanding, and we look forward to improving your experience."
        }
      },
      {
        "author": "Callie L",
        "rating": 1.0,
        "review": "Tried to steal our entire security deposit after move out when we spent 2 full days with 6 people cleaning the apartment. I anticipated they might try this so I took a video upon move out to prove the state of the apartment was perfectly clean and in good order. It took the video proof, a lawyer, and calls and emails every single day to get them to return the deposit. If you must rent from them, take pictures/videos on move in and move out and be prepared to contact them every single day when they steal your deposit. Also CC their bosses on the emails so they get annoyed/embarrassed and respond back to you. Good luck and rent elsewhere if possible!!",
        "ownerResponse": {
          "text": "Callie, thank you for your review. We apologize for the responsiveness issues you experienced. Although we do our best to fairly assess move-out conditions, we welcome former residents to reach out to us if they feel we have made a mistake so we can correct that. We are glad to have resolved your concern and are working to improve future responsiveness. Again, thank you for your review, and we are happy to speak with you if there is anything further we can do for you."
        }
      },
      {
        "author": "Kari Na",
        "rating": 5.0,
        "review": "I noticed the relatively recent bad reviews which got me a little nervous, however! My personal experience has been nothing but great so far! Jeremy Dauglash has gone above and beyond to take the time to answer all of my questions patiently and and very kindly, without making me feel stupid and annoying for having so many. He also took the time to walk me through how to get my electricity switched over and just ensure that everything is in line, ready to go for move in. It is a MAJOR stress relief to me and I am truly grateful!",
        "ownerResponse": {
          "text": "Thank you for your feedback! We're so glad to hear that you had a great experience with our team. We hope you enjoy your new home!"
        }
      },
      {
        "author": "Desirae Bradley",
        "rating": 1.0,
        "review": "Update.our experience here has absolutely had the worst downfall since they fired the manager, Caitlin, who signed our lease. They went from 3 stars to 1.5 since parting ways with her. How funny. Well, we have many maintenance issues that dont get answered. Call the office all the time now and they never answer. We pay $2,500 a month for this garbage. DONT RENT HERE!!!",
        "ownerResponse": {
          "text": "We apologize for your experience and hope to improve it. A member of our team will reach out to you shortly to address your maintenance request and other concerns you may have at the property. We appreciate you letting us know your feedback."
        }
      },
      {
        "author": "Jayme Wilson",
        "rating": 1.0,
        "review": "I have been trying to reach PTLA for a long time now regarding the status of a lease transfer application as well as documentation for ESA. Instead of responding to my emails/phone calls, they deny my upload of the documentation for ESA stating Im not uploading it under the right file identification. The email, if they would respond, that I sent is in regards to this issue and how I am unable to upload it any other way since there is only one area where I can upload any documents. I have called 7 times now and left 2 voicemails with no response as well as an email submission with a complaint. If the office is supposed to be open, all calls should be answered in a timely fashion as well as answered when residents call in the first place. Unacceptable.",
        "ownerResponse": {
          "text": "Thanks for your feedback, and we do apologize for the difficulty you had getting in touch with a member of our team. It sounds like we have now addressed your needs, but please let us know if you need any further assistance."
        }
      },
      {
        "author": "Matthew Schnell",
        "rating": 1.0,
        "review": "1. PTLA is difficult to contact. Plan to go directly to the office if you need to talk with anyone.  I had days where I called up to 6 times with no response or reply to voicemail or email. The property manager where I lived also rarely answered or returned calls.\n2. My unit was brand new when we started the rental.  The unit was covered in construction dust and had clearly not been cleaned.  We even found a doorstop in the freezer.\n3.  PTLA billed me for over 4 hours of cleaning (in addition to the carpet cleaning I had agreed to in the lease).  I sent PTLA multiple pictures of the clean apartment asking what the fee was for and noting that PTLA postmarked my refund over the time allowed by law.  PTLA then refunded the remainder of my deposit.\n\nIf renting with PTLA, I suggest documenting everything very thoroughly.  Take excessive photos, videos and follow up on phone calls via email.\n\nAlso, note that the reviews now only show as going back to Summer of 2023.  The old reviews are now missing.",
        "ownerResponse": null
      },
      {
        "author": "Justin Quyle",
        "rating": 1.0,
        "review": "Dont rent from them if you can avoid it. There was hundreds of 1 star reviews, all of a sudden, theyre gone. Absolutely terrible and garbage property management office. I have no qualms with maintenance. They respond quick and do what needs to be done. But the office took 6 months to process an application for your roommate. I started that process in January, my lease was up for renewal in May. May comes around, 3 days before the deadline for my lease renewal, they tell me my roommate isnt qualified. Ive live here 7 years and havent missed a month, and my past roommates had been even less qualified, so it made no sense. But, they waited till 3 days before my lease renewal deadline to say something, and then refused to give me an extension on that lease renewal timeline. I even pointed out to them that it took them 6 months to process the application. Another time I went into the office to pay my rent in person, they failed to tell me then that other one time fees had been added to my rent and that the check I was giving them would not suffice. I have a list of complaints, I dont want to fill up the whole review area lol",
        "ownerResponse": null
      },
      {
        "author": "Joey Saxer",
        "rating": 5.0,
        "review": "PTLA is AMAZING the landlords are great and understanding. I got my first place through them. Other property managements turned me down because of no rental history",
        "ownerResponse": {
          "text": "Thanks for your review! We're glad we could help you find a home. If there's anything else we can help with, just let us know!"
        }
      },
      {
        "author": "Maya Williams",
        "rating": 1.0,
        "review": "Do not rent from PTLA!!! They managed to remove all old reviews (pretty suspicious since most were 1-2 stars). I have had to deal with them at two separate properties and they have been difficult the entire time.\nBelvedere - they used the age of the building to excuse poor maintenance. There was mold, fleas, the windows leaked, the basement flooded multiple times, washers backed up with black fluid, and there were three seperate gas leaks when I moved out. Maintenance requests were slow and as soon as you asked for something more than the bare minimum they stopped responding.\nElwood edge - when owership transferred PTLA lost my rent payments and proof of insurance and then tried to EVICT ME. This was after I notified them of the fact that a payment wasn't applied to my account. They stopped responding to my calls and emails after the eviction notice without notifying me that they had stopped proceeding with the eviction.\n\nPlease stay away from them! They do not care about you",
        "ownerResponse": null
      },
      {
        "author": "Aidan Sweet",
        "rating": 4.0,
        "review": "Overall everyone I've spoken with at PTLA Is kind and helpful. Maintenance requests are addressed quickly and they are respectful of your space.",
        "ownerResponse": {
          "text": "Thanks for your feedback, Aidan! We're glad you have been pleased with our responsiveness to maintenance requests. If there is anything else we can do for you, please let us know."
        }
      },
      {
        "author": "Janine Richardson",
        "rating": 3.0,
        "review": "Looking for a rental for myself. Unfortunately that company might be very busy. I've not heard back from them as of yet. There are admin fees. Pet fees. Sometimes y'all need to earn more than 3 times the rent. Goodness.",
        "ownerResponse": null
      },
      {
        "author": "Corie Odenbreit",
        "rating": 1.0,
        "review": "Pretty telling when all the reviews from before 2023 have been removed. They deleted my review from a year ago but thats ok Ill just keep posting one. Terrible place to rent from, Monterra Apartments are in a disgusting state and probably should be torn down. Terrible rental prices for barley any amenities. Staff is unresponsive and rude. My partner could over hear one of the office managers talking bad about us through the walls and she referred to my partner as a b!tch. Mind you, we went to their office to ask what was going on after not finishing any repairs on our cracked and leaking ceiling. Avoid at all cost, especially young students moving to the area.",
        "ownerResponse": null
      },
      {
        "author": "Abigail Clark",
        "rating": 1.0,
        "review": "Do not rent from PTLA!!!!! They are scammers. After we moved out from our unit (which we had thoroughly cleaned and repaired damages) they kept our deposit AND charged us nearly 600 dollars for damages. Horrible property management.",
        "ownerResponse": {
          "text": "Thanks for your feedback. We would love the opportunity to discuss your move-out charges with you, and a member of our team will reach out to you shortly. "
        }
      },
      {
        "author": "Terry B",
        "rating": 1.0,
        "review": "Nearly impossible to get a hold of when you need to. The unit I was put into first smelled like the person renting it BATHED in w3ed, despite the lease clearly stating that ANY drug--and literally calling out this one!--is a violation of the lease and cause for revocation of your security deposit. It took a new company coming in, 10 weeks after my \"allowed\" unit change date before I finally got into another unit - and I was still paying for the druggie den! Thankfully the new company acknowledged that PTLA is full of lazy @$$h0les and waived the $250 fee that PTLA no doubt would have charged me for the 10 weeks they spent not replying to my request to move. WORST. COMPANY. E V E R. Also, be SUPER suspicious: there used to be reviews dating from back to 2014 here that averaged to 1.2. ~ mysteriously~, they are all gone. Oldest reviews reviews are now a month old or less.",
        "ownerResponse": null
      },
      {
        "author": "Adrien Couzens",
        "rating": 1.0,
        "review": "NEVER RENT FROM PTLA I have been trying to get an application for a new guarantor through for 2 months and they have stonewalled me every time I have contacted them and given me wrong information multiple times. I just need to add a new guarantor to my lease renewal! I have informed them over and over that my original signer is in the hospital dying and won't be able to renew with me but they can't seem to simply send me a link to an application. I just need them to communicate with me and they refuse to.",
        "ownerResponse": null
      },
      {
        "author": "Wise Wons",
        "rating": 1.0,
        "review": " This place sucks so bad. I cannot even express how confusing and impersonal the whole experience has been. Not only that, the amount of fees they charge is ludicrous. They are seriously nickel and diming the hell out of their tenants. They are never available and never return phone calls. This place is sketch. Cannot wait for my lease to end. I wish I never came here.\n\n#neveragain",
        "ownerResponse": null
      },
      {
        "author": "Indaris Nerothan",
        "rating": 1.0,
        "review": "Somehow, all of the reviews are gone. Thats really suspicious because the majority of the reviews were 1-2 stars - real bad reviews.\n\nWord of warning - tour BEFORE giving deposit or signing any paperwork. Please, they take advantage of college students and low-income families.\n\nI've had nothing but bad experiences with PTLA. This is my first time renting an apartment, I made a lot of mistakes and they took advantage of me.\n\nThey had me pay deposit and sign the lease before doing a walk-through or a tour. Biggest mistake of my life. The apartment I'm in looks NOTHING like the photos on their website. It's so neglected and gross... spray insulation foam sticking out of cracks. The floors are painted over and chipping, dirt and dust build up on exposed pipes. It's a janitor closet retrofitted into an apartment.\n\nI tried asking to release me from my lease a day after signing it because my apartment is unfit for human living. They told me they wouldnt and accused me of making things up. I showed them photos, they didnt care.\n\nI cant WAIT for my lease to be over. I'm never renting from PLTA ever again.",
        "ownerResponse": null
      },
      {
        "author": "Oliver Bibb",
        "rating": 1.0,
        "review": "This company bought the property I live in and took over it as of YESTERDAY and I'm already upset. They gave notice yesterday in the EVENING on a FRIDAY about a bunch of things changing, didn't answer 8+ voice calls or messages even though their office claimed to still be open for multiple hours. Now they're out the entire weekend and ALSO THE MONDAY cause it's a holiday, and they have changed due date for rent to TUESDAY! So essentially they have made it impossible to contact them about these issues and any questions at all.\n\nAnd reading other reviews it is highly obvious they never answer phone calls, and they have yet to provide a single email address that will actually reply. HORRIFIC customer service, especially for a new property they've taken on.",
        "ownerResponse": null
      },
      {
        "author": "marcus cuenca",
        "rating": 1.0,
        "review": "Weird leasing, just started my year lease and a month in they ask me to renew or I won't be able to later.\n\nMy BIGGEST issue with them is watch your belongings as well because apartently the maintenance teams they hire will just take your stuff. Missing my Ryobi Vacuum and a torque wrench. That just so happen to go missing after they were in my apartment. But who knows, just a coincidence probably.",
        "ownerResponse": null
      },
      {
        "author": "Dag Urmensch",
        "rating": 1.0,
        "review": "PTLA is a slick operation staffed by young know-nothings.  If they send you a rental increase notice of 50% or more, four or more months before your lease expires, and illegally present this increase as an offer that expires in a month, ignore it.  It is a meaningless, strongarm tactic, and they will decrease their extortionist demand as the months go by.  Really a nauseating experience dealing with them, and the building owners got wise and switched to a different management company.",
        "ownerResponse": null
      },
      {
        "author": "Eliza Gronke",
        "rating": 1.0,
        "review": "They somehow removed ALL the old reviews. Worst experience/company ever. I contacted them about the mold in my unit at forest hills multiple times and they did nothing, it ruined all of my furniture and they just didnt care. They never once returned a voicemail. The people working the front desk are incompetent and told us false information that took multiple visits for someone to finally realize their mistake. Never rent from these people, they have no integrity.",
        "ownerResponse": null
      },
      {
        "author": "Em Sanders",
        "rating": 1.0,
        "review": "Absolutely awful property management company. They kept trying to offer my wife and I cheap apartments in sketchy areas even though they had nicer expensive apartments elsewhere. We make $4k+ a month. Its probably because of the color of our skin, the fact that we dont speak English well, and we are lesbian. Glad we did not rent here.",
        "ownerResponse": null
      },
      {
        "author": "Will Stevens",
        "rating": 1.0,
        "review": "This company might as well be a shell corporation. They won't pickup your call or return your email. The fact they took over barley a month ago and can't even return calls is ridiculous. Be careful and document everything in your apartment. They will try to confuse you and blame you for damage.",
        "ownerResponse": null
      },
      {
        "author": "Ben Kelly",
        "rating": 4.0,
        "review": "I have had someone parked in the parking garage spot I PAY FOR for the past week where I live, I have contacted this company SEVERAL times and havent heard back from anyone. Cant even have the person towed without the property managements approval, Ive had to park on the side of the road. This company is severely incompetent so much for having more staff available to address my needs\nEdit: if you want anything done you have to talk to them IN PERSON. Changing this review to 4 stars because I went in and got it figured out",
        "ownerResponse": null
      },
      {
        "author": "Miles Hoffman",
        "rating": 1.0,
        "review": "Charged us late fees that were not being posted in our account so we had no idea that they were adding up, but still made us pay them. So many fees, dont trust them.",
        "ownerResponse": null
      },
      {
        "author": "Dylan Kloke",
        "rating": 5.0,
        "review": "Great job, boys. When I was 12 they didnt molest me.",
        "ownerResponse": null
      },
      {
        "author": "Kacey Lind",
        "rating": 5.0,
        "review": "Julian Forester was extremely willing to help and quick with his responses! Had a great experience here and wanted to share my appreciation! Also extremely impressed with how clean the unit was kept.",
        "ownerResponse": null
      },
      {
        "author": "Riley Dehmer",
        "rating": 1.0,
        "review": "Do not rent from PTLA. The company is not transparent with you. They are hard to contact. They did not prepare the landlord at all for me moving in, and it made for a horrible experience. Moving out is going to be worse.",
        "ownerResponse": null
      },
      {
        "author": "Katelynn Pratt",
        "rating": 1.0,
        "review": "This place is a mf joke. NO ONE WAS EVER THERE TO HELP!! Also, they charge so much, spend your money elsewhere",
        "ownerResponse": {
          "text": "Katelynn, thank you for your review. We're sorry to hear that you didn't have a positive experience. If there is anything we can do to address your concerns, please give our office a call."
        }
      },
      {
        "author": "W Riches",
        "rating": 1.0,
        "review": "One star is too much. \nThis company is the worst!\nWARNiNG\n  DO NOT \nuse PTLA whatsoever\nREAD the REViEWS",
        "ownerResponse": null
      },
      {
        "author": "Christian Whiteside",
        "rating": 1.0,
        "review": "Every time I call with an issue, they are rude and try hard not to help or resolve the issue. I fell worse about my day every time I speak with someone. They will straight up hang up on you if they dont want to hear what you have to say",
        "ownerResponse": null
      },
      {
        "author": "Tucker White",
        "rating": 1.0,
        "review": "Shut the water off to the entire building without any warning in the middle of the summer. Called the company and the lady that answered was rude and acted like it was my fault and I was bothering her. I hate this company.",
        "ownerResponse": null
      },
      {
        "author": "Rich Kohr",
        "rating": 4.0,
        "review": "Knowledgeable staff, ready to help. Pleasurable front desk help",
        "ownerResponse": {
          "text": "We appreciate your review!"
        }
      },
      {
        "author": "davis kenny",
        "rating": 1.0,
        "review": "Terrible maintenance crews. Slow response times. Just another awful huge corporation who owns everything and doesn't care about you",
        "ownerResponse": null
      },
      {
        "author": "Tania Chan",
        "rating": 4.0,
        "review": "Luci Moise was very helpful with my son's move in.",
        "ownerResponse": {
          "text": "Thanks for your review! We're so glad our team was able to make the process a smooth one. Let us know if there is anything we can help with in the future!"
        }
      },
      {
        "author": "Kalei Church",
        "rating": 1.0,
        "review": "Took months to get urgent maintenance issues fixed.",
        "ownerResponse": null
      },
      {
        "author": "Ross Campbell",
        "rating": 5.0,
        "review": "Very helpful and friendly staff!",
        "ownerResponse": {
          "text": "Thanks for your feedback! We're glad our team was able to help you!"
        }
      },
      {
        "author": "Jamie M",
        "rating": 1.0,
        "review": "Stay far away from PTLA and every one of their properties.",
        "ownerResponse": null
      },
      {
        "author": "Peps Winchester",
        "rating": 1.0,
        "review": "Im so disappointed I dont even know what to say",
        "ownerResponse": null
      },
      {
        "author": "Thwho Thwhat",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Hannah Westcott",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "s w",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Christopher Street",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Monty Capy",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Veronica Griggs",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Austin Allbee",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 44,
  "adjusted_average_rating": 1.86,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT. The summary provided herein is based only on user reviews and is intended to be a tool to help potential customers in their decision-making process regarding a property management company or rental property. The content of this article reflects the balanced sentiment of those reviews without identifiable information, in keeping with user privacy.</p>  </section>  <section>    <heading><h2>The Good</h2></heading>    <p>Among the user reviews for PTLA Property Management, there are accounts of positive experiences, where renters have praised the company’s communication efforts and responsiveness to concerns. Some users have remarked on the helpfulness of individual staff members, noting their dedication to resolving issues and ensuring a smooth renting process. For example, one reviewer was appreciative of the quick turnaround in viewing properties and finding suitable alternatives when the initial selection didn't meet their needs.</p>    <p>Another highlight from user reviews includes instances where PTLA Property Management addressed specific issues promptly. Examples include quick responses to maintenance requests and direct assistance from staff in helping clients through various administrative procedures, such as switching electricity for move-ins. Positive experiences have helped in alleviating the stress associated with renting, and some users have acknowledged a sense of relief thanks to the efficiency and courtesy of select PTLA staff.</p>  </section>  <section>    <heading><h2>The Great</h2></heading>    <p>A few reviewers have gone beyond reporting good service to describe their experience with PTLA Property Management as great. One user applauded the understanding and accommodating nature of the landlords, who were seen as compassionate about renters without a previous rental history. Another noted that immediate and lingering maintenance concerns were handled expediently and with professionalism, leaving a strong impression of respect for residents’ living spaces and comfort.</p>    <p>Great experiences also extended to property conditions upon moving in. There have been specific mentions of well-maintained and clean units, with one user expressing their gratitude for the cleanliness of the apartment upon move-in. Furthermore, these positive experiences are sometimes attributed to the diligence and proactive approach of certain team members, contributing to a significant stress reduction for those in the middle of transitioning to a new home.</p>  </section>  <section>    <heading><h2>The Bad</h2></heading>    <p>However, not all user reviews for PTLA Property Management reflect satisfaction. There are several complaints about difficulty reaching the company, with users stating they experienced delayed responses or complete lack of acknowledgment when dealing with substantial issues such as heating problems and hot water outages. Additionally, challenges such as unaddressed maintenance requests were a common theme, with some tenants waiting for extended periods for resolutions to their living conditions or getting partial solutions that didn't fully address the root problems.</p>    <p>From a procedural standpoint, users have criticized PTLA for poor communication regarding lease agreements, renewals, and terminations. Some noted that vital information was not conveyed timely or adequately, leading to frustration and unexpected financial or logistic consequences. The handling of security deposits has also been criticized, with instances where users claimed to struggle with the company either holding deposits without clear reasons or charging for unclear damages, leading to a need for persistent follow-ups and, in some cases, legal counsel.</p>  </section>  <section>    <heading><h2>The Ugly</h2></heading>    <p>The uglier aspects of user experiences with PTLA Property Management point to more severe allegations of neglect and mismanagement. A number of users have reported unresolved and egregious issues such as persistent mold, major leaks, insect infestations, and inadequate heating during winter months. In several reviews, renters conveyed a sense that the company did not take these concerns seriously or failed to attend to them with the urgency that such hazardous conditions would merit.</p>    <p>Some users claimed to have experienced deceptive practices, with PTLA accused of mishandling rental payments, springing unexpected fees, and not fulfilling maintenance promises. Allegations of discrimination and a lack of transparency about property conditions prior to lease signing were also aired in the more critical reviews. It is important to note, however, that as with any company, these experiences may not represent the majority, and PTLA Property Management has responded to some user reviews, suggesting a willingness to address issues post-facto.</p>  </section></article>"
}