{
  "name": "Real Property Management North Puget Sound",
  "slug": "real-property-management-north-puget-sound",
  "company_type": "Company",
  "address": "1325 State Ave, Marysville, WA 98270",
  "review_count": 285,
  "average_rating": 4.45,
  "reviews": {
    "google_reviews": [
      {
        "author": "Dalton Vodegel",
        "rating": 5,
        "review": "To the real property management, You guys found a great individual to be a part of your team. I was so grateful to have Mr. Nico come out today to help remove our old water tank heater.\n\nNico assessed the situation and immediately, devised a game plan and executed it in impeccable timing and efficiency. Nico was a one man army today and even repaired some of the work that was done on the initial visit. He took great care of us.\n\nMake sure he gets a good raise \n\nThank you again Nico!",
        "owner_response": {
          "text": "Thank you so much for your wonderful feedback! We're delighted to hear that Nico provided exceptional service. We're proud to have him on our team, and your recognition of his hard work and efficiency means a lot to us. We'll be sure to pass on your kind words to Nico.\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Kayla T",
        "rating": 1,
        "review": "RENTER BEWARE: Deceitful Property Management Company: 8/20/24 - RPM coerced me into signing a lease prior to viewing RPMs side of the move-in checklist. Thus, I didn't have a full understanding of the units' conditions. Furthermore, they exhibited deceitful business practices by telling me that I must sign the checklist and pay ALL FEES prior to receiving the keys. Upon arriving at the unit, it was found that the unit was left uncleaned (currently living in the last tenants filth), damaged beyond normal wear and tear, and exhibited signs of extreme water damage and black mold along with structural concerns. It seems that there's been no prevented maintenance for years. I am now concerned about my health and safety and, coupled with poor communication practices, has resulted in undostress and suffering for someone with medically evaluated disabilities like myself. Will continue to provide updates on the matter.",
        "owner_response": {
          "text": "We're truly sorry to hear about your experience, and we understand the importance of feeling safe and comfortable in your home. Please reach out to us via text or call so we can assist you further and address your concerns promptly."
        }
      },
      {
        "author": "Sergey B",
        "rating": 5,
        "review": "Ive had such a great experience with Real Property Management North Puget Sound, and I have to give a special shout-out to Terry, the Maintenance Coordinator. Terry has been absolutely amazing! Whenever an issue arises, he handles it quickly and professionally, ensuring that everything is taken care of without any hassle. Its clear that Terry truly cares about the properties and the tenants, and his dedication shows in everything he does.\nIf I could give more than 5 stars, I would! Terrys hard work and commitment make a huge difference, and I feel confident knowing things are in great hands with him. Thank you, Terry, for consistently going above and beyond!",
        "owner_response": null
      },
      {
        "author": "Ally Banks",
        "rating": 5,
        "review": "We have had the pleasure of dealing with Terry throughout our rental agreement, she has been great! Always very timely on updates and maintenance requests. Real Property Management North Puget Sound has made the renting process seamless, I would definitely recommend them.",
        "owner_response": null
      },
      {
        "author": "Clinton Leung",
        "rating": 1,
        "review": "I would not recommend renting from this property management company. If you must I would be ready to pay an excessive amount of fees and prepare for an unreasonable move out. To avoid being charged, I would highly recommend taking photos of absolutely everything, and even then RPM will still find something.\n\nWe left the place better than we found it, obliging with getting professional cleaners and carpet cleaners and yet RPM seems to nitpick on things that are just normal wear and tear. When attempting to contact them to come to a fair resolution they will placate you on the phone letting you know things will be ok or that they will call you back after confirming some things internally; this is all stalling - after a while they will just charge your security deposit and send you the invoice and then start dodging any attempts to call them.\n\nIf you are in this situation I would suggest being relentless with their phone lines until you get some actual confirmation in writing. DO NOT give them the benefit of the doubt or rely on their good faith. Get everything in writing very clearly and don't give up or stop calling them.",
        "owner_response": {
          "text": "Clinton,\nWe are sorry you feel this way. Here at Real Property Management North Puget Sound, we make every effort to be honest and fair with the Tenants as well as the Owner of the property. If there is damage caused by the tenant that is beyond normal wear and tear, we are obligated to charge the tenant for that damage to make the Owner whole. For this reason, we take numerous photos at our very thorough pre-move in assessment.  We have no reason or incentive to be dishonest or unfair. Additionally, we resolved your problem with you and you said you'd remove the 1 star review. "
        }
      },
      {
        "author": "Kathy Blaisdell",
        "rating": 5,
        "review": "This is our third month of having RPM managing our apartment complex.  It is completely a day and night change of what we are used to having.  Response time is phenomenal, no longer two weeks to never, very happy with how things are handled.  Kept up to date on what is taking place at all times.  The staff is wonderful.   Terry has been awesome with always letting me know what is going on with my requests and how to be more efficient in the difference between maintenance and other items.   I am very happy with RPM.  I no longer feel I am talking to the wall.   Thank you RPM for all you do and I realize it will be a long process to complete everything, but it is nice to see the progress so far.   Kathy",
        "owner_response": {
          "text": "Thank you for your wonderful review! We're thrilled to hear about your positive experience with Real Property Management North Puget Sound. It's great to know that our response time and communication have made such a significant difference for you. We're especially glad that Terry and the team have been able to assist you effectively. Your satisfaction and peace of mind are our top priorities, and we're committed to continuing to provide excellent service. Thank you for your trust and support!"
        }
      },
      {
        "author": "Eugene Bucad",
        "rating": 5,
        "review": "Cynthia Lara and Rose Morrison were incredibly helpful in finding and securing the perfect apartment for me. Their professionalism, attention to detail, and quick responses made the entire process seamless. Both went above and beyond to ensure everything was in order, answering all of my questions and guiding me through each step. I truly appreciate their dedication and expertise, and I highly recommend them to anyone looking for exceptional assistance with finding a new home..",
        "owner_response": null
      },
      {
        "author": "Danielle Evans",
        "rating": 5,
        "review": "Cynthia was easy to work with, prompt to answer questions and overall made the process smooth. Would 100% work with her again.\nWe worked with Rose Morrison on the lease signing and getting the keys etc. She was also pleasant to work with and made it a good experience.",
        "owner_response": {
          "text": "Thank you, Danielle, for your kind words about Cynthia and Rose; we're so glad to hear that your experience was smooth and enjoyable."
        }
      },
      {
        "author": "Caron Chen",
        "rating": 5,
        "review": "RPM managed my property for fire years.   They are very professional and reliable.  I live in Canada. They helped me find tenants, change tenants, inspect the house, and everything else. I don't have to worry about anything. Now the house is on the market for sell.  If I buy a house next time, I will ask them to manage it again. Thanks very much for their service!",
        "owner_response": {
          "text": "Thank you, Caron, for your kind words and for trusting us with your property management for five years; we're so glad to hear you felt supported throughout the process, and we look forward to assisting you again in the future!"
        }
      },
      {
        "author": "Michael M",
        "rating": 5,
        "review": "I'd just love to let management know how amazing of a job the maintenance coordinator Terry Bertucci is. He's always a pleasure to speak to. He's extremely professional and has a can do attitude. Sometimes having maintenance issues can be stressful but with an individual like Terry around it makes the process smooth. I hope that he is eventually considered for a promotion in the future. He most definitely deserves it!",
        "owner_response": null
      },
      {
        "author": "Ruth Silva",
        "rating": 5,
        "review": "I had the pleasure of meeting Daniel juarez at Real Property Management North Puget Sound. He not only explained the the quality of management they offer, but also emphasized the integrity and value they provide to both property owners and tenants. I would highly recommend their services to anyone seeking reliable property management!  ",
        "owner_response": {
          "text": "Thank you, Ruth, for your wonderful review! We're glad to hear that Daniel made a positive impression and highlighted our commitment to integrity and value. Your recommendation means a lot to us!"
        }
      },
      {
        "author": "Christopher Sturgill",
        "rating": 5,
        "review": "Daniel Juarez was fantastic! He is super responsive and really cares about putting the customer first and making sure all the needs of the property owners are met! Adaptable and flexible! Real Property Managament Northwest is the way to go so far!",
        "owner_response": {
          "text": "Chris, Thank you so much for the amazing review!  It means a lot to hear that you feel supported and valued. Im so glad I could help meet your needs and make the process as smooth as possible. Your success and peace of mind are why we do what we do!   "
        }
      },
      {
        "author": "Julie Londo",
        "rating": 5,
        "review": "Hi\nI just started using this company as a realestate owner.\nI am very impressed with them so far.\nDaniel Juarez has been fantastic,explaining all that they do. I should have done this years ago! I'm confident that this relationship will be around for many years!! Thankyou to all at RPM for your help.!",
        "owner_response": {
          "text": "\nHi Julie, \n\nThank you so much for your kind words and for choosing to partner with us! We're thrilled to hear that you've had a great experience so far, and Im glad I could help explain our services. It's always a pleasure to work with dedicated property owners like yourself, and we're excited to continue building a long-term relationship.\n\nIf you ever have any questions or need further assistance, we're here for you. Welcome to the RPM family!\n\nBest,\nDaniel Juarez and the RPM Team"
        }
      },
      {
        "author": "Kofi Oppong-Asumang",
        "rating": 5,
        "review": "I contacted other potential property managers before signing with you, but you guys at Real Property Management North Puget Sound were miles ahead of the others. I worked with Daniel Juarez and he acted professionally, communicated promptly and demonstrated a great sense of integrity. I liked that Daniel went above and beyond to get help with questions I had - more than once! I look forward to a fruitful and collaborative business relationship with the team.",
        "owner_response": {
          "text": "Thank you for the 5-star review! We're thrilled to hear about your positive experience with Daniel Juarez and our team. We pride ourselves on professionalism, prompt communication, and integrity. We're looking forward to a great business relationship with you. If you have any questions, feel free to reach out."
        }
      },
      {
        "author": "Sam J",
        "rating": 5,
        "review": "We are on our second year of our rental with RPM and we have zero complaints. Maintenance has always responded to our concerns quickly, and every technician has been very polite and professional. Any questions we have are quick to be responded to, and we never have trouble getting into contact with the office. They also worked very closely with us on addressing questions we had with our contract upon signing, and went the extra mile to ensure we were confident in and comfortable with the agreement. We would fully recommend this company if you were trying to rent.",
        "owner_response": {
          "text": "Hi Sam,\n\nThank you for the fantastic 5-star review! Were thrilled to hear that your second year with RPM has been smooth and positive. Our team is dedicated to providing quick, professional service and ensuring our tenants feel confident and comfortable. Your recommendation means a lot to us. If you need anything, dont hesitate to reach out!\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Monica Henderson",
        "rating": 5,
        "review": "I am so happy with the service from Real Property Management North Pudget Sound. Cynthia made the process easy and was always available for questions. Rose made the leasing process easy and provided great customer service.",
        "owner_response": {
          "text": "Thank you, Monica, for your wonderful feedback! It's great to hear that Cynthia and Rose made your experience smooth and enjoyable. We truly appreciate your support!"
        }
      },
      {
        "author": "Selam Negassi",
        "rating": 5,
        "review": "The most amazing real estate office Ive never dealt with the process was fairly easy and fast and truth to be told Cynthia and her team they did everything and beyond. Thank you so much will definitely do business again!",
        "owner_response": {
          "text": "Thank you, Selam! We're so glad to hear that you found the process easy and fast, and we appreciate your kind words about Cynthia and the team; we look forward to working with you again!"
        }
      },
      {
        "author": "L Secrest",
        "rating": 5,
        "review": "Real Property has been very upfront about our property whenever something is needed. They will call and discuss options, and allow us as owners to stay involved with what is done on the property. They have employees, and trustworthy contractors, who can perform work, or allow the owner to find someone or do the work themselves. I appreciate having them complete the work so we dont have to find people when maintenance is needed, or be concerned if the job will be done correctly and safely. I trust them and feel comfortable not worrying about our property.",
        "owner_response": {
          "text": "Hi Lisa,\n\nThank you for the wonderful 5-star review! We're delighted to hear that our approach to property management has met your expectations. Its great to know you appreciate our transparency and the flexibility we offer in managing your property. Were committed to maintaining your trust and ensuring your property is in good hands. If you ever need anything or have more questions, just let us know!\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Kerry Christensen",
        "rating": 5,
        "review": "The team at Real Property Management really came through for me.  I had a tough deadline to meet and was nervous as a first-time landlord.  Their cleaning crew was on site right as the movers were finishing my move out.  By that evening the property was in listing condition and posted the next day.  I had tenants within a few days and RPM expedited the lease signing to meet the deadlines I had on closing escrow for my new home.  I really admired how all of this was handled by multiple people within RPM but they were always on the same page on their end.   I am happy to recommend them to anyone in need of property management!",
        "owner_response": {
          "text": "Hi Kerry,\n\nThank you so much for your fantastic review! We're delighted to hear that our team was able to meet your tight deadline and make your transition as smooth as possible. It's great to know that our coordinated efforts helped you get tenants quickly and manage the lease signing efficiently. We truly appreciate your recommendation and look forward to continuing to support you with your property management needs.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Caden Potter",
        "rating": 5,
        "review": "Easy move in process. Experiencing maintenance repairs in our bathroom. RPM was able to accommodate us with the unit directly next to us. very nice people do deal with.",
        "owner_response": null
      },
      {
        "author": "Anne Auckland",
        "rating": 5,
        "review": "Terry Bertucci has provided great customer.  He has communicated in a timely manner to help get needed maintenance completed on our property!  We appreciate his professionalism and proactive approach!",
        "owner_response": {
          "text": "Thank you for your kind words, Anne! We're glad to hear that Terry provided great service and was able to help with the maintenance on your property. We appreciate your feedback!"
        }
      },
      {
        "author": "Rachel Pressley",
        "rating": 5,
        "review": "We are so glad we chose Real Property management for our new acquired rental when my father passed away. They were sympathetic and understanding from the start and their service has been nothing but excellent since. From maintenance requests to lease renewals, they constantly keep us updated. Not to mention the owner dashboard through their owner portal, it is so simple to read and understand where our rent is being allocated. I can't compare to other companies as this is our first rental, but thanks to them it may not be our last. Thank you!",
        "owner_response": {
          "text": "Hi Rachel,\n\nThank you for your wonderful review! We are deeply sorry for your loss and are glad we could provide the support and service you needed during this time. We're thrilled to hear that you find our maintenance, lease renewals, and owner portal helpful. Your kind words inspire us to continue delivering excellent service. We look forward to continuing our partnership with you.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Emily Osborn",
        "rating": 5,
        "review": "I am incredibly impressed with the maintenance team at RealProperty Management! They were prompt, professional, and extremely knowledgeable. From fixing a leaky faucet to addressing a more complex issue with the HVAC system, every interaction with them was seamless. They not only resolved the problems efficiently but also took the time to explain what was done and offered tips to prevent future issues. Their dedication to quality service truly sets them apart. I highly recommend RealProperty Management for their outstanding maintenance team!",
        "owner_response": {
          "text": "Hi Emily,\nThank you so much for your glowing review! We're thrilled to hear about your positive experience with our maintenance team at Real Property Management North Puget Sound. It's wonderful to know that their promptness, professionalism, and expertise made a significant impact. We pride ourselves on providing quality service and it's great to see that reflected in your feedback. Your recommendation means a lot to us!\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Eleni M",
        "rating": 5,
        "review": "When you need a property management company please think of Real Property   Management of North Puget Sound! Daniel is a Rockstar!! He is the Business Development Manager that I have been working with. He has been nothing but amazing.  He is always quick to respond,  a wealth of knowledge and has made the process very streamlined. I am so incredibly happy to be working with Daniel and Real Property Management North Puget Sound.  I highly recommend Daniel and his team!",
        "owner_response": {
          "text": "Thank you so much for your wonderful review! We're thrilled to hear that you've had a great experience with Daniel and the team at Real Property Management North Puget Sound. We strive to make the property management process as smooth and efficient as possible, and your feedback is incredibly encouraging. If you ever need anything or have more questions, feel free to reach out. Thanks again for your recommendation!\n\nBest regards,"
        }
      },
      {
        "author": "Adongo Merab",
        "rating": 5,
        "review": "My experience with Real Property Management was good.  Cynthia Lara was so helpful and professional.  Terry was so prompt in attending to my maintenance request.  I'd recommend them anytime",
        "owner_response": {
          "text": "Hi Adongo,\n\nThank you for your 5-star rating! We appreciate your support and are thrilled to know you're satisfied with our services at Real Property Management North Puget Sound. If you ever need anything, feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Maero Matthew",
        "rating": 5,
        "review": "Daniel Juarez from Real Property Management North Puget Sound was very helpful explaining the process of putting my house for rent. He provided me the tools to guide my approach towards securing a tenant as quickly as possible. Hes a RockSTar.",
        "owner_response": {
          "text": "It's great to hear that Daniel Juarez from Real Property Management North Puget Sound did so well for you! We're so glad to hear he provided you with valuable guidance. Thank you for sharing your experience, Maero Matthew! Best regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Sierra Joy",
        "rating": 5,
        "review": "Rose and Cynthia were very helpful with me and my partner getting into our next home! Very quick and easy process and I felt very welcomed by the whole team.\nTerry in maintenance is great as well!",
        "owner_response": {
          "text": "Thank you for the wonderful review! We're thrilled to hear that Rose, Cynthia, and our team at Real Property Management North Puget Sound were able to assist you and your partner in finding your next home. Providing a quick, easy process and making you feel welcomed is our goal. If you have any further questions or need assistance, please don't hesitate to reach out. We appreciate your feedback!\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Tracy Knoedler",
        "rating": 5,
        "review": "Daniel Juarez @Real Property Management has been extremely helpful. He does all his research and is very transparent. 100% recommend contacting him if you want to rent out your property!",
        "owner_response": {
          "text": "Hi Tracy,\n\nThank you for your fantastic review! We're thrilled to hear that Daniel has been extremely helpful and transparent in his work. Your recommendation means a lot to us.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Rey Estacion",
        "rating": 5,
        "review": "As a real estate broker myself, I chose Real Property Management North Puget Sound for their exceptional reputation. The entire team is professional, responsive, and incredibly helpful, ensuring a seamless experience from start to finish. I highly recommend their services for anyone looking for top-notch property management.",
        "owner_response": {
          "text": "Hi Rey,\n\nThank you for your fantastic review! We greatly appreciate your trust and recommendation, especially coming from a real estate professional. We're delighted to hear that our team met your expectations and provided a seamless experience. We're here to continue delivering top-notch service for you and anyone you refer to us.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Vlad Bramonth",
        "rating": 5,
        "review": "Have used Real Property Management of Puget Sound for many years and the staff is very friendly and helpful. They have great service and would recommend them to anyone. Tery B has been awesome in recent home repair help.",
        "owner_response": {
          "text": "Hi Vlad,\n\nThank you for your kind words and for being a loyal client of Real Property Management North Puget Sound! We're delighted to hear that youve consistently had a positive experience with our team. Terry B. will be thrilled to know he made a difference with your recent home repair. We truly appreciate your recommendation and look forward to continuing to serve you.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ashley Murrieta",
        "rating": 5,
        "review": "Terry has been very attentive to each maintenance issue I have had. Hes fast and very diligent with his work no matter how big or small the request is. Thank you Terry for everything!",
        "owner_response": {
          "text": "Hi Ashley,\n\nThank you for your wonderful review! We're delighted to hear that Terry has been attentive and diligent in addressing your maintenance issues. Your appreciation means a lot to us. We'll make sure Terry knows how much his hard work is valued.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "CJ Reeder",
        "rating": 5,
        "review": "Terry has been fabulous at communication when work is needed on our property. He is great with following through to make sure issues get resolved.",
        "owner_response": {
          "text": "Thank you for recognizing our efforts in communication and issue resolution on your property! We appreciate your feedback."
        }
      },
      {
        "author": "Viktoria",
        "rating": 5,
        "review": "Very pleased with this property management company especially their maintenance manager Terry, he is very quick to respond and truly cares about problem solving so we feel taken care of. Highly recommend!",
        "owner_response": {
          "text": "Thank you, Viktoria, for your wonderful feedback; we're glad to hear that Terry's quick responses and problem-solving skills have made you feel well taken care of!"
        }
      },
      {
        "author": "Marilyn Saturay",
        "rating": 4,
        "review": "Friendly and helpful people! They are considerate and kind. Responded well with respect. Gail and the staff are great people to talk with.",
        "owner_response": {
          "text": "Hi Marilyn,\n\nThank you for your kind words! Were thrilled to hear that you had a positive experience with our team. Gail and the rest of the staff truly appreciate your feedback and are always here to help.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Heather Davis",
        "rating": 5,
        "review": "My experience with Real Property Management North Puget Sound has been exceptional! Being this is my first rental property I was uncertain of the process and at the beginning I had many questions and hesitations. The staff at Real Property Management helped alleviate my stress and fears. Everyone I have worked with in the office was patient, kind, and knowledgeable answering all of my questions and with their guidance I know the process has been streamlined. Without the Real Property Management Team in my corner I know the rental process would have been extremely stressful. I am so grateful to everyone on the team and I cannot thank you enough for helping to make my owning of a rental property experience so easy!",
        "owner_response": {
          "text": "Thank you for sharing your experience with us, Heather! We are delighted to have been able to assist you through the rental process and alleviate your stress. We appreciate your kind words and are grateful for the opportunity to make owning a rental property a smooth experience for you!"
        }
      },
      {
        "author": "Kristina",
        "rating": 5,
        "review": "Weve been with this property management for over 10 years. Everyone here is easy to reach, always happy to assist, and you always get an excellent customer service. So far the experience has been positive. I like how they always keep me informed with everything thats going on with our property.  Communication is the key for me and they are very good at it.\n\nJett and the rest of the team are  very efficient and very easy to work with!",
        "owner_response": {
          "text": "Thank you for being a loyal customer for over a decade! We're glad to hear that you appreciate our communication efforts and customer service."
        }
      },
      {
        "author": "Brian Moudy",
        "rating": 5,
        "review": "Frank, Gail, and the entire team at Real Property North Puget Sound have been awesome to work with. They gave us a reasonable list of things to work on to get rent ready, and helped us manage some stuff we werent able to take care of ourselves. They communicated clearly throughout and answered all our questions. As first-time landlords, we were very unsure of the whole process, but they made it very easy. We highly recommend them for managing a property.",
        "owner_response": {
          "text": "Thank you so much for sharing your experience, Brian! It was a pleasure assisting you with getting your property \"rent ready\" and making the process easy for you as first-time landlords. We appreciate your recommendation!"
        }
      },
      {
        "author": "Lorena Cruz",
        "rating": 5,
        "review": "Great experience with Cynthia!\nHelp my family to move to our new place fast and made all the process easy. I would definitely Recommend them.",
        "owner_response": {
          "text": "Thank you, Lorena! We're so glad to hear that Cynthia made your family's move fast and easy. We appreciate your recommendation!"
        }
      },
      {
        "author": "Thebeast 149",
        "rating": 5,
        "review": "RPM North has great communication! They make sure I have the information I need to make decisions about my property and ensure my tenants have a high quality place to live. In addition to placing tenants, RPM has helped me replace appliances, coordinate maintenance and repairs with vendors, and even recover packages sent to the wrong address. RPM is also very responsive to me as the owner when I have questions, problems, or concerns. I would highly recommend RPM to any homeowner looking for a management company.",
        "owner_response": {
          "text": "Thank you, Thebeast 149, for the fantastic 5-star review! We're thrilled to hear about your positive experience with Real Property Management North Puget Sound. Excellent communication and comprehensive support are our top priorities, and it's great to know we've met your expectations. We're here to assist with tenant placement, appliance replacements, maintenance, and even package recovery when necessary. Your recommendation means a lot to us. If you have any questions or concerns, we're always here to help.\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Osiris Ledezma",
        "rating": 5,
        "review": "Terry with maintenance has been a gem with any concerns we have brought up to him! He is fast, efficient, and authentic with the customer service he provides! Thank you Terry and team!",
        "owner_response": {
          "text": "Thank you for recognizing Terry's fast, efficient, and authentic customer service! It means a lot to us and we appreciate your feedback!"
        }
      },
      {
        "author": "James Waggoner",
        "rating": 5,
        "review": "I've used RPM for 4 years and they have been a great addition to my team. They are responsive, experienced, and reasonably priced.",
        "owner_response": {
          "text": "James, we are grateful for your loyalty over the past 4 years! Your kind words about our responsiveness, experience, and pricing mean a lot to us."
        }
      },
      {
        "author": "Scott Austin",
        "rating": 5,
        "review": "As a New vendor to Real Property Management,  I would like to thank them for the opportunity to work for them.\nTerry and Gail have been a pleasure to work with.\nThank you\nScott Austin\nAustin Painting",
        "owner_response": {
          "text": "Thank you for the kind words, Scott! It's been a pleasure working with you as well. - Real Property Management"
        }
      },
      {
        "author": "Chris Frost",
        "rating": 5,
        "review": "Real property management in marysville is great,the whole staff are incredibly friendly amd work tirelessly for their customers. Daniel Juarez in particular is a joy to work with",
        "owner_response": {
          "text": "Thank you, Chris, for your kind words about our team and for highlighting Daniel's great work; we truly appreciate your support!"
        }
      },
      {
        "author": "Megan Macias",
        "rating": 5,
        "review": "They have gone above and beyond to work with me. They have maintained my rental agreement while also having open communication about any changes. They Also very much care about all tenants being happy and accommodating neighbors",
        "owner_response": {
          "text": "Megan, we're so grateful for your kind words! We're glad we could work with you and keep the communication open. Happy tenants make our day!"
        }
      },
      {
        "author": "R Elgin",
        "rating": 5,
        "review": "Terry in the maintenance department has been a pleasure to work with.  He has been readily available to answer phone calls and texts sent after hours!  Very helpful in scheduling techs when needed. Thank you Terry!",
        "owner_response": {
          "text": "Thank you for sharing your experience! We're glad to hear that Daniel Juarez and our team at Real Property Management North Puget Sound could make the process smooth for you. We appreciate your kind words!"
        }
      },
      {
        "author": "Kim McShane",
        "rating": 5,
        "review": "It is nice to be able to work with a person like Terry Harrison that has a higher level of professionalism. He is thorough, courteous, and listens to your problems or concerns. How refreshings !!!",
        "owner_response": {
          "text": "Thank you, Kim, for your wonderful feedback about Terry; we truly appreciate your kind words and are glad to hear about your positive experience."
        }
      },
      {
        "author": "Steve Hanning",
        "rating": 5,
        "review": "Frank and his team are the best!\nFound the best tenants you could ever want and there attention to there clients are exceptional.\nI will gladly refer Real Property Management to anyone !",
        "owner_response": {
          "text": "Hi Steve,\n\nThank you for your wonderful review! We're thrilled to hear that you had such a positive experience with Frank and the team. Finding the best tenants and providing exceptional service is our priority. We appreciate your referral and look forward to continuing to serve you.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Artur Nekrasov",
        "rating": 5,
        "review": "I wanna say that Real Property management has done an amazing job managing the house we currently live in! We had such a great experience with them through the entire process, from finding the listing on the web to moving in - they are very responsive, transparent and very well organized. I feel that every single maintenance request is being taken care of, they respond in a timely manner and fix the problem! I had to reach out to the owner through them with very specific request and they helped me with that providing quick and clear communication! Couldnt be more satisfied with their customer service! Thank you a lot!",
        "owner_response": {
          "text": "Thanks so much for the glowing review! We're thrilled to hear you had a great experience with Real Property Management North Puget Sound. We're here to make things smooth for you, from finding the listing to sorting maintenance requests. If you ever need anything else, just give us a shout."
        }
      },
      {
        "author": "Timothy Gilmore",
        "rating": 5,
        "review": "Rose and Cynthia were amazing to work with. They were professional, courteous and knowledgeable about everything. They made the application process seamless. They answered all my questions and were great to work with. This was my first experience with a property management company, but Ive heard it can be very hard. Not at all my experience with Rose and Cynthia!",
        "owner_response": {
          "text": " Thank you for your kind words an 5 star review. Rose and Cinthia, on our leasing team, are awesome and are always trying to help people with the move-in process. They are some of our \"A\" players. We are glad to have you as one of our tenants."
        }
      },
      {
        "author": "Coyoy Empire",
        "rating": 5,
        "review": "Daniel Juarez. Thank you for informing us about your services and guiding us step by step on how Real Property Management North puget coul add value to our business.",
        "owner_response": {
          "text": "Thank you, Coyoy, for your kind words; we're glad Daniel could assist you in understanding how we can add value to your business!"
        }
      },
      {
        "author": "Kacie",
        "rating": 5,
        "review": "Terry has been amazing. He is very communicative and is very quick to be in contact and get our needs taken care of.",
        "owner_response": null
      },
      {
        "author": "Brian Mathis",
        "rating": 5,
        "review": "We have been with RPM for about 8 years. Recently had an odd maintenance issue come up with our rental property.  Terry with RPMNPS put in many hours researching, networking, and negotiating the best possible solution at the most reasonable price.  Thanks again!",
        "owner_response": {
          "text": "Thank you, Brian, for your kind words and for being with us for the past 8 years. Were thrilled to hear that Terry could assist you with your recent maintenance issue. Your trust in Real Property Management North Puget Sound is greatly appreciated. We look forward to continuing to provide you with exceptional service!\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Eric Garst",
        "rating": 5,
        "review": "I would highly recommend RPM Puget Sound! As a tenant, they are always quick to respond to any questions or concerns and the app they use to make payments and maintenance requests is so easy to use! I feel like a priority while working with them!",
        "owner_response": {
          "text": "Thank you, Eric, for your fantastic review! We're delighted to hear that our quick responses and user-friendly app have made your experience as a tenant a positive one. At Real Property Management North Puget Sound, ensuring our tenants feel prioritized is a top priority. We appreciate your recommendation and look forward to continuing to serve you!"
        }
      },
      {
        "author": "Tracy DeLorm",
        "rating": 5,
        "review": "I have had the pleasure of working with Real Property Management North Puget Sound for two years now and I am thrilled with the level of service they provide.\n\nThey conduct a thorough rental analysis each year to ensure that my rent is fair and competitive.  My previous property management company never reminded me to evaluate and raise the rent each year.  When RPMNPS took over, I was at least $700 per month lower than the average rent in the area.\n\nThey conduct yearly inspections of my property which ensures that any potential issues are identified and resolved promptly.  When repairs are needed, they use quality vendors and ensure that repairs are not just quick fixes but are completed with attention to detail and to a high standard.\n\nOverall, my experience with Real Property Management North Puget Sound has been exceptional. Their use of quality vendors, rental analysis, timely rent increase reminders, yearly inspections, and focus on quality repairs have made them reliable and trustworthy partners. I highly recommend their services to anyone in need of professional property management.",
        "owner_response": {
          "text": "Thank you, Tracy! We appreciate your kind words and are grateful for the opportunity to serve you. It's been a pleasure working with you for the past two years and we're glad to hear that our rental analysis, yearly inspections, and focus on quality repairs have met your expectations. We value your trust and recommendation."
        }
      },
      {
        "author": "Lifetime Heating",
        "rating": 5,
        "review": "Terry is an amazing addition to the RPM team! He continues to make sure our mutual clients are taken care of and goes above and beyond to ensure that timely and necessary repairs get scheduled as soon as possible. We love working with RPM and everyone on their team!!",
        "owner_response": {
          "text": "Dear Lifetime Heating,\n\nThank you for the fantastic 5-star review! We appreciate your positive feedback about Terry at Real Property Management North Puget Sound. We're delighted to hear about the excellent service he provides to our mutual clients, ensuring timely and necessary repairs. It's wonderful to know that you love working with our team. If there's anything more we can do or if you have any additional feedback, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Angel",
        "rating": 5,
        "review": "The staff has all been very personable and professional. We have had a few hiccups along the way but it's our first year with them.\n\nI will say that Joseph, the Technician that did a recent service request, is the highlight of RPM. He did such a great job and was very knowledgeable about a variety of issues we were experiencing. He was professional and very personable. He was punctual and responsive throughout and I really appreciated that.",
        "owner_response": {
          "text": "Angel,\nThank you for taking the time to share your experience. We're pleased to hear that our staff has been personable and professional. We understand that the first year may have its challenges, and we appreciate your understanding.\nWe're especially delighted to hear about your positive experience with Joseph, our technician. Your kind words about his knowledge, professionalism, punctuality, and responsiveness mean a lot to us. If you ever encounter further issues or have additional feedback, please don't hesitate to reach out. We're here to ensure your experience with Real Property Management North Puget Sound remains exceptional.\nBest,"
        }
      },
      {
        "author": "Srivatsan Venkatesan",
        "rating": 5,
        "review": "I chose this property management company  for renting my property and the experience has been great. The staff is very professional and is very good at getting things done quickly and in taking care of my rental property. I appreciate the quality and work ethic they bring in every area.\n\nThe management team and staff is excellent and was very responsive and helpful in answering all my questions and concerns. I am very pleased with all the service and help I have received so far.\n\nThis is my first experience using a property management company and they are awesome. I highly recommend Real Property Management North Puget Sound.",
        "owner_response": {
          "text": "Thank you for the wonderful 5-star review! We're thrilled to hear that your experience with Real Property Management North Puget Sound has been great. It's fantastic to know that our staff has been professional, responsive, and efficient in taking care of your rental property. We appreciate your acknowledgment of our quality service and work ethic. If you have any more questions or concerns, please don't hesitate to reach out. Thank you for recommending us!\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "DNA Drain Cleaning and Sewer",
        "rating": 5,
        "review": "Real Property Management North Puget Sound takes care of its clients and tenants in a professional proficient manner always going above a beyond. Terry Bertucci is a great communicator who understands what it takes to get things done cost effectively; with years of experience in trades and customer service its no question why hes a perfect fit and representation of the company!",
        "owner_response": {
          "text": "Thank you so much for the glowing review! We're thrilled to hear about your positive experience with Real Property Management North Puget Sound. We take pride in our professional and proficient service, and it's great to know that Terry Bertucci's expertise and communication have made a positive impact. We value our partnership with you and look forward to continuing to work together.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Robin Croke",
        "rating": 5,
        "review": "I love Real Property Management. They're one of the few US based property management companies in the PNW. You can always reach someone on the phone and they're not talking to you from some script. Very professional, attentive to tenants and homeowners needs and they only hire the best contractors to make repairs. Highly recommend RPM",
        "owner_response": {
          "text": "Thank you for your kind words, Robin! We're glad to hear about your positive experience with our team and services. Appreciate your recommendation!"
        }
      },
      {
        "author": "Pam de Sautelle",
        "rating": 5,
        "review": "Joseph Butcher is an amazing employee of RPM. He is professional and personable, shows empathy for situations well and pays attention to detail.\n\nHe repaired my stove, fire alarm, and kitchen faucet on Friday, returned on Monday after a pipe froze in our garage. Due to the freezing weather conditions all plumbers were out on other calls. Joseph called, then came out quickly, and was able to repair it!!!! It was seamless and perfectly executed. About four hours in total and our water was back on. He initiates the task and follows up professionally over the phone. Well done Joseph!!!!",
        "owner_response": {
          "text": "Pam,\nThanks for the fantastic 5-star review! We're thrilled that Joseph Butcher from Real Property Management North Puget Sound impressed you with his professionalism, personable approach, and attention to detail. Your feedback on the efficient repairs to your stove, fire alarm, kitchen faucet, and frozen pipe is greatly appreciated. If you have more maintenance needs or questions, feel free to reach out.\nBest,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound\n"
        }
      },
      {
        "author": "Joyce Kwan",
        "rating": 5,
        "review": "Having a good experience with them and all the staff especially Terry Bertucci! Terry has consistently answered all my calls and questions asap.  He's a very valuable asset for this company.",
        "owner_response": {
          "text": "Dear Joyce,\n\nThank you for the wonderful 5-star review! We're delighted to hear that you're having a good experience with Real Property Management North Puget Sound and our staff. If you have any specific feedback or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Kristin Johnson",
        "rating": 5,
        "review": "The staff at RPMNPS are all terrific.  Being a first time landlord, Frank was so helpful with getting me started with the whole process.  Gail and Rose were quick to respond with my many questions.   They all worked hard to get my house ready and up on the market.   I am so Thankful I chose them as my property management company.",
        "owner_response": {
          "text": "Thank you, Kristin! We're grateful to have been able to assist you with becoming a first-time landlord. Our team, including Frank, Gail, and Rose, is dedicated to providing helpful and responsive service. We appreciate your trust in us as your property management company."
        }
      },
      {
        "author": "Johnny Blackstar",
        "rating": 5,
        "review": "Real Property Management  got clear communication, responsiveness, expertise, professionalism, you can really trust them, they are very friendly.",
        "owner_response": {
          "text": "Thank you so much, Johnny! We appreciate your kind words and are grateful for your trust in our services. It means a lot to us that you found our communication clear and our team responsive and friendly."
        }
      },
      {
        "author": "Kassandra Taggart",
        "rating": 5,
        "review": "After I learned about how the owners of this RPM office is also investors and only does property management, I knew I needed to also attend their classes and consider this my next investment location. I'm even providing a picture to show you how well the turnout was.  I'm an investor in multiple states and it matters to me that the property manager also understands the investor mindset and will focus on managing my rentals not busy doing a whole lot of nothing.  Frank  & Daniel - thanks for taking the time to speak with me.",
        "owner_response": {
          "text": "Thank you Kassandra!"
        }
      },
      {
        "author": "Dustin Thomas",
        "rating": 5,
        "review": "What a great property management company! I am blown away at their dedication to excellent service for not only their clients but tenants as well, which is rare in the industry. If you are looking for a great company to manage your rental Real is definitely a good choice",
        "owner_response": {
          "text": "Thank you for recognizing our dedication to excellent service for both clients and tenants! We appreciate your kind words and are grateful for your feedback."
        }
      },
      {
        "author": "Rikki Gainer",
        "rating": 5,
        "review": "Rose was so helpful and kind, and shoutout to Cynthia for all of her help!!!",
        "owner_response": {
          "text": "Thank you for your wonderful review, Rikki! We're delighted to hear that Rose and Cynthia provided you with helpful and kind service. Your appreciation means a lot to us!"
        }
      },
      {
        "author": "Sarah Moore",
        "rating": 1,
        "review": "DO NOT RENT FROM THEM! Unless of course you like to be harassed by the property owner's son or If you don't care about how you are treated. They do not care about you. Just your money. Check out BBB website about them. Nothing but complaints. They are not honest.\nI am not talking about the carpet issue. I am speaking on how I was harassed for a year by the property owners son while being your tenant. I had to take legal action which is not okay. They do not care about your safety just money!!!",
        "owner_response": {
          "text": "We are sorry to hear about your experience and take your feedback seriously. At Real Property Management North Puget Sound, we strive to uphold our core values: \"always be honest\" and \"own it.\" We prioritize treating all our tenants with respect and professionalism.\n\nRegarding your specific situation, we took your concerns about the property owners son, that lived nearby, seriously and met with and informed the property owners to have it stop many times. We did all we could to help make your stay better. We really wish you the best. "
        }
      },
      {
        "author": "Austin Kuss",
        "rating": 5,
        "review": "Terry has been phenomenal with helping maintainence issues get resolved as quick as possible, and has been in constant contact for updates and any possible issues",
        "owner_response": null
      },
      {
        "author": "Tetiana Voloshyna",
        "rating": 5,
        "review": "Great service, fast response to the requests. Special thanks to the Terry Bertucci, maintenance coordinator who helped us with our request.",
        "owner_response": null
      },
      {
        "author": "DJ Lay",
        "rating": 5,
        "review": "Maintenance Coordinator Terry Bertucci has been extremely helpful with resolving issues with my rental property. He exceeds expectations with communicating problems and works with me to determine workable solutions. Thanks Terry, your attention to detail and support is greatly appreciated!",
        "owner_response": {
          "text": "Thank you for the fantastic 5-star review! We're thrilled you've had a positive experience with Terry Bertucci, our Maintenance Coordinator at Real Property Management North Puget Sound. Your kind words about Terry's communication and problem-solving skills mean a lot to us. We're here to help if you need anything else!"
        }
      },
      {
        "author": "Garage Tech",
        "rating": 5,
        "review": "Terry the maintenance coordinator has been a pleasure to work with. As a vendor, we appreciate his promptness to respond to our requests for information or approval to move forward on repairs. We find the entire process working with Real Property Management N Puget Sound to be easy and efficient.",
        "owner_response": {
          "text": "Dear Garage Tech,\n\nThank you for the fantastic 5-star review! We appreciate your positive feedback about Terry, our maintenance coordinator, and the efficiency you've experienced working with Real Property Management North Puget Sound. If you have any more comments or if there's anything else we can assist you with, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Tanner Kennedy",
        "rating": 5,
        "review": "Awesome experience! Daniel is the man. He got our sink fixed fast and without issue",
        "owner_response": {
          "text": "Thank you so much for your kind words, Tanner! It was a pleasure assisting you with your sink."
        }
      },
      {
        "author": "Colton Davis",
        "rating": 1,
        "review": "While Real Property Management might seem like a convenient choice for renting, my experience with them has been less than satisfactory.\n\nLet me start with the move-out process, which was a nightmare. Expect to jump through hoops and incur unexpected expenses. Despite leaving the apartment in decent condition, I was hit with charges for what should be considered normal wear and tear. Nail holes in the wall, interior painting, and light bulb replacements were all on the list of things I was charged for. It felt like they were searching for any excuse to dip into my deposit. The most absurd part? Being forced to hire a professional cleaning company at my own expense.\n\nSpeaking of deposits, be prepared to say goodbye to a chunk of yours for a suspicious $200 admin fee. Apparently, coordinating move-out work that was supposedly my responsibility warranted this hefty deduction. And let's not forget the exorbitant charges for seemingly minor items. $284 for a freezer shelf? $77 for a gallon of paint? Absolutely ridiculous.\n\nWhat's more, their strict subleasing policy is downright exploitative. Want to sublease? Sure, but only if you're willing to fork over three months' rent. It's a blatant cash grab and shows a complete lack of consideration for renters.\n\nOverall, Real Property Management seems more interested in nickel and diming tenants than providing a fair and transparent renting experience. If I had known about their overly scrutinous move-out process beforehand, I would have meticulously documented every detail on the move-in inspection form. Consider yourself warnedrenters, beware.",
        "owner_response": {
          "text": "We appreciate your feedback and take it seriously. At Real Property Management, we strive to provide a fair renting experience.\nRegarding the move-out process, charges for items like excessive nail holes, tenant damage that requires painting, and burnt out light bulbs are outlined in the Lease Agreement, and are standard for maintaining the property's condition.\nThe admin fee for coordinating maintenance for tenant damage upon move-out is also standard and communicated upfront in the Lease Agreement.\nOur subleasing policy is firm to ensure compliance with leasing regulations and protect both tenants and property owners.\nWe're sorry our processes didn't meet your expectations, though they were explained at lease signing and detailed in the lease. Thanks for your feedback and bringing your concerns to our attention."
        }
      },
      {
        "author": "Lindsey Price",
        "rating": 1,
        "review": "Future tenants should be aware that RPM puts their landlords above their tenants and are only interested in making money, not supporting the tenants. In a disagreement of the use of my security deposit, Gail was rude and unhelpful and because we couldnt agree, now I have to take an extra step and file a lawsuit just to get my deposit back. Gail repeatedly said the house was dirty to be rude rather than using any level of professionalism or customer service. She also offered no avenue to dispute the charge other than continuously saying this is how it must be instead of understanding its a mutual disagreement and we could use a mediator to resolve it. Why not clarify that its well within a tenant rights to dispute the charges? Im unsure if Gail is incapable or just unwilling to read the laws laid out to protect Washington state tenants.\n\nI understand needing to leave the house in a certain condition based on our lease agreement but was being rude necessary? We are poor and we did our best, we couldnt afford the cleaners they wanted. We work full time and go to school full time, I couldnt spend more than a month deep cleaning the house to meet RPM needs. I recognize they want the house in a certain way and we didnt meet that standard but at this point and based on Gails attitude, I just feel totally scammed no matter what they say is wrong with the house because anything I say will just be met with this is how it must be done. In my opinion, forcing your tenants to perfect the home to your standard out of pocket is just taking advantage of renters who often dont have a choice about the fact they are renting.  Its unfortunate that RPM  doesnt do any work themselves and expects the previous tenant to perfect the house out of pocket for the next tenant, continuing to limit any work needed on RPM side and keeping them from having to bother investing in their properties and tenants.\n\nI also find it extremely important to mention that we returned the house in the exact position it came in when we got it minus regular wear and tear from living in a 100+ year old house for 2 years. It was equally as dirty when we moved in, I spent 2 years deep scrubbing the dirty off of everything in the home (pictures below).\n\nSome advice for RPM, maybe try caring about your tenants and properties by cleaning them yourself rather than being lazy and judgmental? Maybe also have a pre written email ready for tenant deposit disputes since you are not able to talk them through as a company in a nice and professional way. Regardless of their reasoning for taking some or all of my deposit, I just hope future tenants dont make the same mistakes I did and spend 2 months cleaning the house and scrubbing every inch to perfection and most importantly, have Gail walk through your house before you move out so its harder to get taken advantage of - otherwise they do the walkthrough alone and make their own decisions.\n\nI also have a strong feeling based on their previous negative reviews that they will respond to this unprofessionally too. I dont care about the deposit or them, I just want other tenants to be protected and not make the same mistakes I did by renting through them.",
        "owner_response": {
          "text": "We're sorry to hear about your experience. At Real Property Management, we prioritize professionalism and aim to provide excellent service to landlords and tenants alike. We strictly adhere to Tenant Landlord Law and take it seriously. Pet urine in carpet and along baseboards isn't considered normal wear and tear and must be addressed.\n\nRegarding security deposit disputes, we follow Washington state laws and guidelines. We understand disagreements may arise and always aim for honesty and fairness to both tenants and owners.\n\nYour feedback is important to us, and we're dedicated to improving our services. We apologize for any perceived rudeness, which doesn't reflect our customer service standards.\n\n"
        }
      },
      {
        "author": "Tom Gunderson",
        "rating": 5,
        "review": "I have been working with Terry for quite a while. When he contacts me with a Plumbing issue with a Tenant,he is very thorough with all the information we need to take care of the Plumbing problem.\nHe also makes sure to follow up to make sure the Tenant is taken care of.\nIt's a pleasure to work with him as a professional.\nTom Gunderson\nGunderson Plumbing LLC",
        "owner_response": {
          "text": "Thank you for your kind words, Tom! I appreciate your feedback and am glad to hear that you find our interactions helpful and thorough. It's a pleasure working with you as well."
        }
      },
      {
        "author": "razedonradio",
        "rating": 5,
        "review": "We enlisted RPM's services to manage our properties about two years ago.  We have been very pleased with their promptness and attention our properties specific needs.  They have been integral to elevating our tenants reasons to stay long term.  Thank you RPM",
        "owner_response": {
          "text": "Thank you for choosing Real Property Management North Puget Sound to manage your properties! We greatly appreciate your kind words and the trust you have placed in us. It's been a pleasure working with you these past two years and we're glad to hear that our promptness and attention to your property's needs have helped in retaining long-term tenants. We look forward to continuing to provide excellent service to you in the years to come."
        }
      },
      {
        "author": "Cynthia Lopez",
        "rating": 5,
        "review": "Rose and Cynthia are really helpfully, amazing and professional, always answered all our questions",
        "owner_response": {
          "text": "Thank you, Cynthia! We're glad to hear that Rose and the team were able to assist you so well. Your feedback means a lot to us!"
        }
      },
      {
        "author": "Celine Williams",
        "rating": 5,
        "review": "I love working with Greg and the RPM team. They are always quick to respond to my questions and inquiries and treat my clients very well! I appreciate them so much I plan to use them for my own investment property.",
        "owner_response": {
          "text": "Thank you for your kind words! We appreciate your support and are grateful for the opportunity to assist you and your clients. We look forward to working with you on your investment property Celine!"
        }
      },
      {
        "author": "Jeffrey Shumway",
        "rating": 5,
        "review": "As a tenant, Terry has been quite helpful in processing maintenance requests and getting us quick help",
        "owner_response": {
          "text": "Thank you for recognizing Terry's helpfulness with maintenance requests, Jeffrey!"
        }
      },
      {
        "author": "Allison Vaden",
        "rating": 5,
        "review": "I would highly recommend Real Property North Puget Sound as a property manager.  They managed my property for several years.  They were quick to respond to\nany questions or issues.  I always felt like they were taking care of my property and me.  Gail was wonderful to work with, as well as everyone else at Real Property Management.   I wouldn't hesitate to use them again.",
        "owner_response": {
          "text": "Allison Thank You so much. We have really enjoyed working with you! Gail"
        }
      },
      {
        "author": "Jose Hernandez",
        "rating": 5,
        "review": "Terry from Rpm is a great person to work with as a vendor he keeps us busy and has quick response time and very communicative",
        "owner_response": {
          "text": "Thank you, Jose! We appreciate your feedback and are glad to hear that Terry has been helpful and communicative."
        }
      },
      {
        "author": "Blake Nelson",
        "rating": 5,
        "review": "Just moved into our rental, and it has been wonderful dealing with RPM. Rose and Cynthia were so great and made the process of getting into the rental so easy. Tons of communication which is always appreciated. Mike with maintenance has been a big help right off the bat just making sure everything is up to par. Best rental management company Ive ever dealt with.",
        "owner_response": {
          "text": "Blake, Thank you for your review. We will do all we can to make your tenancy as smooth as possible."
        }
      },
      {
        "author": "Eajen Ahmed",
        "rating": 5,
        "review": "Real Property Management is probably the property management company in the area. They take plenty of photos before, after, and during the tenants stay. There costs are reasonable, and communication is great. I would recommend them to anyone.",
        "owner_response": {
          "text": "Thank you, Eajen, for your wonderful 5-star review! Were delighted to hear that you consider Real Property Management North Puget Sound the best property management company in the area. We're glad our detailed photo documentation, reasonable costs, and strong communication have met your expectations. Your recommendation means a lot to us. Thank you for trusting us with your property management needs!\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Guam Grub",
        "rating": 5,
        "review": "Joseph did an exceptionally great job while visiting for the repair. He explained each step of the process as it went along. He was very respectful and courteous. He was professional and quick too! He deserves a raise and a promotion! He definitely represents the company well and knows his stuff! Thank you, Joseph!",
        "owner_response": {
          "text": "Thank you so much for your kind words, Guam Grub! We appreciate your feedback and are grateful to have Joseph on our team. He truly exemplifies our commitment to excellent service."
        }
      },
      {
        "author": "Ley Daffodil",
        "rating": 1,
        "review": "I cant say anything good about this property management. Moved into a very dirty (but surfaced cleaned, so couldnt tell until actually moving in), poorly taken care of home. Had many issues throughout the stay. Countless emails and complaints. Never were they taken care of. Had inspector come in every 6 months and would tell us every time that their notes and pictures were sent to property owner. And that most of the issues were ongoing before moving in. The stairs/porch/and back patio were unsafe and rotting.\nI understand these are issues that the property owner should have taken care of. But with no help from the property management, we got no where to fix the issues.\nMany times random employees would call or email to ask about lists of things needing to be done without investigating or checking with other employees who have already been made aware of issues. It was a constant cat and mouse game with this property management. It seemed like no one communicated within the office. And nothing was ever taken serious.\nOne night a pipe busted in our bathroom gushing hot water. For hours we couldn't get it to stop. We called the emergency line left a message. No one called back until the morning. Imagine if we didn't figure that out how high our bill would have been or how damaged the house could have gotten.\nThe fridge when we moved in was broken with missing drawers and shelves.\nI don't know how property management could let this home get so bad and not do their due diligence with the owners to fix these terrible issues.\n\nI've since moved out of state. But had I not, I would definitely steered clear of this management company again.",
        "owner_response": {
          "text": "We apologize for the experience you had with our property management. We understand your frustration with the cleanliness and maintenance issues you encountered during your stay. We strive to provide a well-maintained living environment for all our tenants and we apologize for falling short in this instance. We apologize for any miscommunication or lack of promptness in addressing your concerns. Please know that we take these matters seriously and we appreciate your feedback. If you have any further concerns or need assistance, please don't hesitate to reach out to us via call or text."
        }
      },
      {
        "author": "Amanda Khan",
        "rating": 5,
        "review": "Thank you for the prompt response to my maintenance request Terry. Its such a comfort to know that I can count on you for any issues that arise.",
        "owner_response": {
          "text": "Thank you for the 5-star rating, Amanda Khan!"
        }
      },
      {
        "author": "tim corr",
        "rating": 5,
        "review": "I've been impressed by how professionally these guys are able to track and communicate the various items of a rental home. It feels like they have the best interest of the owner, tenant, and vendor as their aim. Attention to detail and inexhaustible strive for excellence has made Real Property Management North Puget Sound a company I am proud to work with.",
        "owner_response": {
          "text": "Thank you, Tim! We truly appreciate your kind words and are grateful for the opportunity to work with you. Your satisfaction is our top priority, and we're glad you've noticed our dedication to excellence."
        }
      },
      {
        "author": "Benton Redford",
        "rating": 5,
        "review": "Terry in maintenance has been helpful and prompt when repairs are needed. He has been a  real pleasure to work with.",
        "owner_response": {
          "text": "Thank you for recognizing Terry's hard work and dedication!"
        }
      },
      {
        "author": "April Oli",
        "rating": 5,
        "review": "We've only been with RPM for about a month and so far it's been a great experience with the property management and maintenance team. Ulises has been responsive, reliable. I appreciate their dedication and would definitely recommend their services!",
        "owner_response": {
          "text": "Thank you, April! We're grateful for your kind words and glad to hear that you've had a great experience with our property management and maintenance team. Ulises truly values your satisfaction and will continue to provide responsive and reliable service. We appreciate your recommendation!"
        }
      },
      {
        "author": "Georges Smaha",
        "rating": 5,
        "review": "Great team to work with. Terry Bertucci has been of great assistance exemplifying the role of maintenance manager. Overall, great experience having Real Property manage my rental.",
        "owner_response": {
          "text": "Thank you, Georges! Terry Bertucci is an exceptional and essential part to our maintenance team, and we're grateful to have him. We appreciate your kind words and are delighted to hear that you had a great experience with Real Property Management North Puget Sound managing your rental."
        }
      },
      {
        "author": "Ang Nova",
        "rating": 5,
        "review": "My husband and I have loved working with RPM. Such kind people, swift responses, helpful. Working with them as a middle man makes us feel really good about our rental.",
        "owner_response": {
          "text": "Thank you so much for your kind words! We truly appreciate your feedback and are grateful to have you as valued customers."
        }
      },
      {
        "author": "Joshua Holmes",
        "rating": 5,
        "review": "Terry did a wonderful job walking us through with our broken water heater. Stayed on top of everything with speedy service!!",
        "owner_response": {
          "text": "Thank you for your kind words, Joshua! We appreciate your feedback and are glad to hear that Rose and Cynthia provided outstanding service."
        }
      },
      {
        "author": "Derek Kaye",
        "rating": 5,
        "review": "Daniel was really great to work with. I needed some help understanding, tenant and landlord agreements. Daniels experience showed, and his advice really helped he resolve issues I had.",
        "owner_response": {
          "text": "Thank you, Derek, for the fantastic 5-star review! We're delighted to hear that Daniel's expertise and advice were so helpful in resolving your issues with tenant and landlord agreements. We're proud to have him on our team!\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Victoria Young",
        "rating": 5,
        "review": "Terry has busted his back helping us get everything right. We appreciate him!",
        "owner_response": {
          "text": "Thank you, Victoria! We truly appreciate your kind words and will make sure Terry and the rest of the team knows how much their hard work means to you."
        }
      },
      {
        "author": "Seth Connell",
        "rating": 5,
        "review": "The team at RPM NPS provide outstanding service to not just their customers, but vendors too. Harrison and Gail are quick to respond, professional, and courteous. This regions best property managers Ive had the pleasure of working with!",
        "owner_response": {
          "text": "Thank you so much, Seth! We really appreciate your kind words and are grateful for the opportunity to work with you."
        }
      },
      {
        "author": "Lisa Repenn",
        "rating": 5,
        "review": "Such a very kind and caring team! Very quick to respond and help with any questions or issues.   I have enjoyed working with them. Thank you!",
        "owner_response": {
          "text": "We're delighted to hear that you had a positive experience with our team at Real Property Management North Puget Sound! Thank you for your kind words!"
        }
      },
      {
        "author": "Rick Tilton",
        "rating": 5,
        "review": "Exceptional Property Management Experience with Real Property Management North Puget Sound.\n\nI recently had the pleasure of working with Frank Volkert and the team at Real Property Management North Puget Sound (RPMNPS) to handle the marketing, tenant screening, and overall management of my property. From our initial meeting to the successful one-year rental period, I couldn't be more satisfied with their services.\n\nOne of the standout aspects of RPMNPS is their commitment to ensuring the property is in optimal condition for attracting quality tenants. Frank Volkert, in particular, demonstrated a keen understanding of the market and provided valuable suggestions to enhance my property's appeal. His recommendations for painting and new floor coverings proved to be instrumental in attracting a pool of applicants.\n\nThe meticulous move-in inspection conducted by RPMNPS's home inspector set the tone for the professional standards upheld by the company. It was reassuring to know that they took the time to thoroughly assess the property before tenants moved in. Equally commendable was the follow-up inspection after six months, demonstrating their commitment to maintaining the property's condition over the long term.\n\nThroughout the process, Frank displayed excellent communication and negotiation skills. From the moment the property was ready, he promptly presented a range of qualified applicants, allowing us to make an informed decision. This proactive approach ensured a seamless transition from property preparation to successful tenant placement.\n\nI appreciate the transparency and efficiency demonstrated by RPMNPS. Frank and his team's dedication to maximizing rental returns and ensuring tenant satisfaction have resulted in a trouble-free rental experience for the past year. I am grateful for their expertise and highly recommend Real Property Management Group Northwest to anyone seeking reliable and effective property management services.\n\nIn conclusion, my experience with RPMNPS has been nothing short of outstanding, and I am confident in their ability to continue delivering top-notch property management services in the future. Thank you, Frank Volkert, and the entire team at RPMNPS, for your professionalism, attention to detail, and commitment to excellence.",
        "owner_response": {
          "text": "Thank you, Rick Tilton, for your exceptional review of our property management services at Real Property Management North Puget Sound! We are grateful for your trust and appreciate your kind words about Frank Volkert and our team. Your satisfaction and positive experience over the past year mean a lot to us. We will continue to deliver top-notch property management services with professionalism, attention to detail, and a commitment to excellence. Thank you again for your recommendation!"
        }
      },
      {
        "author": "Kathleen Kelly",
        "rating": 5,
        "review": "UPDATE:  this year(2024),  I've had several things go wrong with my rental. I've been working with Terry and I can honestly say I've never been more pleased. He's personable and has followed thru with all that I have asked of him. I wouldn't hesitate to recommend this company if you are seeking a property manager. I'm just sorry I didn't go this route sooner. You won't regret using them.\n\nI had numerous challenges and expenses getting my property ready for re-rent. I am so glad I enlisted the help of Aaron, Rose, Kelly, Crystal and their vendors to complete my tasks.  Rose in particular I am grateful to in finalizing the projects and getting my property rented. Thank you all so much. I would recommend all of them for your rental needs.",
        "owner_response": {
          "text": "Thank you Kathleen!"
        }
      },
      {
        "author": "Heather Carleton",
        "rating": 5,
        "review": "The team was responsive, scheduled for best time window for our family, evaluated and completed the work quickly and cleanly.",
        "owner_response": {
          "text": "We're so glad to hear that our team was able to provide responsive and efficient service for your family. Thank you for sharing your experience with us!"
        }
      },
      {
        "author": "Simon Jones",
        "rating": 5,
        "review": "Great experience with RPM! Rose and Cynthia worked with me and are very professional and knowledgeable. I really appreciated their prompt and kind responses to my questions. RPM provides the personal touch that is often missing in our overly automated world.",
        "owner_response": {
          "text": "Thank you, Simon! We appreciate your kind words and are thrilled to hear that you had a great experience with us. Rose and Cynthia are fantastic team members and we are glad that their professionalism and knowledge made a positive impact on your experience. We take pride in providing a personal touch to our service and are grateful for your recognition."
        }
      },
      {
        "author": "DEE M",
        "rating": 5,
        "review": "Real property management was amazing! As a new tenant and being new to the area they were able to answer all of my questions not just about the property but the area I would be staying in. They were kind, detailed, and patient! They were able to work with me on my move-in date and was willing to stay later, when I couldnt get to them from where I was coming from to get the keys. I wish all property managements were like them.",
        "owner_response": {
          "text": "Thank you so much for your kind words and for choosing Real Property Management North Puget Sound! We're delighted to hear that we were able to provide you with the information and support you needed as a new tenant. We truly value your feedback and appreciate your recognition of our efforts. It was a pleasure working with you, and we're here for you whenever you need us."
        }
      },
      {
        "author": "Debbie Groothuis",
        "rating": 5,
        "review": "RPM does such a great job working with their clients, vendors and making sure their rental units are in great shape, clean and getting renters in that are vetted!\nThey go above what other property management companies do and you can't go wrong using them whether you're a landlord or prospective renter!",
        "owner_response": {
          "text": "Thank you, Debbie! We truly appreciate your kind words and trust in our services. We prioritize our clients, vendors, and ensuring our rental units are in excellent condition. Your support means a lot to us!"
        }
      },
      {
        "author": "Francine Nogaki",
        "rating": 5,
        "review": "We are landlords and have been with RPMNPS for 7 years and have really appreciated the service and professionalism they provide.",
        "owner_response": {
          "text": "We are so grateful for your loyalty over the past 7 years and are delighted to hear that you appreciate the service and professionalism we strive to provide."
        }
      },
      {
        "author": "Bridgett Alonso",
        "rating": 5,
        "review": "John and his team have been wonderful to work with.  Rose and Cynthia were great at getting right back to me when I had questions.  John has been amazingly helpful and has guided me through the process and assisted me in getting in touch with the right person on his team.  I would highly recommend working with the RPM group!  They're fantastic!",
        "owner_response": {
          "text": "Thank you for your kind review. We really try to do all we can to make your transition as smooth and easy as possible."
        }
      },
      {
        "author": "Nicole Tennison",
        "rating": 5,
        "review": "I highly recommend Real Property Management if you are looking to rent a property. They are professional, great to work with and will take all the stress out of having a rental property. They even have a Diamond Guarantee if a tenant doesnt pay their rent for some reason, you will still get paid!!!",
        "owner_response": {
          "text": "Thank you, Nicole! We appreciate your kind words and recommendation. It's great to hear that our team provided you with a stress-free rental experience. We're glad you appreciate our Diamond Guarantee as well."
        }
      },
      {
        "author": "Steven Thomas",
        "rating": 5,
        "review": "We had a quick response with our maintenance request and got the problem fixed same day. The service tech was quick and courteous and got the job done perfectly.",
        "owner_response": {
          "text": "Hi Steven,\n\nThank you for the 5-star review! We're thrilled to hear that your maintenance request was handled promptly and efficiently. Our team takes pride in providing quick and courteous service. We appreciate your feedback and look forward to continuing to meet your expectations.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "ABUBAKAR BETTS",
        "rating": 5,
        "review": "Great experience. All my questions were answered by Cynthia to make everything seem easy!",
        "owner_response": {
          "text": "Thank you, Abubakar, for your wonderful feedback; we're glad Cynthia could assist you and make the process easy!"
        }
      },
      {
        "author": "K T",
        "rating": 5,
        "review": "Terry B is outstanding and easy to work with. Working with him has been a joy. He's knowledgeable, friendly, and does great work. Thank you, Terry!",
        "owner_response": {
          "text": "Thank you for your kind words, K B! It was a pleasure working with you."
        }
      },
      {
        "author": "Jack Clark",
        "rating": 5,
        "review": "As owner of an Everett duplex I found that my experience with Real Property Management was excellent. I liked that the company provided options for lease only, or all the way up to full management services. The screening for financially responsible prospective tenants was really valuable. The video walk-through of the unit by the company  before leasing meant that I got to have only the most serious potential tenants apply, and kept traffic through the unit to the minimum. I was very pleased with the services of this property manager.",
        "owner_response": {
          "text": "Jack, Thank you for your business. It has been a pleasure to work with you and your tenants."
        }
      },
      {
        "author": "Sean Taylor",
        "rating": 5,
        "review": "Great experience so far with Real Property Management! Very responsive to any and all questions during the leasing process. They are willing to help out whenever. Found me a beautiful home and I am very happy!",
        "owner_response": {
          "text": "Thank you for the kind words, Sean! We're glad you had a great experience with us and that we could help you find a beautiful home. We appreciate your feedback!"
        }
      },
      {
        "author": "Cleofe Sambillon",
        "rating": 5,
        "review": "I can rate Ms Audrey a perfect score she can give the right information to me ..thank you",
        "owner_response": null
      },
      {
        "author": "Christine Hoover",
        "rating": 5,
        "review": "I am in a business networking group with Greg. He is a great guy and Real Property Management North Puget Sound is a wonderful property management company. Keep your home you thought about selling and rent it out and have Real Property Management handle everything for you!",
        "owner_response": {
          "text": "Thanks for your kind words, Christine! We appreciate your support and trust in us to handle your property management needs."
        }
      },
      {
        "author": "Sandy Bowen",
        "rating": 5,
        "review": "I have hired rpm this fall to manage my little house in Lake Stevens.\nSo far it has been a very wonderful experience working with Harison. He is so pleasant and easy to work with. He is their maintenance supervisor and maintenance issues can be unpleasant to deal with as a renter but Harison makes it as easy as it could possibly be.\nI have also worked with Chloe and Ruth and they have been wonderful to me.\nThank you RPM!!",
        "owner_response": {
          "text": "Thank You Sandy. You have been a great Client to work with as well."
        }
      },
      {
        "author": "Hilda Rodriguez",
        "rating": 5,
        "review": "I think the attention to detail that Daniel Juarez gave me was exceptional! Thank you.",
        "owner_response": {
          "text": "Thank you, Hilda! We're glad to hear that Daniel's attention to detail made such a positive impact on your experience."
        }
      },
      {
        "author": "Carl Mitchell",
        "rating": 5,
        "review": "Terry has been awesome to work with.  He has gone above and beyond to assist with our furnace replacement and hot water tank issues at our rental property.",
        "owner_response": {
          "text": "Carl,\nThank you for your 5-star review! We're thrilled to hear that Terry has been awesome to work with and has gone above and beyond to assist with your furnace replacement and hot water tank issues. We appreciate your feedback and the opportunity to serve you. If you have any more concerns or questions, feel free to reach out.\nReal Property Management North Puget Sound \n"
        }
      },
      {
        "author": "Mark Kirshner",
        "rating": 5,
        "review": "Ive worked with Greg and team for years. They do a great job managing my rentals. Their Diamond level guarantee is amazing. Great job!",
        "owner_response": {
          "text": "Mark,\nThank you for your ongoing trust and the wonderful 5-star review! At Real Property Management North Puget Sound, we greatly appreciate your long-term partnership. We're thrilled to hear that you find our team, led by Greg, to be doing a great job managing your rentals. The Diamond Level Guarantee is designed to ensure excellence, and we're delighted it has contributed to your positive experience. If there's ever anything more we can do for you, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound\n"
        }
      },
      {
        "author": "Temi Tope",
        "rating": 5,
        "review": "When you almost thought nothing good could come out of a mere view after so many disappointments. With continual feeling of disappointment which creeps in often and almost want you to give up and not make an attempt at something. Real Property Management (RPM) sure comes with ease at a time my family and me needed this relief. Renting a house has never been this easy with us trying for about 3 years (by our experience). Happened to be on Zillow and having fallen victim of scam 2x through Zillow- I saw our new place listed on Zillow, first thing that struck my mind was to scroll down the listing page, check out who made the listing as I wasnt going to move forward if it was listed by an individual but surprisingly it wasnt. I copied the name of the company to browser which sourced them out, I clicked on their website only to find the listing and many more houses listed for rent. That right there gave me a little hope as a start. I scheduled viewing for the next day and I must say RPM team over at Marysville WA, are all phenomenal. Things went too fast and in two weeks we are officially in our new rented place. All thanks to Rep Cynthia & Rose for helping to make the entire process worthwhile and smooth for us. Gods speed of blessings ladies. PS: I have referred two of our family friends for your service.",
        "owner_response": {
          "text": "Thank you so much for sharing your experience, Temi Tope! We're grateful to have been able to provide you and your family with the relief you needed. It means a lot to us that you found our listing on Zillow and took a chance with us. We're thrilled to hear that the RPM team in Marysville, WA, especially Cynthia and Rose in our leasing department, made the process smooth and worthwhile for you. Your referrals mean the world to us. Wishing you and your family all the best in your new home!"
        }
      },
      {
        "author": "Lisa Barthel",
        "rating": 5,
        "review": "I just wanted to share what a great choice my family made having RPM manage our Dads property.  it was such a difficult time in our lives.  To make the decision to place him in a nursing home.  RPM did an amazing job helping us with this transition.  I would highly recommend them to manage your properties.  Shout out to Kelly!! No matter how busy.   She always took the time to answer any, and all my questions.  RPM you are very lucky to have such an always pleasant, eager to help, dedicated employee...",
        "owner_response": {
          "text": "Thanks Lisa!"
        }
      },
      {
        "author": "Suhas Manangi",
        "rating": 1,
        "review": "Horrible company and horrible service. I signed up in Sept 2022, paid them 30% of rent in onboarding fees but they did not onboard tenants till late Oct, and didn't collect rent from one tenant for so long that led to eviction. Did the same with another tenant. Lost over 1 year of rents. They charged higher than market prices for placing tenants but below par services. Highly unresponsive management company. I terminated after one year for not meeting quality of service for which they sent a large retailiatory bogus bills. Unprofessional and stay away from them.",
        "owner_response": {
          "text": "Suhas, we work very hard for our clients and did our very best in the situation you asked us to help you with.  This a description of what happened.           \nLast year, when you first reached out to us about managing your 4-plex with existing tenants. We started management of units AB&D on 9/19/2022 and Unit C on 9/6/2022.  Unit A had 2 tenant's you had placed previously, that already were not paying you rent, we agreed to help you either get them to pay rent or get them to move on which we did. We got the tenants to vacate in Unit A on 11/30/22. They had trashed your rental so we facilitated a full renovation on Unit A to get it ready for the market by 12/27/2022 and got you new tenants for Unit A by 2/2/2023, this all during the slowest time of year for the rental market. Unit B was also a tenant you had placed before we started managing. She paid October 2022 rent, because of financial/emotional issues, she was not able to pay rent after that so we connected her with Volunteers of America and walked her through the process of applying for rental assistance. VoA assisted in helping her catch up with $5952.50 in rental assistance while she was paying what she could afford each month. However, she eventually stopped paying all-together and didn't apply for more assistance. She was evicted through legal process on 9/14/2023.  Unit 3 and 4 were also tenants you had found that we managed. They have been ideal tenants. Unit 3 & 4 have paid rent through the duration of our contract together. We worked diligently on the situation we were given and it's unfortunate that WA State Landlord Tenant Law mandates take longer than we all would have liked. Regarding the termination fees without proper notice as agreed to in the Management Contract. We discussed this with you and you wanted to terminate without proper notice regardless. "
        }
      },
      {
        "author": "Michaela Ircink",
        "rating": 5,
        "review": "My first experience with Real Property Management, has been amazing! Crystal was so friendly. She answered all my questions, even the stupid ones, and explained everything so thoroughly. Doing nearly everything electronically, made the process so quick! Thanks to Daniel for being so thorough during our first inspection, makes me feel confidant to know that Real Property Management takes such good care of their units!",
        "owner_response": null
      },
      {
        "author": "Alfred Salvacion",
        "rating": 5,
        "review": "Amazing service! Great humble guy! Did all the repairs in a timely manner, hes definitely blessed and highly favored!\n\nThank you for your time!\n\nGreat company",
        "owner_response": {
          "text": "Thank you Alfred (Noel) for the kind words. We are happy to take care of your service requests anytime! "
        }
      },
      {
        "author": "Edward Lanfear",
        "rating": 5,
        "review": "Terry Bertucci was professional and courteous and provided us with great service",
        "owner_response": {
          "text": "Thank you, Edward, for your kind words about Terry's professionalism and service; we appreciate your feedback!"
        }
      },
      {
        "author": "JC h",
        "rating": 1,
        "review": "I would give no stars if I could. Hardly ever return phone calls. messages renters questions about the site because they never show up. When you do have maintenance request you have to wait several days just to get him to show up. if he cant fix the issue they charge you to pay a professional to do it. Than after their professional person comes you need to pay someone yourself to do it because they did not fix the issue. good luck trying to get your money back after you paid for a half done job. Avoid this company at all costs.",
        "owner_response": {
          "text": "Hey jeremy h, \nYour review is welcomed and we are sorry you did not have a good experience with us. We always follow Washington State Landlord/Tenant laws. You can always contact us so we can clear up any misunderstanding.\nBest regards Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Kristine C.",
        "rating": 5,
        "review": "We have worked with Real Property Management for a few years as a contractor for tree maintenance. They are true professionals, keeping their properties looking great, paying invoices quickly, and displaying excellent communication. As a homeowner, Id feel confident that they would take care of my property, and Im sure theyre great with tenants as well, because they always provide us with special tenant requests/instructions prior to scheduling work.  Kevin Moore and Ashlie Gamero have been especially nice to work with. Great Team!",
        "owner_response": {
          "text": "Thank You Kristine"
        }
      },
      {
        "author": "Victoria Isabella",
        "rating": 5,
        "review": "Rose and Cynthia were incredibly helpful and knowledgeable! As a newer renter, I had a lit of questions about the lease/unit and they were extremely organized and kind. I loved getting to finish the  paperwork in person because it allowed us to have peace of mind at the key hand over. Exceptional service and thoughtful people!",
        "owner_response": {
          "text": "Victoria, thank you for your kind words, Real Property Management North Puget Sound try's hard to make our customer and client's experience the best they can be. Rose, Cynthia and the rest of our team really try hard.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Charlene Emard",
        "rating": 5,
        "review": "Real Property Management made the repairs needed to get the house ready to rent hands off for us. We just gave them the keys and sat back and let them take care of it. They also found us a well qualified tenant in a short amount of time. If you want to rent your property out without the headache of managing everything yourself, then I'd recommend Real Property Management.",
        "owner_response": {
          "text": "Charlene, thank you so much for your review. we try hard to make everyone's experience as easy and simple as possible.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Jeff Haugland",
        "rating": 5,
        "review": "So far they have been fantastic to work with. Possibly a little on the pricey side compared to other companies, however their service and professionalism is well worth the cost. Would definitely recommend.",
        "owner_response": {
          "text": "Thank you, Jeff! We appreciate your kind words and recommendation."
        }
      },
      {
        "author": "Marcus Brown",
        "rating": 5,
        "review": "The Maintenance Coordinator Terry Bertucciis is always helpful, communicates well, and gets the job done.",
        "owner_response": {
          "text": "Thank you for your kind words about our Maintenance Coordinator Terry Bertucci, we appreciate your positive feedback!"
        }
      },
      {
        "author": "Joseph Young",
        "rating": 5,
        "review": "Terry was extremely helpful, polite, and responsive! Thanks again!",
        "owner_response": {
          "text": "Thank you, Joseph! We're glad to hear that Terry made your experience positive with his helpfulness and responsiveness. We appreciate your feedback!"
        }
      },
      {
        "author": "Suede",
        "rating": 5,
        "review": "I have been doing business with Real Property Management North Puget Sound for over 7 years.  In my experience they are professional, conscientious, and all-around good people.  COVID regulations presented a unique challenge.  They worked with both tenants and landlords to ensure compliance.  I highly recommend this family-owned, local business.",
        "owner_response": {
          "text": "Thank you for your kind words"
        }
      },
      {
        "author": "Lee Hudson",
        "rating": 5,
        "review": "When I decided to enter the real estate investment game about three years ago, my spouse said OK, but only if I promised to hire a property management company.  When I bought our first rehab project, I called 6+ local managers, interviewed and received quotes from 3 and confidently picked RPM-NPS to partner with.  Not only was their pricing good, but they offered services and expertise from both their own collective experience and the knowledge (industry, financial, legal) provided from RPM's company headquarters.  They are a family-owned office that operates with integrity and good customer service - for owners and tenants.  I have always been able to call with questions and get advice over the phone, email or even on site at the property.  We have always worked through any issue together.  For example, the staff in Everett helped me to make decisions about how to best remodel my first property to maximize the rent I could receive and to lower the amount of future repairs and maintenance requirements.  This is knowledge I've applied to other remodels and purchases.  Now that I'm up to a handful of properties, RPM has helped me as a partner the whole way.  They are a critical part of the team I count on in RE investing along with my bankers, RE mentor, legal and insurance.  Knowing RPM is in my corner has been key in having the confidence to keep looking for more investments.  Obviously, I highly recommend Real Property Management - North Puget Sound!",
        "owner_response": {
          "text": "Thank you Lee,\nWe appreciate you and all our clients and customers.\n\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Saffira C",
        "rating": 5,
        "review": "Hey Mark! Sorry for the delay with the review, you are always on point with your emails and having a good sense of humor goes a long way. Your company RPM is lucky to have you! We always welcome your business with Old Republic!",
        "owner_response": {
          "text": "Thank you so much, Saffira! Your kind words mean a lot to us and I appreciate you taking the time to leave a review. It's always a pleasure doing business with you and Old Republic."
        }
      },
      {
        "author": "Kathleen Walsh",
        "rating": 5,
        "review": "By far the best property management company we have worked with for many years. They are knowledgeable, professional and approach property management with the landlord as a member of the overall team. They are responsive to us as landlords and our tenants and they provide regular and thorough inspections of our properties giving both us and our tenants peace of mind. Every member of of their team has been a pleasure to work with. We high recommend their services.",
        "owner_response": {
          "text": "Thank you James! We have enjoyed working with you, managing your real estate investment portfolio and look forward to the continued success the future will bring."
        }
      },
      {
        "author": "Paola S",
        "rating": 5,
        "review": "It was my first time renting a home and I wasnt sure what to expect. Gail and the rest of the RPM team went above and beyond to help me through the rental process, answered all my questions and sprinted into action when my home required maintenance. It was a wonderful rental experience! Thank you, Gail and team for caring and for being awesome!!",
        "owner_response": {
          "text": "Paola,\nThank you so much for your kind words. Gail and the rest of the team appreciate your time to reach out. Contact us anytime."
        }
      },
      {
        "author": "Megan Gates",
        "rating": 5,
        "review": "I can't say enough good things about Real Property Management. Everyone there is efficient, friendly and genuinely care about their clients needs. I have worked with them for almost a year now and I would absolutely recommend them to anyone looking for a rental or looking to have a rental managed.",
        "owner_response": {
          "text": "Megan, thank you. We appreciate your review and being from the industry, you know what \"good things\" really looks like."
        }
      },
      {
        "author": "Tim Dereg",
        "rating": 5,
        "review": "I have been a client of Real Property Management North Puget Sound for several years, and I can honestly say without hesitation that the people at RPM have always treated me more than fairly.  I cannot think of a single instance where they have ever dealt with me in any unfair manner.  I have never worked with any group more trustworthy and honest than the people at RPM.\n\n--Tim Dereg",
        "owner_response": {
          "text": "We know there is a lot to leasing your property. We are glad to help you through the property managing process."
        }
      },
      {
        "author": "Alex V",
        "rating": 5,
        "review": "Working with them as one of their contractors is an ace! Their staff is very professional and knowledgeable. Getting a work order is very organized as they have their portal, which is easy to monitor and manage.",
        "owner_response": {
          "text": "Thank you, Alex! We appreciate your kind words and are glad to hear that you have had a positive experience working with our team. Your feedback means a lot to us!"
        }
      },
      {
        "author": "CD Music",
        "rating": 5,
        "review": "Real Property Management North Pudget Sound sets the bar high with their professionalism, client care, and positive attitude. Highly recommend using them whenever possible. We knew we were in good hands when we arrived to the home and Aaron was already waiting there, outside of his car with a suit on and a smile on his face. We worked with Aaron throughout the entire process, and he always treated us well. We encountered other property managers that could learn a lot from RPMNPS! Please keep everyone happy and go with these guys! They are the real deal.",
        "owner_response": {
          "text": "Thank you Clint!"
        }
      },
      {
        "author": "Daniel",
        "rating": 5,
        "review": "RPM has been managing my rental property for the past few years now and they've been doing great, no issues and no complaints from me. Total professionalism from the very beginning, they picked the perfect renters, and the best part is I haven't had to do much more than re-sign another contract with them. Thanks!",
        "owner_response": {
          "text": "Thank you Daniel! We have enjoyed working hard to make rental property ownership stress free for you and look forward to working with you for many years to come."
        }
      },
      {
        "author": "Christina Mitchell",
        "rating": 5,
        "review": "Working with Real Property Management for the last year has made finding tenants and maintaining my property a breeze. I wanted as much of a hands-off situation for myself as possible, and John and the rest of the team have really delivered! Thank you RPM!",
        "owner_response": {
          "text": "Christina,\nThank you so much for your kind words. We do all we can to manage your property in the best way possible for you and your resident both."
        }
      },
      {
        "author": "dee romano",
        "rating": 5,
        "review": "Daniel and his Team are excellent to work with.  I brought RPM on board when I was having major issues dealing with a rental property and the renter from hell.  It was not his job at that point to be helpful, but he went out of his way to be there for me in a most difficult time.  This young man is wonderful and responsive.  I would recommend him and RPM to anyone looking for an efficient and compassionate partner for their rental properties.  Thank you Daniel",
        "owner_response": null
      },
      {
        "author": "Joni H",
        "rating": 5,
        "review": "This is a family run business that we used when we needed to rent our house and move to another state.  Anytime we had questions or were concerned about something, there was always an expert on the staff to ease our minds.  They always treated us professionally and with respect and acted in our best interests.  We would recommend to anyone in the Puget Sound trying to hire a Property Management company.  Thanks for helping us manage our house Frank and team!",
        "owner_response": null
      },
      {
        "author": "Rochelle Fahlman",
        "rating": 5,
        "review": "This is a great family owned property management co. I am a real estate broker and refer clients that want to rent out their home. Frank, Danny and team always take excellent care of them. I highly recommend this company.",
        "owner_response": {
          "text": "Thank you Rochelle! We have really enjoyed working with your clients and getting them quality tenants. Thank you so much for your business! We look forward to working with you, Todd, Megan, Nanci and the rest of your awesome team in the years to come!"
        }
      },
      {
        "author": "Krysten Drum",
        "rating": 5,
        "review": "Amy is awesome! My husband and I were in search of homes during the Christmas holiday, so we were finding it tough to get much response from other property management companies. After much searching, my husband and I finally found a beautiful property for rent through RPM's website. From the time we viewed the property, to submitting our applications and signing the lease, Amy has been nothing but responsive, professional and friendly. The entire move-in process was very seamless and Amy patiently answered all of our questions. It's tough to find a good property management company who is responsive. Thank you, Amy and RPM!",
        "owner_response": null
      },
      {
        "author": "Melanie Wegner",
        "rating": 5,
        "review": "This is a family run business with the efficiency of a large corporation!  Frank and team were personable and accessible with fabulous follow up.  They quickly found the perfect renter for our house and took care of everything while keeping me informed and updated.  They made the process so smooth and easy for me it was well worth it. I don't hesitate to recommend them.",
        "owner_response": null
      },
      {
        "author": "Matthew",
        "rating": 5,
        "review": "Real Property Management is a first class business run by honest and competent people who care about their customers and their interests.  They have managed my apartment complex for the last two years now and I could not be happier with the job they have done.  They are one of the few businesses that really do go the extra mile to take care of people.  RPM exemplifies what it means to be a professional.  I look forward to doing business with Frank, Daniel, and the rest of the RPM team for years to come.",
        "owner_response": null
      },
      {
        "author": "McTaco",
        "rating": 5,
        "review": "Terry is always attentive whether I have a last minute  question or need good direction. RPM really does take care of the people that take care of people.",
        "owner_response": {
          "text": "Dear McTaco,\n\nThank you for the outstanding 5-star review! We're pleased to hear about your positive experience with Terry at Real Property Management North Puget Sound. Providing attentive service and reliable guidance is our priority. If you have any more questions or need assistance in the future, feel free to reach out. We appreciate your feedback and look forward to continuing to take care of you.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Kathy Christiansen",
        "rating": 5,
        "review": "We have been very happy with the prompt responses to questions, concerns and service from us as owners and from our renters. I strongly recommend considering using Real Property Management Northwest.",
        "owner_response": {
          "text": "Thank you for your kind words! We truly appreciate your recommendation and are grateful for your satisfaction with our prompt responses and service here at Real Property Management North Puget Sound."
        }
      },
      {
        "author": "Evergreen Lock & Key",
        "rating": 5,
        "review": "The folks at Real Property Management are very professional, reliable, and honest. I've had the pleasure of working with them as a contractor for the past couple of years and they definitely know how to treat their clients and vendors. I would highly recommend them!",
        "owner_response": {
          "text": "Evergreen Lock, Thank You for your kind words. We appreciate working with fair and reliable business partners like you.\nFrank Volkert\nPresident\nRPMNPS"
        }
      },
      {
        "author": "michael woodward",
        "rating": 5,
        "review": "The staff here goes well above and beyond.Rose was great. I would recommend them to anyone looking for rental property. Could not have asked for a better group during this time.Thank you so much for everything.",
        "owner_response": {
          "text": "Dear Michael,\nThanks for the 5-star review! We're glad Rose and our team could make your experience great. If you ever need help or want to recommend us, feel free to reach out.\nBest,\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Carolann Wheelis",
        "rating": 1,
        "review": "Absolutely do not rent from this company. At first they are communicative and responsive, but once you read the lease ALL red flags and gut feelings shouldnt be ignored. Once you move in its nearly impossible to get ahold of someone and when you do no one knows what is going on and passes you along to many different people.\nThe maintenance isnt preformed by the company but the landlords maintenance guy, who is awesome, but creates issues in getting things done in a timely manner.\nThey WILL nickel and dime you for everything, as well as not review your move in statement when creating move out charges.\n\nGail is unprofessional and rude and constantly hands issues over to other people, she once even stated Im not a property manager\n\nas someone whos been a property manager and been in the industry long term the operation is baffling and proves how money hungry these people are. There are many $200 nonsensical admin charges + many more issues.",
        "owner_response": {
          "text": "RPM follows all Washington State Tenant/Landlord laws. In all leases that we draft, a tenant agrees to return the property in the same condition it was given to them, minus normal wear and tear. We document in writing and with pictures the condition of the property before a tenant moves in and after a tenant moves out. We are sorry that we could not come to a happy resolution for you."
        }
      },
      {
        "author": "Jennifer B.",
        "rating": 4,
        "review": "When looking for a rental home in Snohomish County, I was very careful to evaluate rental management companies. I have heard horror stories and experienced one with my last rental property manager. So, when I found a house managed by RPM, I examined Real Property Management Puget Sound closely and found them to be professional, courteous, and timely in their responses. I decided that they were a property management company that I could work with.\n\nAmy Hammer was our leasing agent and she was incredibly friendly and helpful. She walked us through the lease and the requirements before we signed.\n\nOn a scale of 1-5, I would give RPM a 4 (5 being stellar and no way to improve, 1 being \"don't ever work with them\"). The leasing process was smooth and Amy was available to answer any questions/concerns via email. She was very timely in her responses and addressed our concerns and questions well. We have had to put in a few maintenance requests and RPM was always prompt with addressing the requests. The problems we had were with the third party vendors who would often not return RPM's calls. But, that does not reflect on RPM.\n\nReal Property Management exceeded my expectations as far as tenant privacy and autonomy. While there are quarterly walk-throughs, RPM is not overly demanding or intrusive as other property management companies can be.\n\nOne area to improve would be to communicate after a maintenance request has been completed. Two of our maintenance requests are still pending as (I assume, I haven't received communication about them) they are in the process of ordering replacement parts for a light fixture and a refrigerator. Followup emails as to what the plan is would be incredibly helpful.\n\nOverall, I would not hesitate recommending RPM to someone looking to rent a home.",
        "owner_response": null
      },
      {
        "author": "Em and Mom",
        "rating": 5,
        "review": "From the initial application process to periodic questions and service requests, RPM has been a delight to work with. They are professional, friendly, and always punctual in getting back to us with regard to any requests that we might have.  I trust them as a renter and I would trust them with my property. I highly recommend them!",
        "owner_response": null
      },
      {
        "author": "Darcy Gedrose",
        "rating": 1,
        "review": "If you rent from this company be prepared to pay imagionary dump fees for items that aren't yours.  Oh when they sent photos of the items disposed of they were from the boarded up house next door where homeless sleep.  Not my stuff at all.  Not even at the same property where I lived and not in the apartment I moved out of.  Just random furniture on some property next door.  Gail decided to charge me for neighborhood clean up.  I guess she can do that on a whim. I was told to reach out for resolution.  There has been none.  I guess they manage the boarded up house?",
        "owner_response": {
          "text": "We are sorry if we were wrong in this matter. Please reach out to us and we'll be happy to review the situation."
        }
      },
      {
        "author": "Obsi",
        "rating": 5,
        "review": "Easy to work with and such a beautiful house! Thank you Cynthia ",
        "owner_response": {
          "text": "Thank you so much, Obsi! We're delighted you enjoyed your experience and appreciate your kind words about the house and Cynthia's assistance."
        }
      },
      {
        "author": "Jason J",
        "rating": 5,
        "review": "Rose at RPM Puget Sound is amazing. She is thorough and constantly kept us up to date. She is kind, patient and very friendly. I high recommend Rose as she is a confident and compassionate professional!",
        "owner_response": {
          "text": "Thanks so much for the review, Jason J!\nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "CJ Stevenson",
        "rating": 5,
        "review": "There is so much relief in hiring a property manager! RPM is great and Greg is the best! Highly recommend!",
        "owner_response": {
          "text": "Thank you, CJ! We're grateful for your kind words and recommendation. Greg truly is the best!"
        }
      },
      {
        "author": "Dave Leach",
        "rating": 5,
        "review": "RPM does a very good job of managing my rental property.  They keep the process simple and worry free.",
        "owner_response": {
          "text": "Thank you, Dave! We appreciate your kind words and are glad to hear that our property management services have made your experience worry-free."
        }
      },
      {
        "author": "Debbie Groothuis",
        "rating": 5,
        "review": "My company works on the maintenance side wtih Real Property Management North Puget Sound. I have had to call Kevin Moore several times to ask questions or to report problems found on rental properties we are cleaning. He is always quick, professional and courteous to help us resolve things. Upon one occassion he came out to a property during an extremely busy time to lend another set of eyes to a property a tenant had concerns with. That in my opinion is the dedication this company provides to their tenants and vendors on a regular basis. I would recommend using Real Property Management for your rental needs.",
        "owner_response": {
          "text": "Thank you Debbie for your kind compliments"
        }
      },
      {
        "author": "Thomas Ramsell",
        "rating": 5,
        "review": "Had a great experience with Frank, Greg, and the team at Real Property management!  Looking forward to a long relationship.",
        "owner_response": {
          "text": "Thank you, Thomas! We're grateful to have you as a valued client and look forward to a successful future together as well!"
        }
      },
      {
        "author": "Gloria Gammon",
        "rating": 5,
        "review": "The report was so detailed that I could convert it into xls . Benchmark for us to track down progress of the things to be done and done. Thanks so much Jett",
        "owner_response": {
          "text": "Hi Gloria,\n\nThank you for the 5-star review! We're delighted to hear that Jett's detailed report has been so helpful for tracking your property's progress. Your feedback means a lot to us and we appreciate your kind words. We'll be sure to pass along your thanks to Jett.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Sydney Mae",
        "rating": 5,
        "review": "Easiest and simplest process. Rose and Cynthia were very responsive and on it to get us in a short time crunch. Can feel very good about being a tenant with this company.",
        "owner_response": {
          "text": "Thanks so much for the review, Sydney Mae! As we shared we're happy to have you as one of our new tenants.\nRPM strives to give great service and and your feedback was much appreciated.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Marshall Wake",
        "rating": 5,
        "review": "I'm a renter and Frank, Daniel and everyone at RPM have been amazing to work with. They don't just put a priority on the homeowner but also us. They are family run and I appreciate how that translates to their business.",
        "owner_response": null
      },
      {
        "author": "Stephen",
        "rating": 5,
        "review": "RPM staff have been very helpful with all of the needs for the property. There have been a few things that have poped-up and the staff worked with the owner and got everything addressed in a timely matter.\n\nThe office staff is very helpful and friendly every time I contact them.",
        "owner_response": {
          "text": "stephen,\n\nThank you for your kind words. We work very hard to help our customers for whatever they may need."
        }
      },
      {
        "author": "Tabreez Govani",
        "rating": 4,
        "review": "Jose was professional in his delivery of the services that Real Property Management was offering. He was through and not rushing while dealing with potential client; ready to listen to the questions and concerns. The is my first time dealing with Real Property Mgmt.",
        "owner_response": null
      },
      {
        "author": "Square One Home Services",
        "rating": 5,
        "review": "Real Property Management is the most professional, understanding, and responsive property management company I have delt with in all my years in the market. They really know how business is supposed to be done. I would recommend them to everyone.",
        "owner_response": {
          "text": "Square One\nThank you for your kind words. We try very hard to keep our standards at the highest in the industry."
        }
      },
      {
        "author": "James Robison",
        "rating": 1,
        "review": "Be sure to read your lease this company is the worst property management company I have ever dealt with with moving in to moving out the required professional cleaning of a unit. They do nothing on their end, take care of nothing I don't see why a home owner would have them manage their property.\n\nAt the end of your lease be sure to call around and find someone to clean the place carpets and all its only right to leave a place like it was if not better then it was when you moved in. but making me pay out to have a professional come in and clean in is insane.\n\nBut take anyways from this review moving in was a nightmare.\n\nGetting ahold of these people is next to impossible.\n\nAnd moving out in made to be a pain because they don't manage anything getting done. so be ready to lose about 500 of your deposit in cleaning fees because this company requires you to hire a professional.\n\n0/10 would not recommend.",
        "owner_response": {
          "text": "Thank you for the feedback.  We are sorry our interaction was not a positive one.  In this case, we were not the active property manager over the past year as this was a Lease-only Agreement with the property owner.  Our role was limited to helping with preparing the property for move-in and tenant placement only. This move-in preparation includes professional cleaning, which was done with receipt kept on file, prior to you moving in. When we met with you to sign the lease we reviewed all these terms with you in detail and all parties agreed to them and signed. Which includes the tenants having the property professionally cleaned upon vacating and to provide receipt. Again we are sorry for your experience and would be happy to discuss further."
        }
      },
      {
        "author": "Kylie Acacio",
        "rating": 5,
        "review": "Crystal responds to any maintaince needs VERY quickly and professionally. She is always willing to help with any issues and has a true concern for her tenants. I would recommend her to everyone!",
        "owner_response": {
          "text": "Thank you so much Kylie!"
        }
      },
      {
        "author": "Ian H.",
        "rating": 5,
        "review": "I've been using the service of Real Property Management North Puget Sound for over 4 years.   They are professional and always respond quickly to questions and inquiries",
        "owner_response": {
          "text": "Thanks so much for the review, Ian H.! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Suu Phyo",
        "rating": 5,
        "review": "Building is nice...location is very assisciable and price is fair.",
        "owner_response": {
          "text": "Thank you for your positive feedback on our building! We're glad to hear you find the location convenient and the pricing fair."
        }
      },
      {
        "author": "Jay Bennett",
        "rating": 1,
        "review": "This has been by far the worst experience my wife and I have ever had. I could call the office from the time they open till close and can never get anyone on the phone or return a call but I can get a email response in a urgent issue. Move out process was horrific and costly. Then they say the will repair normal wear and tear like small Tac size holes in the wall but then charge for them. And the list of people they give for cleaning and carpet cleaning is a joke. They have one company for each. They find every way to take and take money from you.",
        "owner_response": {
          "text": "Jay, we are sorry you feel that way. Signing a Lease is a legal agreement. Breaking a lease is always expensive to the Owner and the Tenant. Real Property Management tries our best to be fair to both parties as dictated by law. For our cleaners, we use the best priced vendors that do the best job in order to be fair for everyone. If they are inadequate or overcharge we want to be aware of it, we won't put up with our Clients or Tenants to be taken advantage of."
        }
      },
      {
        "author": "Brandon Wilson",
        "rating": 5,
        "review": "Had a great experience with rose and Harrison!",
        "owner_response": {
          "text": "Thank you, Brandon! We're so glad to hear you had a great experience with Rose and Harrison. Your feedback means a lot to us!"
        }
      },
      {
        "author": "E. Clayton",
        "rating": 5,
        "review": "Great communication and responses to maintenance requests!!\nThank you, Terry Bertucci.",
        "owner_response": {
          "text": "Thank you for the 5-star review! We're so glad to hear that you've found our communication and responsiveness to maintenance requests exceptional at Real Property Management North Puget Sound. It's our goal to ensure your experience with us is top-notch. If there's anything more we can do to assist you, please reach out."
        }
      },
      {
        "author": "Mehedi Hussain Panna",
        "rating": 1,
        "review": "Emily scheduled an appointment to show a property. I was there and tried to get a hold of her. Calling number was turned off and was going to her voicemail. After 2 days i was checking again with her on email and figured out its already rented. What a waste of time! Terrible service.",
        "owner_response": null
      },
      {
        "author": "Gerardo Corts",
        "rating": 5,
        "review": "Great full",
        "owner_response": {
          "text": "Thank you so much, Gerardo! We appreciate your kind words."
        }
      },
      {
        "author": "Mark Pollard",
        "rating": 1,
        "review": "I would never rent a place managed by them again! I can't even explain how wrong they have done my family an I.",
        "owner_response": {
          "text": "We are sorry you feel that way. The Owner is doing a complete remodel on the property. We hope for you the best."
        }
      },
      {
        "author": "Kimberly Bray",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Kimberly, for the fantastic 5-star rating! We truly appreciate your support."
        }
      },
      {
        "author": "luis torres",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Luis, for the amazing 5-star rating; your support means a lot to us!"
        }
      },
      {
        "author": "Justine McMenamy",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Justine, for your 5-star rating; we truly appreciate your support!"
        }
      },
      {
        "author": "Laura Andrea Sosa Gonzalez",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you so much, Laura, for your amazing 5-star rating; we truly appreciate your support!"
        }
      },
      {
        "author": "Odessa Donohoe",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Odessa, for your fantastic 5-star rating; we appreciate your support!"
        }
      },
      {
        "author": "D C",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, D, for your wonderful 5-star rating; we truly appreciate your support!"
        }
      },
      {
        "author": "Puchita Mtz",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Puchita, Thank you for using us for your housing needs."
        }
      },
      {
        "author": "Pavlo Yelenets",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Pavlo, for your fantastic 5-star rating; we appreciate your support!"
        }
      },
      {
        "author": "Anna Marie",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Anna, for your wonderful 5-star rating; we appreciate your support!"
        }
      },
      {
        "author": "Delia Fuerte",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Delia, we appreciate your 5-star rating!"
        }
      },
      {
        "author": "qiming dong",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the 5-star rating!"
        }
      },
      {
        "author": "Tiera Williams",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Tiera,\n\nThank you for the 5-star rating! We appreciate your support and are here for any of your property management needs.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Phillip Frost",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Phillip,\n\nThank you for the 5-star rating! We're thrilled to know you had a great experience with Real Property Management North Puget Sound. If there's anything more we can do for you, feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Brandon Hubach",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Brandon,\n\nThank you for the 5-star rating! We appreciate your support and are here if you need anything.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Brian McGrew",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Brian,\n\nThank you for the 5-star rating! Were delighted to know that you had a positive experience with Real Property Management North Puget Sound. If you ever need anything, feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Drew Thompson",
        "rating": 3,
        "review": "",
        "owner_response": {
          "text": "Hi Drew,\n\nThank you for sharing your feedback. We apologize for any inconvenience caused by contacting you during your working hours. Our aim is to ensure a smooth and efficient process for our tenants. We appreciate your understanding and patience as we work to improve our communication practices.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Paul Elsaeed",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Paul,\n\nThank you for the 5-star rating! We appreciate your support.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Amanda Dodd",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Amanda,\n\nThank you for the 5-star rating! We appreciate your support and are glad you're satisfied with our services.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Loden Johnson",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "We're so glad you had a 5-star experience with us!"
        }
      },
      {
        "author": "Jesse",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the 5-star rating, Jess!"
        }
      },
      {
        "author": "Brian Auckland",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Hi Brian,\n\nThank you for the 5-star rating! We're thrilled to know you had a positive experience with Real Property Management North Puget Sound. If you ever need anything or have any feedback, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Jeremi Ross",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Jeremi, for the 5-star rating! We're thrilled to know you had a positive experience with Real Property Management North Puget Sound.\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "jorge de ocampo",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Jorge, for the 5-star rating! We appreciate your support and are glad to know you had a positive experience with Real Property Management North Puget Sound.\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Azhar Iqbal",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Azhar, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you need any assistance or have questions in the future, please don't hesitate to contact us."
        }
      },
      {
        "author": "liliana lopez",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Liliana Lopez, for the 5-star rating! We appreciate your support and are happy to know you had a positive experience with Real Property Management North Puget Sound. If you ever need assistance or have any questions, please don't hesitate to reach out.\n\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Justin Gifford",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any feedback or questions in the future, feel free to reach out."
        }
      },
      {
        "author": "Angel Beltran",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you, Angel, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any questions or need assistance in the future, please feel free to reach out.\n\n\nThank you, Angel, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any questions or need assistance in the future, please feel free to reach out.\n\n\n\nThank you, Angel, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any questions or need assistance in the future, please feel free to reach out.\n\n\n\n"
        }
      },
      {
        "author": "Mary Key",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for your 5-star review!"
        }
      },
      {
        "author": "Whitney Beck",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "We have no record of a \"Whitney Beck\" on any of our records. Please contact us, if you are a customer of ours, we want to resolve any concerns."
        }
      },
      {
        "author": "Peaches George",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "\nThank you, George, for the stellar 5-star review! We're thrilled you had a positive experience with Real Property Management North Puget Sound. If you ever have any further feedback or if there's anything else we can assist you with, please don't hesitate to reach out. We appreciate your support!\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Jill Swick",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Welcome again as a new tenant with RPM.  Thank you for your 5-star review!  "
        }
      },
      {
        "author": "Henok",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Dear Henok,\n\nThank you for the fantastic 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any specific feedback or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "jon brown",
        "rating": 4,
        "review": "",
        "owner_response": {
          "text": "Thank you for your 4-star rating! We appreciate your support."
        }
      },
      {
        "author": "Nafis Rassa",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the 5-star rating, Nafis! We appreciate your support."
        }
      },
      {
        "author": "Al Hocy",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Dear Al,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you ever have specific comments or if there's anything more we can assist you with, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Braden Roseborough",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Dear Braden,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you have any specific comments or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ian stoa",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Dear Ian,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you have any specific comments or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Brody Bos",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Dear Brody,\n\nThank you for the fantastic 5-star rating! Your positive feedback means a lot to us at Real Property Management North Puget Sound. If you ever have specific comments or if there's anything more we can assist you with, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "marci reichert",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Dear Marci,\n\nThank you for the 5-star rating! Your positive feedback is appreciated. If you have any specific comments or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ayman Al-Kahlil",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you so much for the 5-star rating! We appreciate your feedback and are delighted to know you had a positive experience with Real Property Management North Puget Sound. If you ever have any questions or need assistance in the future, feel free to reach out. We're here for you!"
        }
      },
      {
        "author": "james bahe",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "We're thrilled to receive your 5-star rating! Thank you for choosing Real Property Management North Puget Sound. If you ever have any questions or if there's anything we can do for you, don't hesitate to reach out. Your satisfaction is our priority!"
        }
      },
      {
        "author": "Sarah Pettinger",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "We appreciate your 5-star rating! If you have any specific feedback or suggestions to enhance your experience further, please feel free to share. We look forward to serving you."
        }
      },
      {
        "author": "Avni Mehrotra",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Anvi, Thank you for your fantastic 5-star review! We appreciate your support. If you ever have any questions or need assistance in the future, feel free to reach out. We're here for you!"
        }
      },
      {
        "author": "Devin Luke",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you so much for the 5-star rating, Devin!"
        }
      },
      {
        "author": "Ket Nik",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you so much for the 5-star rating! We appreciate your support."
        }
      },
      {
        "author": "Sammy",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you so much for the 5-star rating, Sammy! We appreciate you supporting us!"
        }
      },
      {
        "author": "tasuku thompson",
        "rating": 4,
        "review": "",
        "owner_response": {
          "text": "Thank you for the 4 star review Tasuku! We really strive to provide 5 Star service and would appreciate if you would reach out to us and let us know what we can do better to make your experience a 5 star one next time. We look forward to hearing from you soon!"
        }
      },
      {
        "author": "Geno Oliva",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you Geno for the 5 Star review!"
        }
      },
      {
        "author": "Jacob Elenbaas",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for the 5-star rating, Jacob! We appreciate your support."
        }
      },
      {
        "author": "Miguel Rivas Perez",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Miguel, We are sorry you had a bad experience with us. We pride ourselves on communication. We'd be happy to work with you again in the future. If you would like to share your issue with us, it would be helpful so we can better improve our customer service. Thank you :)"
        }
      },
      {
        "author": "Sana Pervaiz",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "We're sorry you have had a bad experience. We strive to provide a high level of customer service with all our customers."
        }
      },
      {
        "author": "Jeff Chen",
        "rating": 4,
        "review": "",
        "owner_response": {
          "text": "Jeff, thank you for your review. Please let us know what we can do to improve our company up to a 5 star. "
        }
      },
      {
        "author": "Shauna Sullivan",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Shauna,\nThank you for the 5 star review. We are happy you chose Real Property Management. we'll do all we can to make your resident experience a good one."
        }
      },
      {
        "author": "Richard Duncan",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Richard,\nThank your for your kind review. Please reach out to us anytime."
        }
      },
      {
        "author": "Margaret Gall",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Margaret,\nThank you for your 5 star review. We would like to hear from you, if you have a minute, we like to know what we are doing right."
        }
      },
      {
        "author": "Ryan James",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Ryan,\nThank you for your review. We appreciate your support and confidence."
        }
      },
      {
        "author": "ryan barlass",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Ryan,\nThank you for your 5 star review, feel free to reach out anytime."
        }
      },
      {
        "author": "Chris Rey",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Chris,\nThank you for your review. We like to hear how we are doing so please contact us anytime."
        }
      },
      {
        "author": "Tiffany Mendonca",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Tiffany,\nThank you for your review. We appreciate you taking your time for it."
        }
      },
      {
        "author": "Susan Moy",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Susan,\nThank you for your 5 star review. we appreciate our Clients."
        }
      },
      {
        "author": "Eric Mattson",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Eric, Will you contact us? We are unaware of any issues. We would like to address anything that would cause you concern. especially since we have been managing the property for less than a month. Please contact us."
        }
      },
      {
        "author": "Darth Corn",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Daniel,\n\nThank you for your 5 star review. We really appreciate hearing from our Owners!"
        }
      },
      {
        "author": "ashly Swearingen",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "We are sorry you had a not so ideal experience."
        }
      },
      {
        "author": "Alex",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Alex, Thank you for your review."
        }
      },
      {
        "author": "Rich Hart",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you Rich for your support of Real Property Management !"
        }
      },
      {
        "author": "kristina Kristina",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Kristina, we at RPM are sorry that you had a bad experience as a tenant. We follow all Washington State Landlord/Tenant laws. If you feel we have breached the lease agreement, we will be happy to sit with you and go over the lease that was signed and to clarify anything."
        }
      },
      {
        "author": "Eugene Butler",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank Eugene\n\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Kyra Shantice James",
        "rating": 2,
        "review": "",
        "owner_response": {
          "text": "We wish we could have served you more to your satisfaction"
        }
      },
      {
        "author": "Ardis Allyn",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Ardis, we checked our records and we don't have you as a tenant or owner"
        }
      },
      {
        "author": "Shawn and Trisha Daby",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank You for the 5 star review"
        }
      },
      {
        "author": "James Pace",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "James, Thank you for your rating. We are glad to have you as one of our associates."
        }
      },
      {
        "author": "Elaina Hatch",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Mack Jokray",
        "rating": 2,
        "review": "",
        "owner_response": {
          "text": "We don't know this person. We have no record of this person. Mack, If there was a dis-service we would like to make it right."
        }
      },
      {
        "author": "Adam Bryant",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Britton Kinder",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "bruce willis",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Lindsey P.",
        "rating": 1,
        "review": "Future tenants should be aware that RPM puts their landlords above their tenants and are only interested in making money, not supporting the tenants. In a disagreement of the use of my security deposit, Gail was rude and unhelpful and because we couldn't agree, now I have to take an extra step and file a lawsuit just to get my deposit back. Gail repeatedly said the house was 'dirty' to be rude rather than using any level of professionalism or customer service. She also offered no avenue to dispute the charge other than continuously saying 'this is how it must be' instead of understanding it's a mutual disagreement and we could use a mediator to resolve it. Why not clarify that it's well within a tenant rights to dispute the charges? I'm unsure if Gail is incapable or just unwilling to read the laws laid out to protect Washington state tenants.\n\nI understand needing to leave the house in a certain condition based on our lease agreement but was being rude necessary? We are poor and we did our best, we couldn't afford the cleaners they wanted. We work full time and go to school full time, I couldn't spend more than a month deep cleaning the house to meet RPM needs. I recognize they want the house in a certain way and we didn't meet that standard but at this point and based on Gail's attitude, I just feel totally scammed no matter what they say is wrong with the house because anything I say will just be met with 'this is how it must be done'. In my opinion, forcing your tenants to perfect the home to your standard out of pocket is just taking advantage of renters who often don't have a choice about the fact they are renting. It's unfortunate that RPM doesn't do any work themselves and expects the previous tenant to perfect the house out of pocket for the next tenant, continuing to limit any work needed on RPM side and keeping them from having to bother investing in their properties and tenants.\n\nI also find it extremely important to mention that we returned the house in the exact position it came in when we got it minus regular wear and tear from living in a 100+ year old house for 2 years. It was equally as 'dirty' when we moved in, I spent 2 years deep scrubbing the dirty off of everything in the home (pictures below).\n\nSome advice for RPM, maybe try caring about your tenants and properties by cleaning them yourself rather than being lazy and judgmental? Maybe also have a pre written email ready for tenant deposit disputes since you are not able to talk them through as a company in a nice and professional way. Regardless of their reasoning for taking some or all of my deposit, I just hope future tenants don't make the same mistakes I did and spend 2 months cleaning the house and scrubbing every inch to perfection and most importantly, have Gail walk through your house before you move out so it's harder to get taken advantage of - otherwise they do the walkthrough alone and make their own decisions",
        "owner_response": null
      },
      {
        "author": "Rinay R.",
        "rating": 1,
        "review": "They completely charged us every single penny of our deposit for owners responsible repairs. Water leaking into our light fixtures, toilet running from day 2 of move in and noted, windows leading from faulty installation, foundation cracks that had ants building calanies threw them.......DONT RENT FROM THEM EVERRRRRRRRR",
        "owner_response": null
      },
      {
        "author": "Bain M.",
        "rating": 5,
        "review": "RPM has managed my property since 2018 and have provided excellent service and support.  Communication is quick and requests are fulfilled in a reasonable amount of time.  The maintenance reviews are thorough with a the focus on priorities.  Payments are prompt and on time as well as the 1099 tax form every year.\n\nI support and recommend RPM for anyone considering a property management company for their rental property.",
        "owner_response": null
      },
      {
        "author": "Sean D.",
        "rating": 1,
        "review": "I would highly recommend using SOMEONE ELSE to rent out your home. Over the course of a little under four months they dropped the ball on numerous minor maintenance issues and exhibited poor communication throughout that period. Ultimately they decided they couldn't handle our reasonable requests and, tired of being called out on their poor performance, dropped us (a true blessing). Below are numerous examples of why you should use SOMEONE ELSE to rent out your house. \n- Right off the bat they didn't advertise  our house correctly, completely leaving out the central air conditioning (something not every house has in the PNW) and mislabeled the square footage. Our tenants were not told about the air conditioning either until a neighbor casually mentioned it in conversation in the dead of summer.  We were also told we'd be informed of all applicants before signing. After many phone calls we were told a week after someone had already signed a lease. \n- Miscommunication by the maintenance department. We had told them before signing We'd like a break down of all expenses for maintenance, which they said they'd provide us.  Once we signed with RPM they immediately went against their word and would not give us any form of billing breakdown.  \n- Second issue with maintenance department. Told them our furnace had been serviced June 2018. While performing maintenance on the property in April 2019 they asked if we wanted it serviced. We told her that if the maintenance man on the property would be able to check furnace at same time that would be fine so that we didn't have to pay to send him out again in 2 months. He couldn't so RPM sent a separate maintenance person out (zero notification to us) and we received an early surprise bill. \n- Third issue with maintenance department. They sent a plumber out to fix a toilet issue twice on the same toilet (we would later find out). After calling Sarah (maintenance manager) multiple times over a 2 week period to get a straight answer we were told the plumber claimed it was a different toilet the second visit.  We were able to fix it for $15 after paying over $200 to a plumber they work with. \n- Called to ask about the annual inspection coming up due to our growing concerns with tasks being forgotten with the property. We were told by Sarah that we'd be cc'd in an email in regards to scheduling it. After one week we still had not received an email. We were about to follow up again when we were contacted  saying the inspection had been already been done. The inspection and photos were supposed to be of the whole house, but what we received were only two out of three floors, completely missing the full basement (which includes a bedroom, walk in closet, and full bathroom), and our garage. When questioned about it I was told they'd be sent back without additional charge. Surprise, they never came.\n- Fourth issue with the maintenance department. I was told by Erin and Frank before signing that any maintenance expense would be cleared with me and that we would not be in contact with the tenant. The property company is supposed to be our middle man. After the annual inspection we had a few repairs including a front porch step. We had called Sarah in the maintenance department and told her we would hire someone to come out so they could inform the tenant. They then told us they don't inform the tenant if they don't hire the maintenance man. We spoke with Gail (office manager) since we were told we couldn't contact the tenant and were told that most owners just let them take care of everything and don't worry as much. Our home is important to us and too expensive to not care about these expenses, especially since RPM had developed a pattern of dropping the ball on basic things in only a three month period.\n- After having months of back to back issues we requested to please speak to Frank or Daniel (father/son owners of the company) to ease our mind. Upon asking for clarification or an apology so we can move forward we received an email stating it was best to part ways. In this email it stated that they would mail all documents, security deposit, and keys for the property within 30 days. They screwed this up too. We never received keys for our property with the documents and security deposit within those 30 days and after waiting until mid September we contacted RPM about the keys. They told us at first they should of been mailed (they hadn't). We asked if they'd please check so we we know if we we need to rekey the home right away. The receptionist found them and offered to mail them to us and we finally got them nearly four weeks after we were told they'd arrive. \n- RPM told us our tenants were a family of five, which we learned was untrue and they were really a family of seven. The number of family members isn't a big deal but a rental company should be able to give a clear and truthful answer to a question like that.",
        "owner_response": {
          "text": "Sean, \n  I am sorry about the bad experiences you had. I will look into the issues you brought up and do some correcting on our end as needed. \n  It is our policy to communicate with our Clients quickly, address issues and resolve them. I am surprised I didn't know about these issues when you were having them. Some of the items you spoke about, we have corrected.\n  If there is anything we still need to resolve please let me know.\nFrank Volkert"
        }
      },
      {
        "author": "Chelsea O.",
        "rating": 1,
        "review": "If I could give this place 0 stars I would but sadly that's not an option. We moved into our townhouse leased by RPM in February 2020 right before the Covid lockdown. Two weeks into moving in a pipe burst in our ceiling above the kitchen. It took 9 months to fix it YALL 9 MONTHS. Not to mention anytime we have put it in a request for maintenance no one responds for months or even reaches out to check on us. SHAMS AND SCAMS. We have paid every month on Time through out a global pandemic and I can't even get a text back. The most recent event that took place happened today which led to me writing this review. Our lease is renewing at the first of August. One of our room mates communicated to our landlord and RPM at the beginning on July that she would be moving and that a new room mate would be moving in. RPM said nothing and our landlord gave th go ahead. Now we have 3 days until the new lease is due for renewal and they STILL haven't taken our old room mate off and new room mate on. Now they are saying our new room mate has to apply and pay $100 to be added to the lease -excuse me WHAT. The lady named Sue we talked to today was incredibly rude and condescending to our new room mate she even MADE FUN OF HER LAST NAME. Like was laughing at it. It was disgusting. They are human trash bags and Im not one to leave a 1 star review but this is OBSCENE. Run for the hills if this is your property management company on a place you are looking at renting.",
        "owner_response": {
          "text": "I am sorry that you had a bad experience and I believe there could have been some miscommunication. RPM always tries to follow Tenant/Landlord laws. I am sorry this is getting back to you late. Please feel free to call us and ask for John so we can see if we can come up with a resolution.\nThanks"
        }
      },
      {
        "author": "Lucas P.",
        "rating": 5,
        "review": "My wife and I recently moved back to the area and we're on a definite time crunch to get a place.. I originally spoke with John and he was super polite and helpful and kept us updated daily. Rose then helped us out on our lease agreement and Gail took over for her as Rose was on vacation the following week. They even stayed late for us to sign paperwork as we had driven 12 hours and were a little behind. All in all everyone was pleasant to deal with and very friendly. We got into an amazing rental and we are definitely happy! Thank you to the amazing employees and great customer service!",
        "owner_response": null
      },
      {
        "author": "Linnea E.",
        "rating": 5,
        "review": "Christa @ RPM or Real Property Management located in Everett, WA is first class!\n\nI called today with questions because my husband and I are considering\ninvesting in a rental property in the North part of Everett...we are more interested in the area west of Broadway.\n\nWe own rentals in other areas but are not familiar with north Everett. But we heard it is a growing area and could be a good investment. We wanted to know what kind of rent a small, 1000' rental might bring in a specific area from the point of view from a property management firm?\n\nChrista, Executive Assistant was incredible! She not only assisted with with my original question providing approximate rental incomes. \n\nHer knowledge of the area, her explanation of her company's services was the most thorough of the several other property management companies I spoke with. She was able to assist me much better than anyone else even though I was not asking them to manage a property for them...\n\nChrista understood that someone in a preliminary search to purchase a rental is just as important to serve as a homeowner searching for the right property management company.\n\nShe told me of the growing area, about the two hospitals nearby, also a new WSU campus soon to be built and that the closer one gets to the water the higher the property values are.\n\nChrista was able to inform me of the process by which they utilize for billing homeowners for any repairs per month, when rents were due (3 day grace period for tenants) and when homeowners were transferred their monthly rent due. She described their program enabling all billings to be available to the homeowner online and emphasized how simplistic and easy it was to understand.\n\nShe described surrounding areas such as Mukilteo, their great school district and how many tenants enjoy living in the Mukilteo vicinity...\n\nChrista provided me with much more than just potential rent info. She is a terrific representative for this company, Real Property Managagement.\nWe are so appreciative of her patience, knowledge and willingness to go outside of the box to help us.  \n\nBottom line, if we require services of a Property Management Co I will call Christa because I know she would get the job done and get it done right.\n\nPlease thank her for me.",
        "owner_response": null
      },
      {
        "author": "Ryan S.",
        "rating": 1,
        "review": "So if I can give less then a one I would. We rented our house out and these guys were the property manage company that we hired. They not only did not supervise the renters but let the renters do modifications to our home with out our consent. Then when we moved back the damages to our home were not fixed and when they did send our their so called maintenance guy he was rude and started to curse my wife and me and then treat us poorly in our own home. The owners are not the people they portray to be and they are not helpful at all. My Advise to all potential homeowners, do not rent your home thru these guys. I will continue to spread the word on all social media so that everyone can know what they are and how they treat the homeowners. BEWARE\n\n\nI will continue to advice the public on how they treat people and what the company is about!!!!\n\n\n\nReply to Frank.\n\nOnce again full of lies from Frank the owner, we do not drink any alcohol because if religious convictions. So right there is a bold face lie from the so called owner Frank. It took you 4 months to actually respond to this post. You still have not called us! Your maintenance person who you say is so friendly and non aggressive was cursing a woman out! This does not sound like a nice maintenance person. Your employee is a coward for fighting with a woman and your team did not check on the tenants like they should have. You should have caught that they were making modifications to the house like building shelves. \n\nOnce again your company and your team is not who you say they are. Most of your reviews on yelp are people you know. It's fake. Just like how you think you represent your company!  By the way the so called police report is also BS when your employee is on my property threatening and cursing us!",
        "owner_response": {
          "text": "Ryan,\nI am sorry you feel this way. We did do all we could to accommodate you and your wife including allowing you to move in the day the tenant moved out because of some extreme difficulties you and your wife had endured. If we came across unprofessionally in any way, my sincerest apologies.\n  We did all we could to honor your requests and still abide by Landlord Tenant Laws to protect you.\nUnder normal circumstances, we would have repaired any tenant damage while the home was not occupied, because you seemed to be distraught about moving immediately in, we were compassionate, allowed you to move in before we could assess and repair any tenant damage we agreed with you to do any repairs while you were in the home. When our maintenance person arrived to do the pre-arranged repairs, he could smell alcohol and was met by so much hostility that he felt he needed to file a police report after the incident. He is a very kind person and was extremely bothered by the way he was treated and is in no way an aggressive person. \n We always are professional and only want the best and what's right for our Owners and Tenants for everyone's protection.\nI am sorry for the difficulties your family have endured. I hope the best for you and your family."
        }
      },
      {
        "author": "Kathleen W.",
        "rating": 5,
        "review": "We have worked with RPMNPS for 2 years now on multiple properties.. The service has been exceptional. Each member is knowledgeable, professional and a pleasure to work with. They are always responsive to us and to our tenants when needed and we always feel our properties are being well managed and that our tenants are being looked after as well. We highly recommend them.",
        "owner_response": null
      },
      {
        "author": "Peabody J.",
        "rating": 1,
        "review": "Looked at a property that they were renting. We asked if people already had interested parties as we did not want to pay $100 and have credit dinged for nothing. \nWe were told there were two people who had an application in but not all of their info (pay stubs and what not) and that if we got everything in first we move to the top. \n\nSo we went home and paid the $100 and gave all the info they wanted. We were called right away and said looks good and that we would know the next day. \n\nLater that day I got an email saying someone else that had all their stuff in put down a deposit and so they got the place. \n\nSo I feel like we were scammed.",
        "owner_response": null
      },
      {
        "author": "Ron R.",
        "rating": 1,
        "review": "Is terrible. Warning do not let them tell you they do not have to be there on final walk through. Once your out they will say there is damage you are responsible for and not return your deposit. Left the place better than we received it.\n\nR",
        "owner_response": null
      },
      {
        "author": "Sean W.",
        "rating": 5,
        "review": "Del has been amazing.  We are moving from California bringing three dogs and with my entire family.  Del was amazing through it all.  Step by step Del was there for me to assist me and still looking our for the home owner of the rental we were looking at. I can not thank Del enough for the hard work and determination.  Del took so much stress out of this move from state to state I could not be any happier or grateful.\n\nI highly recommend Real Property Management North Puget Sound, \n\nMy family is forever grateful for Del.",
        "owner_response": null
      },
      {
        "author": "Robley K.",
        "rating": 1,
        "review": "GAY COUPLES BEWARE\n\nWe are a gay couple who recently went through the process of renting a condominium with Real Property Management of North Puget Sound. We were kept running in circles, dealing with a succession of employees to satisfy their application process. We are property owners in the process of relocating and are immensely qualified with excellent credit. \n\nAs we were kept waiting, they rented the property to others. Maybe they can technically defend their actions as mere confusion or incompetence, but I hope they never try this again with a gay couple. We will let the Washington State Human Rights Commission, the BBB, and their franchisers look into this issue and find out just what is happening, and to see if a pattern of discrimination emerges.",
        "owner_response": null
      },
      {
        "author": "Eric B.",
        "rating": 5,
        "review": "After buying a new home in Q3 of 2013 I decided to try turning my previous home into a rental. I spoke with three different property management companies in detail and a few others over the telephone and email. In the end I choose RPM. I choose RPM for three reasons. First, of all the companies I spoke with RPM was the best communicator. They always got back to me fast and give me the information I needed. Second, RPM offered the best value for their management fee. Third, the real estate agent I had been working with for over a year, to find my new home, had worked with Frank at RPM and recommended them. My adventure with rental property is just beginning, but, I feel confident everything is going to work out well with RPM as my partner.\n\nUpdate: March 2014\nRPM found a tenant for my home a couple of months ago and everything has been going great. The whole RPM team has been very helpful.",
        "owner_response": null
      },
      {
        "author": "Ryan M.",
        "rating": 2,
        "review": "Experience has not been as good.  Frank quoted me $800 for painting my condo, and he ending up charging me $1200.  He didn't call me about it either, I found our when he sent the bill.",
        "owner_response": null
      },
      {
        "author": "Mystery R.",
        "rating": 5,
        "review": "Excellent Team.  Everything is new to me, first time to rent my house - they are patient with me to get everything in order and succeed.",
        "owner_response": null
      },
      {
        "author": "Mehedi Hussain P.",
        "rating": 1,
        "review": "Emily scheduled an appointment to show a property. I was there and tried to get a hold of her. Calling number was turned off and was going to her voicemail. After 2 days i was checking again with her on email and figured out its already rented. What a waste of time! Terrible service.",
        "owner_response": {
          "text": "Mehedi,\n  Our apologies for your experience. In today's rental market, anyone who wants to rent must be persistent. We really work hard to get our rentals leased to great qualified tenants as quickly as possible.\nFrank Volkert"
        }
      },
      {
        "author": "Nathaniel W.",
        "rating": 5,
        "review": "RPM has done an excellent job being prompt, accommodating, and getting the job done on multiple occasions, but I want to give a special shout out to Frank, who came out at an inconvenient time to solve a baffling problem. For about a week we had been experiencing the dreaded beep of a fire alarm unit, the only thing is that through several battery changes the beeping wouldn't go away, and the source couldn't be found. This was a serious disruption to our sleep, especially to my wife who has been recovering from surgery and desperately needed the sleep. I explained this all to Frank over the phone and he went out his way to come out and investigate for himself. After some head-scratching, trial-and-error, and sound detection, the source was found, we were able to deactivate it and sleep soundly. I really appreciate RPM and Frank's dedication to protect our quality of living and I'd gladly recommend them to anyone considering a property!",
        "owner_response": null
      },
      {
        "author": "Casey W.",
        "rating": 1,
        "review": "I've been a landlord and a tenant.  If you're a landlord - this company is solid.  If you're a tenant - I'd stay away from properties managed by this company.  I'll try to keep this short, despite having a lot to say.  To be transparent, I'm writing this review as a tenant, since that was my interaction with RPM.\nMove-in and the checklist took over an hour and a half!  Longest I've experienced as a tenant.  I called their emergency line because there was water under the fridge that continued to appear after wiping it up.  It took them 2 days to get back to me.  Other than that, all was good during our short (3-4 month) lease.  The real headaches came when it was time to terminate our lease early - we paid the steep early termination penalty (which I don't have a problem with, it was a part of the contract and I'm a reasonable person).  They advised when we moved in that we would have to use \"one of (their) approved vendors\" for both the move-out cleaning and carpet cleaning.  This is where the biggest frustration with RPM lays - RPM only had a single vendor for both.  I had no choice at all for who we used.  See my separate review of the cleaning company, Morgan Real Estate Management.  I was at the mercy of those vendors for what they wanted to charge for their services.  \nI understand that RPM is working to protect the owner of the rental property.  However, from a tenant perspective, you're going to pay on the backend of your rental.  Personally, I'd stay away from them as a tenant in the future - they aren't reasonable when it comes to services at move-out.",
        "owner_response": null
      },
      {
        "author": "Jesse R.",
        "rating": 5,
        "review": "Frank and his family are the owners of RPM in Everett, which covers north of Seattle. They do a great job of setting the correct expectation with the owners they work with and they are the liaison between the owner and the renter so you don't have to bring emotion into your renting experience as an owner. Frank does a great job of keeping Up to date with property values and what your maximum potential can be in different areas of the market.\n\nAs a networking partner of Frank's, I get to better understand more about his business and the way he handles his customers, and the level of integrity that he has for this type of business is outstanding.  \n\nI am honored to refer my friends and family to him for any of their rental needs.\n\nA+ for Customer Service and Integrity",
        "owner_response": null
      },
      {
        "author": "Dale B.",
        "rating": 5,
        "review": "We had a great experience working with Frank and Real Property Management. Frank was able to work and communicate with me effectively, especially with me being out of state. I really appreciate all of the informative data he provided me to make an informed decision on when it came to my rental.  It did not take long for Frank and his team to find a quality renter for my property.  I would definitely recommend Real Property Management!",
        "owner_response": null
      },
      {
        "author": "Claudette C.",
        "rating": 5,
        "review": "I have several properties in several different states (Navy) and I have had several different property managers throughout the years and Real Property Management has been the best out of all of the PMs that we have had.  There are more fees than a traditional PM, but they have a lot of guarantees and I can tell you from past rental experience you want the PM that checks on your house every 6 months.  They have a guy Jeff that sends out detailed reports on the 6 month walk throughs with pictures so you can see how your property looks.  Additionally, when I call or have a concern, the staff take my concerns seriously which is important to me because I have had other PMs who acted like me renting was just a hobby and they woudn't email or call me back.  I wish all of my PMs were as detail oriented as RPM.  I feel relieved that we found a company that treats my property with as much respect as I do.",
        "owner_response": null
      },
      {
        "author": "Letizia A.",
        "rating": 5,
        "review": "Frank and the RPM team are phenomenal! \nThey are very responsive and take initiative to reach out to us ahead of time when leases are coming due, when repairs need to be made, or just to make sure we are aligned on the overall plan for our properties. They get back to me quickly when I email or call, so I never have to call twice or remind them of anything. They've even helped me get multiple bids for landscaping and completely remodeling one of my properties. Frank has also advised me regarding potential rents and driven by to check out properties ahead of me buying them. RPM has truly been an essential partner in our real estate adventures, and I trust that they will take care of our properties like their own.\n\nI wish all of my properties were in a location that Frank and the team could manage them!",
        "owner_response": null
      },
      {
        "author": "Eric V.",
        "rating": 5,
        "review": "Updated Review (09/29/2018):\nAfter being rental owners from 2014-2018, we finally sold our house this month.  During the entire time we rented it out, RPM was our partner in every way, walking us through the process of being a rental owner, handling the stress of managing the property, and ensuring that we had quality renters each and every time.  When it came time to pass the baton to someone else and sell our home, RPM worked closely through the transition process, even serving as our go-between with the utility company after the last renters moved out so that the process could move forward (we live in another state now, making dealing with the utility company difficult)!  They also referred us to a good real estate agent.  I wish we could have sold the property sooner (e.g. May / June) and gotten a better return, but we are still extremely happy with RPM of North Puget Sound.  The entire team has our complete endorsement, without reservation!\n\n- - - - - -\n\nPrevious Review (5/29/2015):\nMy family and I had to move after I was laid off and needed to relocate across the country.  We wanted to set up our home in WA as a rental, so we researched rental management agencies for some time to locate the right one.  \n\nAfter significant investigation, we determined that Real Property Management of North Puget Sound (RPM) would be the best fit for us, due to their professionalism, care, and concern for their customers.\n\nWe have not been disappointed at any time, and in fact our expectations were met and exceeded when a minor snafu with a changed bank account and a misplaced payment was rectified over the weekend by Frank and his team.\n\nAmazing service and dedication - we cannot recommend them highly enough.",
        "owner_response": null
      },
      {
        "author": "Chelsea H.",
        "rating": 5,
        "review": "We can't say enough great things about Del. She was absolutely the most supportive, helpful agent that we could ever hope for. We are a young family and were looking to move closer to our jobs and out if comfort zones so we had a lot of questions and a lot of back and forth moments. She never once made us feel bad or rushed for asking them. She was available night and day via e-mail and phone. When we did the pre move in inspection she really played on our side in documentation, she understands what it can be like renting right now. Again, we could not be happier wih our new home and with Del.",
        "owner_response": null
      },
      {
        "author": "Erica O.",
        "rating": 5,
        "review": "I'd have to say that being in the place I have been for as little as we have been, it's not bad. Especially since it was hectic enough moving across the US. Amy was great and prompt. Didn't really mislead us in anyway. If I could rate the landlord, it would be a different story however, but this is about RPM more than anything. Are landlord doesn't do a very good job at communication nor do our things that were not fixed before we moved in have any clue when they are going to be fixed now. But the staff at Rpm is very friendly and kind and prompt in getting back with us even when it is not their place to. Our landlord is responsible for all repairs but they kindly send their service man out to fix our washer when it was not their job to and that I am grateful for. It was painless and easy to move in and I made sure that we had everything that we needed including who to contact and contact numbers for electric and what not. Amy was great as well! So for the service from the staff at Rpm five thumbs up if that's possible:-)",
        "owner_response": null
      },
      {
        "author": "Krysten D.",
        "rating": 5,
        "review": "Amy is awesome! My husband and I were in search of homes during the Christmas holiday, so we were finding it tough to get much response from other property management companies. After much searching, my husband and I finally found a beautiful property for rent through RPM's website. From the time we viewed the property, to submitting our applications and signing the lease, Amy has been nothing but responsive, professional and friendly. The entire move-in process was very seamless and Amy patiently answered all of our questions. It's tough to find a good property management company who is responsive. Thank you, Amy and RPM!",
        "owner_response": null
      },
      {
        "author": "Elaina H.",
        "rating": 1,
        "review": "DO NOT USE THIS COMPANY! They not only take forever to respond and address your issues and problems with the home your renting, but they also charge you fees they are not entitled to and take money without notifying you out of your security deposit once you move out and refuse to answer you on the matter. They do not abide by the law, you have to fight them on the tenant and landlord law for them to \"get things going\", and even when you have proof, they are still passive aggressive. They do not allow you to be present at the walk thru after you move out, which allows them to come up with whatever they want to come up with. They require you to use their carpet cleaning company, you're not allowed to use any other company. You have to use their cleaning companies and even if you have a quote and receipt of the service in hand, they add additional fees on top of that without notifying you.  If you call for service like you would any other rental, ie. fridge isn't working, dishwasher broke, no hot water etc., they will charge you at the end of your lease without ever telling you about it and then just arbitrarily come up with a figure and deduct that out of your security deposit when it is their responsibility to take care of these items. If you want a reliable, honest company to rent from, RPM North Puget Sound is NOT the place to go.",
        "owner_response": {
          "text": "Thank you for your feedback. You are however contractually obligated to all the deductions made from your deposit. The total amount deducted did not reach $500.00. Separately, please note that you did not pay all of your utilities upon vacating like you had told us you would in early May of this year. That balance remains outstanding. We are happy to discuss this further and please contact us.  Thank you."
        }
      },
      {
        "author": "Jessica H.",
        "rating": 1,
        "review": "If I could give this company 0 stars I would. Do not rent through them, especially if you are military! The only reason we stayed in our rental for 2 years was because we loved the house and our neighbors. And the home owner was also military and we didn't want to screw her over by leaving. But, these people were a nightmare to deal with. We moved in and like with any rental company we were give x amount of days to add issues to the walk through list and document things that needed to be fixed. But, when we emailed them we never got a reply. Emailed again no reply. Any time we needed something to be fixed it took weeks or more to hear back from someone. But you better believe the one time there was an issue with our bank they were blowing up my phone! The staff is rude and unprofessional and the owners refuse to email back as well. Last June the refrigerator started leaking and caused black mold (which I'm severely allergic to) and it took over a month for their \"maintenance\" guy to come look at it, and then when he swore it was fixed a few days later it was leaking again. We called the company no response, emailed no reply. Fast forward a few months and my husband received new military orders and these idiots refused to let us out of our lease even with OFFICIAL MILITARY ORDERS! This company is a joke and I will be sure that all of our military friends and family knows not to rent through RPM. Don't pride yourself on helping our military members and their families then treat them like crap!",
        "owner_response": {
          "text": "I am sorry you feel like this way. When the tenant returns possession of the property to the Landlord, it needs to be clean and returned in as good condition as when rented (normal wear and tear excepted). If it is not returned in good condition, we and you the tenant, are under contract to have it cleaned and repaired for the owner using the security deposit.\nWe always comply with the laws regarding our service members. Please note: \"Discharge\" from Military service does not apply under the Service Member Civil Relief Act 535 section (B) par (1) (b), nor is it sufficient under RCW 59.18.200 to release a tenant from their lease obligation. Even still, the Owner of the property, being Military themselves, allowed you to break your lease without penalty. Repairs still needed to be done.\nWe do have high regard for Military personnel. We have a veteran employed here. We have seldom had any issues from Property Owners or Tenants who are Military. Thank you for your service to our country."
        }
      },
      {
        "author": "bub b.",
        "rating": 5,
        "review": "For the first time in 8 yrs, my husband and I found ourselves looking for a home to rent. A lot has changed in the rental industry and it was a bit overwhelming looking at places and having so many different policies and fees attached to just renting a home. When we contacted RPM, we spoke with Emily and she was so nice and eager to answer all our questions. She went out of her busy schedule to arrange a time for us to see our new home. We are very happy we worked with RPM and are very happy in our new place.",
        "owner_response": null
      },
      {
        "author": "Robert J.",
        "rating": 5,
        "review": "If you need a property manager that knows the industry and have not met with Frank yet, immediately after you read this you must stop whatever you are doing and contact him. He genuinely cares for his clients and always does what is in their best interest. I can't recall ever meeting a more compassionate caring person. As a contractor who has worked for several property management companies, there is only one I recommend, and it couldn't be any stronger. Give him a call and you will know what I'm talking about.",
        "owner_response": null
      },
      {
        "author": "Scott S.",
        "rating": 5,
        "review": "Del provided thorough responses to all of my questions, had great follow up (even after I took occupation of my new residence), and they did a thorough inspection of the unit including photo evidence of any flaws that existed before I moved in. I would very highly recommend using Real Property Management North Puget Sound to anyone looking to rent in the North end.",
        "owner_response": null
      },
      {
        "author": "Mara L.",
        "rating": 4,
        "review": "I had been managing my rental home myself from another state.  With Washington rental laws set up to favor the tenant, it was becoming increasingly difficult to stay in compliance as well as  feel my property was being cared for.  I manage vacation rental properties in Colorado and most of the time really enjoy it, so giving up management of the house in Edmonds was not easy for me to do.  I called several agencies and Daniel  V. was the one answering the phone, ( not a machine) so I was able to feel a personal touch right off the bat.   Daniel has been personable and conscientious throughout the term of what is now the second lease.  Although the costs of management companies in the metro Seattle area are higher than they are in many places, I like working with a family business who I have found to be trustworthy. At times I have felt like Real Property leaned over backwards to please the tenants, without much regard for how I as the owner felt or saw it.  But they have found good matches for my house, the rent has always come in and renters have taken good care of the  house.  I have suggested them to others and will continue to.  I did not give them 5 stars because for me the best of the best in  management companies would be one that has several management plans to select from, e.g. just marketing and placement or just overseeing once a tenant is placed etc.  I did find a few who do this, but I stayed with Real Property because I had begun a working relationship with them and I trust them.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 209,
  "adjusted_average_rating": 4.47,
  "distribution": {
    "1": 34,
    "2": 4,
    "3": 1,
    "4": 7,
    "5": 239
  },
  "summary": {
    "created_timestamp": 1739205568,
    "text": "<section id=\"good\"><h2>Good</h2><p>Real Property Management North Puget Sound has demonstrated consistent efficiency in resolving maintenance issues and providing excellent customer service. Many tenants have praised the company for quick responses to their inquiries. A tenant highlighted that dealing with maintenance was made easy and stress-free thanks to the diligence and prompt assistance of the maintenance team, particularly singling out a maintenance coordinator for his excellent service.</p><p>Additionally, the company's commitment to careful communication and management has been appreciated. It is evident from user reviews that the staff handles various tenancy issues professionally, ensuring that tenants are well-informed about any changes or updates regarding their rental agreements. This level of customer service and proactive problem-solving is a testament to their dedication to maintaining tenant satisfaction.</p></section><section id=\"great\"><h2>Great</h2><p>Real Property Management North Puget Sound is frequently commended for its dedicated staff, who go above and beyond in their service delivery. Clients have mentioned that the company has far exceeded their expectations by providing thorough walk-throughs and regular updates, ensuring everything is in order and handled diligently. Users have appreciated how certain employees remain professional, courteous, and responsive, making the leasing and maintenance processes seamless.</p><p>For property owners, the peace of mind offered by RPM's management services is invaluable. One landlord shared satisfaction with RPM’s ability to attract and retain quality tenants, reducing tenant turnover. The company’s effective marketing strategies, comprehensive inspections, and tenant relations significantly contribute to a positive ownership experience. Recommendations for RPM are often enthusiastic, with clients confident in their capabilities and proven track record.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the numerous positive experiences shared, some reviews indicate areas where Real Property Management North Puget Sound could improve. A few tenants have expressed frustration with the company's deposit return process. Claims of unexpected fees and dissatisfaction with RPM's handling during the move-out process are mentioned, suggesting a need for increased clarity and communication regarding lease agreements and expectations.</p><p>Issues around delayed maintenance responses have also been highlighted. Some reviews noted that emergency maintenance requests, such as plumbing issues, were not addressed as promptly as expected, leading to dissatisfaction and inconvenience for residents. Improved protocol on urgent repair responses could enhance the renter experience, addressing concerns about efficiency in resolving critical issues.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Several user reviews represent a stark contrast to the generally positive feedback, highlighting substantial dissatisfaction with Real Property Management North Puget Sound. Tenants have flagged issues related to unfair treatment during move-outs, including claims of wrongful charges against security deposits for damages considered normal wear and tear.</p><p>The most severe criticisms are directed at the company's communication and problem resolution processes. Some former tenants have described experiences of negligence regarding maintenance requests, leading to safety concerns and considerable stress. A former tenant noted experiences of being misled and a lack of accountability and transparency during critical moments, such as illegal eviction proceedings, damaging trust and raising questions about the management's integrity.</p></section>"
  }
}