{
  "name": "Real Property Management North Puget Sound",
  "slug": "real-property-management-north-puget-sound",
  "company_type": "Company",
  "address": "1325 State Ave, Marysville, WA 98270",
  "review_count": 252,
  "avg_rating": 4.4,
  "reviews": {
    "google_reviews": [
      {
        "author": "Brian Moudy",
        "rating": 5.0,
        "review": "Frank, Gail, and the entire team at Real Property North Puget Sound have been awesome to work with. They gave us a reasonable list of things to work on to get rent ready, and helped us manage some stuff we werent able to take care of ourselves. They communicated clearly throughout and answered all our questions. As first-time landlords, we were very unsure of the whole process, but they made it very easy. We highly recommend them for managing a property.",
        "ownerResponse": {
          "text": "Thank you so much for sharing your experience, Brian! It was a pleasure assisting you with getting your property \"rent ready\" and making the process easy for you as first-time landlords. We appreciate your recommendation!"
        }
      },
      {
        "author": "Dustin Thomas",
        "rating": 5.0,
        "review": "What a great property management company! I am blown away at their dedication to excellent service for not only their clients but tenants as well, which is rare in the industry. If you are looking for a great company to manage your rental Real is definitely a good choice",
        "ownerResponse": {
          "text": "Thank you for recognizing our dedication to excellent service for both clients and tenants! We appreciate your kind words and are grateful for your feedback."
        }
      },
      {
        "author": "Srivatsan Venkatesan",
        "rating": 5.0,
        "review": "I chose this property management company  for renting my property and the experience has been great. The staff is very professional and is very good at getting things done quickly and in taking care of my rental property. I appreciate the quality and work ethic they bring in every area.\n\nThe management team and staff is excellent and was very responsive and helpful in answering all my questions and concerns. I am very pleased with all the service and help I have received so far.\n\nThis is my first experience using a property management company and they are awesome. I highly recommend Real Property Management North Puget Sound.",
        "ownerResponse": {
          "text": "Thank you for the wonderful 5-star review! We're thrilled to hear that your experience with Real Property Management North Puget Sound has been great. It's fantastic to know that our staff has been professional, responsive, and efficient in taking care of your rental property. We appreciate your acknowledgment of our quality service and work ethic. If you have any more questions or concerns, please don't hesitate to reach out. Thank you for recommending us!\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Pam de Sautelle",
        "rating": 5.0,
        "review": "Joseph Butcher is an amazing employee of RPM. He is professional and personable, shows empathy for situations well and pays attention to detail.\n\nHe repaired my stove, fire alarm, and kitchen faucet on Friday, returned on Monday after a pipe froze in our garage. Due to the freezing weather conditions all plumbers were out on other calls. Joseph called, then came out quickly, and was able to repair it!!!! It was seamless and perfectly executed. About four hours in total and our water was back on. He initiates the task and follows up professionally over the phone. Well done Joseph!!!!",
        "ownerResponse": {
          "text": "Pam,\nThanks for the fantastic 5-star review! We're thrilled that Joseph Butcher from Real Property Management North Puget Sound impressed you with his professionalism, personable approach, and attention to detail. Your feedback on the efficient repairs to your stove, fire alarm, kitchen faucet, and frozen pipe is greatly appreciated. If you have more maintenance needs or questions, feel free to reach out.\nBest,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound\n"
        }
      },
      {
        "author": "Kristin Johnson",
        "rating": 5.0,
        "review": "The staff at RPMNPS are all terrific.  Being a first time landlord, Frank was so helpful with getting me started with the whole process.  Gail and Rose were quick to respond with my many questions.   They all worked hard to get my house ready and up on the market.   I am so Thankful I chose them as my property management company.",
        "ownerResponse": {
          "text": "Thank you, Kristin! We're grateful to have been able to assist you with becoming a first-time landlord. Our team, including Frank, Gail, and Rose, is dedicated to providing helpful and responsive service. We appreciate your trust in us as your property management company."
        }
      },
      {
        "author": "Artur Nekrasov",
        "rating": 5.0,
        "review": "I wanna say that Real Property management has done an amazing job managing the house we currently live in! We had such a great experience with them through the entire process, from finding the listing on the web to moving in - they are very responsive, transparent and very well organized. I feel that every single maintenance request is being taken care of, they respond in a timely manner and fix the problem! I had to reach out to the owner through them with very specific request and they helped me with that providing quick and clear communication! Couldnt be more satisfied with their customer service! Thank you a lot!",
        "ownerResponse": {
          "text": "Thanks so much for the glowing review! We're thrilled to hear you had a great experience with Real Property Management North Puget Sound. We're here to make things smooth for you, from finding the listing to sorting maintenance requests. If you ever need anything else, just give us a shout."
        }
      },
      {
        "author": "Timothy Gilmore",
        "rating": 5.0,
        "review": "Rose and Cynthia were amazing to work with. They were professional, courteous and knowledgeable about everything. They made the application process seamless. They answered all my questions and were great to work with. This was my first experience with a property management company, but Ive heard it can be very hard. Not at all my experience with Rose and Cynthia!",
        "ownerResponse": {
          "text": " Thank you for your kind words an 5 star review. Rose and Cinthia, on our leasing team, are awesome and are always trying to help people with the move-in process. They are some of our \"A\" players. We are glad to have you as one of our tenants."
        }
      },
      {
        "author": "Tracy DeLorm",
        "rating": 5.0,
        "review": "I have had the pleasure of working with Real Property Management North Puget Sound for two years now and I am thrilled with the level of service they provide.\n\nThey conduct a thorough rental analysis each year to ensure that my rent is fair and competitive.  My previous property management company never reminded me to evaluate and raise the rent each year.  When RPMNPS took over, I was at least $700 per month lower than the average rent in the area.\n\nThey conduct yearly inspections of my property which ensures that any potential issues are identified and resolved promptly.  When repairs are needed, they use quality vendors and ensure that repairs are not just quick fixes but are completed with attention to detail and to a high standard.\n\nOverall, my experience with Real Property Management North Puget Sound has been exceptional. Their use of quality vendors, rental analysis, timely rent increase reminders, yearly inspections, and focus on quality repairs have made them reliable and trustworthy partners. I highly recommend their services to anyone in need of professional property management.",
        "ownerResponse": {
          "text": "Thank you, Tracy! We appreciate your kind words and are grateful for the opportunity to serve you. It's been a pleasure working with you for the past two years and we're glad to hear that our rental analysis, yearly inspections, and focus on quality repairs have met your expectations. We value your trust and recommendation."
        }
      },
      {
        "author": "Lifetime Heating",
        "rating": 5.0,
        "review": "Terry is an amazing addition to the RPM team! He continues to make sure our mutual clients are taken care of and goes above and beyond to ensure that timely and necessary repairs get scheduled as soon as possible. We love working with RPM and everyone on their team!!",
        "ownerResponse": {
          "text": "Dear Lifetime Heating,\n\nThank you for the fantastic 5-star review! We appreciate your positive feedback about Terry at Real Property Management North Puget Sound. We're delighted to hear about the excellent service he provides to our mutual clients, ensuring timely and necessary repairs. It's wonderful to know that you love working with our team. If there's anything more we can do or if you have any additional feedback, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Colton Davis",
        "rating": 1.0,
        "review": "While Real Property Management might seem like a convenient choice for renting, my experience with them has been less than satisfactory.\n\nLet me start with the move-out process, which was a nightmare. Expect to jump through hoops and incur unexpected expenses. Despite leaving the apartment in decent condition, I was hit with charges for what should be considered normal wear and tear. Nail holes in the wall, interior painting, and light bulb replacements were all on the list of things I was charged for. It felt like they were searching for any excuse to dip into my deposit. The most absurd part? Being forced to hire a professional cleaning company at my own expense.\n\nSpeaking of deposits, be prepared to say goodbye to a chunk of yours for a suspicious $200 admin fee. Apparently, coordinating move-out work that was supposedly my responsibility warranted this hefty deduction. And let's not forget the exorbitant charges for seemingly minor items. $284 for a freezer shelf? $77 for a gallon of paint? Absolutely ridiculous.\n\nWhat's more, their strict subleasing policy is downright exploitative. Want to sublease? Sure, but only if you're willing to fork over three months' rent. It's a blatant cash grab and shows a complete lack of consideration for renters.\n\nOverall, Real Property Management seems more interested in nickel and diming tenants than providing a fair and transparent renting experience. If I had known about their overly scrutinous move-out process beforehand, I would have meticulously documented every detail on the move-in inspection form. Consider yourself warnedrenters, beware.",
        "ownerResponse": {
          "text": "We appreciate your feedback and take it seriously. At Real Property Management, we strive to provide a fair renting experience.\nRegarding the move-out process, charges for items like excessive nail holes, tenant damage that requires painting, and burnt out light bulbs are outlined in the Lease Agreement, and are standard for maintaining the property's condition.\nThe admin fee for coordinating maintenance for tenant damage upon move-out is also standard and communicated upfront in the Lease Agreement.\nOur subleasing policy is firm to ensure compliance with leasing regulations and protect both tenants and property owners.\nWe're sorry our processes didn't meet your expectations, though they were explained at lease signing and detailed in the lease. Thanks for your feedback and bringing your concerns to our attention."
        }
      },
      {
        "author": "Lindsey Price",
        "rating": 1.0,
        "review": "Future tenants should be aware that RPM puts their landlords above their tenants and are only interested in making money, not supporting the tenants. In a disagreement of the use of my security deposit, Gail was rude and unhelpful and because we couldnt agree, now I have to take an extra step and file a lawsuit just to get my deposit back. Gail repeatedly said the house was dirty to be rude rather than using any level of professionalism or customer service. She also offered no avenue to dispute the charge other than continuously saying this is how it must be instead of understanding its a mutual disagreement and we could use a mediator to resolve it. Why not clarify that its well within a tenant rights to dispute the charges? Im unsure if Gail is incapable or just unwilling to read the laws laid out to protect Washington state tenants.\n\nI understand needing to leave the house in a certain condition based on our lease agreement but was being rude necessary? We are poor and we did our best, we couldnt afford the cleaners they wanted. We work full time and go to school full time, I couldnt spend more than a month deep cleaning the house to meet RPM needs. I recognize they want the house in a certain way and we didnt meet that standard but at this point and based on Gails attitude, I just feel totally scammed no matter what they say is wrong with the house because anything I say will just be met with this is how it must be done. In my opinion, forcing your tenants to perfect the home to your standard out of pocket is just taking advantage of renters who often dont have a choice about the fact they are renting.  Its unfortunate that RPM  doesnt do any work themselves and expects the previous tenant to perfect the house out of pocket for the next tenant, continuing to limit any work needed on RPM side and keeping them from having to bother investing in their properties and tenants.\n\nI also find it extremely important to mention that we returned the house in the exact position it came in when we got it minus regular wear and tear from living in a 100+ year old house for 2 years. It was equally as dirty when we moved in, I spent 2 years deep scrubbing the dirty off of everything in the home (pictures below).\n\nSome advice for RPM, maybe try caring about your tenants and properties by cleaning them yourself rather than being lazy and judgmental? Maybe also have a pre written email ready for tenant deposit disputes since you are not able to talk them through as a company in a nice and professional way. Regardless of their reasoning for taking some or all of my deposit, I just hope future tenants dont make the same mistakes I did and spend 2 months cleaning the house and scrubbing every inch to perfection and most importantly, have Gail walk through your house before you move out so its harder to get taken advantage of - otherwise they do the walkthrough alone and make their own decisions.\n\nI also have a strong feeling based on their previous negative reviews that they will respond to this unprofessionally too. I dont care about the deposit or them, I just want other tenants to be protected and not make the same mistakes I did by renting through them.",
        "ownerResponse": {
          "text": "We're sorry to hear about your experience. At Real Property Management, we prioritize professionalism and aim to provide excellent service to landlords and tenants alike. We strictly adhere to Tenant Landlord Law and take it seriously. Pet urine in carpet and along baseboards isn't considered normal wear and tear and must be addressed.\n\nRegarding security deposit disputes, we follow Washington state laws and guidelines. We understand disagreements may arise and always aim for honesty and fairness to both tenants and owners.\n\nYour feedback is important to us, and we're dedicated to improving our services. We apologize for any perceived rudeness, which doesn't reflect our customer service standards.\n\n"
        }
      },
      {
        "author": "DJ Lay",
        "rating": 5.0,
        "review": "Maintenance Coordinator Terry Bertucci has been extremely helpful with resolving issues with my rental property. He exceeds expectations with communicating problems and works with me to determine workable solutions. Thanks Terry, your attention to detail and support is greatly appreciated!",
        "ownerResponse": {
          "text": "Thank you for the fantastic 5-star review! We're thrilled you've had a positive experience with Terry Bertucci, our Maintenance Coordinator at Real Property Management North Puget Sound. Your kind words about Terry's communication and problem-solving skills mean a lot to us. We're here to help if you need anything else!"
        }
      },
      {
        "author": "Johnny Blackstar",
        "rating": 5.0,
        "review": "Real Property Management  got clear communication, responsiveness, expertise, professionalism, you can really trust them, they are very friendly.",
        "ownerResponse": {
          "text": "Thank you so much, Johnny! We appreciate your kind words and are grateful for your trust in our services. It means a lot to us that you found our communication clear and our team responsive and friendly."
        }
      },
      {
        "author": "Ankur Goyal",
        "rating": 5.0,
        "review": "They are the best property management. We were new and unfamiliar with renting out our property. Gail Volkert and her team walked us through the whole process and took care of everything to minute details while we just sat back seeing our property already got tenants within 2 weeks. We just wanted our property to be on rent for a year as we had to stay in some other city. So our experience was very comfortable and relaxing. One last thing to mention, our house was returned to us in pristine condition as if completely newly built home. I will definitely recommend RPM-NPS.",
        "ownerResponse": {
          "text": "Dear Ankur Goyal,\nThank you for the excellent 5-star review! We're thrilled you had a great experience with Real Property Management North Puget Sound. Gail Volkert is awesome at her job and is a great member of our team, she and all the members or our team, do our best to make your experience as smooth as possible. We appreciate your recommendation and will continue to serve you as best as we can.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Homes with Celine",
        "rating": 5.0,
        "review": "I love working with Greg and the RPM team. They are always quick to respond to my questions and inquiries and treat my clients very well! I appreciate them so much I plan to use them for my own investment property.",
        "ownerResponse": {
          "text": "Thank you for your kind words! We appreciate your support and are grateful for the opportunity to assist you and your clients. We look forward to working with you on your investment property Celine!"
        }
      },
      {
        "author": "razedonradio",
        "rating": 5.0,
        "review": "We enlisted RPM's services to manage our properties about two years ago.  We have been very pleased with their promptness and attention our properties specific needs.  They have been integral to elevating our tenants reasons to stay long term.  Thank you RPM",
        "ownerResponse": {
          "text": "Thank you for choosing Real Property Management North Puget Sound to manage your properties! We greatly appreciate your kind words and the trust you have placed in us. It's been a pleasure working with you these past two years and we're glad to hear that our promptness and attention to your property's needs have helped in retaining long-term tenants. We look forward to continuing to provide excellent service to you in the years to come."
        }
      },
      {
        "author": "Garage Tech",
        "rating": 5.0,
        "review": "Terry the maintenance coordinator has been a pleasure to work with. As a vendor, we appreciate his promptness to respond to our requests for information or approval to move forward on repairs. We find the entire process working with Real Property Management N Puget Sound to be easy and efficient.",
        "ownerResponse": {
          "text": "Dear Garage Tech,\n\nThank you for the fantastic 5-star review! We appreciate your positive feedback about Terry, our maintenance coordinator, and the efficiency you've experienced working with Real Property Management North Puget Sound. If you have any more comments or if there's anything else we can assist you with, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Angel",
        "rating": 5.0,
        "review": "The staff has all been very personable and professional. We have had a few hiccups along the way but it's our first year with them.\n\nI will say that Joseph, the Technician that did a recent service request, is the highlight of RPM. He did such a great job and was very knowledgeable about a variety of issues we were experiencing. He was professional and very personable. He was punctual and responsive throughout and I really appreciated that.",
        "ownerResponse": {
          "text": "Angel,\nThank you for taking the time to share your experience. We're pleased to hear that our staff has been personable and professional. We understand that the first year may have its challenges, and we appreciate your understanding.\nWe're especially delighted to hear about your positive experience with Joseph, our technician. Your kind words about his knowledge, professionalism, punctuality, and responsiveness mean a lot to us. If you ever encounter further issues or have additional feedback, please don't hesitate to reach out. We're here to ensure your experience with Real Property Management North Puget Sound remains exceptional.\nBest,"
        }
      },
      {
        "author": "Ang Nova",
        "rating": 5.0,
        "review": "My husband and I have loved working with RPM. Such kind people, swift responses, helpful. Working with them as a middle man makes us feel really good about our rental.",
        "ownerResponse": {
          "text": "Thank you so much for your kind words! We truly appreciate your feedback and are grateful to have you as valued customers."
        }
      },
      {
        "author": "Georges Smaha",
        "rating": 5.0,
        "review": "Great team to work with. Terry Bertucci has been of great assistance exemplifying the role of maintenance manager. Overall, great experience having Real Property manage my rental.",
        "ownerResponse": {
          "text": "Thank you, Georges! Terry Bertucci is an exceptional and essential part to our maintenance team, and we're grateful to have him. We appreciate your kind words and are delighted to hear that you had a great experience with Real Property Management North Puget Sound managing your rental."
        }
      },
      {
        "author": "Rick Tilton",
        "rating": 5.0,
        "review": "Exceptional Property Management Experience with Real Property Management North Puget Sound.\n\nI recently had the pleasure of working with Frank Volkert and the team at Real Property Management North Puget Sound (RPMNPS) to handle the marketing, tenant screening, and overall management of my property. From our initial meeting to the successful one-year rental period, I couldn't be more satisfied with their services.\n\nOne of the standout aspects of RPMNPS is their commitment to ensuring the property is in optimal condition for attracting quality tenants. Frank Volkert, in particular, demonstrated a keen understanding of the market and provided valuable suggestions to enhance my property's appeal. His recommendations for painting and new floor coverings proved to be instrumental in attracting a pool of applicants.\n\nThe meticulous move-in inspection conducted by RPMNPS's home inspector set the tone for the professional standards upheld by the company. It was reassuring to know that they took the time to thoroughly assess the property before tenants moved in. Equally commendable was the follow-up inspection after six months, demonstrating their commitment to maintaining the property's condition over the long term.\n\nThroughout the process, Frank displayed excellent communication and negotiation skills. From the moment the property was ready, he promptly presented a range of qualified applicants, allowing us to make an informed decision. This proactive approach ensured a seamless transition from property preparation to successful tenant placement.\n\nI appreciate the transparency and efficiency demonstrated by RPMNPS. Frank and his team's dedication to maximizing rental returns and ensuring tenant satisfaction have resulted in a trouble-free rental experience for the past year. I am grateful for their expertise and highly recommend Real Property Management Group Northwest to anyone seeking reliable and effective property management services.\n\nIn conclusion, my experience with RPMNPS has been nothing short of outstanding, and I am confident in their ability to continue delivering top-notch property management services in the future. Thank you, Frank Volkert, and the entire team at RPMNPS, for your professionalism, attention to detail, and commitment to excellence.",
        "ownerResponse": {
          "text": "Thank you, Rick Tilton, for your exceptional review of our property management services at Real Property Management North Puget Sound! We are grateful for your trust and appreciate your kind words about Frank Volkert and our team. Your satisfaction and positive experience over the past year mean a lot to us. We will continue to deliver top-notch property management services with professionalism, attention to detail, and a commitment to excellence. Thank you again for your recommendation!"
        }
      },
      {
        "author": "Sierra Joy",
        "rating": 5.0,
        "review": "Rose and Cynthia were very helpful with me and my partner getting into our next home! Very quick and easy process and I felt very welcomed by the whole team.",
        "ownerResponse": {
          "text": "Thank you for the wonderful review! We're thrilled to hear that Rose, Cynthia, and our team at Real Property Management North Puget Sound were able to assist you and your partner in finding your next home. Providing a quick, easy process and making you feel welcomed is our goal. If you have any further questions or need assistance, please don't hesitate to reach out. We appreciate your feedback!\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Mark Kirshner",
        "rating": 5.0,
        "review": "Ive worked with Greg and team for years. They do a great job managing my rentals. Their Diamond level guarantee is amazing. Great job!",
        "ownerResponse": {
          "text": "Mark,\nThank you for your ongoing trust and the wonderful 5-star review! At Real Property Management North Puget Sound, we greatly appreciate your long-term partnership. We're thrilled to hear that you find our team, led by Greg, to be doing a great job managing your rentals. The Diamond Level Guarantee is designed to ensure excellence, and we're delighted it has contributed to your positive experience. If there's ever anything more we can do for you, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound\n"
        }
      },
      {
        "author": "K T",
        "rating": 5.0,
        "review": "Terry B is outstanding and easy to work with. Working with him has been a joy. He's knowledgeable, friendly, and does great work. Thank you, Terry!",
        "ownerResponse": {
          "text": "Thank you for your kind words, K B! It was a pleasure working with you."
        }
      },
      {
        "author": "Nicole Tennison",
        "rating": 5.0,
        "review": "I highly recommend Real Property Management if you are looking to rent a property. They are professional, great to work with and will take all the stress out of having a rental property. They even have a Diamond Guarantee if a tenant doesnt pay their rent for some reason, you will still get paid!!!",
        "ownerResponse": {
          "text": "Thank you, Nicole! We appreciate your kind words and recommendation. It's great to hear that our team provided you with a stress-free rental experience. We're glad you appreciate our Diamond Guarantee as well."
        }
      },
      {
        "author": "Christine Hoover",
        "rating": 5.0,
        "review": "I am in a business networking group with Greg. He is a great guy and Real Property Management North Puget Sound is a wonderful property management company. Keep your home you thought about selling and rent it out and have Real Property Management handle everything for you!",
        "ownerResponse": {
          "text": "Thanks for your kind words, Christine! We appreciate your support and trust in us to handle your property management needs."
        }
      },
      {
        "author": "Jason",
        "rating": 5.0,
        "review": "If you want a great experience with a company that cares about your rental properties, give RPMNPS a call. Greg and the team definitely will take care of you.",
        "ownerResponse": {
          "text": "Thank you, Jason! We appreciate your kind words and are grateful for your trust in us."
        }
      },
      {
        "author": "Paul Konishi",
        "rating": 5.0,
        "review": "Niko was on time and fixed everything in a timely manner very personable and gracious.  Very professional and a great asset to Rpmnps.",
        "ownerResponse": {
          "text": "Thank you for the wonderful 5-star review, Paul! We're thrilled to hear that Niko provided excellent service and was able to address your needs in a timely and professional manner. We're proud to have him as part of the Real Property Management North Puget Sound team."
        }
      },
      {
        "author": "Jeff Haugland",
        "rating": 5.0,
        "review": "So far they have been fantastic to work with. Possibly a little on the pricey side compared to other companies, however their service and professionalism is well worth the cost. Would definitely recommend.",
        "ownerResponse": {
          "text": "Thank you, Jeff! We appreciate your kind words and recommendation."
        }
      },
      {
        "author": "DEE M",
        "rating": 5.0,
        "review": "Real property management was amazing! As a new tenant and being new to the area they were able to answer all of my questions not just about the property but the area I would be staying in. They were kind, detailed, and patient! They were able to work with me on my move-in date and was willing to stay later, when I couldnt get to them from where I was coming from to get the keys. I wish all property managements were like them.",
        "ownerResponse": {
          "text": "Thank you so much for your kind words and for choosing Real Property Management North Puget Sound! We're delighted to hear that we were able to provide you with the information and support you needed as a new tenant. We truly value your feedback and appreciate your recognition of our efforts. It was a pleasure working with you, and we're here for you whenever you need us."
        }
      },
      {
        "author": "Andrew Freeman Sr",
        "rating": 5.0,
        "review": "Awesome company. since we moved from Texas out here they are the ones that helped us find the right home for my family.",
        "ownerResponse": {
          "text": "Thank you for the fantastic 5-star review, Andrew! We're delighted to hear that Real Property Management North Puget Sound was able to assist you in finding the perfect home for your family after your move from Texas. If you need anything else, please don't hesitate to reach out. We're here to help!"
        }
      },
      {
        "author": "K F",
        "rating": 5.0,
        "review": "Terry Bertucci was\nvery helpful in getting everything I needed scheduled & completed. Joseph Butcher the technician was very helpful as well, knowledgeable & attentive with everything we needed done.\n\nVery happy customer!",
        "ownerResponse": {
          "text": "Thank you so much for your kind words! We're grateful for the opportunity to assist you and we're glad Terry and Joseph were able to provide such helpful and attentive service. We appreciate your business!"
        }
      },
      {
        "author": "Christie Thompson",
        "rating": 5.0,
        "review": "Love Greg at RPM!  They have an incredible diamond guarantee with timely rent payments guaranteed; one of the most important things to landlords.",
        "ownerResponse": {
          "text": "Thank you, Christie! We're so glad you love Greg at Real Property Management North Puget Sound and appreciate our diamond guarantee with guaranteed timely rent payments."
        }
      },
      {
        "author": "Carl Mitchell",
        "rating": 5.0,
        "review": "Terry has been awesome to work with.  He has gone above and beyond to assist with our furnace replacement and hot water tank issues at our rental property.",
        "ownerResponse": {
          "text": "Carl,\nThank you for your 5-star review! We're thrilled to hear that Terry has been awesome to work with and has gone above and beyond to assist with your furnace replacement and hot water tank issues. We appreciate your feedback and the opportunity to serve you. If you have any more concerns or questions, feel free to reach out.\nReal Property Management North Puget Sound \n"
        }
      },
      {
        "author": "Alfred Salvacion",
        "rating": 5.0,
        "review": "Amazing service! Great humble guy! Did all the repairs in a timely manner, hes definitely blessed and highly favored!\n\nThank you for your time!\n\nGreat company",
        "ownerResponse": {
          "text": "Thank you Alfred (Noel) for the kind words. We are happy to take care of your service requests anytime! "
        }
      },
      {
        "author": "Guam Grub",
        "rating": 5.0,
        "review": "Joseph did an exceptionally great job while visiting for the repair. He explained each step of the process as it went along. He was very respectful and courteous. He was professional and quick too! He deserves a raise and a promotion! He definitely represents the company well and knows his stuff! Thank you, Joseph!",
        "ownerResponse": {
          "text": "Thank you so much for your kind words, Guam Grub! We appreciate your feedback and are grateful to have Joseph on our team. He truly exemplifies our commitment to excellent service."
        }
      },
      {
        "author": "Ley Daffodil",
        "rating": 1.0,
        "review": "I cant say anything good about this property management. Moved into a very dirty (but surfaced cleaned, so couldnt tell until actually moving in), poorly taken care of home. Had many issues throughout the stay. Countless emails and complaints. Never were they taken care of. Had inspector come in every 6 months and would tell us every time that their notes and pictures were sent to property owner. And that most of the issues were ongoing before moving in. The stairs/porch/and back patio were unsafe and rotting.\nI understand these are issues that the property owner should have taken care of. But with no help from the property management, we got no where to fix the issues.\nMany times random employees would call or email to ask about lists of things needing to be done without investigating or checking with other employees who have already been made aware of issues. It was a constant cat and mouse game with this property management. It seemed like no one communicated within the office. And nothing was ever taken serious.\nOne night a pipe busted in our bathroom gushing hot water. For hours we couldn't get it to stop. We called the emergency line left a message. No one called back until the morning. Imagine if we didn't figure that out how high our bill would have been or how damaged the house could have gotten.\nThe fridge when we moved in was broken with missing drawers and shelves.\nI don't know how property management could let this home get so bad and not do their due diligence with the owners to fix these terrible issues.\n\nI've since moved out of state. But had I not, I would definitely steered clear of this management company again.",
        "ownerResponse": {
          "text": "We apologize for the experience you had with our property management. We understand your frustration with the cleanliness and maintenance issues you encountered during your stay. We strive to provide a well-maintained living environment for all our tenants and we apologize for falling short in this instance. We apologize for any miscommunication or lack of promptness in addressing your concerns. Please know that we take these matters seriously and we appreciate your feedback. If you have any further concerns or need assistance, please don't hesitate to reach out to us via call or text."
        }
      },
      {
        "author": "tim corr",
        "rating": 5.0,
        "review": "I've been impressed by how professionally these guys are able to track and communicate the various items of a rental home. It feels like they have the best interest of the owner, tenant, and vendor as their aim. Attention to detail and inexhaustible strive for excellence has made Real Property Management North Puget Sound a company I am proud to work with.",
        "ownerResponse": {
          "text": "Thank you, Tim! We truly appreciate your kind words and are grateful for the opportunity to work with you. Your satisfaction is our top priority, and we're glad you've noticed our dedication to excellence."
        }
      },
      {
        "author": "Kimberly Ramirez",
        "rating": 5.0,
        "review": "We love working with Real Property North Puget Sound! Terry and Harrison are quick to communicate and care about their tenants.",
        "ownerResponse": {
          "text": "Kimberly,\nThank you for the glowing 5-star review! At Real Property North Puget Sound, providing excellent communication and care to our tenants is a top priority. We're delighted to hear that Terry and Harrison have exemplified these values during your experience. If you ever need anything else or have further feedback, please don't hesitate to reach out.\nFrank Volkert\nPresident \nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Dave Leach",
        "rating": 5.0,
        "review": "RPM does a very good job of managing my rental property.  They keep the process simple and worry free.",
        "ownerResponse": {
          "text": "Thank you, Dave! We appreciate your kind words and are glad to hear that our property management services have made your experience worry-free."
        }
      },
      {
        "author": "Courtney Evans",
        "rating": 5.0,
        "review": "Greg is wonderful to work with. He is incredibly communicative and very clearly cares about the people he is serving. I would highly recommend!",
        "ownerResponse": {
          "text": "Dear Courtney,\n\nThank you for the fantastic 5-star review! We're thrilled to hear that you had a wonderful experience working with Greg at Real Property Management North Puget Sound. Providing excellent communication and caring service are core values of ours, and we're glad Greg exemplified that. Your recommendation means a lot to us. If you ever need anything else or have further feedback, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Kathy Christiansen",
        "rating": 5.0,
        "review": "We have been very happy with the prompt responses to questions, concerns and service from us as owners and from our renters. I strongly recommend considering using Real Property Management Northwest.",
        "ownerResponse": {
          "text": "Thank you for your kind words! We truly appreciate your recommendation and are grateful for your satisfaction with our prompt responses and service here at Real Property Management North Puget Sound."
        }
      },
      {
        "author": "CJ Stevenson",
        "rating": 5.0,
        "review": "There is so much relief in hiring a property manager! RPM is great and Greg is the best! Highly recommend!",
        "ownerResponse": {
          "text": "Thank you, CJ! We're grateful for your kind words and recommendation. Greg truly is the best!"
        }
      },
      {
        "author": "Allison Vaden",
        "rating": 5.0,
        "review": "I would highly recommend Real Property North Puget Sound as a property manager.  They managed my property for several years.  They were quick to respond to\nany questions or issues.  I always felt like they were taking care of my property and me.  Gail was wonderful to work with, as well as everyone else at Real Property Management.   I wouldn't hesitate to use them again.",
        "ownerResponse": {
          "text": "Allison Thank You so much. We have really enjoyed working with you! Gail"
        }
      },
      {
        "author": "Gina Smith",
        "rating": 5.0,
        "review": "Terry in maintenance has been so helpful and responsive to my many inquiries about the property managed by RPM- Im very appreciative for his quick responses and willingness to assist during this recent storm.",
        "ownerResponse": {
          "text": "Gina,\nThank you for taking the time to leave a 5-star review! We're delighted to hear that Terry in maintenance has been helpful and responsive to your inquiries about the property managed by Real Property Management North Puget Sound. We appreciate your kind words and are glad Terry's quick responses and assistance during the recent storm were valuable. If you have any more inquiries or need further assistance, feel free to reach out.\nBest regards,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound\n"
        }
      },
      {
        "author": "Simon Jones",
        "rating": 5.0,
        "review": "Great experience with RPM! Rose and Cynthia worked with me and are very professional and knowledgeable. I really appreciated their prompt and kind responses to my questions. RPM provides the personal touch that is often missing in our overly automated world.",
        "ownerResponse": {
          "text": "Thank you, Simon! We appreciate your kind words and are thrilled to hear that you had a great experience with us. Rose and Cynthia are fantastic team members and we are glad that their professionalism and knowledge made a positive impact on your experience. We take pride in providing a personal touch to our service and are grateful for your recognition."
        }
      },
      {
        "author": "Nicole Burke",
        "rating": 5.0,
        "review": "The maintenance coordinator Terry has exceptional customer service and made repairs a smooth and easy process! Thankful for his help!",
        "ownerResponse": {
          "text": "Thank you so much, Nicole! Terry is truly amazing at what he does for all our customers here at Real Property Management North Puget Sound and I'm glad he made your repair process smooth and easy!"
        }
      },
      {
        "author": "Sean Taylor",
        "rating": 5.0,
        "review": "Great experience so far with Real Property Management! Very responsive to any and all questions during the leasing process. They are willing to help out whenever. Found me a beautiful home and I am very happy!",
        "ownerResponse": {
          "text": "Thank you for the kind words, Sean! We're glad you had a great experience with us and that we could help you find a beautiful home. We appreciate your feedback!"
        }
      },
      {
        "author": "McTaco",
        "rating": 5.0,
        "review": "Terry is always attentive whether I have a last minute  question or need good direction. RPM really does take care of the people that take care of people.",
        "ownerResponse": {
          "text": "Dear McTaco,\n\nThank you for the outstanding 5-star review! We're pleased to hear about your positive experience with Terry at Real Property Management North Puget Sound. Providing attentive service and reliable guidance is our priority. If you have any more questions or need assistance in the future, feel free to reach out. We appreciate your feedback and look forward to continuing to take care of you.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Blake Nelson",
        "rating": 5.0,
        "review": "Just moved into our rental, and it has been wonderful dealing with RPM. Rose and Cynthia were so great and made the process of getting into the rental so easy. Tons of communication which is always appreciated. Mike with maintenance has been a big help right off the bat just making sure everything is up to par. Best rental management company Ive ever dealt with.",
        "ownerResponse": {
          "text": "Blake, Thank you for your review. We will do all we can to make your tenancy as smooth as possible."
        }
      },
      {
        "author": "Sterile Veneral",
        "rating": 3.0,
        "review": "I wasn't taken away with their customer service as me and my girlfriend are looking for a home and needed help. With verify identification online, and the lady was very rude basically indicated if your to stupid to do that then we don't wanna rent to you",
        "ownerResponse": {
          "text": "So sorry you had a bad experience with customer service. If you were in contact with Real Property Management North Puget Sound you would not have had this type of conversation. We pride ourselves with great customer service and have the reviews to show this.  If we can turn this around for you call us at 425-527-6553 as I can assure you your experience will be top-notch !"
        }
      },
      {
        "author": "Jun Hong",
        "rating": 5.0,
        "review": "RPM was very helpful and stayed in  continuous communication for the entire leasing process. I got most of my help from Rose and Cynthia, and they did everything in their power to make the move in process as painless as possible.",
        "ownerResponse": {
          "text": "Thank you so much, Jun Hong! We truly appreciate your kind words and are delighted that Rose and Cynthia were able to provide you with excellent service throughout your leasing process. We're glad we could make your move-in as smooth as possible."
        }
      },
      {
        "author": "April Oli",
        "rating": 5.0,
        "review": "We've only been with RPM for about a month and so far it's been a great experience with the property management and maintenance team. Ulises has been responsive, reliable. I appreciate their dedication and would definitely recommend their services!",
        "ownerResponse": {
          "text": "Thank you, April! We're grateful for your kind words and glad to hear that you've had a great experience with our property management and maintenance team. Ulises truly values your satisfaction and will continue to provide responsive and reliable service. We appreciate your recommendation!"
        }
      },
      {
        "author": "Suhas Manangi",
        "rating": 1.0,
        "review": "Horrible company and horrible service. I signed up in Sept 2022, paid them 30% of rent in onboarding fees but they did not onboard tenants till late Oct, and didn't collect rent from one tenant for so long that led to eviction. Did the same with another tenant. Lost over 1 year of rents. They charged higher than market prices for placing tenants but below par services. Highly unresponsive management company. I terminated after one year for not meeting quality of service for which they sent a large retailiatory bogus bills. Unprofessional and stay away from them.",
        "ownerResponse": {
          "text": "Suhas, we work very hard for our clients and did our very best in the situation you asked us to help you with.  This a description of what happened.           \nLast year, when you first reached out to us about managing your 4-plex with existing tenants. We started management of units AB&D on 9/19/2022 and Unit C on 9/6/2022.  Unit A had 2 tenant's you had placed previously, that already were not paying you rent, we agreed to help you either get them to pay rent or get them to move on which we did. We got the tenants to vacate in Unit A on 11/30/22. They had trashed your rental so we facilitated a full renovation on Unit A to get it ready for the market by 12/27/2022 and got you new tenants for Unit A by 2/2/2023, this all during the slowest time of year for the rental market. Unit B was also a tenant you had placed before we started managing. She paid October 2022 rent, because of financial/emotional issues, she was not able to pay rent after that so we connected her with Volunteers of America and walked her through the process of applying for rental assistance. VoA assisted in helping her catch up with $5952.50 in rental assistance while she was paying what she could afford each month. However, she eventually stopped paying all-together and didn't apply for more assistance. She was evicted through legal process on 9/14/2023.  Unit 3 and 4 were also tenants you had found that we managed. They have been ideal tenants. Unit 3 & 4 have paid rent through the duration of our contract together. We worked diligently on the situation we were given and it's unfortunate that WA State Landlord Tenant Law mandates take longer than we all would have liked. Regarding the termination fees without proper notice as agreed to in the Management Contract. We discussed this with you and you wanted to terminate without proper notice regardless. "
        }
      },
      {
        "author": "Kassandra Taggart",
        "rating": 5.0,
        "review": "After I learned about how the owners of this RPM office is also investors and only does property management, I knew I needed to also attend their classes and consider this my next investment location. I'm even providing a picture to show you how well the turnout was.  I'm an investor in multiple states and it matters to me that the property manager also understands the investor mindset and will focus on managing my rentals not busy doing a whole lot of nothing.  Frank  & Daniel - thanks for taking the time to speak with me.",
        "ownerResponse": {
          "text": "Thank you Kassandra!"
        }
      },
      {
        "author": "Thomas Ramsell",
        "rating": 5.0,
        "review": "Had a great experience with Frank, Greg, and the team at Real Property management!  Looking forward to a long relationship.",
        "ownerResponse": {
          "text": "Thank you, Thomas! We're grateful to have you as a valued client and look forward to a successful future together as well!"
        }
      },
      {
        "author": "Temi Tope",
        "rating": 5.0,
        "review": "When you almost thought nothing good could come out of a mere view after so many disappointments. With continual feeling of disappointment which creeps in often and almost want you to give up and not make an attempt at something. Real Property Management (RPM) sure comes with ease at a time my family and me needed this relief. Renting a house has never been this easy with us trying for about 3 years (by our experience). Happened to be on Zillow and having fallen victim of scam 2x through Zillow- I saw our new place listed on Zillow, first thing that struck my mind was to scroll down the listing page, check out who made the listing as I wasnt going to move forward if it was listed by an individual but surprisingly it wasnt. I copied the name of the company to browser which sourced them out, I clicked on their website only to find the listing and many more houses listed for rent. That right there gave me a little hope as a start. I scheduled viewing for the next day and I must say RPM team over at Marysville WA, are all phenomenal. Things went too fast and in two weeks we are officially in our new rented place. All thanks to Rep Cynthia & Rose for helping to make the entire process worthwhile and smooth for us. Gods speed of blessings ladies. PS: I have referred two of our family friends for your service.",
        "ownerResponse": {
          "text": "Thank you so much for sharing your experience, Temi Tope! We're grateful to have been able to provide you and your family with the relief you needed. It means a lot to us that you found our listing on Zillow and took a chance with us. We're thrilled to hear that the RPM team in Marysville, WA, especially Cynthia and Rose in our leasing department, made the process smooth and worthwhile for you. Your referrals mean the world to us. Wishing you and your family all the best in your new home!"
        }
      },
      {
        "author": "Adam",
        "rating": 5.0,
        "review": "Rose and her crew were very helpful and made the process as easy and simple as possible. Their communication is second to none.",
        "ownerResponse": {
          "text": "Thanks a bunch for the 5-star review! We're delighted to hear that Rose and the crew made things easy for you. We take pride in keeping our communication top-notch. If you need anything else, just give us a shout.\nBest Regards"
        }
      },
      {
        "author": "Seth Connell",
        "rating": 5.0,
        "review": "The team at RPM NPS provide outstanding service to not just their customers, but vendors too. Harrison and Gail are quick to respond, professional, and courteous. This regions best property managers Ive had the pleasure of working with!",
        "ownerResponse": {
          "text": "Thank you so much, Seth! We really appreciate your kind words and are grateful for the opportunity to work with you."
        }
      },
      {
        "author": "michael woodward",
        "rating": 5.0,
        "review": "The staff here goes well above and beyond.Rose was great. I would recommend them to anyone looking for rental property. Could not have asked for a better group during this time.Thank you so much for everything.",
        "ownerResponse": {
          "text": "Dear Michael,\nThanks for the 5-star review! We're glad Rose and our team could make your experience great. If you ever need help or want to recommend us, feel free to reach out.\nBest,\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Sandy Bowen",
        "rating": 5.0,
        "review": "I have hired rpm this fall to manage my little house in Lake Stevens.\nSo far it has been a very wonderful experience working with Harison. He is so pleasant and easy to work with. He is their maintenance supervisor and maintenance issues can be unpleasant to deal with as a renter but Harison makes it as easy as it could possibly be.\nI have also worked with Chloe and Ruth and they have been wonderful to me.\nThank you RPM!!",
        "ownerResponse": {
          "text": "Thank You Sandy. You have been a great Client to work with as well."
        }
      },
      {
        "author": "Bridgett Alonso",
        "rating": 5.0,
        "review": "John and his team have been wonderful to work with.  Rose and Cynthia were great at getting right back to me when I had questions.  John has been amazingly helpful and has guided me through the process and assisted me in getting in touch with the right person on his team.  I would highly recommend working with the RPM group!  They're fantastic!",
        "ownerResponse": {
          "text": "Thank you for your kind review. We really try to do all we can to make your transition as smooth and easy as possible."
        }
      },
      {
        "author": "Matt Durst",
        "rating": 5.0,
        "review": "Joseph provided us with an excellent experience in resolving our situation with our in-home issue. Not only is very communicative and informative, but provides a directive as to what he will be doing to fix the issue",
        "ownerResponse": {
          "text": "Matt, Thanks for the 5 star review! Glad Joseph could help with your in-home issue. If you need anything else, feel free to reach out."
        }
      },
      {
        "author": "Bri Bri",
        "rating": 5.0,
        "review": "Terry was great, he communicated with me with every step, he never kept me out of the loop.",
        "ownerResponse": {
          "text": "Dear Bri Bri,\n\nThank you for your wonderful 5-star review! We're thrilled to hear that Terry provided excellent communication, keeping you informed every step of the way. At Real Property Management North Puget Sound, we value transparency and are glad Terry delivered on that. If you ever have more feedback or if there's anything else we can assist you with, feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ollie Badmus",
        "rating": 4.0,
        "review": "We have been pleased with the handing of our application by RPM, and we look forward to doing business with RPM. I also stopped by the Marysville office and I was very pleased with the people I met there. Thank you so much.\nOllie Badmus",
        "ownerResponse": {
          "text": "Thank you for choosing RPM! We appreciate your positive feedback and we're excited to have you as our customer."
        }
      },
      {
        "author": "Aubree R",
        "rating": 5.0,
        "review": "Rose and Cynthia were both so helpful during the application and move in process. Very responsive and answered every question we had. This is our first time dealing with a property management company and we are so happy to be working with this team. 10/10 recommend",
        "ownerResponse": {
          "text": " Aubree, Thank you for your kind words and 5 star review. Rose and Cynthia, on our leasing team, are awesome and are always trying to help people with the move-in process. They are a great asset to our \"A\" player team. We are glad to have you as one of our tenants."
        }
      },
      {
        "author": "JC h",
        "rating": 1.0,
        "review": "I would give no stars if I could. Hardly ever return phone calls. messages renters questions about the site because they never show up. When you do have maintenance request you have to wait several days just to get him to show up. if he cant fix the issue they charge you to pay a professional to do it. Than after their professional person comes you need to pay someone yourself to do it because they did not fix the issue. good luck trying to get your money back after you paid for a half done job. Avoid this company at all costs.",
        "ownerResponse": {
          "text": "Hey jeremy h, \nYour review is welcomed and we are sorry you did not have a good experience with us. We always follow Washington State Landlord/Tenant laws. You can always contact us so we can clear up any misunderstanding.\nBest regards Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Ed Schaplow",
        "rating": 5.0,
        "review": "Frank and his people are hard working honest people who know their business well. I highly recommend them",
        "ownerResponse": {
          "text": "Dear Ed,\n\nThank you for the stellar 5-star review! We appreciate your kind words about Real Property Management North Puget Sound and it has been a pleasure to get to know you. We take pride in being hardworking, honest professionals who excel in our field. Your recommendation means a lot to us. If you have any more feedback or if there's anything else we can assist you with, feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ian H.",
        "rating": 5.0,
        "review": "I've been using the service of Real Property Management North Puget Sound for over 4 years.   They are professional and always respond quickly to questions and inquiries",
        "ownerResponse": {
          "text": "Thanks so much for the review, Ian H.! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Saffira C",
        "rating": 5.0,
        "review": "Hey Mark! Sorry for the delay with the review, you are always on point with your emails and having a good sense of humor goes a long way. Your company RPM is lucky to have you! We always welcome your business with Old Republic!",
        "ownerResponse": {
          "text": "Thank you so much, Saffira! Your kind words mean a lot to us and I appreciate you taking the time to leave a review. It's always a pleasure doing business with you and Old Republic."
        }
      },
      {
        "author": "Don Andrews",
        "rating": 5.0,
        "review": "We haves use Real Property Management to rent our home in Marysville for the lat 3+ years.  They removed all the worries about renting. The found great tenants for us, dealt with all the day-to-day headaches that go along with renting your home out.  They walk through the home on a regular basis to make sure all is well and deal with any needs of the tenant.  They have immediate access to the craftsman needed to deal with your home issues.  And, most importantly to me, was that I found them to be people of great integrity.  They do their best!   I will always go back to them to do what they do best.",
        "ownerResponse": {
          "text": "Thank you so much Don, you have been a great client of ours.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Alex V",
        "rating": 5.0,
        "review": "Working with them as one of their contractors is an ace! Their staff is very professional and knowledgeable. Getting a work order is very organized as they have their portal, which is easy to monitor and manage.",
        "ownerResponse": {
          "text": "Thank you, Alex! We appreciate your kind words and are glad to hear that you have had a positive experience working with our team. Your feedback means a lot to us!"
        }
      },
      {
        "author": "Jack Clark",
        "rating": 5.0,
        "review": "As owner of an Everett duplex I found that my experience with Real Property Management was excellent. I liked that the company provided options for lease only, or all the way up to full management services. The screening for financially responsible prospective tenants was really valuable. The video walk-through of the unit by the company  before leasing meant that I got to have only the most serious potential tenants apply, and kept traffic through the unit to the minimum. I was very pleased with the services of this property manager.",
        "ownerResponse": {
          "text": "Jack, Thank you for your business. It has been a pleasure to work with you and your tenants."
        }
      },
      {
        "author": "Tiffany Pacheco",
        "rating": 5.0,
        "review": "Everything has been a breeze w real property management!  from Terry the maintenance coordinator and Rose and Cynthia as well! Thank you! ",
        "ownerResponse": {
          "text": "Thank you for the fantastic 5-star review! We're thrilled to hear that everything has been a breeze with Real Property Management North Puget Sound. Terry, our maintenance coordinator, along with Rose and Cynthia, is delighted to have made your experience smooth. If you ever have more feedback or need assistance, feel free to reach out. We appreciate your trust in us!\n\nBest regards,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Cynthia Marisol Lara Cruz",
        "rating": 5.0,
        "review": "Being working with RPMNPS for over 2 years, the team is incredible!",
        "ownerResponse": {
          "text": "Cynthia,  Thank You you are the best! "
        }
      },
      {
        "author": "saqab husain",
        "rating": 5.0,
        "review": "They made the process simple and were easy to work with. Will be back for future property management needs.",
        "ownerResponse": {
          "text": "Dear Saqab,\n\nThank you for the fantastic 5-star review! We're delighted to hear that you found Real Property Management easy to work with and that we made the process simple for you. We look forward to assisting you with any future property management needs you may have. If you ever need anything, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management\n\nThank you for the fantastic 5-star review! We're delighted to hear that you found Real Property Management North Puget Sound easy to work with and that we made the process simple for you. We look forward to assisting you with any future property management needs you may have. If you ever need anything, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Victoria Isabella",
        "rating": 5.0,
        "review": "Rose and Cynthia were incredibly helpful and knowledgeable! As a newer renter, I had a lit of questions about the lease/unit and they were extremely organized and kind. I loved getting to finish the  paperwork in person because it allowed us to have peace of mind at the key hand over. Exceptional service and thoughtful people!",
        "ownerResponse": {
          "text": "Victoria, thank you for your kind words, Real Property Management North Puget Sound try's hard to make our customer and client's experience the best they can be. Rose, Cynthia and the rest of our team really try hard.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Jake Landeros",
        "rating": 5.0,
        "review": "Awesome procedures for viewing properties! Staff was extremely helpful and welcoming",
        "ownerResponse": {
          "text": "Thank you for the fantastic 5-star review, Jake! We're thrilled you found our property viewing procedures to be excellent at Real Property Management North Puget Sound. Our team strives to be helpful and welcoming, and we're glad you had a positive experience. If you have any questions or need assistance, feel free to reach out. We're here for you!"
        }
      },
      {
        "author": "Charlene Emard",
        "rating": 5.0,
        "review": "Real Property Management made the repairs needed to get the house ready to rent hands off for us. We just gave them the keys and sat back and let them take care of it. They also found us a well qualified tenant in a short amount of time. If you want to rent your property out without the headache of managing everything yourself, then I'd recommend Real Property Management.",
        "ownerResponse": {
          "text": "Charlene, thank you so much for your review. we try hard to make everyone's experience as easy and simple as possible.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Lisa Barthel",
        "rating": 5.0,
        "review": "I just wanted to share what a great choice my family made having RPM manage our Dads property.  it was such a difficult time in our lives.  To make the decision to place him in a nursing home.  RPM did an amazing job helping us with this transition.  I would highly recommend them to manage your properties.  Shout out to Kelly!! No matter how busy.   She always took the time to answer any, and all my questions.  RPM you are very lucky to have such an always pleasant, eager to help, dedicated employee...",
        "ownerResponse": {
          "text": "Thanks Lisa!"
        }
      },
      {
        "author": "Rochelle Fahlman",
        "rating": 5.0,
        "review": "This is a great family owned property management co. I am a real estate broker and refer clients that want to rent out their home. Frank, Danny and team always take excellent care of them. I highly recommend this company.",
        "ownerResponse": {
          "text": "Thank you Rochelle! We have really enjoyed working with your clients and getting them quality tenants. Thank you so much for your business! We look forward to working with you, Todd, Megan, Nanci and the rest of your awesome team in the years to come!"
        }
      },
      {
        "author": "Megan Gates",
        "rating": 5.0,
        "review": "I can't say enough good things about Real Property Management. Everyone there is efficient, friendly and genuinely care about their clients needs. I have worked with them for almost a year now and I would absolutely recommend them to anyone looking for a rental or looking to have a rental managed.",
        "ownerResponse": {
          "text": "Megan, thank you. We appreciate your review and being from the industry, you know what \"good things\" really looks like."
        }
      },
      {
        "author": "Paola S",
        "rating": 5.0,
        "review": "It was my first time renting a home and I wasnt sure what to expect. Gail and the rest of the RPM team went above and beyond to help me through the rental process, answered all my questions and sprinted into action when my home required maintenance. It was a wonderful rental experience! Thank you, Gail and team for caring and for being awesome!!",
        "ownerResponse": {
          "text": "Paola,\nThank you so much for your kind words. Gail and the rest of the team appreciate your time to reach out. Contact us anytime."
        }
      },
      {
        "author": "Kristine C.",
        "rating": 5.0,
        "review": "We have worked with Real Property Management for a few years as a contractor for tree maintenance. They are true professionals, keeping their properties looking great, paying invoices quickly, and displaying excellent communication. As a homeowner, Id feel confident that they would take care of my property, and Im sure theyre great with tenants as well, because they always provide us with special tenant requests/instructions prior to scheduling work.  Kevin Moore and Ashlie Gamero have been especially nice to work with. Great Team!",
        "ownerResponse": {
          "text": "Thank You Kristine"
        }
      },
      {
        "author": "E Smith",
        "rating": 5.0,
        "review": "After months of searching for a rental and dealing with numerous flaky landlords we happened upon Real Property Management North Puget Sound. Not only did we have a place to live within a few days but it's located in the perfect environment for our family. Every time I called I spoke with a real person who was polite, professional, and understanding. We are thrilled with our experience and would highly recommend RPM.",
        "ownerResponse": {
          "text": "Thank you very much for the kind review!"
        }
      },
      {
        "author": "Suede",
        "rating": 5.0,
        "review": "I have been doing business with Real Property Management North Puget Sound for over 7 years.  In my experience they are professional, conscientious, and all-around good people.  COVID regulations presented a unique challenge.  They worked with both tenants and landlords to ensure compliance.  I highly recommend this family-owned, local business.",
        "ownerResponse": {
          "text": "Thank you for your kind words"
        }
      },
      {
        "author": "Josiah Minnix",
        "rating": 5.0,
        "review": "Great property management company. Easy to use website, good communication, quick response to any maintenance issues. Had a recent issue with some maintenance items and Mark was easy to reach and made sure everything was taken care of. Thank you!!",
        "ownerResponse": {
          "text": "Josiah, thank you for your review. We are happy to have Mark and all of our team try very hard to take care of our Clients and Customers."
        }
      },
      {
        "author": "James Dunlap",
        "rating": 5.0,
        "review": "I have been very impressed with Real Property Management. I have worked with them for a while now, and it seems like Frank and his team are always searching for new ways to add value to their business. The landlord workshops are especially helpful in educating folks about the real estate market, applicable laws, and business management.\nI HIGHLY recommend their services!",
        "ownerResponse": {
          "text": "Thank You James for your kind words"
        }
      },
      {
        "author": "Lee Hudson",
        "rating": 5.0,
        "review": "When I decided to enter the real estate investment game about three years ago, my spouse said OK, but only if I promised to hire a property management company.  When I bought our first rehab project, I called 6+ local managers, interviewed and received quotes from 3 and confidently picked RPM-NPS to partner with.  Not only was their pricing good, but they offered services and expertise from both their own collective experience and the knowledge (industry, financial, legal) provided from RPM's company headquarters.  They are a family-owned office that operates with integrity and good customer service - for owners and tenants.  I have always been able to call with questions and get advice over the phone, email or even on site at the property.  We have always worked through any issue together.  For example, the staff in Everett helped me to make decisions about how to best remodel my first property to maximize the rent I could receive and to lower the amount of future repairs and maintenance requirements.  This is knowledge I've applied to other remodels and purchases.  Now that I'm up to a handful of properties, RPM has helped me as a partner the whole way.  They are a critical part of the team I count on in RE investing along with my bankers, RE mentor, legal and insurance.  Knowing RPM is in my corner has been key in having the confidence to keep looking for more investments.  Obviously, I highly recommend Real Property Management - North Puget Sound!",
        "ownerResponse": {
          "text": "Thank you Lee,\nWe appreciate you and all our clients and customers.\n\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Michaela Ircink",
        "rating": 5.0,
        "review": "My first experience with Real Property Management, has been amazing! Crystal was so friendly. She answered all my questions, even the stupid ones, and explained everything so thoroughly. Doing nearly everything electronically, made the process so quick! Thanks to Daniel for being so thorough during our first inspection, makes me feel confidant to know that Real Property Management takes such good care of their units!",
        "ownerResponse": null
      },
      {
        "author": "Dale Bonilla",
        "rating": 5.0,
        "review": "We had a great experience working with Frank and Real Property Management. Frank was able to work and communicate with me effectively, especially with me being out of state. I really appreciate all of the informative data he provided me to make an informed decision on when it came to my rental.  It did not take long for Frank and his team to find a quality renter for my property.  I would definitely recommend Real Property Management!\n\nThanks,\nDale",
        "ownerResponse": {
          "text": "Dale,Thanks for the 5-star review! We're glad you had a great experience with Frank and Real Property Management. If you have more needs or questions, feel free to reach out.\nBest, Frank Volkert\n"
        }
      },
      {
        "author": "Christina Mitchell",
        "rating": 5.0,
        "review": "Working with Real Property Management for the last year has made finding tenants and maintaining my property a breeze. I wanted as much of a hands-off situation for myself as possible, and John and the rest of the team have really delivered! Thank you RPM!",
        "ownerResponse": {
          "text": "Christina,\nThank you so much for your kind words. We do all we can to manage your property in the best way possible for you and your resident both."
        }
      },
      {
        "author": "Kathleen Walsh",
        "rating": 5.0,
        "review": "By far the best property management company we have worked with for many years. They are knowledgeable, professional and approach property management with the landlord as a member of the overall team. They are responsive to us as landlords and our tenants and they provide regular and thorough inspections of our properties giving both us and our tenants peace of mind. Every member of of their team has been a pleasure to work with. We high recommend their services.",
        "ownerResponse": {
          "text": "Thank you James! We have enjoyed working with you, managing your real estate investment portfolio and look forward to the continued success the future will bring."
        }
      },
      {
        "author": "Todd Fahlman",
        "rating": 5.0,
        "review": "I highly recommend Real Property Management North Puget Sound. They have the best prices and offer the greatest service. They will take care of everything for you. Their tenant selection process is second to none. They have a program that will pay the mortgage if the tenant they place doesn't pay their rent. They treat everyone like family.",
        "ownerResponse": {
          "text": "Thank you Todd!! We have really enjoyed our time working with you and your team over the years! Our collaborations have allowed both our companies to better service the real estate needs of many people in the area at a much higher level."
        }
      },
      {
        "author": "Tim Dereg",
        "rating": 5.0,
        "review": "I have been a client of Real Property Management North Puget Sound for several years, and I can honestly say without hesitation that the people at RPM have always treated me more than fairly.  I cannot think of a single instance where they have ever dealt with me in any unfair manner.  I have never worked with any group more trustworthy and honest than the people at RPM.\n\n--Tim Dereg",
        "ownerResponse": {
          "text": "We know there is a lot to leasing your property. We are glad to help you through the property managing process."
        }
      },
      {
        "author": "David Cook",
        "rating": 5.0,
        "review": "From an investor perspective real property management is ideal. First they tell me what property is worth the investment then they make sure nothing goes wrong. Its so easy. Thank you!",
        "ownerResponse": {
          "text": "Thanks for choosing Real Property Management, David! We're thrilled to hear that you found our services easy and ideal for your investment needs."
        }
      },
      {
        "author": "Darcy Gedrose",
        "rating": 1.0,
        "review": "If you rent from this company be prepared to pay imagionary dump fees for items that aren't yours.  Oh when they sent photos of the items disposed of they were from the boarded up house next door where homeless sleep.  Not my stuff at all.  Not even at the same property where I lived and not in the apartment I moved out of.  Just random furniture on some property next door.  Gail decided to charge me for neighborhood clean up.  I guess she can do that on a whim. I was told to reach out for resolution.  There has been none.  I guess they manage the boarded up house?",
        "ownerResponse": {
          "text": "We are sorry if we were wrong in this matter. Please reach out to us and we'll be happy to review the situation."
        }
      },
      {
        "author": "Krysten Drum",
        "rating": 5.0,
        "review": "Amy is awesome! My husband and I were in search of homes during the Christmas holiday, so we were finding it tough to get much response from other property management companies. After much searching, my husband and I finally found a beautiful property for rent through RPM's website. From the time we viewed the property, to submitting our applications and signing the lease, Amy has been nothing but responsive, professional and friendly. The entire move-in process was very seamless and Amy patiently answered all of our questions. It's tough to find a good property management company who is responsive. Thank you, Amy and RPM!",
        "ownerResponse": null
      },
      {
        "author": "Jayson Hathaway",
        "rating": 5.0,
        "review": "Nico did a great job fixing our fan unit in our room!",
        "ownerResponse": {
          "text": "We really appreciate your great review. We hope to be able to continue to have a great relationship with our Clients and Customers"
        }
      },
      {
        "author": "Ricardo Ocampo",
        "rating": 5.0,
        "review": "They are very friendly and help you from beginning to end.  and they are there all the time to help with any problem or question you may have.",
        "ownerResponse": {
          "text": "Thank you for the fantastic 5-star review! At Real Property Management North Puget Sound, we're thrilled to hear that our friendly team has been there to assist you from beginning to end. We appreciate your positive feedback and are always here to help with any problems or questions you may have. If there's anything else you need, feel free to reach out.\n\nBest regards,\nFrank Volkert \nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Faris Talib",
        "rating": 5.0,
        "review": "Amazing support from the management , thanks again specifically for the main focal point person  making the follow up",
        "ownerResponse": {
          "text": "Dear Faris,\n\nThank you for the fantastic 5-star review! We're thrilled to hear about the amazing support you received from our team at Real Property Management North Puget Sound. Whether it's Gail, Harrison, or any member of our dedicated team, we're here to provide excellent service. If you have any more feedback or if there's anything else we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "CD Music",
        "rating": 5.0,
        "review": "Real Property Management North Pudget Sound sets the bar high with their professionalism, client care, and positive attitude. Highly recommend using them whenever possible. We knew we were in good hands when we arrived to the home and Aaron was already waiting there, outside of his car with a suit on and a smile on his face. We worked with Aaron throughout the entire process, and he always treated us well. We encountered other property managers that could learn a lot from RPMNPS! Please keep everyone happy and go with these guys! They are the real deal.",
        "ownerResponse": {
          "text": "Thank you Clint!"
        }
      },
      {
        "author": "Mark Mears",
        "rating": 5.0,
        "review": "I was very impressed with Frank and his team.  As my wife and I evaluated an investment property, Frank always answered our calls and emails.  He gave us constant updates to the changing rental market.  As an out of state investor, Frank is our ONLY choice to manage current rentals and help us evaluate future investments.  We know the tenants are in good hands too.",
        "ownerResponse": null
      },
      {
        "author": "Matthew",
        "rating": 5.0,
        "review": "Real Property Management is a first class business run by honest and competent people who care about their customers and their interests.  They have managed my apartment complex for the last two years now and I could not be happier with the job they have done.  They are one of the few businesses that really do go the extra mile to take care of people.  RPM exemplifies what it means to be a professional.  I look forward to doing business with Frank, Daniel, and the rest of the RPM team for years to come.",
        "ownerResponse": null
      },
      {
        "author": "Daniel",
        "rating": 5.0,
        "review": "RPM has been managing my rental property for the past few years now and they've been doing great, no issues and no complaints from me. Total professionalism from the very beginning, they picked the perfect renters, and the best part is I haven't had to do much more than re-sign another contract with them. Thanks!",
        "ownerResponse": {
          "text": "Thank you Daniel! We have enjoyed working hard to make rental property ownership stress free for you and look forward to working with you for many years to come."
        }
      },
      {
        "author": "Carolann Wheelis",
        "rating": 1.0,
        "review": "Absolutely do not rent from this company. At first they are communicative and responsive, but once you read the lease ALL red flags and gut feelings shouldnt be ignored. Once you move in its nearly impossible to get ahold of someone and when you do no one knows what is going on and passes you along to many different people.\nThe maintenance isnt preformed by the company but the landlords maintenance guy, who is awesome, but creates issues in getting things done in a timely manner.\nThey WILL nickel and dime you for everything, as well as not review your move in statement when creating move out charges.\n\nGail is unprofessional and rude and constantly hands issues over to other people, she once even stated Im not a property manager\n\nas someone whos been a property manager and been in the industry long term the operation is baffling and proves how money hungry these people are. There are many $200 nonsensical admin charges + many more issues.",
        "ownerResponse": {
          "text": "RPM follows all Washington State Tenant/Landlord laws. In all leases that we draft, a tenant agrees to return the property in the same condition it was given to them, minus normal wear and tear. We document in writing and with pictures the condition of the property before a tenant moves in and after a tenant moves out. We are sorry that we could not come to a happy resolution for you."
        }
      },
      {
        "author": "Joni H",
        "rating": 5.0,
        "review": "This is a family run business that we used when we needed to rent our house and move to another state.  Anytime we had questions or were concerned about something, there was always an expert on the staff to ease our minds.  They always treated us professionally and with respect and acted in our best interests.  We would recommend to anyone in the Puget Sound trying to hire a Property Management company.  Thanks for helping us manage our house Frank and team!",
        "ownerResponse": null
      },
      {
        "author": "Melanie Wegner",
        "rating": 5.0,
        "review": "This is a family run business with the efficiency of a large corporation!  Frank and team were personable and accessible with fabulous follow up.  They quickly found the perfect renter for our house and took care of everything while keeping me informed and updated.  They made the process so smooth and easy for me it was well worth it. I don't hesitate to recommend them.",
        "ownerResponse": null
      },
      {
        "author": "firsttimersluck",
        "rating": 5.0,
        "review": "My husband and I are a military couple, so we were concerned about moving and having to leave our home behind to strangers. It was suggested to us to use a property management company so that we wouldn't have to worry about not being able to take care of our tenants and property from across the country.\nBoy, are we thankful we did!\nRPM has been just WONDERFUL for us! They found us tenants far faster than we had anticipated, take care of everything, keep us in the loop without overwhelming us, etc. We could not be more pleased with them! They made what was going to be a scary process for us as first time landlords, painless and easy.\nWe will never use another property management company, plain and simple.",
        "ownerResponse": null
      },
      {
        "author": "Jason J",
        "rating": 5.0,
        "review": "Rose at RPM Puget Sound is amazing. She is thorough and constantly kept us up to date. She is kind, patient and very friendly. I high recommend Rose as she is a confident and compassionate professional!",
        "ownerResponse": {
          "text": "Thanks so much for the review, Jason J!\nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Matthew Terwilliger",
        "rating": 5.0,
        "review": "RPM, since day one has been very prompt, professional, with outstanding communication. Their dedicated customer service helps put my mind at ease & I couldn't imagine managing my rental property without them.",
        "ownerResponse": {
          "text": "Matthew, we appreciate your input. Please reach out anytime.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Kathleen Kelly",
        "rating": 5.0,
        "review": "I had numerous challenges and expenses getting my property ready for re-rent. I am so glad I enlisted the help of Aaron, Rose, Kelly, Crystal and their vendors to complete my tasks.  Rose in particular I am grateful to in finalizing the projects and getting my property rented. Thank you all so much. I would recommend all of them for your rental needs.",
        "ownerResponse": {
          "text": "Thank you Kathleen!"
        }
      },
      {
        "author": "dee romano",
        "rating": 5.0,
        "review": "Daniel and his Team are excellent to work with.  I brought RPM on board when I was having major issues dealing with a rental property and the renter from hell.  It was not his job at that point to be helpful, but he went out of his way to be there for me in a most difficult time.  This young man is wonderful and responsive.  I would recommend him and RPM to anyone looking for an efficient and compassionate partner for their rental properties.  Thank you Daniel",
        "ownerResponse": null
      },
      {
        "author": "Jennifer B.",
        "rating": 4.0,
        "review": "When looking for a rental home in Snohomish County, I was very careful to evaluate rental management companies. I have heard horror stories and experienced one with my last rental property manager. So, when I found a house managed by RPM, I examined Real Property Management Puget Sound closely and found them to be professional, courteous, and timely in their responses. I decided that they were a property management company that I could work with.\n\nAmy Hammer was our leasing agent and she was incredibly friendly and helpful. She walked us through the lease and the requirements before we signed.\n\nOn a scale of 1-5, I would give RPM a 4 (5 being stellar and no way to improve, 1 being \"don't ever work with them\"). The leasing process was smooth and Amy was available to answer any questions/concerns via email. She was very timely in her responses and addressed our concerns and questions well. We have had to put in a few maintenance requests and RPM was always prompt with addressing the requests. The problems we had were with the third party vendors who would often not return RPM's calls. But, that does not reflect on RPM.\n\nReal Property Management exceeded my expectations as far as tenant privacy and autonomy. While there are quarterly walk-throughs, RPM is not overly demanding or intrusive as other property management companies can be.\n\nOne area to improve would be to communicate after a maintenance request has been completed. Two of our maintenance requests are still pending as (I assume, I haven't received communication about them) they are in the process of ordering replacement parts for a light fixture and a refrigerator. Followup emails as to what the plan is would be incredibly helpful.\n\nOverall, I would not hesitate recommending RPM to someone looking to rent a home.",
        "ownerResponse": null
      },
      {
        "author": "Office Manager",
        "rating": 5.0,
        "review": "As an employee of Morgan Maintenance Services, I work closely with Rose Morrison, the Maintenance Coordinator for RPM. Rose and her staff are professional, friendly and efficient. They respond to phone calls and emails quickly and work with us to be flexible when scheduling. As one of their preferred vendors, they always provide us with detailed info so our crew goes into a job prepared. I would highly recommend them!",
        "ownerResponse": null
      },
      {
        "author": "Casey Westerman",
        "rating": 1.0,
        "review": "I've been a landlord and a tenant.  If you're a landlord - this company is solid.  If you're a tenant - I'd stay away from properties managed by this company.  I'll try to keep this short, despite having a lot to say.  To be transparent, I'm writing this review as a tenant, since that was my interaction with RPM.\nMove-in and the checklist took over an hour and a half!  Longest I've experienced as a tenant.  I called their emergency line because there was water under the fridge that continued to appear after wiping it up.  It took them 2 days to get back to me.  Other than that, all was good during our short (3-4 month) lease.  The real headaches came when it was time to terminate our lease early - we paid the steep early termination penalty (which I don't have a problem with, it was a part of the contract and I'm a reasonable person).  They advised when we moved in that we would have to use \"one of (their) approved vendors\" for both the move-out cleaning and carpet cleaning.  This is where the biggest frustration with RPM lays - RPM only had a single vendor for both.  I had no choice at all for who we used.  See my separate review of the cleaning company, Morgan Real Estate Management.  I was at the mercy of those vendors for what they wanted to charge for their services.\nI understand that RPM is working to protect the owner of the rental property.  However, from a tenant perspective, you're going to pay on the backend of your rental.  Personally, I'd stay away from them as a tenant in the future - they aren't reasonable when it comes to services at move-out.",
        "ownerResponse": null
      },
      {
        "author": "Greg Martz",
        "rating": 4.0,
        "review": "These folks have been great to work with.  Responsive and reliable, they are professional and worked hard to help me get my house rented.  Its a great service at a reasonable price.  I shopped around, they give the best value for the money!  They have innovative value added technology and services to keep you informed,account for your funds and protect you from loss.   They also call you back.",
        "ownerResponse": null
      },
      {
        "author": "Laura Larson",
        "rating": 1.0,
        "review": "They are by far and away the worst company I have ever dealt with.  Trying to get a hold of them - NEVER.  Once you do they don't want to help you with anything.  I tried to contact them about a move-out I was sent to 5 different people.  Once I got a hold of someone they were not willing to help me.  Beware current tenant when you move-out they shut all of your portals so you can't get any documentation for work order or items requested for repair.  Oh and don't ask for a copy of any receipt because they won't provide you with one, calling it Privacy with their Vendors.  I have worked in the Property Management business for 35 years and I have never seen such poor management in my life.  So glad that my son now rents through another company.  Owners beware there are a lot more option out their for you.",
        "ownerResponse": {
          "text": "We have never rented to this person. Besides inaccurate information have no record of her and don't know who her son is."
        }
      },
      {
        "author": "Evergreen Lock & Key",
        "rating": 5.0,
        "review": "The folks at Real Property Management are very professional, reliable, and honest. I've had the pleasure of working with them as a contractor for the past couple of years and they definitely know how to treat their clients and vendors. I would highly recommend them!",
        "ownerResponse": {
          "text": "Evergreen Lock, Thank You for your kind words. We appreciate working with fair and reliable business partners like you.\nFrank Volkert\nPresident\nRPMNPS"
        }
      },
      {
        "author": "Katherine Voss",
        "rating": 5.0,
        "review": "We moved from out of state and wanted to get into a new home on a very short timeline. Rose helped us get through the approval process and into our new home very quickly. We love that we had one point of contact throughout the process and that she got to know us and our needs. We are looking forward to enjoying the holidays in our new home thanks to Rose!",
        "ownerResponse": {
          "text": "Katherine, you're very welcome!  :)"
        }
      },
      {
        "author": "Nanci Denney",
        "rating": 5.0,
        "review": "Real Property Mgmt is Amazing!  They care deeply about their property owners and their tenants.  You won't find a better Property management company to rent from or handle your properties.",
        "ownerResponse": {
          "text": "Nanci, we so appreciate you. We aim to please and know that it is our Clients like you and Customers that really keep us in business"
        }
      },
      {
        "author": "Em and Mom",
        "rating": 5.0,
        "review": "From the initial application process to periodic questions and service requests, RPM has been a delight to work with. They are professional, friendly, and always punctual in getting back to us with regard to any requests that we might have.  I trust them as a renter and I would trust them with my property. I highly recommend them!",
        "ownerResponse": null
      },
      {
        "author": "Kelly Hundley",
        "rating": 5.0,
        "review": "Working with Rose at Real Property Management has been a real pleasure.  She was always available for questions and to find solutions to issues that arose during the rental process.  She possess a  professionalism and positive attitude that all owners and renters will find refreshing.",
        "ownerResponse": {
          "text": "Thanks Kelly!"
        }
      },
      {
        "author": "Brian Pollack",
        "rating": 1.0,
        "review": "RENTERS BEAWARE!!!!! Your better off going with williams investment then these guys. Our landlord  sold  our town house with out warning and the new landlord  hired RPM. It was an absolute  nightmare  dealing with them. Their office manager  Gail is extremely  rude and unprofessional. They are extremely  rude when emailing. But when it came to a city bill that we didn't get yet received in the mail,  some how the office got it before us ,the office manager  was hounding  us about paying it but couldn't give us a straight answer  on the return of our deposit.",
        "ownerResponse": {
          "text": "Brian, we are sorry you feel this way. Utilities are the responsibilities of the tenant using the utilities."
        }
      },
      {
        "author": "jordan anderson",
        "rating": 5.0,
        "review": "Been renting from real properties management for 3 yrs now they are a nice group of people who care about people not cash. They just worked there butt off too get me into my very owe stuido. Rose thank you",
        "ownerResponse": {
          "text": "Thank you, Jordan! We appreciate your kind words and are thrilled to have been able to help you find your own studio. It means a lot to us that you feel we genuinely care about people."
        }
      },
      {
        "author": "nelstheviking",
        "rating": 2.0,
        "review": "We used this company to manage our house, and had many bad experiences. They were always extremely difficult to get a hold of and wouldn't answer or return calls or get back to us with information we wanted. At times they charged us exorbitant maintenance fees and wouldn't say what those fees were actually for. Despite having a requirement to call us before spending more than $300 on maintenance they would do it anyway and we would only know when we got the bill. When we had a tenant that stopped paying rent and needed to be evicted they took care of the eviction process, but did nothing to keep us informed of what was happening and never provided sufficient information for us to pursue losses in small claims, despite asking for such information dozens of times.",
        "ownerResponse": {
          "text": "Nels, thank you for your feedback regarding the rental property we have been managing for you for over 3 years.  RPM takes this kind of feedback very seriously and will be reaching out to you to resolve your concerns. At RPM we always get back to clients and tenants within 24 hours of any phone call or email correspondence. We are transparent on our maintenance fees and offer fair yet competitive repair estimates and prices. A detailed description of all maintenance work performed is found on your monthly online statements. In reviewing the repair history at your property I see a couple of emergency water leaks that were fixed expeditiously to prevent further property damage. As your property manager, I assure you, prevention of further damage to your property that water leaks can so easily cause, was our top priority through those repairs. Our communication history shows we kept you posted through the entirety of the emergency water leak repair process. One of those bills was over the $300 pre-approved amount, we informed you and received permission from you to do the work. However, our management contract grants us the authority to act in your best interest in the case of emergency situations such as water, fire, flood, etc.\n\nRegarding the eviction of the tenant that stopped paying rent. Unfortunately, once the lease was signed, we later found out the approved tenant did not move in but instead had moved in his adult daughter, that would not have qualified.  Shortly after the lease started we discovered this and then the rent stopped coming in so we started the eviction process. We walked you through every step of the way. Once the Writ of Restitution was performed, we were at the property per your request when the Sheriff physically removed the resident. Our team here at RPM then removed all the residents property (couches, bed frames, mattresses, dishes etc) from inside the house onto the lawn. We updated you with photos. We would be happy to discuss this further. Thank you."
        }
      },
      {
        "author": "Liz Donadio",
        "rating": 1.0,
        "review": "The lack of responsiveness and professionalism demonstrated by this company, particularly Gail Volkert is unprecedented in my experience. At every opportunity to be of service to me as a property owner, they deferred to my tenant who vandalized my property and left me with several messes, including an infestation in my crawlspace that was never noted or dealt with by RPMNPS. Gail received the final water/sewer bill for $224. and did not attempt to recover from tenant, but rather claimed that I am responsible for this weeks after the fact. This is beyond subpar service and I would not recommend ever doing business with them.",
        "ownerResponse": {
          "text": "I am sorry you feel this way. We don't have control what a tenant does under certain circumstances. Please contact us so we have a chance to look at all the facts. If we have wronged you, we want to make it right."
        }
      },
      {
        "author": "Ron Wilmot",
        "rating": 5.0,
        "review": "Ive been a rental property owner and manager for over 50 years having owned 85 rentals in Or Ca and Wa\nThese included a 23, a 16, 6 and 4 plex. I was looking in the Anacortes area for a charming cozy 2 br home to purchase but hitting too many pending dead ends until I talked to Kellie at RPM at 1:30. She meticulously went over my needs made a call to the listing agent and was able to tell me that subject property had 2 strong ca$h offers but seller was hesitant ...she said Go ahead and make an offer which I did and..lo n behold the seller accepted..a contract was prepared, signed by edocs and buttoned up totally in 3 hours..\nNow Ive been a mortgage lender escrow manager, real estate investor and these 2 gals Really exemplified knowledge and service off any scale. Closing in. A week and a half . Kellie at RPM will handle the management totally for me with tenant application, verifications of capability,, receiving and remitting rent  monthly with reports.\nI was Blown away by their proficiency and teamwork to accomplish SO much in such a 3 hour framework.\nIm so looking fwd to sharing more with Kellie ref our very common backgrounds and enthusiasm that Gets Things Done...\nRon Wilmot",
        "ownerResponse": {
          "text": "Ron, Thank you for your kind words. We try to treat all of our Clients properties here at Real Property Management North Puget Sound, as though we were managing our own. Please contact our office anytime.\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Sydney Mae",
        "rating": 5.0,
        "review": "Easiest and simplest process. Rose and Cynthia were very responsive and on it to get us in a short time crunch. Can feel very good about being a tenant with this company.",
        "ownerResponse": {
          "text": "Thanks so much for the review, Sydney Mae! As we shared we're happy to have you as one of our new tenants.\nRPM strives to give great service and and your feedback was much appreciated.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Jennifer Beadles",
        "rating": 5.0,
        "review": "Real Property Management is the only property management company that I refer my clients to. They are quick to respond, and are always on top of things. They are competitive with their rents, and are always putting their clients first.\n\nFrank has even gone out of his way to pre-inspect properties for out of state investors who are looking to purchase new properties. He is really committed to making sure investors are getting a good return.\nFrank understands the numbers and what makes a good investment, which is a rare find.",
        "ownerResponse": null
      },
      {
        "author": "David Middleton",
        "rating": 1.0,
        "review": "This is the worst property management company I have ever dealt with. Upon moving in my wife and I noticed that the ice maker on the fridge did not work, put a request in to fix it, but was never fixed the entire time we lived at our residence. When asked for a solution owner stated she did not want to replace the fridge, so basically deal with it, great service huh? Pictures show my initial move out inspection and my move out bill, they added an extra charge for weeding. In addition they charged for installation of a smoke detector which is their responsibility.\nAs a member of the United States Navy, I am simply appalled by the service both my family and myself received from this company after following all the rules they set fourth, truly bad business.",
        "ownerResponse": {
          "text": "Sorry about your bad experience. I hope we can improve and learn from this."
        }
      },
      {
        "author": "Matt Hamilton",
        "rating": 4.0,
        "review": "Overall great experience, Eric has been super helpful in the 1.5 years I have lived here the only reason on I gave 4 starts is the other staff sometimes is not as helpful especially when we have issues they seem to do as little as they can to help. Once my roommates cars were towed and they other staff member we spoke refused to help or reimburse us for the wrongful towing. We explained the situation to Eric and he had it cleared up in less than 2 min.",
        "ownerResponse": {
          "text": "This review is directed towards our Bellevue office. Real Property Management Eclipse"
        }
      },
      {
        "author": "Doug Mormann",
        "rating": 5.0,
        "review": "I found the staff at RPM of NPS  particularly helpful as a new renter in the Seattle area.  Gail helped us set up and use the autopay system and the interactive system to report and/or get quick help on routine rental items.  Kevin was able to provide clear guidance on the move out process and timing.",
        "ownerResponse": {
          "text": "Thank you, We're glad to be of service.\n\nFrank Volkert"
        }
      },
      {
        "author": "Nathaniel White",
        "rating": 5.0,
        "review": "RPM has done an excellent job being prompt, accommodating, and getting the job done on multiple occasions, but I want to give a special shout out to Frank, who came out at an inconvenient time to solve a baffling problem. For about a week we had been experiencing the dreaded beep of a fire alarm unit, the only thing is that through several battery changes the beeping wouldn't go away, and the source couldn't be found. This was a serious disruption to our sleep, especially to my wife who has been recovering from surgery and desperately needed the sleep. I explained this all to Frank over the phone and he went out his way to come out and investigate for himself. After some head-scratching, trial-and-error, and sound detection, the source was found, we were able to deactivate it and sleep soundly. I really appreciate RPM and Frank's dedication to protect our quality of living and I'd gladly recommend them to anyone considering a property!",
        "ownerResponse": {
          "text": "Thank you Nathan, I'm glad we found the chirping and you both can get some sleep now.\nFrank Volkert"
        }
      },
      {
        "author": "Pacific Legacy Investments",
        "rating": 5.0,
        "review": "Terry helped  us with timely maintenance issues and has a superb team! Thank you.",
        "ownerResponse": {
          "text": "Thank You so much for your great review!!!! It helps us, our team, our Clients and Customers and helps us serve you better. Thanks Again"
        }
      },
      {
        "author": "Zebb Seabrook",
        "rating": 5.0,
        "review": "From the moment I started conversations with Adam at RPM Everett, this has been the best experience I could have imagined when deciding to hire a property management company.  I have managed my own property for over 10 years and was very close to selling it due to all the headaches of being a landlord, but at the advice of some friends I decided to look into property management and I'm so glad I did.\n\nIt took almost two months from when I first contacted RPM to when I I finally decided to put my rental \"on the market\", and they were extremely patient with me through the whole process, never pressuring me to try and do anything before I was ready.  I had Adam on speed dial and I almost always received a response to a text or email within 5 minutes at any time of the day or night.\n\nThere are a lot of misconceptions and misinformation when it comes to renting out your property and RPM helps you navigate through it all.  Now I never have to worry about getting my rent on time, dealing with a bad tenant, or God forbid dealing with an eviction process.  That peace of mind alone makes me so happy I decided to go with RPM.  If Adam's boss is reading this, give that man a raise.  He went way above and beyond anything I could have ever hoped for.  I hope this will be a very long relationship between me and RPM.  Thanks for everything!",
        "ownerResponse": null
      },
      {
        "author": "Ernest Vigil",
        "rating": 5.0,
        "review": "Real Property Management North Puget Sound delivers a high quality and  excellent experience.  Everything from the administrative communications, Gail w/ office management,  Aaron w/business development,  Kelly w/ maintenance management, and the timing /value of the work of the vendors.  RPMNPS truly cares about the needs of their tenants and handles all their properties with the upmost efficiency.",
        "ownerResponse": {
          "text": "Thank you for the good review. We really do all we can to be honest, fair, have good communication to both our Owner's and Residents.\nSincerely\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "travis orrino",
        "rating": 5.0,
        "review": "Hello this is Travis orrino. I had the pleasure of dealing with the nice lady rose. She was very friendly and very professional. I highly recommend this company.",
        "ownerResponse": {
          "text": "Travis,\nRose is one of our team\"s \"A\" players. We are glad Rose is with us as we are with all our team of \"A\" players. If there is any way we can assist you, Please let us know."
        }
      },
      {
        "author": "Don Berry",
        "rating": 5.0,
        "review": "I have been working with Real Property Management for a while now and have found them to be very professional.\nThe staff is easy to work with and very responsive.",
        "ownerResponse": {
          "text": "Don, thank you for your review. We work very hard to make everyone's experience with Real Property Management North Puget Sound a good one."
        }
      },
      {
        "author": "Marshall Wake",
        "rating": 5.0,
        "review": "I'm a renter and Frank, Daniel and everyone at RPM have been amazing to work with. They don't just put a priority on the homeowner but also us. They are family run and I appreciate how that translates to their business.",
        "ownerResponse": null
      },
      {
        "author": "W01278 MGR4",
        "rating": 5.0,
        "review": "My wife and I have worked with Aaron and Lisa at RPMNPS for a year.  It has been a seamless experience for a new property owner.  Their analysis was spot on, and look forward to working with them for years to come.\nThanks for everything. Adam",
        "ownerResponse": {
          "text": "Adam, Thank you for your kind words. We appreciate you as a Client and will treat you as we would want to be treated."
        }
      },
      {
        "author": "Stephen Bodoh",
        "rating": 5.0,
        "review": "RPM staff have been very helpful with all of the needs for the property. There have been a few things that have poped-up and the staff worked with the owner and got everything addressed in a timely matter.\n\nThe office staff is very helpful and friendly every time I contact them.",
        "ownerResponse": {
          "text": "stephen,\n\nThank you for your kind words. We work very hard to help our customers for whatever they may need."
        }
      },
      {
        "author": "James Robison",
        "rating": 1.0,
        "review": "Be sure to read your lease this company is the worst property management company I have ever dealt with with moving in to moving out the required professional cleaning of a unit. They do nothing on their end, take care of nothing I don't see why a home owner would have them manage their property.\n\nAt the end of your lease be sure to call around and find someone to clean the place carpets and all its only right to leave a place like it was if not better then it was when you moved in. but making me pay out to have a professional come in and clean in is insane.\n\nBut take anyways from this review moving in was a nightmare.\n\nGetting ahold of these people is next to impossible.\n\nAnd moving out in made to be a pain because they don't manage anything getting done. so be ready to lose about 500 of your deposit in cleaning fees because this company requires you to hire a professional.\n\n0/10 would not recommend.",
        "ownerResponse": {
          "text": "Thank you for the feedback.  We are sorry our interaction was not a positive one.  In this case, we were not the active property manager over the past year as this was a Lease-only Agreement with the property owner.  Our role was limited to helping with preparing the property for move-in and tenant placement only. This move-in preparation includes professional cleaning, which was done with receipt kept on file, prior to you moving in. When we met with you to sign the lease we reviewed all these terms with you in detail and all parties agreed to them and signed. Which includes the tenants having the property professionally cleaned upon vacating and to provide receipt. Again we are sorry for your experience and would be happy to discuss further."
        }
      },
      {
        "author": "Square One Home Services",
        "rating": 5.0,
        "review": "Real Property Management is the most professional, understanding, and responsive property management company I have delt with in all my years in the market. They really know how business is supposed to be done. I would recommend them to everyone.",
        "ownerResponse": {
          "text": "Square One\nThank you for your kind words. We try very hard to keep our standards at the highest in the industry."
        }
      },
      {
        "author": "Tabreez Govani",
        "rating": 4.0,
        "review": "Jose was professional in his delivery of the services that Real Property Management was offering. He was through and not rushing while dealing with potential client; ready to listen to the questions and concerns. The is my first time dealing with Real Property Mgmt.",
        "ownerResponse": null
      },
      {
        "author": "Kylie Acacio",
        "rating": 5.0,
        "review": "Crystal responds to any maintaince needs VERY quickly and professionally. She is always willing to help with any issues and has a true concern for her tenants. I would recommend her to everyone!",
        "ownerResponse": {
          "text": "Thank you so much Kylie!"
        }
      },
      {
        "author": "Jerry A",
        "rating": 5.0,
        "review": "Great service provided by friendly people in a very timely manner.",
        "ownerResponse": {
          "text": "Thank you for your kind words! We appreciate your feedback and are glad we could assist you in a timely manner."
        }
      },
      {
        "author": "Wendy Bell",
        "rating": 5.0,
        "review": "The name and number for the person we needed to come evaluate a water leak issue was provided. He came quickly the same day and resolved the issue to our satisfaction.",
        "ownerResponse": {
          "text": "Wendy, thank you for the review. We appreciate your review and will do all we can ton resolve issues as quickly and efficiently as possible"
        }
      },
      {
        "author": "SuperEmueller",
        "rating": 5.0,
        "review": "I recently got in touch with RPM to handle some unruly tenants. They helped us with getting us in touch with a fantastic company called Property Doctors who fully remodeled my home to make it beyond rent ready. Much thanks!",
        "ownerResponse": {
          "text": "You're very welcome!"
        }
      },
      {
        "author": "Jay Bennett",
        "rating": 1.0,
        "review": "This has been by far the worst experience my wife and I have ever had. I could call the office from the time they open till close and can never get anyone on the phone or return a call but I can get a email response in a urgent issue. Move out process was horrific and costly. Then they say the will repair normal wear and tear like small Tac size holes in the wall but then charge for them. And the list of people they give for cleaning and carpet cleaning is a joke. They have one company for each. They find every way to take and take money from you.",
        "ownerResponse": {
          "text": "Jay, we are sorry you feel that way. Signing a Lease is a legal agreement. Breaking a lease is always expensive to the Owner and the Tenant. Real Property Management tries our best to be fair to both parties as dictated by law. For our cleaners, we use the best priced vendors that do the best job in order to be fair for everyone. If they are inadequate or overcharge we want to be aware of it, we won't put up with our Clients or Tenants to be taken advantage of."
        }
      },
      {
        "author": "Irem Erkan Cetin",
        "rating": 5.0,
        "review": "Real Property Management helped us get our dream house in such a short time. They value their customers and they do their job professionally!",
        "ownerResponse": {
          "text": "Thank you for your kind words. We do all we can to work with our Clients and Customers as regulations allow."
        }
      },
      {
        "author": "Joshua McKeown",
        "rating": 5.0,
        "review": "Kevin Moore of Real Property Management North Puget Sound has been great to work with. I always appreciate a person who cares not only about their profession but also cares about the people.",
        "ownerResponse": null
      },
      {
        "author": "Ryan Brancheau",
        "rating": 5.0,
        "review": "Relocating from Kentucky and the entire team removed the stress of house hunting. Lisa, Erin and Gail are amazing people who care truly care about others. Beyond thankful that we were fortunate to work with them.",
        "ownerResponse": {
          "text": "Thank You for your kind words. We are happy to help.\n\nFrank Volkert"
        }
      },
      {
        "author": "hunter akau",
        "rating": 1.0,
        "review": "Communication skills are not strong. Been trying to get ahold of them and heard nothing back for 5 days. Was really excited to rent a house from them but they do not respond.",
        "ownerResponse": {
          "text": "Hunter,\n  I am sorry you had a bad experience trying to rent. We have been swamped with inquiries for the properties we have on the market. It is impossible for us to get to all of them.\n\"Leasing department prides itself on always responding to the result of an application once it's processed.  We apologize if you didn't receive it through our AppFolio system. We have improved our communications regarding notices to applicants as a result of this issue.\"\n"
        }
      },
      {
        "author": "Michelle Richie",
        "rating": 1.0,
        "review": "I wouldnt ever recommend this company! They have done nothing but cause issues, ignore issues with the rental property such as mouse droppings and ant infestation found when we moved it. Never give us the proper notice before they have to have people come inside the house for whatever they need them to do. House was not properly inspected or maintained previous to being listed for rent or previous to our move in date. For a nearly $3,000 a month rental not including any utilities, youd think that we would have more respect towards us and properly maintained property.\nThey are the worst at communication, and now Im just waiting for the day we move out and them to try and blame all the issues this house has on us.\nThankfully I have many messages and pictures with dates, but I really dont want to deal with court.\nMost my complaints cant even go into detail, but PLEASE do not use this company!",
        "ownerResponse": {
          "text": "Dear Current Tenant,\nAs agents for the owner, we are to follow all Washington State landlord and tenant laws regarding the pest control issues you are experiencing at the single-family home you are currently renting. We would be happy to go over the issue, as well as the landlord/tenant law with you and find a resolution. Please contact John at RPM."
        }
      },
      {
        "author": "A A",
        "rating": 1.0,
        "review": "We explained to them that we had poor credit. They said that if our combined credit was under 600, we would just have to pay an extra deposit. Then they denied us because we were 5.5pts below their minimum that they never mentioned. They make their money by lying and cheating people out of their money.\n\nAnd mind you, it took them two weeks to return our call about the property to begin with.",
        "ownerResponse": null
      },
      {
        "author": "Ryan Erdmann",
        "rating": 5.0,
        "review": "They currently run my rental properties and are great with communication so far, their prices are very reasonable and they placed an awesome tenant in my unit. They even got me a slightly higher rent amount than I originally wanted to post it for. Thanks Jose !!",
        "ownerResponse": {
          "text": "Thank you for your kind words and we will continue to do the best we can for you"
        }
      },
      {
        "author": "Regina Rux",
        "rating": 1.0,
        "review": "This company is horrible.  I have family members that recently rented from them.  They had nothing but problems. They had to fight to get things fixed and upon move out they tried to keep their deposit claiming that they left it dirty and didn't patch holes (that were there when thru moved in). They also tried to blame them for a crack in the wall that was clearly a foundation issue. Do not rent from this company.  You will regret it",
        "ownerResponse": {
          "text": "Regina, we are sorry you feel this way and assure you we resolve any and all disputes professionally and promptly with our valued customers. Please call us at our office 425-903-8500, so we can get more information from you regarding who your family members are, if they indeed were our tenants and any resolutions made with them. We look forward to hearing from you."
        }
      },
      {
        "author": "Nicolas Veldhorst",
        "rating": 5.0,
        "review": "Really flexible- understand that people have work and things going on in their lives. Great communicators and available for questions",
        "ownerResponse": {
          "text": "Thank you Nicolas! We appreciate your understanding and value your feedback."
        }
      },
      {
        "author": "E. Clayton",
        "rating": 5.0,
        "review": "Great communication and responses to maintenance requests!!",
        "ownerResponse": {
          "text": "Thank you for the 5-star review! We're so glad to hear that you've found our communication and responsiveness to maintenance requests exceptional at Real Property Management North Puget Sound. It's our goal to ensure your experience with us is top-notch. If there's anything more we can do to assist you, please reach out."
        }
      },
      {
        "author": "Mehedi Hussain Panna",
        "rating": 1.0,
        "review": "Emily scheduled an appointment to show a property. I was there and tried to get a hold of her. Calling number was turned off and was going to her voicemail. After 2 days i was checking again with her on email and figured out its already rented. What a waste of time! Terrible service.",
        "ownerResponse": null
      },
      {
        "author": "Dymphna Wiley",
        "rating": 5.0,
        "review": "Chad is very helpful with any assistance I need. He keeps me updated and informed in a timely manner.",
        "ownerResponse": {
          "text": "Dymphna, Thank you for your review."
        }
      },
      {
        "author": "Vanessa Quevedo",
        "rating": 5.0,
        "review": "Very professional and great service.  They answer back to your concerns very quickly! It was been very easy to work with them and would rent from them again in the future.",
        "ownerResponse": {
          "text": "Thanks so much for the review, Vanessa Quevedo!\nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Denise Keffeler",
        "rating": 1.0,
        "review": "We had been calling emailing to see a home listed by them for approximately 2 weeks  Finally we just applied for the house without actually seeing it, spend the $100 for fee and finally receive an email that the house was rented   Better get my money back.  :/",
        "ownerResponse": {
          "text": "Denise, thank you for coming in to pick up your refund check for the application fee you paid. In this situation you applied just before we approved an applicant for the property. We apologize for your inconvenience and felt in this situation full reimbursement was the fair and honest thing to do.\nBest wishes- The RPM Team"
        }
      },
      {
        "author": "Colby Flowers",
        "rating": 5.0,
        "review": "Very professional and very helpful through the move in process",
        "ownerResponse": {
          "text": "Thank you for the fantastic 5-star review! We're delighted to hear that you found our team at Real Property Management North Puget Sound to be professional and helpful during your move-in process. If you ever have any more feedback or if there's anything we can assist you with, feel free to reach out. We appreciate your trust in us!"
        }
      },
      {
        "author": "Ted Stryker",
        "rating": 5.0,
        "review": "Prompt straight forward responses to my questions.",
        "ownerResponse": {
          "text": "Thank you for appreciating our prompt and straightforward responses!"
        }
      },
      {
        "author": "Joyce Kwan",
        "rating": 4.0,
        "review": "Having a good experience with them and all the staff.",
        "ownerResponse": {
          "text": "Dear Joyce,\n\nThank you for the wonderful 5-star review! We're delighted to hear that you're having a good experience with Real Property Management North Puget Sound and our staff. If you have any specific feedback or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Alexis Sorby",
        "rating": 5.0,
        "review": "Mark is wonderful! So cheerful and great to talk to, love working with this company",
        "ownerResponse": {
          "text": "Alexis, Mark and the team here at Real Property Management North Puget Sound aim to take care of our customers"
        }
      },
      {
        "author": "Mariam Tariri",
        "rating": 5.0,
        "review": "Daniel and his team are very honest and clear about what they do. They have great communication and services they provide are the best in their field. Thank you RPM",
        "ownerResponse": null
      },
      {
        "author": "Bruce Wayne Davis",
        "rating": 5.0,
        "review": "Real Property Management North Puget Sound company is \"Real\" People \"Real\" Service and really an awesome experience.",
        "ownerResponse": {
          "text": "Bruce, thank you for your review. Your comments mean a lot to us."
        }
      },
      {
        "author": "Joshua Ossinger",
        "rating": 5.0,
        "review": "Responsible, dedicated, and on top of their property management. These guys really are perfect for taking away the headache for your investment property!",
        "ownerResponse": {
          "text": "Thank you Josh! It has been great working with you and we look forward to a bright future together."
        }
      },
      {
        "author": "Ahmed Omar",
        "rating": 5.0,
        "review": "Super helpful and professional.",
        "ownerResponse": {
          "text": "Thank you for your 5-star review!"
        }
      },
      {
        "author": "Gerardo Corts",
        "rating": 5.0,
        "review": "Great full",
        "ownerResponse": {
          "text": "Thank you so much, Gerardo! We appreciate your kind words."
        }
      },
      {
        "author": "Ben Silvey",
        "rating": 5.0,
        "review": "Ulises in the maintenance department is quick and communicative. Thank you.",
        "ownerResponse": {
          "text": "We appreciate your kind words about Ulises in maintenance! Thank you."
        }
      },
      {
        "author": "Domenico Minotti",
        "rating": 5.0,
        "review": "Prompt response and good attention to details",
        "ownerResponse": {
          "text": "Dear Domenico,\n\nThank you for the excellent 5-star review! We're delighted to hear that you appreciated our prompt response and attention to detail at Real Property Management North Puget Sound. Providing top-notch service is our priority, and we're glad it made a positive impact on your experience. If you have any more feedback or if there's anything else we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Tymon Johns",
        "rating": 5.0,
        "review": "These guys know the ins and outs of the business and really take care of their customers. Great property managers!",
        "ownerResponse": {
          "text": "Thank you!"
        }
      },
      {
        "author": "Cary Gammon",
        "rating": 5.0,
        "review": "Very responsive. Rented my property within 30 days. Highly recommend.",
        "ownerResponse": {
          "text": "Thank you for the 5 Star Review Cary! It has been our pleasure in doing business with you! We look forward to taking great care of your property, tenants and your investor friends and their properties you most recently referred to us to manage."
        }
      },
      {
        "author": "Sarah Blakeley",
        "rating": 5.0,
        "review": "Amy did an excellent job communicating information between the landlord and myself in a timely manner. Thank you so much for your help!",
        "ownerResponse": null
      },
      {
        "author": "Brandie Ogden -walburn",
        "rating": 5.0,
        "review": "Very good. Polite professional people",
        "ownerResponse": {
          "text": "Thank you, Brandie! We appreciate your kind words and are glad to hear that our team provided polite and professional service."
        }
      },
      {
        "author": "Levi Sutton",
        "rating": 5.0,
        "review": "Great people that take the stress out of property management.",
        "ownerResponse": {
          "text": "Thank you Levi! It has been a real pleasure managing your rental property in Everett these last several years. You are an ideal client and we are grateful to be able to work with you and your property."
        }
      },
      {
        "author": "Aliou Lo",
        "rating": 5.0,
        "review": "Great company\nVery good customer service",
        "ownerResponse": {
          "text": "Thanks so much for the review, Aliou Lo! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Mark Pollard",
        "rating": 1.0,
        "review": "I would never rent a place managed by them again! I can't even explain how wrong they have done my family an I.",
        "ownerResponse": {
          "text": "We are sorry you feel that way. The Owner is doing a complete remodel on the property. We hope for you the best."
        }
      },
      {
        "author": "Debbie Benlien-Cotten",
        "rating": 5.0,
        "review": "I love working with Real Property Management they are great!",
        "ownerResponse": null
      },
      {
        "author": "Michael Robertson",
        "rating": 5.0,
        "review": "Very good to work with. If there are issues they are quick to resolve.",
        "ownerResponse": {
          "text": "Hi Michael, thank you for your kind words. We have enjoyed managing your property and reciprocate that you have been a very good to work with client. We look forward to a great business relationship with you for years to come."
        }
      },
      {
        "author": "David Kim",
        "rating": 5.0,
        "review": "Great rental management company. Highly recommended.",
        "ownerResponse": {
          "text": "Thank You Kim\n\nFrank Volkert"
        }
      },
      {
        "author": "Christopher Thompson",
        "rating": 5.0,
        "review": "Rose is incredibly professional and helpful!",
        "ownerResponse": {
          "text": "Thank you Chris!  Your review shares that RPM does take the time for questions and answers with applicants and tenants."
        }
      },
      {
        "author": "Robert Gracia",
        "rating": 5.0,
        "review": "I work here awesome team",
        "ownerResponse": {
          "text": "Robert, it has been a pleasure working and growing with you this year! Looking forward to a 2023 of continued success! "
        }
      },
      {
        "author": "Jessica Hulett",
        "rating": 5.0,
        "review": "Mark was very helpful!",
        "ownerResponse": {
          "text": "Jessica, thank you for the great review! You are right, Mark is a great member of our team. Pleas reach out to us for any needs you might need."
        }
      },
      {
        "author": "Alex Otness",
        "rating": 5.0,
        "review": "Friendly, Fast, helpful",
        "ownerResponse": {
          "text": "Thank you, Alex! We appreciate your kind words and are glad to hear that you found our service friendly, fast, and helpful."
        }
      },
      {
        "author": "Aaron",
        "rating": 5.0,
        "review": "So far so good",
        "ownerResponse": {
          "text": "Thanks so much for the review, Aaron! \nWe strive to give great service and and your feedback is welcomed.\nYour welcome to contact us if you want to give us additional feedback on how we can serve you and others better.\nBest regards, Real Property Management - North Puget Sound"
        }
      },
      {
        "author": "Emad Qaifa",
        "rating": 5.0,
        "review": "Thank u",
        "ownerResponse": {
          "text": "Emad,\nI am sorry for the experience you had. We really try to be responsive to all our calls and requests. I will look into it. Hopefully we can use this to improve our services.\n\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Charles Brooks",
        "rating": 1.0,
        "review": "Extremely unprofessional and very misleading",
        "ownerResponse": {
          "text": "We are sorry you feel this way. We do all we can to be honest and fair to both our owners and residents\n\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Nicholas Williams",
        "rating": 1.0,
        "review": "Thieves",
        "ownerResponse": null
      },
      {
        "author": "Zoi Encinas",
        "rating": 5.0,
        "review": "Their efficient",
        "ownerResponse": {
          "text": "Thank you Zoi! Our team works hard everyday to provide the best customer service in the industry! We appreciate your business and look forward to working with you to get the greatest results out of your rental properties in the years to come!"
        }
      },
      {
        "author": "Robin Croke",
        "rating": 5.0,
        "review": "I love Real Property Management. They're one of the few US based property management companies in the PNW. You can always reach someone on the phone and they're not talking to you from some script. Very professional, attentive to tenants and homeowners needs and they only hire the best contractors to make repairs. Highly recommend RPM",
        "ownerResponse": null
      },
      {
        "author": "Puchita Mtz",
        "rating": 5.0,
        "review": "I highly recommend this company where they very kindly help you look for the house that you have in mind, I give them 100% confidence, they are kind, trustworthy and they always answer my questions 100%.",
        "ownerResponse": {
          "text": "Puchita, Thank you for using us for your housing needs."
        }
      },
      {
        "author": "Shawna Hershaw",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "m m",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 5-star rating! We appreciate your support!"
        }
      },
      {
        "author": "Justin Gifford",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any feedback or questions in the future, feel free to reach out."
        }
      },
      {
        "author": "Angel Beltran",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you, Angel, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any questions or need assistance in the future, please feel free to reach out.\n\n\nThank you, Angel, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any questions or need assistance in the future, please feel free to reach out.\n\n\n\nThank you, Angel, for the 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any questions or need assistance in the future, please feel free to reach out.\n\n\n\n"
        }
      },
      {
        "author": "Mary Key",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for your 5-star review!"
        }
      },
      {
        "author": "Whitney Beck",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "We have no record of a \"Whitney Beck\" on any of our records. Please contact us, if you are a customer of ours, we want to resolve any concerns."
        }
      },
      {
        "author": "Peaches George",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "\nThank you, George, for the stellar 5-star review! We're thrilled you had a positive experience with Real Property Management North Puget Sound. If you ever have any further feedback or if there's anything else we can assist you with, please don't hesitate to reach out. We appreciate your support!\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Jill Swick",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Welcome again as a new tenant with RPM.  Thank you for your 5-star review!  "
        }
      },
      {
        "author": "Henok",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Henok,\n\nThank you for the fantastic 5-star rating! We appreciate your support of Real Property Management North Puget Sound. If you have any specific feedback or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "jon brown",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for your 4-star rating! We appreciate your support."
        }
      },
      {
        "author": "Nafis Rassa",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 5-star rating, Nafis! We appreciate your support."
        }
      },
      {
        "author": "Al Hocy",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Al,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you ever have specific comments or if there's anything more we can assist you with, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Braden Roseborough",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Braden,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you have any specific comments or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ian stoa",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Ian,\n\nThank you for the 5-star rating! We appreciate your positive feedback. If you have any specific comments or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Brody Bos",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Brody,\n\nThank you for the fantastic 5-star rating! Your positive feedback means a lot to us at Real Property Management North Puget Sound. If you ever have specific comments or if there's anything more we can assist you with, please don't hesitate to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "marci reichert",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Marci,\n\nThank you for the 5-star rating! Your positive feedback is appreciated. If you have any specific comments or if there's anything more we can assist you with, please feel free to reach out.\n\nBest regards,\nFrank Volkert\nPresident\nReal Property Management North Puget Sound"
        }
      },
      {
        "author": "Ayman Al-Kahlil",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for the 5-star rating! We appreciate your feedback and are delighted to know you had a positive experience with Real Property Management North Puget Sound. If you ever have any questions or need assistance in the future, feel free to reach out. We're here for you!"
        }
      },
      {
        "author": "james bahe",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We're thrilled to receive your 5-star rating! Thank you for choosing Real Property Management North Puget Sound. If you ever have any questions or if there's anything we can do for you, don't hesitate to reach out. Your satisfaction is our priority!"
        }
      },
      {
        "author": "Sarah Pettinger",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "We appreciate your 5-star rating! If you have any specific feedback or suggestions to enhance your experience further, please feel free to share. We look forward to serving you."
        }
      },
      {
        "author": "Avni Mehrotra",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Anvi, Thank you for your fantastic 5-star review! We appreciate your support. If you ever have any questions or need assistance in the future, feel free to reach out. We're here for you!"
        }
      },
      {
        "author": "Devin Luke",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for the 5-star rating, Devin!"
        }
      },
      {
        "author": "Ket Nik",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for the 5-star rating! We appreciate your support."
        }
      },
      {
        "author": "Zach Port",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 5-star rating, Zach! We appreciate your support."
        }
      },
      {
        "author": "Sammy Hoff",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you so much for the 5-star rating, Sammy! We appreciate you supporting us!"
        }
      },
      {
        "author": "tasuku thompson",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 4 star review Tasuku! We really strive to provide 5 Star service and would appreciate if you would reach out to us and let us know what we can do better to make your experience a 5 star one next time. We look forward to hearing from you soon!"
        }
      },
      {
        "author": "Geno Oliva",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Geno for the 5 Star review!"
        }
      },
      {
        "author": "Jacob Elenbaas",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the 5-star rating, Jacob! We appreciate your support."
        }
      },
      {
        "author": "Miguel Rivas Perez",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Miguel, We are sorry you had a bad experience with us. We pride ourselves on communication. We'd be happy to work with you again in the future. If you would like to share your issue with us, it would be helpful so we can better improve our customer service. Thank you :)"
        }
      },
      {
        "author": "Sana Pervaiz",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "We're sorry you have had a bad experience. We strive to provide a high level of customer service with all our customers."
        }
      },
      {
        "author": "Jeff Chen",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Jeff, thank you for your review. Please let us know what we can do to improve our company up to a 5 star. "
        }
      },
      {
        "author": "Shauna Sullivan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Shauna,\nThank you for the 5 star review. We are happy you chose Real Property Management. we'll do all we can to make your resident experience a good one."
        }
      },
      {
        "author": "Richard Duncan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Richard,\nThank your for your kind review. Please reach out to us anytime."
        }
      },
      {
        "author": "Margaret Gall",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Margaret,\nThank you for your 5 star review. We would like to hear from you, if you have a minute, we like to know what we are doing right."
        }
      },
      {
        "author": "Ryan James",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Ryan,\nThank you for your review. We appreciate your support and confidence."
        }
      },
      {
        "author": "ryan barlass",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Ryan,\nThank you for your 5 star review, feel free to reach out anytime."
        }
      },
      {
        "author": "Chris Rey",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Chris,\nThank you for your review. We like to hear how we are doing so please contact us anytime."
        }
      },
      {
        "author": "Tiffany Mendonca",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Tiffany,\nThank you for your review. We appreciate you taking your time for it."
        }
      },
      {
        "author": "Susan Moy",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Susan,\nThank you for your 5 star review. we appreciate our Clients."
        }
      },
      {
        "author": "Eric Mattson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Eric, Will you contact us? We are unaware of any issues. We would like to address anything that would cause you concern. especially since we have been managing the property for less than a month. Please contact us."
        }
      },
      {
        "author": "Darth Corn",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Daniel,\n\nThank you for your 5 star review. We really appreciate hearing from our Owners!"
        }
      },
      {
        "author": "ashly Swearingen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "We are sorry you had a not so ideal experience."
        }
      },
      {
        "author": "Alex",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Alex, Thank you for your review."
        }
      },
      {
        "author": "Rich Hart",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Rich for your support of Real Property Management !"
        }
      },
      {
        "author": "kristina kovacs",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Kristina, we at RPM are sorry that you had a bad experience as a tenant. We follow all Washington State Landlord/Tenant laws. If you feel we have breached the lease agreement, we will be happy to sit with you and go over the lease that was signed and to clarify anything."
        }
      },
      {
        "author": "Eugene Butler",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank Eugene\n\nFrank Volkert\nPresident\nReal Property Management\nNorth Puget Sound"
        }
      },
      {
        "author": "Kyra Shantice James",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "We wish we could have served you more to your satisfaction"
        }
      },
      {
        "author": "Ardis Allyn",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Ardis, we checked our records and we don't have you as a tenant or owner"
        }
      },
      {
        "author": "Shawn and Trisha Daby",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank You for the 5 star review"
        }
      },
      {
        "author": "James Pace",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "James, Thank you for your rating. We are glad to have you as one of our associates."
        }
      },
      {
        "author": "Hanjin Miao",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Hanjin for the great review! We have really enjoyed managing your two rentals over the last several years."
        }
      },
      {
        "author": "Heloisa Callado",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Heloisa!"
        }
      },
      {
        "author": "Elaina Hatch",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mack Jokray",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "We don't know this person. We have no record of this person. Mack, If there was a dis-service we would like to make it right."
        }
      },
      {
        "author": "Adam Bryant",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Britton Kinder",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "bruce willis",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 196,
  "adjusted_average_rating": 4.47,
  "average_rating": 4.42,
  "summary": {
    "text": "<section><h2>Good</h2><p>Real Property Management North Puget Sound (RPMNPS) appears to excel in professionalism and responsiveness, with tenants noting prompt and efficient service in addressing maintenance requests and issues. Staff members, including Terry, have been praised for their unwavering support and dedication to ensuring a comfortable tenant experience. Customers appreciate RPMNPS for its communicative approach, with some highlighting the company's ability to relieve the stress associated with property management. Examples of particular employees who have garnered individual accolades for their assistance include Joseph Butcher for his attention to detail and problem-solving skills, as well as Rose and Cynthia for their help with the move-in process.</p></section><section><h2>Great</h2><p>The RPMNPS team is described as caring, with customers feeling that their needs are genuinely considered. Tenants have mentioned the convenience of the company's online systems for rent payment and maintenance requests. Additionally, the company has been commended for expert advice on property value and investment insights, emphasizing their value to property owners. The kindness and helpfulness of RPM employees during the application and leasing processes, as well as during occupancy, have consistently been a theme in the positive reviews.</p></section><section><h2>Bad</h2><p>Some tenants have encountered less than satisfactory experiences with RPMNPS. There have been instances of delayed responses and perceived inadequacies in communication, particularly when trying to view or inquire about properties. Maintenance issues have sometimes not been resolved to the satisfaction of tenants, and challenges have also arisen during the move-out process, where tenants had trouble receiving assistance or clarification from staff.</p></section><section><h2>Ugly</h2><p>The company's handling of security deposits and move-out charges has come under fire, with tenants expressing frustration over unexpected fees and charges for what tenants believe should have been considered normal wear and tear. Accusations of mismanagement have arisen, with some former tenants suggesting that RPMNPS displayed a lack of professionalism and fairness. In these cases, it seems that regardless of the company's positive aspects, the experiences of certain tenants have tainted their overall perception of the property management company.</p></section>"
  },
  "created_timestamp": 1725642000
}