{
  "name": "Regency Park Apartments",
  "slug": "regency-park-apartments",
  "company_type": "property",
  "address": "2050 Fraser St, Bellingham, WA 98229",
  "review_count": 165,
  "average_rating": 3.55,
  "reviews": {
    "google_reviews": [
      {
        "author": "sheila harrison",
        "rating": 5.0,
        "review": "The staff does an amazing job. They are all great and make this feel more like a family. Terry has been making sure everything is looked at and we are given the ok to play with chalk again and for the kids to ride bikes!",
        "ownerResponse": null
      },
      {
        "author": "Nicoll Ferrari (Nikki)",
        "rating": 5.0,
        "review": "I have to say that so far I really enjoy living here, for a Huge Apartment complex the ladies in the office and maintenance guys really stay on top of things! Communal living always has it challenges but it feels very homey and comfortable here. Beautiful trails and greenery surrounding the property if you like to go for walks too : )",
        "ownerResponse": {
          "text": "Hey Nicoll, Thanks for the great review! We appreciate your recognition and will do our best to keep up the great work! We work hard to provide customers with a great experience and look forward to continuing to do the same for you! We're here for you anytime!"
        }
      },
      {
        "author": "Chris Wells",
        "rating": 3.0,
        "review": "I have a friend who moved here.   His apartment was not ready to live in.  No one hooked the dryer up.  Holes in the walls.  I understand this is a section 8 unit but everyone deserves a walk through before moving in.  By providing section 8 they get a huge tax break.",
        "ownerResponse": {
          "text": "Hi Chris, \nThank you for bringing this to our attention. We are fortunate to be able to participate in Washington State's affordable housing program which comes with specific rules we follow. We understand your frustration and if you would like to contact us please email us at live@regencywa.com.\nSincerely,\nRegency Park MAnagement Team"
        }
      },
      {
        "author": "Alex Fick",
        "rating": 5.0,
        "review": "Maintenance has always respond to my concerns in a timely manner.",
        "ownerResponse": {
          "text": "Greetings Alex, Thank you for taking the time to share your experience. We are happy to read that our team has been able to provide exceptional service for you. We hope to become one of your favorites. Let us know what we need to do to earn your continued loyalty. See you next time!"
        }
      },
      {
        "author": "Kamaya Gonzalez",
        "rating": 5.0,
        "review": "I currently live here and I must say that for such a big complex of apartments, it is very much in order, and well maintained. Daneen and Diane are extremely wonderful managers who ,as I can only imagine, deal with many many issues throughout everyday, but still every time one walks in the office...you are greeted with a smile and a very courteous offer of assistance.\nI thank HNN properties for employing such great ladies for our office staff!",
        "ownerResponse": {
          "text": "Hey Kamaya, Thanks for the kind words! We value your feedback and look forward to seeing you again soon! As always, our team is looking forward to your next visit. See you soon!"
        }
      },
      {
        "author": "James Steele",
        "rating": 5.0,
        "review": "I have lived at Regency Park Apartments since 2009. Have REALLY enjoyed the place. There is a swimming pool, a movie theatre, an office to use computers, and a great bunch of friendly neighbors! The office staff will bend over backwards to help you with any problems that may arise. There are washers and driers in the apartments, and saved car spaces for a fee. Close to shopping, schools, and the bus line runs near it. Come check us out!",
        "ownerResponse": {
          "text": "James, Thank you for the awesome feedback. We value your feedback and look forward to seeing you again soon! Please reach out to us with any additional questions or comments!"
        }
      },
      {
        "author": "Tommy Mans",
        "rating": 4.0,
        "review": "Diane Park gave me a business card and said I was logged in with my yahoo email in 2023. The pool looked clean and lobby area is well organized. I had applied for housing there about 8 months ago.",
        "ownerResponse": {
          "text": "Hello Tommy, Thanks so much for taking the time to share your positive experience! It's great to know that we were able to provide you with the highest levels of service. We hope to continue exceeding your expectations with great service. Thanks again and we look forward to seeing you again soon."
        }
      },
      {
        "author": "Crysta Jameson",
        "rating": 5.0,
        "review": "Staff very respectful and helpful, there is a Theater Room, workout Room, a swimming pool and a hot tub, which are definitely perks of being here, but not during a pandemic, ",
        "ownerResponse": {
          "text": "Hi Crysta, \rThank you for your kind review. We are happy to pass along your comments to our team! We appreciate knowing how we are doing. We do have awesome amenities here and are looking forward to reopening them when it is safer to do so while following the Washington State Safe Start Guidelines.\r\rWarm Regards,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Os Sht",
        "rating": 5.0,
        "review": "I have lived here for almost three years now with my wife and kids. We have been blessed with living at regency park since day one. The staff in the front office is wonderful, the maintenance team is by far I've ever seen in any residence. You can tell they truly care about each family that lives here. They go above and beyond and try extremely hard. Thank you to every single person that works here to make it so wonderful. Bless you all!",
        "ownerResponse": {
          "text": "Oleg, thank you so much for your very kind review. Reviews like this give us motivation and help us ensure we provide high-quality care. It is wonderful to know that we have had such a positive impact. Our team strives to deliver an excellent experience, and are glad you found this to be the case during your residency. \r\r-Regency Park Management Team"
        }
      },
      {
        "author": "Steven Seagal",
        "rating": 1.0,
        "review": "BEWARE! The new \"head\" of maintenance almost assaulted me in the parking lot near his Dodge Magnum. I had to make this private account because you can't complain anymore without being chastised (Julie is no longer here to take tenants seriously anymore). The large, Bald male with a red beard cursed me out and proceeded to threaten me with physical violence over their inability to keep the dumpster clear. The only reason I didn't call the police is because I diffused the situation by leaving the scene. This is my first time having to post a bad review for Regency, but they need a new maintenance crew. Many other people are complaining about him as well, BEWARE!",
        "ownerResponse": {
          "text": "Hi Steven,\nThank you for reaching out and bringing this to our attention. Our records indicate that there is no resident by the name of Steven Seagal. If you would like to speak to us please call us at 360-392-8050, or email us at residents@hnnwa.com. so we may talk more directly.\nSincerely,\nHNN Resident Relations Team"
        }
      },
      {
        "author": "Megan Phipps",
        "rating": 4.0,
        "review": "I've had great experience with this complex so far! I haven't lived here long, but getting in was such a pleasant experience I absolutely love the ladies in the office. I had new carpets and hardwood when I moved in, loved it!",
        "ownerResponse": {
          "text": "Megan,\nThank you for your kind review; we are happy to pass along your comments to the team here at Regency Park Apartments!\nRegards,\nRegency Park Management Team"
        }
      },
      {
        "author": "Hank Holland",
        "rating": 1.0,
        "review": "Deneen is a manipulative, conniving lady. The new maintenance guy (dwarfish, red-bearded lumberjack) is the most DISRESPECTFUL, racist, rude person we've ever met. He is the reason we are reporting Regency to Tenants Revolt. He called us discriminatory names under his breath while inspecting our apartment (after 9 years of living here, we've never experienced this with previous maintenance). Julie is the only redeeming quality to Regency after Michelle and Hans left. Julie is so sweet, she always tries to help you out. Diane is awesome, she needs to replace Deneen. Deneen will lie to you, she will insult you back-handedly and treat you like a child. When you really need her help, she'll treat you like a peasant. Michelle and Hans were so heart-felt and understanding, the sense of community is COMPLETELY LOST. We are saving up to leave this place. Why did Michelle and Hans leave? Please come back... We miss you so much. The new maintenance is terrible. Stay away from Regency, this place is becoming more dangerous as the months slip by, I'm not sure who's doing background checks, but just Google Regency Park Apartments crime in Bellingham. You'll get an idea.",
        "ownerResponse": {
          "text": "Hi Hank,\nThank you for reaching out, We are always looking for feedback so we can be better. Our records show that there is no one by your name at the property. If you would like to speak more about any concerns or issues you may have we ask that you reach out to our Resident Relations Team at residents@hnnwa.com.\nSincerely,\nHNN Resident Relations Management Team"
        }
      },
      {
        "author": "Craig Cunningham",
        "rating": 2.0,
        "review": "The office opens very late and I wish they could open early. They open at 10! The management can invade your privacy, have many rules, make you sign papers throughout the whole lease period (multiple times), and not just once at the beginning/end.  Every 3 months or sometimes less, they come in to your place to do checks on cleanliness, the fire detectors, and random procedures. They even keep track of your car in the parking lot and count how many days your gone. They also have rules of visitors and how long they are allowed to stay. No visitor can stay longer than 5 hours and can't come over days back to back. They are nice at first, but over time you will find out that they are rude and can be pretty unprofessional at times. I was not satisfied with being there. The price is descent for what you get. I just really didn't like the experience. Also, there are many kids around and if you live near the park, the kids get super loud and its incredibly disturbing.",
        "ownerResponse": null
      },
      {
        "author": "Janine Richardson",
        "rating": 2.0,
        "review": "Nice apartment layout. Maintenance doesn't take very good care of property. Loose cement steps. Yes they know it's loose. As with most apartment complex rent is way too high",
        "ownerResponse": {
          "text": "Hi Janine,\rThanks for leaving feedback and a star rating for our community. We are disappointed that your experience was not positive. Please feel free to contact us at the office at your earliest convenience. We would love to see if we can turn your experience around.\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Lisa Sloan",
        "rating": 5.0,
        "review": "I am a current resident. The apartments are managed very well. Any time I have submitted a maintenance request the request is always responded to within the time range they tell you they can get to it. The office staff are WONDERFUL! I've never had an issue with any of them to date. They are welcoming, professional, and they even remember me by name, something I very much appreciate. There are frequent inspections- an annual investors/insurance inspection, smoke detector inspections, etc.that can feel a little invasive, but honestly it's ok because they are keeping on top of making sure the property is safe and maintained well and you are given ample notice that they will be entering your unit.\n\nAlso, they host a number of community events/socials, have a pool, fitness room, and theater open for party rentals.\n\nAs for neighbors...that is pretty hit and miss, but that is life in an apartment complex. The \"bad\" neighbors don't seem to last long anyway.",
        "ownerResponse": {
          "text": "Thank you so much for your positive review!"
        }
      },
      {
        "author": "Destiny Watson",
        "rating": 2.0,
        "review": "Don't really recommend as a living place. The apartments are small and fairly dirty, the pool is gross and I'm not sure its cleaned as much as it should be. There's a park, I guess that's the most ok part of the place. There's also lots of addicts and bad people around there. Not very safe for kids either.",
        "ownerResponse": null
      },
      {
        "author": "Cheri Cariveau",
        "rating": 5.0,
        "review": "I have had some ups and some downs but all in all it is a great place to live and things get fixed fast and in a timely manner. Staff are great and maintenance are all polite. Been here for 4 years plus now.",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!\n\nBest,\nRegency Park Management"
        }
      },
      {
        "author": "Nathan Rowley",
        "rating": 2.0,
        "review": "The apartments themselves are fine, and repairs were done on time.  Some of the management was more helpful than others.  The major problem is the noise level from the large amount of children, if you cannot deal with a ridiculous amount of cursing and screaming from children as young as 3 then stay far away from Regency Park.  DO NOT rent an apartment adjacent to the playground, your window WILL be used as a goal for whatever ball game the little rats decide to play that day.",
        "ownerResponse": null
      },
      {
        "author": "God Zilla",
        "rating": 1.0,
        "review": "I absolutely despise Regency for very good reasons and here's why.\n1. Every few months the rent goes up more and more, and now Regency isn't so affordable anymore.\n\n2. The management is often TERRIBLE!!! To start off with, the owner is snide, stuck up, rude, and uncaring. Every time one of us talks to her she says some sort of snide remark, is very impolite, and just brushes off everything you say to her. Hauns, her husband, is okay, but really conniving and a liar. During an inspection he'll tell you everything is totally fine, and then you get a notice the next day saying you have to clean or fix something or else you're evicted. He also always says he'll do something and then never actually does it. The rest of the management isn't TOO horrible, but they're usually poorly trained and unprofessional. We usually digitally sign our lease, but there have been MULTIPLE times where the management just completely loses our lease somewhere, then blames us for it and says we never signed it. They have also lost our rent checks before, blaming us for that as well. The only good thing about them, is at least the former manager Cindy no longer works here. She was by far the most stuck up, bitchy, uncaring, conniving, and just all around terrible person I've ever met.\n\n3. They have CONSTANT inspections and often give you little to no warning. We are now on our third inspection THIS MONTH. It is February 10th.....yea.... They usually have an inspection for some sort of stupid reason at least every 2-3 months. The worst part is that they come in, say you're totally fine, and then give you an eviction notice the next day for stuff a simple as a COUPLE dishes in the sink, one small thing being in front of the heater that takes two seconds to move, or a SMALL amount of clothes somewhere that hasn't been put away yet. Seriously these guys give out eviction notices for ANYTHING they can find.\n\n4. It's a terrible place. The surrounding streets, stores, and schools are nice, but they're not the problem. The problem is the terrible neighbors, the constant police visits, and the management doing nothing about any of this! Seriously I can't count how many times I've complained about my upstairs AND downstairs neighbors slamming things, screaming, or blasting music at all hours of the night, but does Regency do anything about it? No. No they don't. The place has serious drug problems and there was even a shooting a few years ago. Not a safe place for your kids. Not to mention even the KIDS have problems! Probably because their parents aren't usually good people if they live here. The kids steal, scream at all hours, cuss, and start drugs and drinking early on. I implore you, if you have children and want them to actually grow up decently, keep them FAR away from this place.\n\n5. Maintenance is unreliable. If something is broken, you go and tell the office and get simple papers done. Then you sit and wait for weeks while they keep telling you they're planning on coming but never do. I always see them chatting with each other and doing nothing. They just don't care.\n\nAll in all, Regency is a terrible place run by uncaring people who act like they care when they really don't. They're lazy, disrespectful, and overall just very uncaring. If you can avoid living here, please try.",
        "ownerResponse": {
          "text": "Hello -- Thanks for reaching us regarding Regency Park. I am sorry you do not have a positive review of Regency Park. I will be passing on your comments to the apartment manager at Regency Park. If you would like to discuss any of this further, please contact residents@hnnwa.com.\n\nThank you! HNN Resident Relations"
        }
      },
      {
        "author": "Lisa Loomis",
        "rating": 4.0,
        "review": "The management is very nice and they do a lot for the residents such as kids cookouts and have the ice cream shack come and they work with you and your financial situation.  Great place to live!",
        "ownerResponse": {
          "text": "Hi Lisa,\nThank you for leaving us a review! We appreciate the kind words and hope we can continue to exceed your expectations.\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Anna shtey",
        "rating": 5.0,
        "review": "Great People work here who really care. The staff is so nice and polite, truly heart warming. The buildings and outside areas are always so clean and maintained. I appreciate all the effort from these wonderful staff. Thank you so much!",
        "ownerResponse": {
          "text": "Hi Anna, \r\rWe are so happy to read such a great review.  We are happy to pass along your comments to the team here at Regency Park!\r\r- HNN Communities Customer Service"
        }
      },
      {
        "author": "Whitney",
        "rating": 1.0,
        "review": "First off, the office staff is incompetent.  One in particular, Julie, is unprofessional and disrespectful.  She also lacks thorough knowledge of landlord tenant laws.  At one point, they attempted to charge us for trash removal from the hallway when there was no trash for them to remove.  And when I showed her proof of it, she said she still wouldn't remove the charge while addressing me rudely.  It's been 27 days since we moved out and we never received our deposit back or a mailed statement stating why they haven't returned it and now I have to get a lawyer involved to deal with them.  They constantly close the pool during the summer, they don't have it open during any reasonable hours for there not to be screaming children in it and they baby sit everyone in the pool.  Never had an apartment complex like this before.  Also, because it is low income, the majority of the people act the stereotype of lower class and there is a lot of crime.  I'd say there was police there 5 out of 7 days of the week at minimum.  Lots of drug activity.  Also, I paid 1,050 ish for a 1088 sqft apartment and I currently live in a 1,200 sqft apartment for (drum role please) $950 a month and it is in way better shape.  Do not, under any circumstances, live at these apartments.  And if you do, let me say \"I told you so\" now.  Might as well get that out of the way.  You can do better than this, you deserve better.",
        "ownerResponse": {
          "text": "Whitney - I am sorry you did not have a good experience at Regency Park.  We are always striving to improve, so I will pass your comments on to the manager.\n\nBest regards,\nHNN Resident Relations"
        }
      },
      {
        "author": "Jimmy Sloan",
        "rating": 5.0,
        "review": "This is temporary housing for older folks. But if you think about it, aren't we all temporary residents on planet earth?  OMG, I just had an existential crisis. I need a cheeseburger to forget this, and make me feel better.",
        "ownerResponse": {
          "text": "Hi Jimmy, \rWe are very happy to have provided you with such a positive experience! Have a good day!\r\rBest,\rRegency Park"
        }
      },
      {
        "author": "Elyssa Cartier",
        "rating": 1.0,
        "review": "Our house is on the other side of the fence from this complex and the animal/resident noise is horrendous.\n\nWe regularly call in physical & verbal bomestic disputes to the local PD. And it seems that the apartments have somewhat recently laxed their pet policy, seemingly allowing residents up to 3 dogs per apartment that then bark incessantly at all times of day and night. The only care given to dogs is blood-curdling screams and we can hear the occasional swats (again, these people are not quiet and hit each other and their animals at a frequency to match their screaming).\n\nIf you're down with child, spousal, and animal abuse, this is the place for you.",
        "ownerResponse": null
      },
      {
        "author": "David PJ Tye",
        "rating": 4.0,
        "review": "Great accommodations with amenities such as library, gym,pool and various group activities.Large complex.Locating specific apartment may be challenging; they all look the same from outside...worth the effort, though!",
        "ownerResponse": null
      },
      {
        "author": "Justin Coslor",
        "rating": 5.0,
        "review": "I live here across Fraser Street 98229 and love it!",
        "ownerResponse": {
          "text": "Hi Justin,\rThank for updating your review! It makes us very happy to know that you love it here at our community!  We appreciate you taking the time to let know. Hope you have a wonderful day. \r\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Rebecca Jones",
        "rating": 4.0,
        "review": "Very nice apartments. I would love to Live next to my Family that lives there. Maybe I can go for a swim sometime.",
        "ownerResponse": {
          "text": "Hi Mike and Becky,\rThanks for leaving a high star rating for our community. We appreciate you taking the time out of your day to do this. It means a lot to us to know how we are doing.\r\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Andrea Maier",
        "rating": 4.0,
        "review": "My daughter lives there. Nice place washer and dryer in them. Dishwasher too.",
        "ownerResponse": {
          "text": "Andrea,\nWe are very happy we could provide you and your daugther with a positive experience!\n\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Alicia Basham",
        "rating": 5.0,
        "review": "We moved in not long ago and its awesome I am sooooo happy here my kids love it and the staff are so nice.",
        "ownerResponse": null
      },
      {
        "author": "Jamie Alvarez",
        "rating": 4.0,
        "review": "Very clean, well maintained neighborhood. The management ladies were very friendly!",
        "ownerResponse": {
          "text": "Jamie,\nThank you for your kind review; we are happy to pass along your comments to the team here at Regency Park Apartments!\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Kristin Morris",
        "rating": 3.0,
        "review": "Well I live here so its not bad..  love the ladies in office and lovely matainance men",
        "ownerResponse": {
          "text": "Hi Kristin Morris,\n\nThank you for taking the time to let us know about your recent experience and we are happy our team make your stay with us more enjoyable.  We'll make sure to pass along this review to them.\n\nThank you!\nHNN Customer Service"
        }
      },
      {
        "author": "American Classic",
        "rating": 5.0,
        "review": "I visit there for dinner twice a month. Very nice place. Office staff was awesome and great clubhouse and pool",
        "ownerResponse": null
      },
      {
        "author": "Christopher Baggett",
        "rating": 3.0,
        "review": "Good sized apartments has a pool and on site storage....  Not very good parking for residents or visitors.",
        "ownerResponse": {
          "text": "Hello Christopher, thank you for leaving an honest review. Parking can be hard to find at most apartments.  Feel free to email any suggestions to us. Thank you and have a great day! -HNN Associates Customer Service (customerservice@hnnwa.com)"
        }
      },
      {
        "author": "Jordan Callender",
        "rating": 5.0,
        "review": "Deneen and Diane. They were so friendly and very prompt in getting us in. Two of the sweetest people we have met.",
        "ownerResponse": {
          "text": "Hi Jordan, \rWe're glad you had such a wonderful experience with us! Thanks for your kind comments about our team. I will happily share your review with the team. We can't thank you enough for taking time out of your day to let us know how we are doing.\r\rBest Regards,\rHNN Communities Customer Service Team"
        }
      },
      {
        "author": "Janet Dunagan",
        "rating": 5.0,
        "review": "When I was there yesterday it was a pleasure to me meet my friends  and I was able to relax it was so peaceful ",
        "ownerResponse": {
          "text": "Thank you again for taking the time to let us know how we did. We hope you have a great day!"
        }
      },
      {
        "author": "Karethra Bex",
        "rating": 4.0,
        "review": "The outside grounds are nicely maintained.  The property managers are communicative and easy to work with.",
        "ownerResponse": null
      },
      {
        "author": "Auston Olapas YouTube",
        "rating": 5.0,
        "review": "Watch out for the coyotes and raccoons that roam the greenbelt. This apartment complext is close to the creek where lots of wild animals roam.",
        "ownerResponse": {
          "text": "Hello Auston, we appreciate you taking the time to leave us this feedback. Have a great day!  -HNN Associates Customer Service"
        }
      },
      {
        "author": "Tiffany Longoria",
        "rating": 1.0,
        "review": "Honesty this place is horrible you can only have visitors for no more then 5 hours a day and they can't come everyday or u have to put them on yr lease I hate this place wish I never moved there",
        "ownerResponse": null
      },
      {
        "author": "James Galen-Abbitt",
        "rating": 3.0,
        "review": "As far as low income housing goes, it's not half bad. It is by no means remarkable, but it's not supposed to be.",
        "ownerResponse": null
      },
      {
        "author": "Christopher Buss",
        "rating": 2.0,
        "review": "Apartments are nice enough but every person I know that's rented from here has had issues with the management in one way or another.",
        "ownerResponse": null
      },
      {
        "author": "Kim Buckingham",
        "rating": 5.0,
        "review": "It's where I live and they take good care of you.  Clean and friendly staff ",
        "ownerResponse": null
      },
      {
        "author": "Kori Austin",
        "rating": 3.0,
        "review": "Been living here for 6 yrs and its definitely alot if changes and not all for the better.",
        "ownerResponse": {
          "text": "Kori, \rWe truly appreciate your honest feedback. We would like to talk further, so if you would like, please reach out to our manager at 360-392-8050 so we can talk further.\r\rSincerely,\rRegency Park Management"
        }
      },
      {
        "author": "Jude Mendivil",
        "rating": 4.0,
        "review": "Its a good place for a family and elderly people to live",
        "ownerResponse": {
          "text": "Hi Jude,\nWe are very happy to have provided you with such a positive experience!\n\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Marty Euper",
        "rating": 5.0,
        "review": "Loved the way that Regency Park staff and Opportunity staffworked together to help us out.",
        "ownerResponse": {
          "text": "Thank you again for taking the time to let us know how we did. We hope you have a great day! \rBest regards, \rHNN Communities Customer Service"
        }
      },
      {
        "author": "Alicia Chandra",
        "rating": 1.0,
        "review": "some of the rules are annoying my downstairs neighbors are very horrible and people are always coming out of the woods and the kids who live here are very rude",
        "ownerResponse": {
          "text": "Alicia - Thank you for your feedback. As we are always trying to improve our community, I will be sure to pass along your comments to the manager.\n\nBest regards,\nHNN Resident Relations"
        }
      },
      {
        "author": "Jenn Marie",
        "rating": 4.0,
        "review": "Wish the pool or just the hot tub at least, would be open further into the fall...",
        "ownerResponse": null
      },
      {
        "author": "night fire yt",
        "rating": 1.0,
        "review": "There was mold in corners and overall bad place",
        "ownerResponse": {
          "text": "Hi there,\nWe ask that you please email us with more details so we can help out with this. Please email us at live@regencyparkwa.com with more information. \nSincerely,\nRegency Park Management Team"
        }
      },
      {
        "author": "Sonja Jager",
        "rating": 1.0,
        "review": "Terrible management. Maintenance takes months to fix anything",
        "ownerResponse": {
          "text": "Hi Sonja, \nThank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied with your visit. /We understand your frustration with this a d would like to talk with you more. Please email us at residents@hnnwa.com.\nSincerely,\nHNN Resident Relations"
        }
      },
      {
        "author": "Denise Prowell",
        "rating": 5.0,
        "review": "It's a fairly nice apt building.",
        "ownerResponse": {
          "text": "Hi Denise, thank you so much for your positive comments about Regency Park! Have a great day! -HNN Associates Customer Service"
        }
      },
      {
        "author": "Kelsey McMahon",
        "rating": 3.0,
        "review": "Some sketchy people live here but the staff is always friendly.",
        "ownerResponse": null
      },
      {
        "author": "Michael-Isaiah Evans",
        "rating": 3.0,
        "review": "They have weird rules there but it's an okay place to live.",
        "ownerResponse": null
      },
      {
        "author": "Jay Jay Dunagan",
        "rating": 5.0,
        "review": "It's a clean place and well kept up",
        "ownerResponse": null
      },
      {
        "author": "Katherine",
        "rating": 5.0,
        "review": "The office personnel are always helpful and maintenance is timely.",
        "ownerResponse": null
      },
      {
        "author": "Jose Gutierrez",
        "rating": 5.0,
        "review": "Diana was great, very helpful!",
        "ownerResponse": {
          "text": "Jose, \nThank you for your kind review; we are happy to pass along your comments to the team here at Regency Park Apartments!\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Thelema Smith",
        "rating": 5.0,
        "review": "Real nice place hoping i can get a place too",
        "ownerResponse": null
      },
      {
        "author": "Eli Pucci",
        "rating": 5.0,
        "review": "Great location,  right by whatcom falls park",
        "ownerResponse": {
          "text": "Eli, your wonderful feedback and rating mean a lot to us. We hope to see you soon! - HNN Communities Customer Service"
        }
      },
      {
        "author": "david cummins",
        "rating": 3.0,
        "review": "Good ol' free range children runnin' around.",
        "ownerResponse": null
      },
      {
        "author": "Carl G",
        "rating": 5.0,
        "review": "Excellent place to live",
        "ownerResponse": {
          "text": "Hi Carl, Thanks so much for taking the time to share your positive experience! We're always happy to help so don't hesitate to contact us if you ever need anything. We work hard to provide customers with a great experience and look forward to continuing to do the same for you! Please let us know what we can do for you in the future."
        }
      },
      {
        "author": "Jacob Dille (Jake)",
        "rating": 1.0,
        "review": "Absolute top 5 worst places in Bellingham",
        "ownerResponse": null
      },
      {
        "author": "Skylar Smith",
        "rating": 2.0,
        "review": "Its a shame that it always has so much trash everywhere",
        "ownerResponse": null
      },
      {
        "author": "Britney Tomlinson",
        "rating": 3.0,
        "review": "Cheap place to live, close to lots of things",
        "ownerResponse": null
      },
      {
        "author": "Kelly Pettus",
        "rating": 1.0,
        "review": "no dumpster on the other side of the street",
        "ownerResponse": {
          "text": "Hi there, I would like to get some more details about your experience with us. I'm not sure what you are referencing in relationship to a dumpster? Please reach out via email or come to the office and we can try to assist. Thanks! HNN Customer Service Team."
        }
      },
      {
        "author": "Richard Coop",
        "rating": 5.0,
        "review": "Lots of friends live there.",
        "ownerResponse": null
      },
      {
        "author": "Cyndi Ackerson",
        "rating": 4.0,
        "review": "Nice place and spacious Apartments.",
        "ownerResponse": null
      },
      {
        "author": "Joel Cariaga",
        "rating": 3.0,
        "review": "Don't ever live here",
        "ownerResponse": {
          "text": "Hi Joel,\nThank you for reaching out, we are always looking for feedback to improve. We would like to hear more about your experience, and ask that you please call us at 360-392-8050 so we can best help you. \nSincerely,\nRegency Park Management "
        }
      },
      {
        "author": "Nofoaga Lewis",
        "rating": 5.0,
        "review": "It's alright that's not bad!!!!",
        "ownerResponse": {
          "text": "Thank you for your comment. We appreciate it.\n\nBest regards,\nHNN Resident Relations"
        }
      },
      {
        "author": "Mike Doyle",
        "rating": 1.0,
        "review": "Got out of car and saw a needle",
        "ownerResponse": null
      },
      {
        "author": "William Roberts",
        "rating": 5.0,
        "review": "A great place to Live.",
        "ownerResponse": {
          "text": "Hi William, thank you so much for your positive comments about Regency Park! We hope to see you soon! - HNN Communities Customer Service"
        }
      },
      {
        "author": "Joshua Powell",
        "rating": 4.0,
        "review": "Big ass speed bumps",
        "ownerResponse": null
      },
      {
        "author": "Brian Dye",
        "rating": 3.0,
        "review": "Drug users live there",
        "ownerResponse": null
      },
      {
        "author": "Justinn Tatu",
        "rating": 5.0,
        "review": "Live here",
        "ownerResponse": {
          "text": "Justinn, thank you for taking the time to review and recommending Regency Park to others. Reviews like this give us motivation and help us ensure we provide high-quality customer service. Have a wonderful day. -HNN Associates Customer Service"
        }
      },
      {
        "author": "Carl Graber",
        "rating": 5.0,
        "review": "Nice place to stay",
        "ownerResponse": {
          "text": "Hi Carl, \rThank you for the high star rating! We appreciate you taking the time out of your day to let us know how we are doing. It means a lot to our team.\r\rBest Regards,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Anna Pliakina",
        "rating": 5.0,
        "review": "Great",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Amanda Helde",
        "rating": 1.0,
        "review": "Crowded.",
        "ownerResponse": {
          "text": "Hello Amanda, We are sorry to hear that. Wed like to understand more about the situation. If you wouldnt mind emailing us at customerservice@hnnwa.com about your experience, it will be greatly appreciated. We look forward to hearing from you on how we can improve. Sincerely HNN Customer Service."
        }
      },
      {
        "author": "Go HAWKS!!",
        "rating": 4.0,
        "review": "Great location!",
        "ownerResponse": {
          "text": "We are happy to hear you had such a positive experience with our team! Thank you for taking the time to review Regency.\r\rSincerely,\rRegency Parks Management"
        }
      },
      {
        "author": "Arrows O'time",
        "rating": 5.0,
        "review": "Meh",
        "ownerResponse": {
          "text": "Arrows, thank you for the high star rating!\rBest regards, \rHNN Communities Customer Service"
        }
      },
      {
        "author": "Ruth Smith",
        "rating": 3.0,
        "review": "Ok",
        "ownerResponse": null
      },
      {
        "author": "Beth Parker",
        "rating": 2.0,
        "review": "Blah",
        "ownerResponse": null
      },
      {
        "author": "Wayne Gro",
        "rating": 4.0,
        "review": "clean",
        "ownerResponse": null
      },
      {
        "author": "Tracy Smith",
        "rating": 3.0,
        "review": "Just looking around",
        "ownerResponse": null
      },
      {
        "author": "Lisa Treadway",
        "rating": 1.0,
        "review": "Scary place!",
        "ownerResponse": {
          "text": "Hello Lisa, We are sorry to hear that. Wed like to understand more about the situation. If you wouldnt mind emailing us at customerservice@hnnwa.com about your experience, it will be greatly appreciated. We look forward to hearing from you on how we can improve. Sincerely HNN Customer Service."
        }
      },
      {
        "author": "Amanda Camarillo",
        "rating": 3.0,
        "review": "A bit ghetto",
        "ownerResponse": {
          "text": "Amanda Camarillo, \r\rWe regret to hear that you had a negative experience with us, but would appreciate the chance to turn your experience around, so if you are willing, please reach out to us at (360) 392-8050 to discuss this further.\r\rBest Wishes,\rRegency Park Management"
        }
      },
      {
        "author": "Evan Smither",
        "rating": 1.0,
        "review": "this place sucks",
        "ownerResponse": {
          "text": "Evan -\n\nThanks for reaching us regarding Regency Park.  I am sorry you do not have a positive review of Regency Park.  If you would like us to work on specific issues, please pass this feedback on to residents@hnnwa.com.\n\nThank you!\nHNN Resident Relations"
        }
      },
      {
        "author": "cassie w",
        "rating": 2.0,
        "review": "Bad neighborhood",
        "ownerResponse": null
      },
      {
        "author": "Blessed Mom",
        "rating": 5.0,
        "review": "Terri and Marcy are amazing! They are involved in the Community and really care about the tenants! If I have any issue at all, they are on top of it. They went above and beyond and now the kids can play with the sidewalk chalk and ride their bikes :) I love the community involvement between tenants and office staff. It makes living here feel like home. They listen to ideas of the tenants and they dont dismiss us. I love it here! If you need anything ever, ask Terri, Marcy! Our maintenance staff is amazing as well. Nome is always so caring and personable and professional. He communicates with you and once he fixes whatever the issue is, he will\nFollow up with you. I never have to chase anyone to get a work order completed! He also always has a smile on his face! I have absolutely no complaints. Regency Park is amazing!",
        "ownerResponse": null
      },
      {
        "author": "Nanny Buttersworth",
        "rating": 5.0,
        "review": "Love this place!\n\nTerri is the best! So welcoming and she cares so much! She works hard to help her residents!\n\nFaves about our community\n\nNeighbors and staff! The pool! The fitness room! The trails! The location, close to shopping and easy access to I-5, maintenance and our new manager is awesome too!\n\nDownsides, parking. (We are working out a solution)\n\nLove our community ",
        "ownerResponse": null
      },
      {
        "author": "Jennifer Sobjack",
        "rating": 5.0,
        "review": "I give out community a five star rating based on these factors.\n\n1.) My neighbors! They are my friends and I can count on them. \n\n2.) The (current as of this writing) staff is amazing. Caring, fun, hard working, and you can really talk to them when in need of anything!\n\n3.) It seems that everyone here is doing their best and I really believe we have a strong community right now. \n\nWith that being said, there are some downsides to living here (city) and these are things you are going to find pretty much no matter where you are living in Bellingham unfortunately. \n\nI should mention we have community get togethers for the kiddos, and we have a pool and hot tub open during the summer. \n\nAll year round we have a fitness room. \n\nSo happy to have an affordable place to live while I am preparing to buy a house.",
        "ownerResponse": null
      },
      {
        "author": "Mariano Quiroz",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Mariano, Thank you for taking the time to share your experience. It is truly touching to know you think so highly of us! We're always happy to assist so don't hesitate to reach out to us if you need anything. It was a pleasure to serve you."
        }
      },
      {
        "author": "Elioth S",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Greetings Elioth, Thanks for choosing us and leaving such a great review! We appreciate your recognition and will do our best to keep up the great work! Our goal will always be to provide the best experience and we love knowing yours was no different. We look forward to seeing you again soon."
        }
      },
      {
        "author": "Francisco javier serrano",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Greetings Francisco, Thanks for the kind words! We are happy to read that our team has been able to provide exceptional service for you. We're glad you had a great experience and we look forward to continuing to exceed your expectations! Thanks again and we look forward to seeing you again soon."
        }
      },
      {
        "author": "Alaxaneer Garcia",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Greetings Alaxaneer, We appreciate the time you took to give us such a great rating! Hearing that your experience went well really makes our day. We're glad you had a great experience and we look forward to continuing to exceed your expectations! We're here for you anytime!"
        }
      },
      {
        "author": "Truth is Trending",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi There, \nThanks so much for taking the time to share your positive experience! We are happy to see that our team has been able to provide exceptional service for you. If you ever need anything please don't hesitate to reach out to our team. See you next time!"
        }
      },
      {
        "author": "DIEGO FERNANDO MAZUERA MAYOR",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Greetings, Diego, Thanks for the great review! We are happy to see that our team has been able to provide exceptional service for you. We look forward to keeping up the great work! Sincerely, Regency Park Management Team"
        }
      },
      {
        "author": "Sarah Coulson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!"
        }
      },
      {
        "author": "mike lahr",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Mike, \nWe are very happy to have provided you with such a positive experience!\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Erica Fryer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Tawan Slone",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!\nBest,\nRegency Park Management"
        }
      },
      {
        "author": "Cherie Shook",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Dezeray Hammer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!"
        }
      },
      {
        "author": "Jason C",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Jason,\rThank you for taking the time to let us know how we did. We hope you have a great day!\r\rBest,\rRegency Park Management"
        }
      },
      {
        "author": "Hctor Armando Pineda Glvan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi there,\rWe are very happy to have provided you with such a positive experience! Have a good day!\r\rBest,\rRegency Park Management"
        }
      },
      {
        "author": "Marcus VanDalen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Marcus, \rWe regret to hear that you had a negative experience with us, but would appreciate the chance to turn your experience around. Please reach out to our Management team at 360-392-8050. \r\rSincerely,\rRegency Park Management"
        }
      },
      {
        "author": "Greg Nelson",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Greg Nelson, thank you for taking the time to leave a review for us at Regency Park Apartments. If you need anything from us, please reach out to the front office or call.\r\rThank you,\rRegency Park Management Team"
        }
      },
      {
        "author": "Ar Shot",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hello,\rThanks for leaving a high star rating for our community. It means a lot to our team that you took the time out of your day to do this. We can't thank you enough.\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Estelle Assink",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Estelle,\rThanks for leaving a star rating for our community. It is disappointing that your experience was not positive. If you would like to provide more feedback, please reach out to us at (360) 392-8050 so we can assist you further.\r\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Victor Sweet",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Victor,\rThanks for leaving a high star rating for our community. It means a lot to our team that you took the time out of your day to do this. We love knowing how we are doing!\r\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Tina Duke",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Tina,\rThank you for letting us know how we are doing. We are disappointed to see that your experience with us was not as positive as we would want. We would like to have a better understanding of your experience. Please reach out to us at (360) 392-8050 at your earliest convenience and we will d o  our best to turn your experience around.\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "Tina Martin",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Tina, \rWe are disappointed to see your low star rating. If you could provide more information to us, we would be more than happy to try and make this situation better. Please reach out to our team at 360-392-8050.\r\rSincerely,\r-Regency Park Management Team"
        }
      },
      {
        "author": "c",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Anthony,\r\rWe are so happy to read such a great review about Regency Park!  They surely have a great team there and it shows!  Thanks for taking the time to let us know how they did.\r\r-HNN Communities Customer Service"
        }
      },
      {
        "author": "Sara Jules",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Sara , thank you for taking the time to let us know about your experience. Please reach out to us at (360) 392-8050 so we may understand more about your experience. -Regency Park Management Team"
        }
      },
      {
        "author": "Johnathen Shelly",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Johnathen,\r\rWe regret to hear that you had a negative experience with us, but would appreciate the chance to turn your experience around.   We hope you are willing to give us another chance. Please reach out to us at (360) 317-2557 so we can work towards a resolution. \r\r-Regency Park Management Team"
        }
      },
      {
        "author": "Edwin Mitchell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Edwin , we are very happy to have provided you with such a positive experience! Thank you for taking the time to leave a positive rating. -Regency Park Management Team"
        }
      },
      {
        "author": "Katherine Mcabee",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cheri Juenemann",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Cheri,\r\rWe are disappointed to hear that you did not have a more positive experience with us at Regency Park.  Our manager would really like to speak with you more regarding this matter. Please reach out to us at (360) 392-8050. We look forward to hearing from you.\r\r-Regency Park Management Team"
        }
      },
      {
        "author": "AngelMom M",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Angelmom M, thank you for the high star rating! \rBest regards, \rRegency Park Apartments"
        }
      },
      {
        "author": "Marri",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Robert Lee",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Robert, \r\rThank you for taking the time to leave us feedback about your experience with us.  Please contact us at (360) 392-8050 so we can work with you to make this right.  We look forward to speaking with you soon.\r\r-Regency Park Management Team"
        }
      },
      {
        "author": "Dani",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Darcy Lindenmuth",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ashley Carpenter",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brown Eyess",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Desiree Mork",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Christina Sires",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Diablito G",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Melissa Nicholson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Melissa, it's experiences like yours that really keep us motivated! Thank you for your review! Sincerely -HNN Associates Customer Service"
        }
      },
      {
        "author": "Jenna Kennedy",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Jenna for taking the time to let us know how we did. We hope you have a great day!  HNN Associates Customer Service"
        }
      },
      {
        "author": "Robert Dow",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Robert, we are very happy to have provided you with such a positive experience! Thank you for your time with this review. -HNN Associates Customer Service"
        }
      },
      {
        "author": "steve nave",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Steve, thank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied. Feel free to reach out and let us know more. -HNN Associates Customer Service (customerservice@hnnwa.com)"
        }
      },
      {
        "author": "Lori Lykins",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Lori Lykins, thank you for your kind review; we are happy to pass along your comments to the team here at Regency Park! Best regards,  HNN Customer Service Team"
        }
      },
      {
        "author": "Brittany Evans",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Brittany, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Regency Park. Have a wonderful day! -HNN Associates Customer Service"
        }
      },
      {
        "author": "Maria Martinez",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Maria, thank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied. We would like to have a better understanding about your experience. Please reach out to us at customerservice@hnnwa.com and help us improve our customer service. -HNN Customer Service"
        }
      },
      {
        "author": "John Gilchrist",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Samanda Dillard",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Samuel Tjaden",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "patricia Roberts",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Lynn Ramsey-Hadeen",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Misty Shea",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "George Martinez",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Aaron Santa Cruz",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Marcus Sandstrom",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ferret White",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tara QueenT MacCormack",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Conner Hostetler",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "L P",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tengasha Gibeau",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cristynn Portillo",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "sara barnes",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Alyse Umbinetti",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jeremy Eisses",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Richard Huizenga",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Elia Barrios",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Stephen Hawkins",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Timothy O'Clair",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Astrid Berg",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Archer",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Noah Ziegler",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "ZenoM0RPH 426",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Chris Weigel",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Miguel Del Villar",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Derek Quick",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kiana Nolan",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Blessed M.",
        "rating": 5,
        "review": "Terri and Marcy are amazing! They are involved in the Community and really care about the tenants! If I have any issue at all, they are on top of it. They went above and beyond and now the kids can play with the sidewalk chalk and ride their bikes :) I love the community involvement between tenants and office staff. It makes living here feel like home. They listen to ideas of the tenants and they don't dismiss us. I love it here! If you need anything ever, ask Terri, Marcy! Our maintenance staff is amazing as well. Nome is always so caring and personable and professional. He communicates with you and once he fixes whatever the issue is, he will\nFollow up with you. I never have to chase anyone to get a work order completed! He also always has a smile on his face! I have absolutely no complaints. Regency Park is amazing!",
        "ownerResponse": null
      },
      {
        "author": "Milagros B.",
        "rating": 5,
        "review": "Diane is my favorite office lady. She is always sweet and helpful. She left her desk to help us when we had an issue in our apartment and we needed her come see for herself.",
        "ownerResponse": {
          "text": "Hi Milagros,\nThank you for your review. We appreciate residents like you! We will pass along this comment to the On-Site Team.\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Oleg S.",
        "rating": 5,
        "review": "I have lived here for almost three years now with my wife and kids. We have been blessed with living at regency park since day one. The staff in the front office is wonderful, the maintenance team is by far I've ever seen in any residence. You can tell they truly care about each family that lives here. They go above and beyond and try extremely hard. Thank you to every single person that works here to make it so wonderful. Bless you all!",
        "ownerResponse": {
          "text": "Hi Oleg, Thank you for your kind review; we are happy to pass along your comments to the team here at Regency Park Apartments! - HNN Communities Customer Service"
        }
      },
      {
        "author": "Anna S.",
        "rating": 5,
        "review": "Regency Park Apt truly deserves a 5 Star rating from me and my family members. We all agree that this place is amazing. Let me start by saying that ALL the people who work at Regency really make this place great. They are always so polite and professional. Absolutely ALL the people that work here deserve a medal. This place is constantly being built; like a new smoking area and a brand new children's play area outside. They also have a theater room, gym area, and a computer area. Also I notice how hard the workers are at their job; they care about this place, they constantly remodel, they constantly manage the areas that need tending, they are on time and work until the job is complete. My husband and I always see workers outside the complex fixing and building and always managing the trash. The office ladies are wonderful too! Any issues we had were taken care of right away. Plus our neighbors are great too; everyone here seems to mind their own business and it feels like a safe community. This place is huge so we have no problems with parking either. We are very happy living here. Thank you for all your hard work, our family surely appreciates it.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 91,
  "adjusted_average_rating": 3.62,
  "summary": "<article class='review-summary'>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>      This article was generated by ChatGPT and is only intended to be a tool to help prospective renters and homeowners find a property management company or rental property. It is based on the summarization of user reviews and is meant to reflect balanced perspectives on Regency Park Apartments. The summary provides an overview of diverse experiences without divulging identifiable reviewer information, aiming to help readers make informed decisions.    </p>  </section>  <section>    <heading>      <h2>Good</h2>    </heading>    <p>      Many reputations are built on the quality of service, and this seems to stand true for Regency Park Apartments. Residents repeatedly praise the community feel fostered by the staff, describing them as friendly, professional, and personably involved in their interactions. Events such as get-togethers for the children exemplify how the management goes above and beyond to create a sense of belonging. The maintenance team also receives commendations for their efficient and attentive response to issues, with one family mentioning specific follow-ups after work orders were completed, which left them very satisfied.    </p>    <p>      The property's amenities also gather positive feedback, with the swimming pool, fitness room, and available theater room being highlights for current occupants. Importantly, the level of upkeep and tidiness at the apartments seems to be well managed. From observations about the cleanliness of the grounds to the noticeable effort put in to maintain and upgrade facilities, it's clear that the management team at Regency Park Apartments is devoted to caring for the property.    </p>  </section>  <section>    <heading>      <h2>Great</h2>    </heading>    <p>      A standout feature of the Regency Park Apartments is the acknowledgment of thoughtful and caring customer service from specific staff members. For instance, the detailed recognition of employees such as Terri, Marcy, and Diane, who have gone over and above their duties, helps illustrate the personal touch they bring to their roles. Tenants feel their concerns are heard and treated promptly, contributing to the positive public impression of the management company.    </p>    <p>      Furthermore, the office staff is remembered by name, which goes to show their friendly demeanor and effective communication does not go unnoticed. Scheduled events for residents foster community interaction and the management's proactiveness in resolving any leisure amenity restrictions indicates an attentiveness to residents' quality of life. Aspects such as the new play areas for children add to the attractiveness of the community-oriented environment.    </p>  </section>  <section>    <heading>      <h2>Bad</h2>    </heading>    <p>      However, not all aspects reviewed are commendable. There are reports of increased rental prices over the years, which has led to concerns about affordability. Additionally, the remarks about the neighborhood indicate a mixed feeling of safety, with occasional mentions of police presence and petty crime, understandable concerns for current and potential residents.    </p>    <p>      Parking availability has also been a notable issue, with residents expressing frustrations over the scarcity of spaces. The administration's invasiveness with property checks and rule enforcement has also been cited as a source of discontent among lessees who feel their privacy is unduly disturbed or that the restrictions are excessive.    </p>  </section>  <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>      Trouble lurks in terms of managerial interactions for some, with one user review implying a physical altercation with a maintenance head, which sharply contrasts with otherwise positive mentions of staff. Such experiences raise serious concerns about professionalism and tenants' safety. Moreover, the follow-up on these confrontations seems to fall short with questions about the legitimacy of complaints and the absence of conflict resolution causing additional unease.    </p>    <p>      Problems with maintenance, like delayed response times leading to prolonged disrepair and lack of fidelity in addressing issues, have been highlighted as well. The dismissal of reports about poor living conditions and an unprofessional attitude from a few management members tarnish the otherwise good reputation of the company. The mixed performance of management is troubling, especially when considering the consequences it might have on residents' daily comfort and trust in the property management.    </p>  </section></article>"
}