{
  "name": "Regency Park Apartments",
  "slug": "regency-park-apartments",
  "company_type": "Property",
  "address": "2050 Fraser St, Bellingham, WA 98229",
  "review_count": 14,
  "average_rating": 4.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Jay M",
        "rating": 1,
        "review": "Very, very poor customer service upon inquiring about a rental there.  I filled out contact information on their web site.  They auto-texted me telling me to go online to schedule a \"tour.\"  We;;, there's no place on their web site to do that.  Also, the units listed as available on their web site are not what is actually available to rent!\n\nI called them and was told that they have noting to tour.  Nothing available.  The lady was short, rude and seemed like she didn't want to be bothered.\n\nI will not be renting here.  Ever.",
        "owner_response": null
      },
      {
        "author": "BlackBerry & friends",
        "rating": 1,
        "review": "Im gonna rant for just a minute!\n\nMy kitchen light has been out for 2 weeks now, i let them know the day it went out and they said someone would be over and I've been trying to get maintenance over here to fix it since. My washer has been down for almost 2 months again and my kids bedroom heater is very dangerous and falling apart so i wont trun any of the heaters on. Management dont seem to care i have been putting work orders in, sent a few texts to see when they can come fix stuff.. never get a answer... and today i sent screenshots saying everything has been \"Scheduled\" in there books FOR WEEKS NOW!!   BUT  NOT SCHEDULED WITH US!\"\n\nI even went in and asked when this stuff will be fixed. They said ill let you know!  im ready to move, cuz management dont care!\n\nI just want out stuff fixed, i paid my rent on time every month, yet they cant fix anything  \n\nWere getting new people blow us soon and the workers have been working downstairs every day this week... yet they run when i walk outside. i just hope the new people are nice and chill and we get along  oh ill be having a nice talk with the new people as well and telling them to make sure everything works!!",
        "owner_response": null
      },
      {
        "author": "Blessed Mom",
        "rating": 5,
        "review": "Terri and Marcy are amazing! They are involved in the Community and really care about the tenants! If I have any issue at all, they are on top of it. They went above and beyond and now the kids can play with the sidewalk chalk and ride ",
        "owner_response": {
          "text": "Dear Blessed, We're delighted to hear about your experience! It is truly touching to know you think so highly of us! We're always happy to assist so don't hesitate to reach out to us if you need anything. Please let us know what we can do for you in the future."
        }
      },
      {
        "author": "Nanny Buttersworth",
        "rating": 5,
        "review": "Love this place!\n\nTerri is the best! So welcoming and she cares so much! She works hard to help her residents!\n\nFaves about our community\n\nNeighbors and staff! The pool! The fitness room! The trails! The location, close to shopping and easy access to I-5, maintenance and our new manager is awesome too!\n\nDownsides, parking. (We are working out a solution)\n\nLove our community ",
        "owner_response": {
          "text": "Hi Nanny, Thanks for the kind words! We're thrilled that Terri left such a great impression! We truly value your recommendation, and are confident we can continue to provide excellent service in the future. It was a pleasure to serve you."
        }
      },
      {
        "author": "Sheila Harrison",
        "rating": 5,
        "review": "The staff does an amazing job. They are all great and make this feel more like a family. Terry has been making sure everything is looked at and we are given the ok to play with chalk again and for the kids to ride bikes!",
        "owner_response": {
          "text": "Greetings sheila, We are grateful and appreciate the time you took to leave your review. It is truly touching to know you think so highly of us! We hope to continue exceeding your expectations with great service. We look forward to seeing you again soon."
        }
      },
      {
        "author": "Jennifer Sobjack",
        "rating": 5,
        "review": "I give out community a five star rating based on these factors.\n\n1.) My neighbors! They are my friends and I can count on them. \n\n2.) The (current as of this writing) staff is amazing. Caring, fun, hard working, and you can really talk to them when in need of anything!\n\n3.) It seems that everyone here is doing their best and I really believe we have a strong community right now. \n\nWith that being said, there are some downsides to living here (city) and these are things you are going to find pretty much no matter where you are living in Bellingham unfortunately. \n\nI should mention we have community get togethers for the kiddos, and we have a pool and hot tub open during the summer. \n\nAll year round we have a fitness room. \n\nSo happy to have an affordable place to live while I am preparing to buy a house.",
        "owner_response": {
          "text": "Dear Jennifer, Thanks so much for taking the time to share your positive experience! It's feedback like yours that reminds us why we do what we do. We look forward to providing you with more great experiences in the near future. We're here for you anytime!"
        }
      },
      {
        "author": "Nicoll Ferrari (Nikki)",
        "rating": 5,
        "review": "I have to say that so far I really enjoy living here, for a Huge Apartment complex the ladies in the office and maintenance guys really stay on top of things! Communal living always has it challenges but it feels very homey and comfortable here. Beautiful trails and greenery surrounding the property if you like to go for walks too : )",
        "owner_response": {
          "text": "Hey Nicoll, Thanks for the great review! We appreciate your recognition and will do our best to keep up the great work! We work hard to provide customers with a great experience and look forward to continuing to do the same for you! We're here for you anytime!"
        }
      },
      {
        "author": "Chris Wells",
        "rating": 3,
        "review": "I have a friend who moved here.   His apartment was not ready to live in.  No one hooked the dryer up.  Holes in the walls.  I understand this is a section 8 unit but everyone deserves a walk through before moving in.  By providing section 8 they get a huge tax break.",
        "owner_response": {
          "text": "Hi Chris, \nThank you for bringing this to our attention. We are fortunate to be able to participate in Washington State's affordable housing program which comes with specific rules we follow. We understand your frustration and if you would like to contact us please email us at live@regencywa.com.\nSincerely,\nRegency Park MAnagement Team"
        }
      },
      {
        "author": "Kamaya Gonzalez",
        "rating": 5,
        "review": "I currently live here and I must say that for such a big complex of apartments, it is very much in order, and well maintained. Daneen and Diane are extremely wonderful managers who ,as I can only imagine, deal with many many issues throughout everyday, but still every time one walks in the office...you are greeted with a smile and a very courteous offer of assistance.\nI thank HNN properties for employing such great ladies for our office staff!",
        "owner_response": {
          "text": "Hey Kamaya, Thanks for the kind words! We value your feedback and look forward to seeing you again soon! As always, our team is looking forward to your next visit. See you soon!"
        }
      },
      {
        "author": "James Steele",
        "rating": 5,
        "review": "I have lived at Regency Park Apartments since 2009. Have REALLY enjoyed the place. There is a swimming pool, a movie theatre, an office to use computers, and a great bunch of friendly neighbors! The office staff will bend over backwards to help you with any problems that may arise. There are washers and driers in the apartments, and saved car spaces for a fee. Close to shopping, schools, and the bus line runs near it. Come check us out!",
        "owner_response": {
          "text": "James, Thank you for the awesome feedback. We value your feedback and look forward to seeing you again soon! Please reach out to us with any additional questions or comments!"
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Milagros B.",
        "rating": 5,
        "review": "Diane is my favorite office lady. She is always sweet and helpful. She left her desk to help us when we had an issue in our apartment and we needed her come see for herself.",
        "owner_response": {
          "text": "Hi Milagros,\nThank you for your review. We appreciate residents like you! We will pass along this comment to the On-Site Team.\nRegards,\nRegency Park Management"
        }
      },
      {
        "author": "Oleg S.",
        "rating": 5,
        "review": "I have lived here for almost three years now with my wife and kids. We have been blessed with living at regency park since day one. The staff in the front office is wonderful, the maintenance team is by far I've ever seen in any residence. You can tell they truly care about each family that lives here. They go above and beyond and try extremely hard. Thank you to every single person that works here to make it so wonderful. Bless you all!",
        "owner_response": {
          "text": "Hi Oleg, Thank you for your kind review; we are happy to pass along your comments to the team here at Regency Park Apartments! - HNN Communities Customer Service"
        }
      },
      {
        "author": "Anna S.",
        "rating": 5,
        "review": "Regency Park Apt truly deserves a 5 Star rating from me and my family members. We all agree that this place is amazing. Let me start by saying that ALL the people who work at Regency really make this place great. They are always so polite and professional. Absolutely ALL the people that work here deserve a medal. This place is constantly being built; like a new smoking area and a brand new children's play area outside. They also have a theater room, gym area, and a computer area. Also I notice how hard the workers are at their job; they care about this place, they constantly remodel, they constantly manage the areas that need tending, they are on time and work until the job is complete. My husband and I always see workers outside the complex fixing and building and always managing the trash. The office ladies are wonderful too! Any issues we had were taken care of right away. Plus our neighbors are great too; everyone here seems to mind their own business and it feels like a safe community. This place is huge so we have no problems with parking either. We are very happy living here. Thank you for all your hard work, our family surely appreciates it.",
        "owner_response": null
      },
      {
        "author": "Jane C.",
        "rating": 1,
        "review": "Currently live there, they don't uphold their own policies, they don't process paperwork in a timely manner, their office staff is overall poorly run and lack most common sense. As for maintenance, they half ass their jobs and often times don't come to fix problems when they say they will. My apartment has a washer that is so old that the metal all around the top and inside is rusting off and falling into the clothes loads (we have a roommate who has metal allergies and you can imagine this doesn't go well) and to top it off randomly stops working... rather than replace it they come in put some glue on it and wait for us to complain again and then tell us there is an on sight laundry facility (which costs money) but why use that when we pay 45$ each month to have an in unit washer and dryer?? There is frequent  apartment inspections for random things like stickers on the windows and every time they come in to inspect that the apartment they never take off their muddy boots. Carpet stains of course you will have to clean or it comes out of your deposit. It took them 2 months to get back to us with the results of a criminal background check to start the paperwork process of a new roommate which normally takes other apartments 2 days at maximum. Your rent is subject to price change even if you have a lease and will generally go up about 50$ a year. There is no parking tickets for people who park terribly over the lines or take up more than one spot ...and parking itself is very limited.  They overall will treat any complaint you have as if you are the problem even if its a reasonable complaint....Many of the ground floor apartments have moisture issues and have tendencies to grow  mold and the most that regency will do is give you a dehumidifier which you have to use but it runs up your electric bill.  Many of the people in the apartment complex leave their dogs waste EVERYWHERE so if you have kids always check their shoes. The apartment complex will send out fliers claiming they will give you a 25$ fine if you are caught but even if you have photo evidence of a person not picking up their dogs poop its not good enough. The management needs to see the person do it with their own eyes.. which they never will because they sit in their office all day and are out of sight of most of the grassy areas near the apartments.  So overall people can leave their poop everywhere knowing they have no consequences. There is no smoking allowed in the apartments however you are allowed to smoke on your porch IF you dispose of your cigarettes into an ash tray. However if you want to throw your cigarettes on the ground or even in front of your neighbors slider door so the smoke blows in their window go ahead again even though its against policy they wont enforce it. If you want to get your jolly's off of making your asthmatic neighbor go to the emergency room because you improperly dispose of your cigarettes GO FOR IT. \n\nThe was cheap when we moved in but now their rent prices are at par with other places.  The environment is total crap would not recommend to anyone.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 14,
  "adjusted_average_rating": 4.0,
  "distribution": {
    "1": 3,
    "2": 0,
    "3": 1,
    "4": 0,
    "5": 10
  },
  "summary": {
    "created_timestamp": 1739205580,
    "text": "<section id=\"good\"><h2>Good</h2><p>In the user reviews for Regency Park Apartments, many tenants express satisfaction with the sense of community and the amenities available. The residents frequently praise the property for having a friendly neighborhood atmosphere with activities like community get-togethers. The complex offers a variety of facilities including a swimming pool, gym, and walking trails, which several residents appreciate for enhancing their living experience. The management team is often highlighted for being understanding and approachable, with specific mentions of their willingness to solve issues promptly. For instance, one resident noted how the management team was quick to address problems, making the living conditions more enjoyable. Many reviewers appreciate the staff's efforts in maintaining the complex and the engaging family-friendly environment they cultivate.</p></section><section id=\"great\"><h2>Great</h2><p>What truly stands out in user reviews is the exceptional service provided by certain members of the Regency Park Apartments staff. Tenants frequently mention individuals such as Terri, Marcy, and Diane, citing their professionalism and kindness. People appreciate their efforts to foster a welcoming environment and their eagerness to assist. The maintenance team is also commended for being responsive and committed, often surpassing expectations by quickly addressing residents' issues. One tenant illustrated the exceptional service by sharing how the staff proactively managed repairs and improvements to the communal areas, contributing to a well-kept and safe community. The consistent friendliness and professionalism of the office staff provide reassurance and a sense of satisfaction among the tenants.</p></section><section id=\"bad\"><h2>Bad</h2><p>However, not every resident has enjoyed a seamless experience at Regency Park Apartments. Some reviews indicate a lapse in the effectiveness of the property management, especially concerning maintenance issues. A few tenants reported prolonged delays in fixing essential utilities, like malfunctioning appliances and safety hazards, which left them feeling frustrated and neglected. Communication breakdowns between the residents and management have also been noted, with tenants expressing dissatisfaction over unfulfilled repair promises despite multiple follow-ups. Furthermore, confusion about availability and improper responses during inquiries about apartment tours have frustrated potential renters, leaving some with a negative impression of the customer service.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Unfortunately, some user reviews paint a quite disheartening picture of certain aspects of living at Regency Park Apartments. A few residents have detailed ongoing issues with pressing maintenance problems, such as long-standing electrical issues and faulty appliances, that remained unresolved for months. One resident described the disturbing situation of an unsafe heater and broken washer, exacerbated by the management's apparent apathy towards rectifying these hazards. Additionally, there are complaints about the inconsistent enforcement of policies, such as those pertaining to garbage disposal, pet waste management, and smoking regulations. These unresolved issues have led some residents to feel disregarded and disillusioned, overshadowing the positive aspects of their living situations and resulting in calls for improved management practices.</p></section>"
  }
}