{
  "name": "Roma Management",
  "slug": "roma-management",
  "company_type": "company",
  "address": "557 W Bakerview Rd #108, Bellingham, WA 98226",
  "review_count": 75,
  "average_rating": 3.49,
  "reviews": {
    "google_reviews": [
      {
        "author": "Greg Fortune",
        "rating": 5.0,
        "review": "Erin and the staff at Roma Management were more than helpful, they were absolutely amazing!\n\nI was looking for a new apartment for my mother on short notice, and Erin and team went above and beyond to find us the right place at the right price, and helped us every step of the way. The new place is fantastic and my mother couldn't be happier. Erin was right, it was perfect for her.\n\nDespite the short notice combined with the twists and turns that go with getting in to a new place, Erin was always polite, cheerful, and thoroughly professional.\n\n10/10 - Would have my own mother rent here",
        "ownerResponse": {
          "text": "We are so thrilled to hear that your mother is enjoying her new home. We truly try our best to find the best fit for our tenants and happy this worked out for her. Thank you for your feedback this is so helpful.\nErin"
        }
      },
      {
        "author": "S. Jackson",
        "rating": 4.0,
        "review": "Pros:\n- Office management is very caring and professional, always willing to help with anything you need\n- Hardly raised the rent at all during my time here ($25 total raise for two years)\n- Easy to use portal for rent payments and maintenance requests\n- Very comfy & cozy with nice appliances, great insulation in the building\n\nCons:\n- Horrible parking. The customers from the massage parlor, delivery people, and tenant's guests constantly take reserved spaces. While the office staff tries very hard to help, sometimes the office is closed and nothing can really be done besides parking in the overflow parking lot which is further away. Not very fun when it's cold/rainy out\n- Slow maintenance. They are always very kind and always get it done but it takes awhile\n\nOverall I've enjoyed my stay here, I'm moving due to other circumstances but if I was looking to continue living in a studio apartment I'd stay",
        "ownerResponse": {
          "text": "Hi Sarah, We appreciate your residency for the past two year and welcome your feedback. Regrettably parking allocation is out of our control, we do inform all our prospective tenants prior to renting about the challenges. Our goal is to ensure maintenance items are completed in a timely manner however some items do take longer. The Property mangement does need to owner to approve maintenance."
        }
      },
      {
        "author": "Katelyn",
        "rating": 5.0,
        "review": "Before Roma took over as my property management company it took weeks to have things fixed, if they ever even got fixed. Usually things were just ignored or brushed off and I ended up having to do a lot of repairing around my super old house myself. Since Roma took over Ive felt like Im actually being taken care of again and its a breath of fresh air. By far the most attentive and generally best property management company Ive rented through since I started renting years and years ago. From day 1 theyve been super caring and on top of things. Thanks for all you guys do!!",
        "ownerResponse": {
          "text": "Thank you for sharing your experience! We're delighted to hear tht you apprecaite our efforts to provide exceptional support. Your feedback movtivates us to continue delievering the best service to our residents."
        }
      },
      {
        "author": "Michael J. Berger",
        "rating": 5.0,
        "review": "Erin at ROMA is absolutely terrific! Over the last 5 years she has been a tremendous help with all my property management needs and is a breathe of fresh air when it comes to overall customer service.",
        "ownerResponse": {
          "text": "It's been a pleasure working with you too, Michael! I'm passionate about what I do and always strive to help others. Thank you for taking the time to recognize my efforts; it means a lot to me."
        }
      },
      {
        "author": "melissa zuk",
        "rating": 5.0,
        "review": "We moved into a property managed by Roma about 2 weeks ago and our experience has been exceptional! The team worked hard to get our place ready so we could move in before the available date and welcomed us warmly upon arrival from out-of-state. They've made all repairs in a timely fashion and are prompt with responses to our questions. We are so pleased!",
        "ownerResponse": {
          "text": "Thank you for your kind words about your experience with us. We try our very best to make your experience with us enjoyable. "
        }
      },
      {
        "author": "Malynne Castro",
        "rating": 5.0,
        "review": "Very pleased with our application and move in process through Roma! A simple, easy, and fast process where we felt valued and supported. The ladies in the office that helped us; (Erin, Becki, and Emma) were so incredibly kind and efficient. Ive had all my questions answered and these folks truly care about their residents experiences. Very happy with our new property management. I highly recommend Roma Property Management!",
        "ownerResponse": {
          "text": "It has been a pleasure working with you and we greatly appreciate your feedback."
        }
      },
      {
        "author": "Roberto Chavarria",
        "rating": 5.0,
        "review": "Best experience ever! With the housing market the way it is right now not everybody cares about the renters so much, well this is not the case of Roma Management, they were all very supportive and listening specially Erin, we moved from a different state and we were not able to see the apartment in person before we moved in but Erin made us feel confident that we were going in the right direction, guided us through the whole process without running into any issues.\n\nSame thing happened when we moved out, everything was super clear and done efficiently. We moved before our lease finished and Erin helped us to get someone in as soon as possible!\n\n100% recommend ",
        "ownerResponse": {
          "text": "Thank you for sharing your experience with us and seeing the value in the service we provide, we(I) do care and it's so nice to see that it is apprecaited. It was a pleasure to work with you and your family. If you ever need another rental in the future we would love to work with you again."
        }
      },
      {
        "author": "Gabriel Casasanta",
        "rating": 5.0,
        "review": "Roma management has been amazing to me! I was working with Erin one on one and she has been reliable, understanding and flexible about my situation. She always picked up the phone when I answered and was so prompt! She and the owner helped me get approved for a studio and genuinely wanted to help me out as a human being. It was very refreshing considering most these rental companies in Bellingham dont have the best reputation. Roma management are REAL AUTHENTIC people who want to help. I met Emma in the office as well, she was so sweet and kind and scanned my paper work to put in my application right away. I thoroughly enjoyed my time working with them and felt listened to understood by them. Thank you Roma!",
        "ownerResponse": {
          "text": "It was pleasure working with you and we appreciate you sharing your experience with us. We try to provide the customer service that everyone desires and happy saw it first hand.\n"
        }
      },
      {
        "author": "Candace",
        "rating": 4.0,
        "review": "Erin in the office was amazing. Minor fixes tend to get left behind, large things are fixed very very quickly. Overall, a very good experience, especially considering the property management experience in Whatcom County as a whole. *Insect maintenance on the property could be improved as spiders are not my favorite.",
        "ownerResponse": {
          "text": "It was pleasure working with you these past FIVE years. I hope your move went well! Thank you for your tenacy! I hope all went well with you move and settling in, we would love to work with you again."
        }
      },
      {
        "author": "Journey Howden",
        "rating": 5.0,
        "review": "Erin helped my boyfriend and I get set up with our first home! She was so much help and made the process incredibly smooth.",
        "ownerResponse": {
          "text": "It has been a pleasure to assist you during this process and I look forward to working with you. Thank you for your kind review."
        }
      },
      {
        "author": "Jessica Warrick",
        "rating": 5.0,
        "review": "Erin from Roma made our renting experience wonderful. Her attentiveness and dedication to making every interaction human instead of a cold corporate response was refreshing, to say the least. She truly went above and beyond, setting a new standard for your typical management company. A sincere thank you to Erin and the entire Roma team.",
        "ownerResponse": {
          "text": "Hi Jessica,  Thank you for your very kind feedback! It is so rewarding when you see that someone like you appreciate all that we do. We truly love helping people. All the best to you moving forward."
        }
      },
      {
        "author": "Kayleigh Banks",
        "rating": 5.0,
        "review": "We are so happy with Roma Management. I rented a gorgeous apartment in Ferndale from them for a few years and then when my relationship changed they helped me coordinate a transfer to a different apartment and really made a very difficult time a lot easier with their support. Since then I have rented two other apartments from them and can tell you everything has been great. Erin in the office is on top of things and very responsive. If you are looking for a place to live, check them out.",
        "ownerResponse": {
          "text": "Thank you for your very kind feedback, we truly appreciate that you took the time to share your experience. Thrilled to hear you have enjoyed your time with us thus far and look forward to working with you in the future.. "
        }
      },
      {
        "author": "sabine KEMPfe",
        "rating": 5.0,
        "review": "Erin is a god send. She was super friendly, attentive and informative. She worked with me for our special move in circumstance, and considered both my needs and the needs of the owner until we came up with a solution, which shows she is both an excellent employee and a genuinely caring person. She was also INCREDIBLY fast in the approval process which made everything so much less stressful. Emma also showed me our unit, and she was really nice and super helpful. The company as a whole has been super upfront with what the need/expect, and none of their requests have been obscene or unwarranted. The listings are extraordinarily accurate to the units, which has not been the case with many property management companies in Bellingham. Definitely my best experience with rental companies so far! Looking forward to moving in :-) Thanks guys!",
        "ownerResponse": {
          "text": "Hi Sabine, thank you for your kind feedback! We truly appreciate that you recognize our efforts, and look forward to working with you."
        }
      },
      {
        "author": "Colleen Johnson",
        "rating": 5.0,
        "review": "So far from my moving in 3 years ago to now they have been great. Erin always answers my calls and is very helpful. They are great. The owner has some things they should maintain better but the property managers can't make them do it but I know Erin reports concerns to them. Thanks Guys. I hope I'm able to stay here after the inevitable rent increases.",
        "ownerResponse": {
          "text": "Hi Colleen, Thank you so much for your wonderful feedback, it has been a pleasure to work with you these past few years. "
        }
      },
      {
        "author": "Victoria Alvarez",
        "rating": 5.0,
        "review": "Erin is one of the most attentive Property Managers I have worked with.  I have tried to apply to a couple of different properties in Bellingham and had to always chase them down to get a reply.  I spoke with Erin after the office was already closed for the day and she spoke to me for an hour before I even applied.  Later that evening, I applied for the apartment and received approval in less than 24 hours.  This tells me a few things about Erin and ROMA Management:\n1) They understand how stressful looking for an apartment is and try their best to make it as pain free as possible.\n2) They listen to what your needs are and do their best to accommodate.\n3) They are here for the tenants and property owners; looking to find the best fit for both.\n\nThank you Erin and ROMA Management for putting your clients first; tenants and owners.\n\nLooking forward to seeing you in August.",
        "ownerResponse": {
          "text": "Thank you so much for your kind words and you amazing review, Victoria. We really appreciate you taking the time to share your experience with us and the community. It is so nice to hear that our efforts are making a difference. We look forward to working with you."
        }
      },
      {
        "author": "Chris Throop",
        "rating": 5.0,
        "review": "I first applied to the apartment without even looking at it, knowing that it was a solid place and very good location. My first visit to the apartment complex  was comfortable, the setup of the building feels new and modern. Everything inside the apartment is up to date and all well managed. Solid heaters, good washer/dryer/dishes, and an overall very easy to maintain flooring/cabinets/etc. Thanks again Roma and all their counterparts.\nSincerely, Unit 207",
        "ownerResponse": null
      },
      {
        "author": "Julie Jakobitz",
        "rating": 5.0,
        "review": "Erin does an amazing job!  I worked closely with her for several weeks getting someone placed at one of the properties.  This case ended up having a ton more paperwork than usual.  Erin was dedicated to working with me and getting this person placed.  She consistently answered the phone on my first try and she communicated clearly and with a cheerful attitude.  She went above and beyond and has a honest, helpful and professional disposition. Michelle, her assistant, also was accommodating and great to work with.  Thank you Roma Management for really showing that you are here to serve those in need of a safe and comfortable place to live even when there is extra work involved!",
        "ownerResponse": {
          "text": "Julie it was a pleasure to work with you as well. It was wonderful to work as a team to place your client. You make a difference."
        }
      },
      {
        "author": "Irena Kolbert",
        "rating": 4.0,
        "review": "Nice and fancy units I have to say! There is always parking in the Ferndale Willy Flats, and it was overall a great experience. I didn't like that they kept my $1250 deposit when I moved out early though. There were no damages at all in my unit, but they apparently keep the whole deposit if you don't stay the whole lease. Other PM companies like Landmark don't charge that high of a fee to break a lease, especially considering they now can rent my spot for a few hundred dollars more per month just because I left early. If anything, I did them a favor lol. But oh well, it was a nice apartment at least.",
        "ownerResponse": {
          "text": "Thank you for your comments - Regrettably the security deposit is forfeited if you break your lease agreement with us, this is our policy and also listed in the lease agreement signed by all residents. Not all management companies manage to the same criteria that is why it is very important to know what you are signing. Happy to hear you generally enjoyed your time with us."
        }
      },
      {
        "author": "Justine Griffith",
        "rating": 5.0,
        "review": "I have been with Roma Management for almost a year now. Whenever I have a problem, they are quick to respond and show they truly do care for your best interest. I've spoken with all of the staff and each one has been nothing but kind and thoughtful. Unfortunately, one of the apartments were not in a good condition due to previous renters... However, the Roma Management team have continued to communicate with me every step of the way and have worked to fix everything that needs to be fixed.\nI want to say a very special thank you to Erin Galbraith in specific. She is so kind and hard working. Erin works to help find the solution for all of your problems and continues to follow through with what she says will happen. I appreciate all of her hard work and dedication to her work, she always go above and beyond (which is so hard to find)!",
        "ownerResponse": {
          "text": "Justine - we appreciate you and your patience with this unique situation."
        }
      },
      {
        "author": "Elijah Owen (Eli)",
        "rating": 1.0,
        "review": "I put in eight maintenance requests and only one was taken care of because it was a leak in the sink and it would damage their property. 2 years I was being strung along with a simple door fix.\n\nLady in the office is extremely rude. Avoid at all costs.",
        "ownerResponse": {
          "text": "Please do not base your judgement/opinion about Roma Management by this review, there is so much more to this situation than the person is willing to share, lease violations etc. "
        }
      },
      {
        "author": "Ilya Shportko",
        "rating": 5.0,
        "review": "Really awesome service. I enjoyed my stay there. Everything went well. Erin did a really great job helping my wife and I get in the unit and out. We were able to successfully receive our security deposit as well. I would recommend them any day.",
        "ownerResponse": {
          "text": "Thank you for your kind words, we enjoyed working with you as well. All the best to you both moving forward."
        }
      },
      {
        "author": "Jin Soo Hong",
        "rating": 5.0,
        "review": "We feel blessed in getting to work with Erin of finding our new apartment in Bellingham, WA. She is very kind will find you the perfect home / apartment that meets your need. If google had 10 stars rating, she deserves full 10 stars.",
        "ownerResponse": null
      },
      {
        "author": "Steven Boring",
        "rating": 5.0,
        "review": "Erin is very easy to work with and does her Job well. If you need something and she doesn't have the answer she will go out of her way to try and find it. I've dealt with 3 other property management companies and this one has been by far the best. Thanks Erin!",
        "ownerResponse": {
          "text": "Hi Steven it has been a pleasure to work with you. Thank you for your kind words."
        }
      },
      {
        "author": "Andrea Velasco",
        "rating": 5.0,
        "review": "Erin is the best!! She always try to helps and make things easy. I had a great experience renting with Roma Management.",
        "ownerResponse": {
          "text": "It was a pleasure working with you as well. Thank you for sharing your experience with us. All the best with your move."
        }
      },
      {
        "author": "Tanya Chase",
        "rating": 5.0,
        "review": "I moved into the Ferndale location about two and a half years ago. Since then I have had to call Roma a handful of times for everything ranging from noise complaints to trash to questions about decorating my door they have always been quick to return my calls very professional. I feel that they will go out of their way to help you problem solve most issues. At 46 years old I have had a handful of rental management companies throughout the years and roma is definitely at the top of that list. I hope that people will remember that they are simply a middleman in between us and the owner and just because we reach out to the management company doesn't always mean the owner is going to comply.",
        "ownerResponse": null
      },
      {
        "author": "Jacob Olsen",
        "rating": 5.0,
        "review": "We came from another complex (VABC) where management was sub-par. Our experience has been awesome with Roma. We had a delay with our complex opening and they worked with us and even offered to help us out with storing our stuff. Erin is a huge asset to this company as well. Her customer service is unmatched and she truly cares about the tenants. Highly recommend this company.",
        "ownerResponse": {
          "text": "Thank you so much Jacob for your kind words! We are so pleased to have you as a resident!"
        }
      },
      {
        "author": "jmajor29",
        "rating": 5.0,
        "review": "I rented from Roma for 3 years and never had a problem with them. The customer service in the office was Outstanding! The apartments are beautiful. The appliances worked perfect! I Never had a problem with mold or bug's in the apartment. The location was great!  And the rent was reasonable. I would definitely rent from them again!!\n\nFive Stars Roma! You are Excellent!! Thank you for everything!\n",
        "ownerResponse": {
          "text": "Thank you for taking the time to give us your thoughts - We will miss you! All the best!"
        }
      },
      {
        "author": "Liana Harvey",
        "rating": 5.0,
        "review": "Had a pretty great experience with Roma. Erin was very nice and helpful with the moving in and out process and was always pleasant to talk to. Great location of units and will definitely keep in mind for any future moves.",
        "ownerResponse": {
          "text": "It was a pleasure working with you. Thank you so much for your sharing your experience with other."
        }
      },
      {
        "author": "Lio C",
        "rating": 1.0,
        "review": "Erin was extremely rude to my partner on the phone. Hung up on him when he asked about getting the lease contract in writing. The rude behavior only started after we had turned in our applications-- which is when they would have learned that my partner is disabled. Not using my real name on google, by the way, so their canned \"this person has never had dealings with us\" response won't fly.",
        "ownerResponse": {
          "text": "This information is disappointing to hear. I always go out of my way to assist someone and feel there is more to this then the person is wanting to share and why they did not reveal their real name."
        }
      },
      {
        "author": "Marva Biggar",
        "rating": 1.0,
        "review": "This place is an absolute scam. I asked what I needed to do to break my lease early and was advised I would need to forfeit my deposit and provide an intent to vacate. I sent them my intent to vacate, 5/30 and was completely out of the unit on that date including turning in my keys. Tell me why I just got a bill in the mail for partial rent to 6/3! I was out before the 1st of June as discussed. Im NOT paying you $80 for a month I did not even have keys to an apartment.\n\nWhile I lived here I constantly had to deal with horrible parking restrictions which on occasion left me without a parking spot in my own lot, the worst most inconsiderate neighbors constantly violating the terms of the lease and when a complaint was sent, they didnt take any action. The garbage area was always a disgusting mess and they would just let it overflow till someone decided to complain. The office management is never in office during their regularly scheduled hours and they are completely clueless most of the time.\n\nI advise not to rent here. Youre better off renting privately as most of the rental companies in the Bellingham area are a sham!\n\nAlso dont worry about providing some canned response. Not gonna pay attention to it nor will I respond so it will be a waste of your time.",
        "ownerResponse": {
          "text": "Hi Marva Biggar, thanks for sharing your feedback. We are sorry to hear you didn't have a great experience. We take your feedback seriously and hope you'll give us another chance."
        }
      },
      {
        "author": "Lynn G",
        "rating": 5.0,
        "review": "Erin Galbraith is amazing! She worked her hardest to help my family get into a place and has been a sweetheart the whole time. Thank you so much!",
        "ownerResponse": {
          "text": "It was a pleasure working with you and your family. Thank you!"
        }
      },
      {
        "author": "Dima Karashchuk",
        "rating": 5.0,
        "review": "Had a great experience staying at Willy Flats. Roma Management  helped us out all of the two years that we stayed there. Great team, great communication skills.",
        "ownerResponse": {
          "text": "Hi Dima, thank you for your positive review, we appreciate your feedback. We enjoyed working with you these past two years. All the best.\nErin - Roma Management"
        }
      },
      {
        "author": "Skye Saxon",
        "rating": 5.0,
        "review": "I lived at a Roma property with roommates while I was going to school in Bellingham, it took MONTHS to find a place and none of the several places I looked at compared to this apartment. Our unit was spacious and modern and close to I-5 and shopping. I will say, there seemed to be poor installation and winters were rough here. During storms, I've also been locked out of the building. I always felt taken care of by management, but was a bit shocked by the huge rent increase during my first few months living there. By the time I left, rent increased nearly $400! Maintenance was slow and difficult to reach, parking was totally a disaster, but I think they were more than accommodating with frequent roommate changes than I would have expected, considering the building was mostly made up of quiet family types. Now that I'm starting my own family, I'd like nothing more than to move back into these apartments- however the rent is getting a little steep (I'm currently renting a 2 bd in Seattle for about $1300, it's tiny but it's affordable and close to everything). If I ever move back to Bellingham, I would definitely look at Roma properties first.",
        "ownerResponse": {
          "text": "Thank you for your review. We are glad that you had a good experience with Roma Management."
        }
      },
      {
        "author": "Jeff Singsaas",
        "rating": 5.0,
        "review": "In the complete free for all of finding a place to rent in Bellingham prior to the school year, I FINALLY spoke to a real person and, fortunately it was Erin at Roma Management.  She was friendly (rare), helpful, knowledgable, and helped structure a fair agreement.  She stayed in touch during the approval process so we weren't in the dark (again, rare) and all paperwork arrived on time as promised.  Erin is a great rep for Roma and a solid professional.",
        "ownerResponse": {
          "text": "We appreciate you taking the time to leave this review!"
        }
      },
      {
        "author": "Amber Abapo",
        "rating": 1.0,
        "review": "Haven't gotten to our maintenance request for 3 months now. Almost 4. Accusing us of not nofiying them of our pet rabbit. Bills us a $200 \"late\" bunny fee. Tells us they gave us a PAPER notification about the rabbit hutch outside when we never received one. Asked for email in addition to a paper notice just in case...no response. Someone else literally has a bed frame out on their deck, and we can't have a hutch? Lack of communication. But they can send emails out, I wonder why? Why bother having a 5 hour office hour when you're hardly there for 3 days out of the week?[October 1, 2017] It's not our fault that you refused to meet us to show us the unit and sign the lease just because it was \"your day off\". We set a time to meet, waited 2 hours. Never showed. [October 2, 2017] We had to extend our Uhaul another 24 hours and try to move everything into the unit before one of us had to return the Uhaul AND get to work on time. Physically let the maintenance guy know about the walls, said he'd come in later the week. No show. When we came that morning they didn't seem to expect us to show up and had to rush to get all the paperwork ready, which is probably how they forgot about our pet fee. STILL not OUR fault. We signed, paid for the deposit + first month's rent assuming we were also charged for the pet fee. And here we are now. I don't expect to stay here much longer after our lease is done. Worst service I've ever experienced.",
        "ownerResponse": {
          "text": "Thank you for your impute.  We are disappointed to hear that you have been so displeased. We again apologize for the rushed process you experienced at move-in. This dissatisfaction is precisely why we no longer bend on our move-in dates for residents, even if they plead with us to allow them to move in sooner. Unfortunately, things fall through the cracks, such as an overlooked pet or not enough time to perform touch up painting, which was the downside to your move in.\n\nIn reference to unauthorized items on patios, please understand that everyone who is in violation of these policies is notified to rectify them, whether the tenant does so immediately is a different story. In which case we continue to take action with these tenants who are in violation.\n\nThank you for being prompt to comply with the patio polices.\n\nWe wish you all the best in your further adventures in the renting world."
        }
      },
      {
        "author": "Sarah Finkbonner",
        "rating": 5.0,
        "review": "Romas' management team is assume! They respond promptly, an are a group of fantastic ladies who go above and beyond!",
        "ownerResponse": {
          "text": "Thank you Sarah for your kind feedback! We enjoy working with you as well, you are an ideal tenant. "
        }
      },
      {
        "author": "kyle shadowchain",
        "rating": 3.0,
        "review": "I have not actually dealt with the owners or any staff...but I have been waiting a good almost 10 minutes for someone to come by the office in romark flats to apply for their 2 bed 1 bath apartment. The office is not supposed to close till 2. There is no one inside and doors are locked. I am giving it 3 stars just cause I haven't actually dealt with anyone but I may have to adjust that depending on if someone shows up. This is not good business. No \"out to lunch\" sign or any sign of when they will be back and I even met a tenant from one of their buildings. Says it was a pain and a half to get into his apartment but after that he hasn't had to deal with them much. Good rent, beautiful apartments. But so far as I can tell good luck getting in. I'm gonna walk over to windermere and see if they can work with me.\n\nUPDATE: i have since not only met with their stafg but have moved into an apartment here. I must admit im glad i only gave them 3 before because ot was fair for having not met them. Upon meeting her and moving in she has shown me why they have such great reviews. Knowing it was my first place she helped me with the walkthrough and checklist stuff so when i eventally move out, which i dont see happening fof some time, i wouldnt be charged for things that were not my fault which she could have stayed silent. Let me fill out the form and then charge me at the end like crazy. Now not to say there was a bunch wrong. A ding here, some chipped plaster there. For someone like myself nothing too huge. Standard wear and tear living. But i never would have marked it if she had not been so helpful.\n\nI will say my only gripe about this place if anything given how awesome erin has been and helpful too is the lack of an elevator. I have a handicapped younger brother and elderly grandparents who would love to stop by but alot of planning has to go into ot to make sure they can get up the stairs or im there or someone is who will carry my brothers wheelchair up the stairs. However their ground floor units look awesome and have just from the few peaks i have gotten from open shutters and walking around between my apartment and the mailbox. So im sure if they did get someone who needs handicap accessible housing they could accomate if a ground floor apartment was available.\n\nEven if they added an extra little wheelchair lift id rate this place even higher. But for now 5 stars is certainly what romark flatts and erin are worth as i love living here so far.",
        "ownerResponse": {
          "text": "Hi Kyle! We apologize for not being in the office when you came by. We do have limited staff this week as some called out. With it being the summer months it is an extremely busy season and we are out showing units and preforming move-ins almost everyday. It is best to schedule a tour with us in the future. To avoid future frustrations we will be changing our hours to \"Be Appointment Only\". Again we are apologetic for missing you earlier today. All the Best to you."
        }
      },
      {
        "author": "Duncan (hikesafely)",
        "rating": 3.0,
        "review": "My Deposit was a struggle to get back.\n\nI spent a year in the apartments on W Bakerview. (I left June 2019) During my stay I had a very pleasant experience with the management. However when I moved out they charged me for the disposal of mattress and box spring that was \"inappropriately left at the dumpster.\" I DIDN'T EVEN OWN A BOX SPRING. So I was charged for someone's garbage. I complained to the management and they said they would remedy the situation. I have not heard from them since.\n\nUPDATE : As of Aug 8, 2019 I have yet to receive this refund.\n\nUPDATE : As of Sept 1, 2019 I have received my fair share of the deposit.",
        "ownerResponse": {
          "text": "Duncan as I had stated that I will refund you the hauling fee that was charged to you.  You should be receiving a check in the mail by the end of the week. Sincerely-Roma Management"
        }
      },
      {
        "author": "Daniel Karpov",
        "rating": 1.0,
        "review": "I've been a first time tenant with this property management since July 2018. I had emailed them numerous times about overflowing dumpsters/recycling bins, unauthorized vehicles parking, and maintenance issues and not once have received a response back. No matter what day or time of the week I stop by the leasing office, their door is always locked and they are out of the office. When calling, goes straight to full voice mail box after a few rings. Impossible to reach! Overall, terrible property management company.",
        "ownerResponse": {
          "text": "We appreciate your input and would like to work with you about these issues.We have been working hard to resolve these issues however it is a tedious task and we will continue to work on this."
        }
      },
      {
        "author": "Erica Gonzalez",
        "rating": 1.0,
        "review": "They left during the pandemic and let all the weeds overtake the apartments. When they came back and without warning they sprayed herbicide during the middle of the weekday at like 4pm. When I brought this to the owners attention he said its just round up. I had a reaction to it as did another neighbor of mine. That tells you everything you need to know.\n\nThey have gaslighted me as they are doing below and they will pretend they havent gotten your calls, emails, or letters. Get a landlord u can trust.",
        "ownerResponse": {
          "text": "The move-out paperwork was sent out on September 17th which is well within the 21 day time frame that is required by law. Per the tenants request the Move-out paperwork was sent to their employers address. Our office was just notified today, Thursday, 9/24 at 9:00 am. We addressed immediately, confirmed the mailing address, sent an  electronic disposition letter and stated we would issue you a new check if they still could not find the letter sent to employer, tenant agreed.  Rather then writing this review I wish they would have contacted us earlier to resolve."
        }
      },
      {
        "author": "Emily Rossing",
        "rating": 5.0,
        "review": "We just got an apartment through Roma and so far it's been a breeze! Amanda and Erin have been so great with the application process and have answered every question for us! We look forward to renting from them.",
        "ownerResponse": {
          "text": "Thanks so much! We can't wait to serve you again soon."
        }
      },
      {
        "author": "Abrielle Tolle",
        "rating": 5.0,
        "review": "Erin has gone out of her way to make sure my renting experience was as painless and transparent as possible. I've greatly appreciated the time she's taken to help me out.",
        "ownerResponse": {
          "text": "It's been a pleasure to work with you as well. Thank you for renting with Roma Management."
        }
      },
      {
        "author": "Austins Challenges",
        "rating": 1.0,
        "review": "Warning for everyone applying here. The 100$ fee does not do anything. After placing the holding fee and turning in our applications we find out they rented our place out to someone else while we had the hold on the place and they hadn't even looked at all applications. and when i went and talked to the property manager she could only blame the computer for messing everything up and offered no help with rude overtones the entire conversation.",
        "ownerResponse": {
          "text": "While we always strive for satisfaction with prospective tenants, unfortunately, things do not always work out. Specifically, in your case, you should have never been allowed to place the holding fee down on the unit until your application had first been approved. We have taken the proper steps to ensure this does not happen again.\n\nWe did do our best to offer you another unit we had available at the time, with no response from you.  We do empathize with your disappointment and understand your frustration.  While we know that the refund of the full $100 holding fee could not make up for the lost unit, we had hoped that no ill feelings would set in and that we would have retained you as a resident."
        }
      },
      {
        "author": "Jessica Coogan",
        "rating": 5.0,
        "review": "Erin is so helpful and a great person to work with. They provide excellent customer service and provide as much leniency as they can given lease restrictions.",
        "ownerResponse": {
          "text": "It is a pleasure to work with you. Thank you for your tenancy with us."
        }
      },
      {
        "author": "MarLa Williams",
        "rating": 5.0,
        "review": "Erin is fantastic and professional. She was amazing with the move in and outstanding with helping with the move out. Great management by Erin.",
        "ownerResponse": {
          "text": "Marla, it was a pleasure to work with you as well. Happy to help resolve your move-out from the previous management."
        }
      },
      {
        "author": "Veronica Marie Perez",
        "rating": 5.0,
        "review": "Management has been communicative, helpful, and welcoming. The move-in process was easy, complaints are heard and responded to, and most of the residents Ive met are extremely friendly. Great place to call home!",
        "ownerResponse": {
          "text": "Thank you Veronica, It's been a pleasure to work with you as well."
        }
      },
      {
        "author": "Anjoli Garrison",
        "rating": 5.0,
        "review": "very helpful & kind management, really helped me get into a place in about a weeks time!",
        "ownerResponse": {
          "text": "Thank you for your feedback, we are more than happy to assist and look forward to working with again."
        }
      },
      {
        "author": "Savvy Shopper",
        "rating": 1.0,
        "review": "Regularly overinflates the values of the homes they list for rent on Zillow.  The last one I checked was overinflated by more than $100,000 over its actual value.  Pity the people dumb enough to rent that.  When you come across a listing by these folks on Zillow, report the listing.  Actual values of homes are located on the Whatcom County Assessors Page.  Look it up by property address, easy to find the owner, square footage, and actual value of the home.  BTW, charging $100 to hold a house and then renting it to someone else without returning the fee is ILLEGAL.",
        "ownerResponse": null
      },
      {
        "author": "Jacob D",
        "rating": 1.0,
        "review": "Withholding deposits whimsically, or because they know its on the former tenants time and resources to get it back, is just outrageous. This is a poorly managed establishment. Dont expect to get good response time to your most basic of needs or wants.",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "Inna Gamdysey",
        "rating": 5.0,
        "review": "Very helpful management. Pleasant to work with. Caring.",
        "ownerResponse": {
          "text": "Inna, thank you so much for review, we truly apprecaite you and your feedback and look forward to working with you in the future."
        }
      },
      {
        "author": "Emmanuelle Maher",
        "rating": 1.0,
        "review": "these folks will NOT give you your deposit back. theyll dodge your calls. not only are they stealing hard-earned wages, but peace of mind, too.",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "Leticia Velasco",
        "rating": 5.0,
        "review": "Amazing costumer service! They're always  there for all our needs! we been with them 2 years and we have no complaints ! thank goodness we found a amazing landlord!!! soooooo happy!!!!!",
        "ownerResponse": null
      },
      {
        "author": "Jacob Blankenship",
        "rating": 5.0,
        "review": "Been living in their units for about 3 years now, the unit I have is well built and they respond quickly to my issues that arise.",
        "ownerResponse": {
          "text": "Thank you Jacob! We strive to give the best service possible. We appreciate you as a resident of Roma Management."
        }
      },
      {
        "author": "Lisl Ost",
        "rating": 1.0,
        "review": "they should really rename the deposit bc YOU DON'T GET IT BACK and that's not a deposit. they've apparently always done this read the other bad reviews",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "Nathan Jaimez",
        "rating": 1.0,
        "review": "Very poor management when it comes to customer service. Not to mention they withhold your deposit. Look elsewhere to avoid this problem. Highly recommend you dont support this establishment. Complete waste of time and money.",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "MegaJabboy",
        "rating": 1.0,
        "review": "Non-communicative and highly unprofessional, these people are currently holding my friend's deposit illegally without any reasoning! No walk out sheet or anything! Really disgusting and illegal, avoid this place!",
        "ownerResponse": {
          "text": "This tenant was given their disposition letter according to the law and send to the tenant's specifications."
        }
      },
      {
        "author": "steven trujillo",
        "rating": 1.0,
        "review": "I applied for a unit with this company, I was the first to submit all required documentation and they rented the unit out from under me.",
        "ownerResponse": {
          "text": "Steven, we are very sorry that this did not work out.  Unfortunately there was another application that had been submitted when your application came in.  They did get their final documentation in prior to your last document arriving.  We do have a policy of first come, first serve and do not hold rental units when they are available.  Again, we are sorry this did not work out and wish you well."
        }
      },
      {
        "author": "Remi Vitales",
        "rating": 1.0,
        "review": "Impossible to get deposit back. BE AWARE! They will keep your deposit no matter what.",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "Makayla Montoya Frazier",
        "rating": 1.0,
        "review": "Dont rent here if you plan on getting a deposit back! Unprofessional and lackluster. They are also LIARS, see below ",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "Victoria Brown",
        "rating": 1.0,
        "review": "If there was a zero star rating they would get it. Terrible! Just dont use them!",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management. I find it strange you have the rating since we have never worked with you."
        }
      },
      {
        "author": "Sarah M",
        "rating": 1.0,
        "review": "SCAMMERS!!!!!! They will keep your deposit and ignore your calls!!!!!!!!!!!! If I could give them negative stars I would!!!!!!",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "Eliot Tole",
        "rating": 1.0,
        "review": "Worst ever. Dont even bother renting from them.",
        "ownerResponse": null
      },
      {
        "author": "Zach Appelbaum",
        "rating": 1.0,
        "review": "Horrible service. Dont mess with these guys.",
        "ownerResponse": {
          "text": "False Accusation. This person has no dealings with Roma Management"
        }
      },
      {
        "author": "James Hong",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Bryli Elsner Blankenship",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Bryli - we were so happy to help with your situation!"
        }
      },
      {
        "author": "Bruin 34",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "mahinahiapo",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ryan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Amanda A.",
        "rating": 2,
        "review": "Positives: the office gals were always friendly to us and did their best to assist and for the space, they were a good price compared to the surrounding area - $1150 for a 2 bed/1 bath. We also loved how wide they made the staircases as this was helpful when moving in. The layout overall was also nice! It felt secluded with the surrounding nature which was part of what drew us there. \n\nNegatives: pieces of Willy Flats and the owner. The owner is not a \"people person\" at all and has no manners that we - or the neighbors we would often chat with - ever saw. He literally yelled at my partner (while he was letting our dog pee in a grassy area) telling him he isn't allowed to pee on the concrete (what dog chooses to pee on concrete?!) or on site - which the lease didn't state anywhere and there's no designated pet area on site and the apartments have nothing near by. He didn't even introduce himself or apologize after my partner corrected what the owner thought he was doing. \n\nSo, on to the apartments...they look nice overall but you can tell that they bought whatever materials could be found because few of the apartments even actually match and even within the apartment there are three different \"wood\" colors ranging from blonde to red tones - so random. The walls between people's living rooms and the next tenants bedroom are quite thin. You can hear whole conversations type thin...the floor is so cheap that dropping and ICE PACK dented it. Literally dented it. There were dents in the floor before we even moved in and we were the first ones to ever live there. There is no guest parking on site, and the apartments are in a random area with no alternate parking options available - not even a shoulder on the main road. People were CONSTANTLY making a huge mess of the trash/recycle area. They really just need to put money into cameras so they know who is abusing the rules, but it seems the owner was too cheap? So instead, every month that people made a mess of the area they would charge extra to ALL tenants. \n\nAll in all, not a great experience. Seems more of a money focus as a whole. If it weren't for the kind office staff, it'd be a 1 star.",
        "ownerResponse": null
      },
      {
        "author": "Jaz G.",
        "rating": 1,
        "review": "Extremely Unprofessional staff. Withhold deposits over a month, against state law. Very small parking lot, no guest parking at all. Do not live here if you want your loved ones to comfortably visit you.",
        "ownerResponse": null
      },
      {
        "author": "David G.",
        "rating": 1,
        "review": "Absolutely ridiculous phone etiquette. Customer service was so unexpectedly terrible. Treating us as a nuisance for wanting to see a unit. If my first and only conversation with them reflects their management style I would never bother making your first call.",
        "ownerResponse": null
      },
      {
        "author": "Michelle B.",
        "rating": 5,
        "review": "I lived in the Willy Flats apartments managed by Roma. When I had an issue and reached out to Erin I got very timely responses and they dealt with whatever the issue was promptly. I ended up getting a job out of state and had to break my lease. I contacted Erin and was informed that my deposit would be forfeit (fair, I signed a contract after all) , but that she would try to rent my unit so I would not be responsible for rent for the remaining 2 months. I moved out mid-month, so she told me to pay the full month's rent and that should cover cleaning costs, carpet (I have animals and there is a fee listed for this in the lease), and any damage. That seemed fair to me, so I did that, not expecting to get any money back. Not only did she rent my unit, saving me a lot of money, but I was just notified that I'm getting a lot of the rent overpayment back. I did return the apartment clean and without damage, but like I said, I didn't anticipate getting any money back. I'm shocked. Roma is the first property management company that I've had where I've walked away feeling like I was treated fairly, they are so lucky to have Erin. And that's saying something, because I did break my lease and normally that would make for a bad end. I would definitely recommend renting from them if you're in Whatcom County!",
        "ownerResponse": null
      },
      {
        "author": "Erica G.",
        "rating": 1,
        "review": "They left during the pandemic and let all the weeds overtake the apartments. When they came back and without warning they sprayed herbicide during the middle of the day like a weekday at 4pm. I had a reaction to it as did another neighbor of mine. They have gaslighted me and they will pretend they haven't gotten your call or letters. I like trusting my landlord.",
        "ownerResponse": null
      },
      {
        "author": "Sarah O.",
        "rating": 1,
        "review": "This company will not only use up all of your security deposit, but they will also charge you EXTRA for bogus reasons. They have failed to do any maintenance requests when you request them, they will set up all these random fees and won't answer any calls or emails when you try to reach them. Their listings are all over priced and the parking is a joke. Beware if you are a tenant or a potential tenant. Oh, and not to mention how unprofessional they are. They have their business hours set up so that no tenant can reach them in normal business hours. I hope they never screw anyone over like they did with the people I know who lived at one of their managed properties. No other management company is as terrible as these people are.",
        "ownerResponse": null
      },
      {
        "author": "Brian P.",
        "rating": 2,
        "review": "Amanda the \"senior property manager\", argued with my girlfriend about what room number we lived in for an extra key to borrow, my girlfriend was unsurprisingly right and Amanda offered no apology. The owner is the maintenance worker also and when our door lock broke and he replaced it the Management didn't have a copy of that new key after. We also didn't get a call from him when it became 3 hours past our appointment just because he was \"busy\" after we had to call him. And when we couldn't tell if our overhead fan in the kitchen was on because it's so weak he also could barely hear it and he left it like that and had the nerve to ask how much we cook, really?!! There are no security cameras even though it's next to a busy street where we have had to call the cops multiple times for suspicious activity, I got told by a neighbor we have had package thefts too. There's been a lot of cutting corners and poor owner effort for resolutions. Plus the complaints they send us for having a cat that likes to sit on the window ledge, surprise animals like sunshine and we're on the first floor so we aren't just going to have our windows open... And that's why we pay a pet deposit, right? No guest parking... That should say a lot on it's own. Poorly insulted windows and door jams for \"brand new\". They care about the employees first by a long shot, just look at the hours of operations... It's laughable. Amanda bring her kids to work often and it's obviously more disorganized when that happens. ...So I wouldn't recommend Roma unless you want disrespectful, cheap and selfish management. Erin is great on her own so we feel bad she has to work with the other two. Growing up in Bellingham I'm really disappointed in this property's leadership, it's just \"new money suckers\" here.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 70,
  "adjusted_average_rating": 3.44,
  "summary": "<article class='review-summary'>  <section>          <h2>Disclaimer</h2>        <p>This article is generated by ChatGPT and is only intended to be a tool to help you find a property management company or rental property. The information provided in this article is a summary of user reviews for Roma Management and does not reflect the opinions of ChatGPT itself. The content is intended to provide an overview of different experiences and does not include personally identifiable information about the reviewers.</p>  </section>  <section>          <h2>The Good</h2>        <p>User reviews on Roma Management often spoke highly of the responsiveness and professionalism of the staff, particularly Erin, who was mentioned numerous times for her helpfulness and dedication. Residents felt cared for and appreciated the company's swift action on various matters. One tenant cited an instance where the management team was described as going above and friendliness, promising some reviewers a sense of being valued and heard.</p>    <p>In regard to customer service, several users mentioned that the application and move-in processes were made exceptionally smooth and fast, thanks to the support provided. This proactive attitude seems to be a common theme, with the management taking steps to assist residents in times of need and replying to their concerns and queries with genuine care. Additionally, some users appreciated the attention to tenant needs during the COVID-19 pandemic, suggesting that Roma Management puts effort into maintaining the well-being of its community.</p>  </section>  <section>          <h2>The Great</h2>        <p>Many reviews highlighted Roma Management’s ability to exceed expectations, particularly with the maintenance and repair issues. Before Roma’s involvement, several users mentioned experiencing delays or complete inaction from previous managers; however, under Roma’s watch, repairs were handled more efficiently. For instance, one user expressed relief and satisfaction that things got fixed quickly after Roma took over the property, improving their rental experience significantly.</p>    <p>Another strong suit mentioned in the user reviews is communication. Roma Management is commended for its engagement and communication with tenants, with the staff praised for their prompt and warm responses. The reviews point out that tenants received quick replies to their maintenance requests and inquiries. One user review happily noted that after moving in, Roma Management addressed all the repair concerns in a timely manner, leading to a positive remark on the maintenance delivery system.</p>  </section>  <section>          <h2>The Bad</h2>        <p>Despite positive comments, there are issues that some tenants have found concerning. A considerable number of reviews pointed out that the parking situation at some Roma Management properties has been problematic. Tenants have experienced issues like assigned spots being occupied by unauthorized vehicles and inadequate parking space for guests.</p>    <p>Other negative reviews focus on maintenance delays. While the staff was generally warm and kind, some users reported waiting longer than expected for maintenance completion. For one individual, a seemingly simple door repair was stretched out over an extended period, conveying frustration over the timeline in which fixes were addressed. This suggests potential space for improvement in managing and executing maintenance requests.</p>  </section>  <section>          <h2>The Ugly</h2>        <p>Perhaps the most concerning aspect from user reviews is the deposit retention and end-of-tenancy charges. Some tenants have expressed dissatisfaction with charges applied upon moving out, which they felt were unfair or not in line with their expectations. There was mention of users not receiving a complete deposit back and being additionally charged for conditions they disagreed with, highlighting a lack of clarity around deposit deductions.</p>    <p>Furthermore, communication shortcomings when handling complaints about deposit returns have been noted, with some users stating that reaching the management became difficult after moving out. While these experiences are not universal among Roma Management tenants, they constitute an area of grievance that impacts Roma Management’s overall reputation according to several user reviews.</p>  </section></article>"
}