{
  "name": "RPM Property Management",
  "slug": "rpm-property-management",
  "company_type": "Company",
  "address": "424 W Bakerview Rd #109, Bellingham, WA 98226",
  "review_count": 15,
  "average_rating": 2.4,
  "reviews": {
    "google_reviews": [
      {
        "author": "Ginae Ramirez",
        "rating": 1,
        "review": "I would give RPM 0 stars. Their customer service sucks and they take advantage of college students. If you are a college student DO NOT RENT FROM RPM!!!\n\n** response to RPM:\nThe move out costs were not my issue, my issue was the horrible customer service not only after I had already moved out, but also throughout the year I rented from you. I never received a polite response to any communication with you and was always responded to with attitude when I was being complete professional with you. RPM is overall a bad company and I think other rental companies in the Bellingham area are better to rent from (I.e., Hammer properties).",
        "owner_response": {
          "text": "Ginae, all fees etc. are clearly listed in the lease and communication is sent out regularly between the tenants and the property management team.  We don't have any hidden costs etc.  The move out instructions were clearly communicated via email and posted to your front door, so that there would be no confusion.  They were not followed and the appropriate fees, per the lease, were applied. "
        }
      },
      {
        "author": "Ho Choe",
        "rating": 1,
        "review": "Awful management.  Just look at high numbers of 1 and 2 star reviews.  The concern I had was so poorly managed I wonder if the property owner know or care about the renters' dissatisfaction?  Or perhaps the same ownership.  If you manage student housing where many remote parents send monthly payments, why not offer ACH direct bank deposit instead of expensive 2.85% credit card payment method?  RPM also accepts Bill Pay but that's not always reliable as physical mail can, and do get lost.  Why make it so difficult to make payments while charging 10% late fee?  The payment method is antiquated at best, but the real issue is how the RPM manages concerns.",
        "owner_response": {
          "text": "(Reviewer is not a tenant with RPM) We take our tenants concerns very seriously and respond (typically in writing) as clearly and quickly as possible.   We have several available payment options and are looking in to adding ACH to our platform in the future."
        }
      },
      {
        "author": "Maleah Meinhold",
        "rating": 1,
        "review": "I lived here for the 2019-2020 school year and in that time our apartment flooded twice. My roommate and I had to hound them to take action, and never gave us a confirmation that there was no mold damage. The apartments themselves are look worn in and not worth the price, they took 1/2 of our deposit and up-charged us for cleaning and replacements. Like the other reviews say, Gustavo is truly the best part of this place always reliable and went above and beyond to help us with our flooding.",
        "owner_response": null
      },
      {
        "author": "Katie Knaub",
        "rating": 2,
        "review": "Been living in the New England Apartments for about 5 months, and I know we will not be returning next year. The apartments aren't bad, for factoring in price and proximity to campus (as I am a student). But there have been multiple incidents with the staff at RPM being unorganized (like forgetting that we had paid our rent and going as far as sending us emails that we would be charged late fees, for example). The parking is an ABSOLUTE FRICKIN NIGHTMARE, and is the primary reason as to why we are leaving. 80% of the spots are so small that you can only park in if you don't expect to get out of your car - and on top of that, it's not regulated, so it's cool that it's free, but I'd honestly rather pay to have a guaranteed spot for my car. On top of that, when cars are parked incorrectly (e.g. taking up multiple spots) for several days, they will usually get called in to RPM, someone will come tape a sign saying that they've taken your information and need to move your car or it will be towed, basically. This happened to someone in my time here. You know how long it took RPM to tow their car after they put the sign on it? LONGER THAN A MONTH. (It deserved to be towed because at this point it had been there at least a week before someone called it in, and had the sign on the car for a very long time. The only reason they get 2 stars is for the okay-ness of the apartments and the AWESOME maintenance guy, Gustavo. If anything ever breaks, or sometimes is even just old, Gus will just go ahead and replace it for you. RPM - I hope you give him a raise, he's very kind and is great at what he does.",
        "owner_response": null
      },
      {
        "author": "Brady Schmitt",
        "rating": 1,
        "review": "In my experience, RPM consistently missed any expectations or standards a realty company should be held to. The company knows they can charge asinine fees to unknowing college students and not suffer any consequences, outside of their universally poor public image. In my year with them we encountered false police/noise reports with $100 fees tacked on, water damage from a burst water heater, (which was much more catastrophic to other units in our building and without any compensation or apology on the part of RPM.) As well as a general lack of responsiveness to basic maintenance issues. The rent prices are exorbitant for the quality of service and housing provided and I would highly suggest taking business elsewhere.",
        "owner_response": null
      },
      {
        "author": "Josie Rowe",
        "rating": 5,
        "review": "Best place Ive rented in Bellingham. Clean and spacious apartments, maintence is prompt and the staff in the office are very helpful. I recently broke my foot and they were quick to accommodate me with parking to make my life 10000% easier, which they did not have to do (Bev you are the best!!). I am extremely grateful and so happy that Im renting with a company that is so helpful to its tenants. Everything is simple when dealing with the office when it comes to things such as lease transfers, maintence requests, and anything else really. Always been happy with the company. Only negatives is that the complex Im renting out has tight parking- however this is almost entirely due to college students not knowing how to park between the lines, and limited office hours.",
        "owner_response": null
      },
      {
        "author": "Katie Buechler",
        "rating": 2,
        "review": "Management is AWFUL. The apartments are not nice quality, which wouldn't be terrible if they weren't so expensive. The repair man, Gustavo, is the best part of this place, and everything else sucks. If you have literally any other choice, choose it over renting from this company.",
        "owner_response": null
      },
      {
        "author": "Ira Ch Lassen",
        "rating": 4,
        "review": "They've been good people so far.",
        "owner_response": null
      },
      {
        "author": "Tess Schornack",
        "rating": 1,
        "review": "Horrible hours and rude",
        "owner_response": null
      },
      {
        "author": "Juliana Pope",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cindy Ortiz",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Joe S.",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Emmett Linklater",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Brad S",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 9,
  "adjusted_average_rating": 2.0,
  "distribution": {
    "1": 7,
    "2": 3,
    "3": 0,
    "4": 2,
    "5": 3
  },
  "summary": {
    "created_timestamp": 1739205586,
    "text": "<section id=\"good\"><h2>Good</h2><p>In the user reviews for RPM Property Management, some tenants highlighted positive experiences, particularly praising the maintenance services. A notable mention goes to Gustavo, a maintenance staff member, who routinely receives accolades for being prompt and efficient. Examples include tenants expressing satisfaction with how Gustavo goes above and beyond when dealing with issues such as flooding or urgent repairs. These positive experiences suggest that while RPM Property Management may have notable areas of improvement, their maintenance team does contribute positively to their overall service.</p><p>Additionally, there are reviews from tenants who appreciate the clean and spacious apartments and prompt assistance from the office team. One tenant recounted how the company accommodated them with special parking arrangements following a foot injury, simplifying their daily routine. These experiences paint a picture of helpful and considerate support staff who are willing to make extra efforts for tenant comfort when required.</p></section><section id=\"great\"><h2>Great</h2><p>Great reviews for RPM Property Management highlight instances of standout customer service and tenant satisfaction. In some cases, tenants have found the overall rental process to be smooth and hassle-free, particularly mentioning the staff's helpfulness in navigating lease transfers and maintenance requests. The management's attention to individual tenant needs, such as fast response times and efficient handling of requests, leaves a positive impression on some renters.</p><p>One user review praised the company's willingness to accommodate special requests, which significantly improved their personal living situation. Another positive aspect reflected in the reviews is the appreciation for the company by long-term tenants who have found stability and satisfactory living conditions. These accounts, although less frequent, demonstrate that tenants do have positive, stress-free experiences with RPM Property Management, especially when communication is clear and needs are promptly met.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews frequently point out several negative aspects of RPM Property Management's operations, particularly centering around their customer service and communication. Many tenants reported difficulties in getting effective responses to their concerns, with some feeling neglected or ignored. Examples of such issues include unresolved maintenance concerns like flooding, with tenants having to repeatedly follow up to get attention. The lack of clear communication and follow-through on such issues contribute to a recurring sense of frustration among renters.</p><p>Another common theme in the negative feedback is the unresponsiveness to payment-related inquiries, with the payment system described as outdated and causing inconvenience. An example provided by a tenant highlighted an instance of miscommunication where their rent payment was recorded incorrectly, leading to unwarranted late fee charges. Despite these challenges, tenants generally acknowledged areas where service could improve significantly, indicating that there are still some redeeming qualities in the staff’s occasional efforts to resolve issues.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Some user reviews depict particularly concerning experiences with RPM Property Management, describing issues that go beyond inconvenient to seriously problematic. Several tenants alleged being subject to excessive fees and felt that the company exploits college students. One example cited includes reports of false noise complaints resulting in substantial and seemingly unwarranted fees. Such incidents appear to add to a perception of unfair treatment and a lack of accountability in the company's operations.</p><p>Reports of unaddressed water damage and insufficient attention to safety concerns like potential mold growth are also shared in the reviews, reflecting a neglect of essential property management duties. These issues, coupled with accusations of poor infrastructure quality and high rent prices, leave some tenants feeling exceedingly dissatisfied and taken advantage of. In such narratives, the experiences paint a picture of a management approach that prioritizes profit over tenant welfare, alongside a failure to consistently rectify deeply rooted concerns in their service delivery.</p></section>"
  }
}