{
  "name": "Samish Commons",
  "slug": "samish-commons",
  "company_type": "property",
  "address": "321 N Samish Way, Bellingham, WA 98225",
  "review_count": 15,
  "average_rating": 4.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "John K. Cummings",
        "rating": 5.0,
        "review": "Liked it so much that I've decided to take a one bedroom apartment here.",
        "ownerResponse": null
      },
      {
        "author": "John K Cummings",
        "rating": 5.0,
        "review": "Nice apartments, reasonably priced too",
        "ownerResponse": null
      },
      {
        "author": "Pampered Duchess",
        "rating": 2.0,
        "review": "The building itself is fine. It's new and rather well insulated. It's fine as low-income housing. However, it's \"tax credit\" rather than subsidized housing. The management can't keep janitorial staff, doesn't communicate well, and generally does not address community concerns. It's so bad around here that they basically tore down and rebuilt the Aloha.",
        "ownerResponse": null
      },
      {
        "author": "Vanessa Alexander",
        "rating": 5.0,
        "review": "Nice albeit small brand new apartments. Most Are some type of rent assisted/sliding fee scale ECT. Second building will be getting underway very soon they say, it should be open and people moving in sometime next year is what I've heard.",
        "ownerResponse": null
      },
      {
        "author": "Todd Johnson",
        "rating": 5.0,
        "review": "Tango and I really do love living here ..and Once the buildings are finished... sometime between Spring and the Summer of (2023)..Sammish Commons will be a Stable, Secure, Resident Friendly, Caring Management, little Community within it's own self.. Quality living and a Great location too, literally \"everything\" you can ask for is within walking distance!.. I'm genuinely happy but just don't know how to identify it sometimes.. lol... Sammish Commons, Thank you for letting us rest our weary heads..",
        "ownerResponse": null
      },
      {
        "author": "Fernando Gonzalez",
        "rating": 5.0,
        "review": "Beautiful piece of architecture in the Samish Urban village, lots of parking, easily accessible, next to Downtown and I-5.",
        "ownerResponse": null
      },
      {
        "author": "Terrilynn Land",
        "rating": 2.0,
        "review": "Please use the eleavatr",
        "ownerResponse": null
      },
      {
        "author": "Kim Sandberg",
        "rating": 5.0,
        "review": "My friend lives there!  Great place!",
        "ownerResponse": null
      },
      {
        "author": "Carl Graber",
        "rating": 5.0,
        "review": "Excellent place to live",
        "ownerResponse": null
      },
      {
        "author": "Cyndi Ackerson",
        "rating": 5.0,
        "review": "I live here and I love it. ",
        "ownerResponse": null
      },
      {
        "author": "Carl G",
        "rating": 5.0,
        "review": "Love the place",
        "ownerResponse": null
      },
      {
        "author": "Tessa",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cindy S",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shovia Muchirawehondo",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tina Martin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 4.45,
  "summary": {
    "text": "<section><h2>Good</h2><p>Samish Commons seems to bring satisfaction to residents with its architectural elegance and the practicality of its location. Several users commend the property for its beautiful construction and the convenience it offers, being close to downtown areas and major highways such as I-5. Accessibility to necessities within walking distance is cited as a significant benefit, elevating the living experience for those choosing to reside here.</p><p>References to the brand new apartments being both nice and small imply that while the living quarters may be compact, they are well-received. This indicates a favorable impression of the property's offerings, despite the modest size of the living spaces. The emphasis on the newness of the apartments also suggests that residents appreciate the modern amenities and the fresh condition of the accommodations.</p></section><section><h2>Great</h2><p>From the standpoint of user reviews, Samish Commons stands out as a community that residents are proud to call home with testimonies of love and adoration expressed for the property. Multiple reviews relayed a sense of genuine happiness, with one particular review celebrating the sense of security, attentive management, and the responsive community vibe forecasted to flourish with the completion of the property's construction phase.</p><p>One enthusiastic resident even mentioned that they were so pleased with their living experience that they have decided to take a one-bedroom apartment there, further underscoring the attraction to Samish Commons. Words like \"excellent place to live\" and celebrations of the soon-to-be-completed additional buildings reflect a bright outlook on the community's future and its residential appeal.</p></section><section><h2>Bad</h2><p>Notwithstanding its high points, Samish Commons does not escape critique concerning its property management practices. Issues seem to stem from shoddy communication and a failure to consistently address tenant concerns. One user review particularly highlighted the difficulty in retaining janitorial staff, which may reflect deeper systemic issues within the property management company.</p><p>The delineation between \"tax credit\" and subsidized housing, as mentioned in a user review, suggests that there could be a disparity in expectations on affordability and management obligations, potentially leading to dissatisfaction among residents who have different needs in terms of assistance and property maintenance.</p></section><section><h2>Ugly</h2><p>Though detailed negative experiences are not abundantly clear in the available user reviews, it can be deduced that the management occasionally falls short in maintaining the standards expected by the residents. A review signals that there has been a significantly negative situation that necessitated a major renovation, to the extent of tearing down and rebuilding a structure, which raises questions about the initial quality and oversight provided by the property management.</p></section>"
  }
}