{
  "name": "Samish Station",
  "slug": "samish-station",
  "company_type": "property",
  "address": "109 N Samish Way, Bellingham, WA 98225",
  "review_count": 8,
  "average_rating": 2.62,
  "reviews": {
    "google_reviews": [
      {
        "author": "Makayla Haverluk",
        "rating": 1.0,
        "review": "There's no parking and the surrounding businesses don't let you park there. Management doesn't care about it. The building also has several problems, like the construction wasn't thought all the way through and rushed to get it done. Security is a sham. Front doors don't always lock so people can just walk right in.",
        "ownerResponse": null
      },
      {
        "author": "AJ Guest",
        "rating": 1.0,
        "review": "This isn't a review more so a question posed to the management. I see that y'all only have 7 reviews for this property and I wanna know why you down play the few reviews that were negative as well as disregard someones personal experiences by telling them that no one else has had any issues that they described in their review? please explain to me that how can a property that has only 7 reviews have a good track record?",
        "ownerResponse": null
      },
      {
        "author": "Randy Siverson",
        "rating": 2.0,
        "review": "I rented a 1 bedroom. Very small unit (420 sq/ft) and very expensive ($1300). PLUS you have to pay $60 per month for each parking space on top of rent. And very cheap furniture and gym equipment. Couldn't see the unit before renting because it was under construction. But if i could have, i would not have rented it. The kitchen, living room, dining room, and laundry room are all one room lol You pay for convenience of location I suppose but not worth it imo. Could be okay for young students if they can afford it. Also, I had 2 very expensive bicycles stolen from the community bicycle storage room even with heavy duty locks (they cut the bicycle stand thats bolted to the wall). Not the owners fault necessarily but they should've had better security and the tenant who did it should have been evicted if they were \"reasonably certain\" they knew who it was. Security system wasn't set up until the second theft, so the culprit got away scott free. Lease states you cannot store bicycles in your unit, so be careful. But they don't have breed restrictions, so thats a plus!",
        "ownerResponse": {
          "text": "Hi Randy,\n\nThis is James - the property manager at Samish. We've met a few times. I'm very sorry you were not satisfied with your unit. There's always a risk, when you make the decision to rent a unit site-unseen, that that unit won't meet your own personal expectations and your own personal preferences. I'm happy to report, though, that the subsequent resident and other residents in our one-bedroom units, have expressed nothing but satisfaction. Our one-bedrooms are easily our most popular floorplan, so, while it may not have been the right unit for you, it certainly is for a lot of others, and we're proud of that.\n\nI'm disappointed that you were not satisfied with our furniture and our equipment. Most places in town that provide furniture use only very chintzy, dorm-room-style furniture, whereas all of our furniture was purchased from the Ashley Home Store, and our gym equipment purchased from Dick's Sporting Goods. We spared almost no expense to make sure our residents could thoroughly enjoy the building, both inside their units and in the common areas. Our gym is by far our most popular and frequently used amenity, and I've not heard one complaint from anyone else, so I'm admittedly perplexed at your disappointment.\n\nAs for your bicycles, I'm first of all glad that you were able to make successful insurance claims for both incidents, and I'm further glad that my personal testimony to the insurance agents helped see those claims to successful ends. I am and was happy to help you reach a satisfying conclusion to this most unfortunate situation in any way I could, and if that meant responding to countless phone calls with insurance agents, then that's what needed to be done. Furthermore, I hope you will direct your negative reviews on this topic to the Bellingham Police Department. We provided to them what we consider a mountain of evidence that pointed to the suspected culprit in these bike thefts, including video footage and other security records, and they did nothing with it. Between pouring through dozens of hours of security footage, to writing witness statements, to the insurance calls, to cutting together relevant video clips, to talking and setting up meetings with the officers working your case, I spent an enormous amount of time trying to bring the culprit to justice, so it's incredibly disappointing that the Bellingham Police Department didn't hold up their end. If you still have your case number, I suggest you call and ask them why they chose not to pursue it further. I'm curious, myself. I may still have the case number somewhere in my email, so please reach out to me if you don't have it. Nevertheless, we did increase our security since these incidents and don't anticipate any further issues.\n\nNothing is more important to us than resident satisfaction. Most rentals in Bellingham are operated by large management companies or huge hedge funds based out of state, none of which care about or even talk to their residents. We're not them. We're a small business, entirely locally owned and operated, and we take great care to maintain a reputation of kindness and satisfaction. We own every property we manage and usually build them, too. All of this to say, that, while our unit may not have met your own personal criteria for a satisfying unit, I do hope you'll give us another chance if you find yourself looking for housing again. We have several modern, high-end apartment buildings, with more on the way, and I'm certain we can find something satisfying to your expectations.\n\nPlease let me know if you have any other concerns or questions. You know how to reach me.\n\n-James"
        }
      },
      {
        "author": "Jim Erickson",
        "rating": 5.0,
        "review": "Our son rents a unit at Samish Station.  The unit is new and it's nice, granite countertops and stainless appliances.  It is also convenient to Western.  The construction was late and the management offered to put my son up in a hotel, which we did not accept, but we very much appreciated.   Being in real estate, I understand issues with development and construction these days!  We would definitely recommend!!",
        "ownerResponse": {
          "text": "Mr. Erickson,\n\nThank you so much for this wonderful review. We're happy we could be of excellent service to you and your son, whom we hope rents with us for a long time!\n\nLet us know if there's anything we can do to make your experience even better!\n\n-Samish Station Management"
        }
      },
      {
        "author": "Dave Hayes",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Gabe,\n\nI'm not sure you have the right place. We don't have any record of ever interacting with you, and we've never rented to you in any capacity.\n\nBecause of this, I have no choice but to flag your review as fake. If you did, in fact, have some negative interaction with us, we are happy to make it right. Either reach out to us, or actually describe your experience in your review.\n\nAs you can tell from our other, legitimate reviews, we have a great track record of tenant satisfaction, and we work very hard to maintain that.\n\nAll the best!\n\n-James, Property Manager"
        }
      },
      {
        "author": "John and Gretchen",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Mr. Corbin,\n\nThank you so much for writing this wonderful review! We're so happy to have satisfied, understanding residents. We can't wait for you to experience all Samish Station has to offer.\n\nLet us know if there is anything we can do to improve your experience even further.\n\n- Samish Station Management"
        }
      },
      {
        "author": "John M",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Fernando Gonzalez",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 4,
  "adjusted_average_rating": 2.25,
  "summary": "<article class='review-summary'>  <section>    <heading><h2>Disclaimer</h2></heading>    <p>This article is generated by ChatGPT, a language model AI, and is only intended to be a tool to help individuals find a property management company or rental property. The summaries in this article are based on user reviews of Samish Station and do not represent the opinions or views of the language model or its affiliates.</p>  </section>  <section>    <heading><h2>Good</h2></heading>    <p>Residents of Samish Station have found several aspects of their living experience to be positive. Stand-out features mentioned in the reviews include new units with modern amenities such as granite countertops and stainless-steel appliances. The proximity to educational institutions like Western has been noted as convenient for many residents, making it an attractive option for students or those affiliated with the university.</p>    <p>In instances of construction-related delays, the management at Samish Station has offered compensatory measures like hotel accommodations, showing a proactive stance towards customer service. Such gestures illustrate the management's commitment to resident satisfaction, and at least some individuals have expressed appreciation for these efforts, recommending Samish Station based on their experience.</p>  </section>  <section>    <heading><h2>Great</h2></heading>    <p>Amidst the struggles that can come with development and construction, management at Samish Station has exhibited an awareness of these challenges, and an attitude aimed towards resolution. For individuals with experience in real estate, such understanding can be especially resonant, acknowledging the complexities of the current real estate landscape. These gestures and acknowledgements can be a great relief to residents who value clear communication and supportive procedures.</p>    <p>In addition, the management team has actively engaged with the community through owner responses to user reviews, offering personal commitments and contact information, which reinforces their willingness to maintain an open dialogue. The intention to provide exemplary service and to encourage long-term renting relationships with their tenants emphasizes the positive dimensions of their customer care approach.</p>  </section>  <section>    <heading><h2>Bad</h2></heading>    <p>Despite the commendable elements, some residents report frustrations concerning the property. There appear to be issues related to the size and cost of the units at Samish Station; certain residents found their apartments to be smaller than expected for the price paid, with some comments pointing out the perceived high rent and additional costs for parking. These concerns highlight a possible mismatch between resident expectations and the offerings of the apartments.</p>    <p>Maintenance and security have also been cited as areas of concern. Incidents involving theft, especially of bicycles, hint at underlying security weaknesses that residents believe should be addressed more rigorously. While the property has reportedly responded to these incidents by increasing security measures, the effectiveness of these improvements over the long-term remains to be monitored by the residents and prospective tenants.</p>  </section>  <section>    <heading><h2>Ugly</h2></heading>    <p>There are several pointed criticisms leveled against Samish Station in user reviews that suggest more systemic problems. Claims of poor management practices, such as not adequately addressing negative feedback, have emerged, with one reviewer questing the integrity of the management's treatment of reviews. Further, there are grievances about the building's overall construction and design, with one user suggesting that the process was rushed, potentially compromising the living experience.</g></p>    <p>On top of this, the communication strategy of the management has come under scrutiny. While some reviews highlight a responsive and helpful demeanor, others outline a failure to meet residents' concerns with regards to unit features and communal spaces. The reported uneven enforcement of policies, such as storing bicycles in units, adds to the complexity, potentially dissuading prospective residents who value consistency and reliability in property management.</p>  </section></article>"
}