{
  "name": "Samish Commons",
  "slug": "samish-commons",
  "company_type": "property",
  "address": "321 N Samish Way, Bellingham, WA 98225",
  "review_count": 15,
  "average_rating": 4.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "John K. Cummings",
        "rating": 5.0,
        "review": "Liked it so much that I've decided to take a one bedroom apartment here.",
        "ownerResponse": null
      },
      {
        "author": "John K Cummings",
        "rating": 5.0,
        "review": "Nice apartments, reasonably priced too",
        "ownerResponse": null
      },
      {
        "author": "Pampered Duchess",
        "rating": 2.0,
        "review": "The building itself is fine. It's new and rather well insulated. It's fine as low-income housing. However, it's \"tax credit\" rather than subsidized housing. The management can't keep janitorial staff, doesn't communicate well, and generally does not address community concerns. It's so bad around here that they basically tore down and rebuilt the Aloha.",
        "ownerResponse": null
      },
      {
        "author": "Vanessa Alexander",
        "rating": 5.0,
        "review": "Nice albeit small brand new apartments. Most Are some type of rent assisted/sliding fee scale ECT. Second building will be getting underway very soon they say, it should be open and people moving in sometime next year is what I've heard.",
        "ownerResponse": null
      },
      {
        "author": "Todd Johnson",
        "rating": 5.0,
        "review": "Tango and I really do love living here ..and Once the buildings are finished... sometime between Spring and the Summer of (2023)..Sammish Commons will be a Stable, Secure, Resident Friendly, Caring Management, little Community within it's own self.. Quality living and a Great location too, literally \"everything\" you can ask for is within walking distance!.. I'm genuinely happy but just don't know how to identify it sometimes.. lol... Sammish Commons, Thank you for letting us rest our weary heads..",
        "ownerResponse": null
      },
      {
        "author": "Fernando Gonzalez",
        "rating": 5.0,
        "review": "Beautiful piece of architecture in the Samish Urban village, lots of parking, easily accessible, next to Downtown and I-5.",
        "ownerResponse": null
      },
      {
        "author": "Terrilynn Land",
        "rating": 2.0,
        "review": "Please use the eleavatr",
        "ownerResponse": null
      },
      {
        "author": "Kim Sandberg",
        "rating": 5.0,
        "review": "My friend lives there!  Great place!",
        "ownerResponse": null
      },
      {
        "author": "Carl Graber",
        "rating": 5.0,
        "review": "Excellent place to live",
        "ownerResponse": null
      },
      {
        "author": "Cyndi Ackerson",
        "rating": 5.0,
        "review": "I live here and I love it. ",
        "ownerResponse": null
      },
      {
        "author": "Carl G",
        "rating": 5.0,
        "review": "Love the place",
        "ownerResponse": null
      },
      {
        "author": "Tessa",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cindy S",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shovia Muchirawehondo",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tina Martin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 4.45,
  "summary": "<article>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>      This article is generated by ChatGPT and is only intended to be a tool to help you find a property management company or rental property. It aims to summarize user reviews without disclosing personal information about the reviewers. The sentiments and instances cited herein reflect the content of the reviews gathered and may not represent a comprehensive view of the company's service quality. User discretion is advised when considering this article's intent to provide a balanced view of the said property management company.    </p>  </section>    <section>    <heading>      <h2>Good</h2>    </heading>    <p>      Samish Commons has received high praise for its architectural beauty and convenient location from several users. A user expressed contentment with the structure stating it to be a “Beautiful piece of architecture in the Samish Urban village,” adding that it benefits from ample parking and accessibility to Downtown and I-5. Another review highlighted the quick walking distance to essential services, appreciating the excellent location and nearby amenities.    </p>    <p>      The quality of the living spaces has also been applauded, with residents describing their apartments as \"nice\" and \"brand new.\" Consistent with these positive remarks, one reviewer has expressed such a level of satisfaction that they have committed to a one-bedroom apartment, which showcases the property's ability to meet and potentially exceed renters' expectations in terms of living standards.    </p>  </section>    <section>    <heading>      <h2>Great</h2>    </heading>    <p>      The community at Samish Commons has been particularly mentioned as \"resident friendly\" and a place where management is perceived as caring. A satisfied tenant shared their sentiment about the area evolving into a “Stable, Secure, Resident Friendly” neighborhood with diligent management contributing positively to the community atmosphere. Such feedback implies that residents feel not only accommodated but also valued.    </p>    <p>      Moreover, the reassurance provided by some reviews point to a responsive environment where the quality of living is a priority. The community's forward-looking perspective is evident in comments about upcoming improvements and expansions, suggesting that Samish Commons is on a path toward enhancing its offerings with additional building developments anticipated to accommodate more residents in the future.    </p>  </section>    <section>    <heading>      <h2>Bad</h2>    </heading>    <p>      Despite the praises, not all feedback about Samish Commons has been positive. There are reports of poor communication and a failure to address community concerns effectively. For instance, a user review complained about the management's inability to maintain janitorial staff and mentioned that communication could be greatly improved, indicating an area where the property management might focus on to enhance resident satisfaction.    </p>    <p>      Additionally, one of the reviews implied that there is a certain level of dissatisfaction regarding the overall quality of services. The term \"low-income housing\" was used to signify that, although the buildings are new and insulated, there are underlying issues related to the tax credit system and the management’s handling of the property that aren’t meeting the expectations of some residents.    </p>  </section>    <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>      Rental management companies often face challenges, especially when they don't meet the expectations they set. At Samish Commons, a stark contrast was presented by a reviewer using the word \"bad\" to describe the state of affairs concerning the management's oversight of the property. This type of feedback, though less frequent, underscores the importance of consistent and quality service to avoid damaging the property's reputation.    </p>    <p>      While no specific examples were provided regarding negligence or failure to address maintenance, the insinuation that the property had to undergo a significant reconstruction (“basically tore down and rebuilt”) raises questions about the property's management efficiency and effectiveness. It is not mentioned how often the company has replied to user reviews, but being responsive to such criticisms is essential for maintaining trust among current and prospective residents.    </p>  </section></article>"
}