{
  "name": "Sehome Court Apartments",
  "slug": "sehome-court-apartments",
  "company_type": "Property",
  "address": "820 32nd St, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 4.36,
  "reviews": {
    "google_reviews": [
      {
        "author": "H_Scribbler",
        "rating": 5,
        "review": "Lived here for about two years.\n\nThe initial impression was bad - the landlord seemed to not know how to sound anything other than snappy/rude on the phone, almost even condescending.  Thought maybe I was making a mistake, but gave it a try since I like townhome-style apartments.\n\nLocation was great - close to WWU, close to grocery stores and restaurants, gas station right around the corner right before easy access to the freeway onramp - and a small farm next door that sold fruits and vegetables - a bonus. Did some walking around at night throughout the year - pretty safe neighbourhood.\n\nCome to think of it I don't think I ever saw the landlord while I lived there - he was like a phantom in the mist - I know he was around the premises from time to time though - to remove snow from the walkways or tape some notices on the door and whatnot.\n\nThe maintenance guy deserves most of the credit for my staying there for two years. He was quick to respond to maintenance requests, very efficient, courteous, accomodating and always friendly. Wave and he will definitely wave back.\n\nThe unit I was in, had a neighbour who made loud, rhythmical noise all night - made my bedroom feel like a cheap club. Sometimes their pet elephant slammed into the wall and dragged itself along the hallway, or a balled up armadillo bounced down their stairs for the hell of it. Lost many hours of sleep and much, much sanity. However, I am not taking stars out of the apartment because I figured I just drew a short straw.\n\nIn the end I have come believe that the landlord is proud of his property since he takes good care of it. He was responsive to my emails/calls, and despite his rather impolite ways, in the end I got used to it and stopped getting offended.\n\nI would definitely go back and live there if I ever return to Bellingham - just not the same unit so I can avoid that neighbour.",
        "owner_response": null
      },
      {
        "author": "Kelly Machnik",
        "rating": 5,
        "review": "Sehome Court has been a really great place to live for the past four years. The owner and maintenance person are very helpful and responsive. The property is well kept. Maintenance issues are handled immediately. The price is very reasonable for a spacious two bedroom apartment. They are strict with rules regarding parking and smoking but that helps make it a great place to live.",
        "owner_response": null
      },
      {
        "author": "Jahnel Burgess",
        "rating": 5,
        "review": "Lived in the apartments for 2.5 years and loved it. Very clean and there is an on site maintenance person who will fix any emergency issues and also keep up on all ongoing projects to improve living conditions. Neighbors were kind and respectful, appreciated how the owner screened tenants well. Would highly recommend",
        "owner_response": null
      },
      {
        "author": "Cat Lasswell",
        "rating": 5,
        "review": "Wonderful apartments! Large and affordable with wonderful staff and maintenance crew. I love that it was pet friendly and even includes basic comcast in the rent! One of the best places i've rented from in Bellingham, hands down.",
        "owner_response": null
      },
      {
        "author": "Full Moon",
        "rating": 1,
        "review": "I would like to say that the customer service I received while trying to fill out the application was one of the worst experiences I have ever encountered. There were too many red flags with the management. When I was trying to drop off the application papers there was a man in front of the office building who very rudely told me I had to leave and I tried to tell him that I needed to drop off some application papers and he kept interrupting me and telling me to leave. The first time I called them I was being asked personal questions that go against HIPAA. When I was asking him questions that I had about my lease, he made it seem like I was the one who was wasting his time. Ive worked in customer service and the way that the manager talks to the applicants is so unprofessional and condescending. The manager is disrespectful and doesnt know how to run a business. Ive had so many issues",
        "owner_response": null
      },
      {
        "author": "Solomon Wilson",
        "rating": 5,
        "review": "I like it",
        "owner_response": null
      },
      {
        "author": "Kevin Jensen",
        "rating": 5,
        "review": "Great apartment",
        "owner_response": null
      },
      {
        "author": "Shelby Haupt",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Brittany V",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Basil",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Robin Sing",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 7,
  "adjusted_average_rating": 4.43,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 1,
    "4": 1,
    "5": 8
  },
  "summary": {
    "created_timestamp": 1739205595,
    "text": "<section id=\"good\"><h2>Good</h2><p>User reviews highlight several positive aspects of Sehome Court Apartments. Tenants appreciate the property's well-maintained condition, mentioning that maintenance issues are addressed promptly. Specific examples note the helpfulness and efficiency of the on-site maintenance staff, enhancing the overall living experience. Additionally, the location's proximity to essential amenities, such as grocery stores and restaurants, is greatly valued by tenants, creating a convenient lifestyle. Another aspect praised is the pet-friendly policy, which is considered a bonus for those with furry friends, adding a layer of comfort and attractiveness to potential tenants.</p><p>The responsive nature of the management, despite occasional brusqueness, is another facet that some tenants recognize as contributing to their overall positive experiences. Tenants have mentioned that while the landlord's manner may initially seem harsh, ultimately they appreciate how matters are handled decisively and efficiently. The sense of safety in the neighborhood, supported by quick access to public transport and nearby conveniences, rounds out the positive feedback, making it an appealing option for many. These elements contribute to an enhanced living experience that some residents highly recommend.</p></section><section id=\"great\"><h2>Great</h2><p>In this article, the greatness of Sehome Court Apartments shines through the enthusiastic praise for its living environment. Long-term tenants frequently commend the attentive and punctual maintenance team that not only resolves emergencies promptly but also consistently maintains the property to a high standard. This reliable service creates a comfortable and worry-free space for residents, encouraging some to enjoy stays spanning several years. The large and affordable units are another significant draw, with some residents labeling their spaces as the best they have rented in Bellingham, largely due to the combination of size and cost.</p><p>The community atmosphere is another emphasized positive, as exemplified by respectful neighbors and a shared commitment to observing community guidelines, such as parking and smoking rules. One reviewer specifically notes the diligence with which tenants are vetted, ensuring a harmonious living environment. The inclusion of utilities like basic Comcast in the rent is seen as a bonus, adding value and convenience. The combination of these factors creates a high quality of life for many residents, leading to high praise and strong recommendations.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite many positive reviews, some critical feedback points to customer service issues at Sehome Court Apartments. One review highlights a difficult application process, describing encounters with the management as unprofessional and disrespectful. Questions perceived as invasive and a dismissive attitude from the manager painted a negative picture, undermining initial impressions of the property. Such experiences have led to concerns about management's ability to effectively communicate and handle prospective tenants, revealing an area for improvement.</p><p>Another issue mentioned involves the initial demeanor of the landlord, described as snappy and condescending. Although some residents come to tolerate and even appreciate his efficiency over time, initial interactions may deter potential tenants. This suggests that while the property itself is well-regarded, the approachability and communication style of certain staff members could benefit from refinement to match the high standard of the living spaces.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Very few reviews delve into the extreme negatives, but significant issues were highlighted in a couple of instances. One particular review paints a vivid picture of an applicant's frustrating experience fraught with poor customer service. The narrative describes being interrupted and dismissed when attempting to submit application paperwork, and more alarmingly, being asked questions that allegedly violated privacy guidelines, like HIPAA, reflecting a severe disconnect in professional conduct. These encounters left a lasting impression and were enough for the reviewer to deem the management's operation as incompetent.</p><p>While many tenants eventually acclimate to the management's terse communication style, the negative initial interactions have a profound effect, causing some to equate these experiences with broader management deficiencies. Such issues not only tarnish the rental process but also raise concerns about the overall customer service standards in place. Addressing these concerns could further enhance the property's reputation and appeal.</p></section>"
  }
}