{
  "name": "Sehome Court Apartments",
  "slug": "sehome-court-apartments",
  "company_type": "Property",
  "address": "820 32nd St, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 4.36,
  "reviews": {
    "google_reviews": [
      {
        "author": "H_Scribbler",
        "rating": 5.0,
        "review": "Lived here for about two years.\n\nThe initial impression was bad - the landlord seemed to not know how to sound anything other than snappy/rude on the phone, almost even condescending.  Thought maybe I was making a mistake, but gave it a try since I like townhome-style apartments.\n\nLocation was great - close to WWU, close to grocery stores and restaurants, gas station right around the corner right before easy access to the freeway onramp - and a small farm next door that sold fruits and vegetables - a bonus. Did some walking around at night throughout the year - pretty safe neighbourhood.\n\nCome to think of it I don't think I ever saw the landlord while I lived there - he was like a phantom in the mist - I know he was around the premises from time to time though - to remove snow from the walkways or tape some notices on the door and whatnot.\n\nThe maintenance guy deserves most of the credit for my staying there for two years. He was quick to respond to maintenance requests, very efficient, courteous, accomodating and always friendly. Wave and he will definitely wave back.\n\nThe unit I was in, had a neighbour who made loud, rhythmical noise all night - made my bedroom feel like a cheap club. Sometimes their pet elephant slammed into the wall and dragged itself along the hallway, or a balled up armadillo bounced down their stairs for the hell of it. Lost many hours of sleep and much, much sanity. However, I am not taking stars out of the apartment because I figured I just drew a short straw.\n\nIn the end I have come believe that the landlord is proud of his property since he takes good care of it. He was responsive to my emails/calls, and despite his rather impolite ways, in the end I got used to it and stopped getting offended.\n\nI would definitely go back and live there if I ever return to Bellingham - just not the same unit so I can avoid that neighbour.",
        "ownerResponse": null
      },
      {
        "author": "Kelly Machnik",
        "rating": 5.0,
        "review": "Sehome Court has been a really great place to live for the past four years. The owner and maintenance person are very helpful and responsive. The property is well kept. Maintenance issues are handled immediately. The price is very reasonable for a spacious two bedroom apartment. They are strict with rules regarding parking and smoking but that helps make it a great place to live.",
        "ownerResponse": null
      },
      {
        "author": "Jahnel Burgess",
        "rating": 5.0,
        "review": "Lived in the apartments for 2.5 years and loved it. Very clean and there is an on site maintenance person who will fix any emergency issues and also keep up on all ongoing projects to improve living conditions. Neighbors were kind and respectful, appreciated how the owner screened tenants well. Would highly recommend",
        "ownerResponse": null
      },
      {
        "author": "Cat Lasswell",
        "rating": 5.0,
        "review": "Wonderful apartments! Large and affordable with wonderful staff and maintenance crew. I love that it was pet friendly and even includes basic comcast in the rent! One of the best places i've rented from in Bellingham, hands down.",
        "ownerResponse": null
      },
      {
        "author": "Full Moon",
        "rating": 1.0,
        "review": "I would like to say that the customer service I received while trying to fill out the application was one of the worst experiences I have ever encountered. There were too many red flags with the management. When I was trying to drop off the application papers there was a man in front of the office building who very rudely told me I had to leave and I tried to tell him that I needed to drop off some application papers and he kept interrupting me and telling me to leave. The first time I called them I was being asked personal questions that go against HIPAA. When I was asking him questions that I had about my lease, he made it seem like I was the one who was wasting his time. Ive worked in customer service and the way that the manager talks to the applicants is so unprofessional and condescending. The manager is disrespectful and doesnt know how to run a business. Ive had so many issues",
        "ownerResponse": null
      },
      {
        "author": "Solomon Wilson",
        "rating": 5.0,
        "review": "I like it",
        "ownerResponse": null
      },
      {
        "author": "Kevin Jensen",
        "rating": 5.0,
        "review": "Great apartment",
        "ownerResponse": null
      },
      {
        "author": "Shelby Haupt",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brittany V",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Basil",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Robin Sing",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 7,
  "adjusted_average_rating": 4.43,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the user reviews, Sehome Court Apartments is applauded for its strategic location and the quality of maintenance service provided. Tenants appreciate the proximity to essential amenities like WWU, grocery stores, restaurants, and even a neighboring farm selling fresh produce. The property's safety and the responsiveness of maintenance to requests, marked by efficiency and friendliness, also receive commendations, making tenants feel well-attended.</p><p>The apartments boast spacious two-bedroom units that offer value for money, while the rules enforced by the property management, such as those regarding parking and smoking, contribute to a peaceful and enjoyable living environment. The pet-friendly policy and inclusion of basic Comcast services in the rent attest to Sehome Court Apartments' efforts to cater to a wide range of tenant needs, reinforcing why some tenants have chosen to stay for multiple years.</p></section><section><h2>Great</h2><p>Several tenants have expressed high regard for the staff, especially noting the property's well-kept condition, suggesting a level of pride from the landlord in the maintenance of his property. The on-site maintenance personnel are not only prompt in addressing emergencies but are also proactive in implementing ongoing improvements to enhance living conditions, which has been a decisive factor for tenants in continuing their residencies.</p><sp>The tenant screening process is highly appreciated by residents, leading to a community of kind and respectful neighbors. This, coupled with a landlord who is responsive to emails and calls—even though his mannerisms may come off as brisk—shows a commitment to tenant satisfaction and property management that resonates well with the community at Sehome Court Apartments.</p></section><section><h2>Bad</h2><p>Despite the general positive sentiment, there exists discontent with the customer service, particularly regarding the landlord's perceived rudeness and condescension, which tarnishes initial interactions. Potential tenants have experienced unwelcoming encounters that include intrusive personal questions and abrupt dismissals when attempting to submit application paperwork. Such experiences have been concerning enough for some to label the customer service as one of the worst encountered, suggesting a need for significant improvements in communication etiquette.</p><p>Moreover, at least one tenant has faced disruptive noise issues from neighbors, impacting sleep and overall well-being. While this does not reflect the majority experience, the frustration over the lack traded rest for strife indicates the property management's challenge in uniformly enforcing community living standards or soundproofing measures to ensure a peaceful environment for all residents.</p></section><section><h2>Ugly</h2><p>The most alarming concerns reported in the user reviews relate to encounters with management that verge on disrespect and unprofessionalism. A potential tenant reported a particularly distressing episode involving a disrespectful confrontation with a person in front of the leasing office, which culminated in feeling unwelcome and disrespected. This, accompanied by the manager's reportedly poor handling of applicants' inquiries and the insinuation that their questions were a waste of his time, paints a picture of a management style that could be perceived as impolite and dismissive, overshadowing the property's positive attributes.</p></section>"
  }
}