{
  "name": "Sky View Apartments",
  "slug": "sky-view-apartments",
  "company_type": "Property",
  "address": "1800 Texas St, Bellingham, WA 98229",
  "review_count": 5,
  "average_rating": 3.6,
  "reviews": {
    "google_reviews": [
      {
        "author": "Teasa B",
        "rating": 2.0,
        "review": "Wasn't the best or safest place to live. My husband and I lived in a front apartment and had very few problems with our neighbors, none after the one got evicted. I had very kind and chatty neighbors and I actually miss them now that we've moved. My suggestion is to take pictures of everything and stay in top of complaints. Our apartment started growing mold despite our efforts and money put into trying to clean and kill it. We complained and asked for help to get rid of the mold. When nothing happened and it continued to grow we found out I was pregnant and we decided to move out to somewhere safer.",
        "ownerResponse": null
      },
      {
        "author": "Joseph",
        "rating": 3.0,
        "review": "No problems with management or maintenance, as all employees are very charming and genuine people. Complaints and maintenance are dealt with in good time.\n\nOur issue is the residents. Over the time my boyfriend and I have been here, we've been called homophobic slurs late at night by drunk tenants, walked in on multiple times in our own livingroom by somebody wanting to buy drugs, witnessed domestic violence bi-monthly, stalked, harassed, almost robbed, and noises and screaming don't even phase us anymore it's so common.\n\nThe appliances are old and dirty, but it's a cheap place so we can't ask for the world. They allow pets which is nice, but the old tenant's fleas stuck around, which our cat didn't appreciate much... being a cat. Always strange people lurking about. Most likely someone selling something in a unit.\n\nI wouldn't recommend moving here unless you're desperate for a roof over your head as we were. It's cheap, warm, and flexible. No laundry, but good places nearby. Bus stops close-by every 15 minutes as well. If you do move here, just stick to yourself. The residents aren't worth getting involved with.\n----------------------\nUPDATE 2/7/19:\nMoved out a bit ago to Bellevue for school. Since this review was written, the neighborhood cleaned up, and I believe they installed a laundry room to be shared by tenants. Rent also increased as per the usual gentrification of Washington continues.",
        "ownerResponse": null
      },
      {
        "author": "Shattersphere",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jerry Franklin",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 2.5,
  "summary": {
    "text": "<section><h2>Good</h2><p>Residents of Sky View Apartments have found some aspects of their stay to be pleasant. User reviews mention amiable and communicative neighbors, emphasizing a sense of community among some tenants. Positive interactions with the property staff are highlighted as well, with management and maintenance teams described as charming and genuine, and generally responsive to the needs of the residents. This indicates that, on a personal level, the staff is capable of providing a welcoming environment.</p><p>In addition to the amiable staff, some upgrades to the property have been made over time, such as the installation of a shared laundry room, contributing to an improved living experience. Also, the locality has benefits like good bus connectivity with stops close by, operating every 15 minutes, offering convenience to the residents in terms of transport. Such amenities are essential for a comfortable urban living experience and seem to be appreciated by the tenants.</p></section><section><h2>Great</h2><p>Fortunately, there have been periods when the community has experienced improvements, possibly due to management interventions. Updates from a user review mentioned that the neighborhood around Sky View Apartments had cleaned up, which could signify increased attention to the residents' quality of life and proactive measures taken by the property management to address earlier issues. Also, despite the past complaints, some tenants had very few problems with their immediate neighbors, which might reflect an overall amicable resident population or successful conflict resolution processes.</p><p>Rent flexibility and the allowance of pets stand out as advantageous policies at Sky View Apartments. These features demonstrate an approach to accommodate the diverse needs of tenants, making the property accessible to those with stringent budget constraints or beloved animal companions. Additional amenities that support essential living needs, although basic, are mentioned and seem to be a part of what Sky View Apartments deems as an important offering to its residents.</p></section><section><h2>Bad</h2><p>However, not all resident experiences at Sky View Apartments have been positive. One considerable concern raised in user reviews is related to the condition of the apartments, with problems such as mold growth despite efforts from tenants to resolve the issue. When the management was alerted about such problems, the response was lacking, leading to the decision of some residents to vacate for safer living conditions. Maintenance issues appear to be a recurring theme, with complaints not always addressed promptly or effectively.</p><p>Appliances provided by the property have also been described as old and dirty, which suggests a potential neglect in updating and maintaining the units to a higher standard. Such issues could directly impact the daily living experiences of tenants and possibly deter prospective residents. It appears that while the property does offer the basics needed for habitation, it may fall short in ensuring all aspects of the apartments meet desirable standards of cleanliness and functionality.</p></section><section><h2>Ugly</h2><p>The darker side of life at Sky View Apartments comes from some alarming experiences shared by tenants in user reviews. Incidents of homophobia, harassment, stalking, and frequent disturbances from other residents have been mentioned, painting a picture of a sometimes hostile and unsafe living environment. Reports of problematic behaviors, such as residents being approached for drug purchases, further contribute to this negative image. Despite some attempts at resolving these issues, it is clear that significant challenges remain in establishing a consistently peaceful and secure community atmosphere.</p><p>There is also an impression that the broader tenant population might contain individuals engaging in unsavory activities that can cause discomfort or pose risks to others. Former tenants have advised against becoming involved with certain residents, suggesting an underlying tension or mistrust within the community. Such experiences are severely detrimental to the reputation of Sky View Apartments and hint at a systemic problem that requires more robust interventions from the property management to ensure tenant safety and well-being.</p></section>"
  },
  "timestamp": "September 7 2024"
}