{
  "name": "Sky Vue Apartments",
  "slug": "sky-vue-apartments",
  "company_type": "Property",
  "address": "600-620 Lincoln St, Bellingham, WA 98229",
  "review_count": 42,
  "average_rating": 3.45,
  "reviews": {
    "google_reviews": [
      {
        "author": "Highkey mami",
        "rating": 5.0,
        "review": "There was a shift in management here and since then the communication has increased, the professionalism and the response in maintenance has remained in good standing. They approve people who really need it and the the units itself are pretty decent.",
        "ownerResponse": null
      },
      {
        "author": "J A",
        "rating": 1.0,
        "review": "They did not honor their $250 rent concession for September that was offered to tenants who renewed their lease. Then had the nerve to charge late fees on that $250 because they were negligent in crediting it on time. Impossible to get it straightened out with them, despite the rent concession being in writing and management confirming in email that I will be getting it for September rent. Hard to get a hold of, and they keep saying they will fix it but don't. This is how they treat good tenants. Beware.",
        "ownerResponse": {
          "text": "Hi there this is Kailey with the Customer Service team. Thank you for the feedback. I am sorry to hear about your frustrations with the concession. Our team is working through files to ensure accuracy. I welcome the opportunity to speak with you in greater detail regarding your concerns. Please feel free to contact me directly at customerservice@plpinc.net with your name and contact details so we can ensure your file gets reviewed properly. Take care, Kailey"
        }
      },
      {
        "author": "Evi Fitz",
        "rating": 1.0,
        "review": "Sky Vue has basically terrible customer service in the Leasing Office, for a week and a half we were without hot water and working electricity and they ignored the entire buildings communications to them for a week until saying they would fix the problem the following Friday (then didnt actually fix it until the following Tuesday). The maintenance team enters your home without notice (theyve walked in on me undressed). The building itself is falling apart, with constant need for maintenance in the apartments and the side panel of the building recently just fell off? Also saw some reviews stating it was clean The stairways are notoriously smelly and dirty with spills and dirt. Not worth it for the price.",
        "ownerResponse": {
          "text": "Hi Evi, this is Kailey with the Customer Service team. Thank you for the feedback. I am sorry to see you reduce your 2 star review to 1. The reason the repair took so long was because PSE (Puget Sound Energy) was the one who had to make the repair and they got to the community as quickly as they were able. Our team tried to accommodate as best as possible, offering alternative showering locations, Door Dash giftcards, and also a rent credit. I'm sorry that these efforts for a repair that was out of our hands were not to your satisfaction. I welcome the opportunity to speak with you in greater detail regarding your concerns. Please feel free to contact me directly at 425-287-7438 or email at customerservice@plpinc.net Take care, Kailey"
        }
      },
      {
        "author": "jade nason",
        "rating": 1.0,
        "review": "I wouldnt recommend to anyone. The people working at the office never respond to emails or calls.They dont care to help and every time I have asked for help I was directed to the manager who always gave an excuse to her never answering or being helpful like Im sick or Im busy. Was always in a rush to get me out of the office but never actually took proper steps to help me resolve any of the problems regarding the online portals being down, the phone lines being down, maintenance problems, and the doors to the building never locking. There was a serious safety issue regarding that and they did not take it serious enough and I ended up having to move out because they refused to do anything about it. Living there showed me how unprofessional they are and how much they dont care. If I could give this place a zero I would.",
        "ownerResponse": {
          "text": "Thank you for sharing your candid experience with us. We value your feedback and have provided your comments to our team. We will use these comments as area of focus and improvement for the community. Please contact our Customer Care Team directly at customerservice@plpinc.net if there is anything we can assist you with at this point."
        }
      },
      {
        "author": "ashlyncollinkevin",
        "rating": 1.0,
        "review": "The management here is horrible.   My daughter rents an apartment here and they almost never give notice before entering her apartment.  Her first roommate was brought in to view the apartment without notice and while my daughter was sleeping.  Her roommate later told her that whoever was giving the tour said they knew she was in there and that they really werent supposed be doing this.  Today they entered again while she was at work And left all the lights on so she knew they were there while she was gone.  While I was talking to her in the phone she told me that the maintenance guy just came in again, unannounced, with no warning, and not even a knock on the door.  She peeked out of her bedroom door and saw him and he wasnt even wearing a mask.  She is terrified to leave her room now.   I called the management and of course I get no answer, I just left a voicemail.  I feel like they take advantage of young college kids and think they can get away with this kind of thing.  Steer clear of here if you want any privacy.",
        "ownerResponse": {
          "text": "Hello, We pride ourselves in creating a sense of community through respect and transparency. I understand that our Customer Service team has been in touch with you and our regional manager is working with the team to identify what has occurred. Please consider contacting our Customer Service department directly to try and resolve any outstanding issues there may be. They are reachable at customerservice@plpinc.net or via phone at 425-287-7438."
        }
      },
      {
        "author": "Bri Dague",
        "rating": 1.0,
        "review": "Here goes nothing: My roomates and I did a lease takeover with Landmark at the beginning of the year. That process was hell but at least we were able to get a decent place in Bellingham at an affordable price when split between the 3 of us. We were able to have our pets with no issues and maintenance requests were slow but at least processed. We get news in April that Pacific properties and WWU living are taking over management and that our apt will be rented out by room at a ridiculously high rent. Approximately 750 for a mini master and then appox. 740 for a single room plus 30 per person for water. The unit was originally 1050 total and included most utilities. Im sorry I have never in my life paid more that 30 for 3 months worth of water services so 90 a month is a scam. The property is right next to the I5 on ramp so if your unit faces west, youre going to have interrupted sleep like no other, also the appliances and entire building is outdated. I know WWU has said they are upgrading the units however new office style carpeting in the halls and a lurid paint scheme dont justify the obscene rent hike.\nAnother change implemented is no double occupancy so even if the price hike wasnt enough to make you go insane my roommates and I wouldnt have been able to stay as they were a couple renting the mini master room.\nAs mentioned by others WWU Living communication leaves something to be majorly desired. Their emails arent clear and are often sent out WHILE the project is happening. This occurred while they were cleaning balconies and painting the exterior of the property. The great mailbox vandalism of 2019 may not have been their fault directly, but they could have communicated sooner that our mail was going to be rerouted to an offsite location and kept us updated. It is their job to contact the appropriate outlet and relay the info to the tenants.\nThere are only 10 reviews including mine but the mass exodus of units over the past 3 months should speak for itself.",
        "ownerResponse": {
          "text": "Hi Bri, this is Wendee from Customer Service.  I am really sorry had a bad experience.  Unfortunately when there is ownership/management we are not able to please everyone.  We are investing long term in the property to make it better and in addition to putting our customers first.  I would love the opportunity to speak with you in greater detail about your concerns and all the great stuff we are doing to improve the community.  Please feel free to contact me directly at wmiller@plpinc.net.  Take care, Wendee"
        }
      },
      {
        "author": "Lauren Cushner",
        "rating": 1.0,
        "review": "EDIT: I posted this review a few months ago and I wanted to update with things that have happened since then. My lease ended on August 9th, but we had to deal with several more problems from property management. Despite the fact that our lease ended in August, we were still charged for September rent in our online portal. My roommate had to call several times to even get an answer, and was simply told \"oh that happens sometimes, but you don't have to pay it\". I then emailed them about the issue through the online portal because I wanted that in writing, and I received no response. Finally, after several weeks, the charge was removed, but not after quite a lot of complaining on our part, and if we hadn't said anything, I'm sure we would have been expected to pay. As other reviews have stated, our mailbox was broken a couple months back and we were not notified for a week. A whole week went by where our mail wasn't being delivered and we were not told. It also took over a month to fix, which may or may not have been their fault, but communication was lacking either way. Additionally, while this didn't happen to me personally as we cancelled our internet before this, I've heard from several other residents that they couldn't cancel their internet plans before moving out because, with no notification, Pacific Living Properties merged all tenants accounts into one controlled by them, so tenants didn't have control over them. Again, this was done completely behind their backs and I'm not even sure how it's possible, but it happened. Right now we're just waiting on our security deposit (which we were told we'd receive within 3 weeks of our lease ending, but I'm honestly skeptical) so we can finally be done with this place for good. Absolutely do not rent from Pacific Living Properties, WWU Living, or Sky Vue if at all possible, despite the fact that they're now so desperate for tenants they're offering discounts to current residents to entice them to stay, and continually extending the deadline for lease renewals in the hope of getting more people. It's not working, and it isn't worth it.\n\nIf you're looking for an apartment in Bellingham, look elsewhere. I've lived here for two years and it's decent, but it was recently bought by a new property management company, Pacific Living Properties, and is absolutely no longer worth it. They've increased the rent on my 3 bedroom apartment by almost $700 (from about $1500 to almost $2200) for the next leasing period. The amenities advertised in their listings are exaggerated at best and a straight up lie at worst. They advertise a community game area and a resident center with free printing, for example, but neither of those are actually on site, they're at other apartment communities managed by PLP. I've already had more issues with this company in the month they've managed the property than I had in two years with the previous owners. Again, the apartments are in alright shape, but are absolutely not worth the $700+ per person you'd be paying for them. You can do a lot better for a lot cheaper, so save your time and money.",
        "ownerResponse": {
          "text": "Hi Lauren, this is Wendee from Customer Service.  I am sorry to hear about your frustrations.  I have looked into your concerns and would love the opportunity to chat with you in greater details if you like.  Your check was mailed last week to the forwarding address you left with the site.  I hope to hear from you.  Wendee"
        }
      },
      {
        "author": "Mahkayla Barnet",
        "rating": 1.0,
        "review": "I'd give 0 stars if possible. It's a college town so there's not going to be much, if any, great property managements. However stay away from this one, seriously, it's the worst one I've ever dealt with. If I would've known Landmark was selling I wouldn't of wasted my time moving in just to be basically forced to move out a few months later. They increased the rent by over 50%, utilities aren't included anymore. The barbecue place they talk about is a drive away, not on location. Also their pictures are inaccurate. There is one specific picture with bar stools, the bar top can barely hold something the size of a candle. I moved into a 2 bedroom, 1.5 bath. The master has 2 closets and a half bath and its huge. The 2nd room is probably half the size, 1 closet, and has to share a bathroom but Pacific Living is charging only $10 less for the 2nd bedroom. I've also been told that you are not allowed to share a bedroom with anyone. And they rent out by the room, I'm not a Western student, I don't want some random person living with me. The parking is awful. You get 2 parking passes, even for the 3 bedroom, and there is never enough parking. No guest parking, and they hand out parking tickets often. The management is the absolute worse at communicating, for instance we stopped receiving mail due to mailbox damage and was never informed our mail was being directed off site. The location is awful anyway, I wake up constantly due to the freeway. Oh and the fire alarm goes off often, so the whole building has to evacuate. I could go on but moral of the story: they only care about taking all of your money. You can find somewhere much better for cheaper. I enjoyed living in Son Rise properties.\n\nThey have also been doing remodeling but not informing the residents of when things are getting done. For example, when they did the hallway floors we had no notice and we were stuck in our apartment for hours. Thankfully, I lived on the bottom level so I just jumped my balcony so I could get to work on time. I don't know what everyone else did on the upper levels.\n\nBy the way, it's super sketchy you won't even allow us to be there for the final walk through. It's not our fault everyone is moving out due to the rent hike. Also, how do you not have corporates phone number? I need to speak to someone higher up then WWU living since you aren't willing to help me. You put me on hold for 7 minutes just to tell me you can't find the phone number.",
        "ownerResponse": {
          "text": "Hi Mahkayla, we see this appears to be a similar re-post to your Google review on July 10th. At that time we responded with the following: \"Hi Mahkayla, Thank you for taking the time to reach out and leave a review. We are sorry to hear you are as displeased with the community as every interaction. with you has been a positive one. In regards to the price increase, apartments are receiving upgrades such as new fixtures, hardware, and new flooring in the kitchen/bathroom. We have also painted the outside of the building, are in the process of re-landscaping the property, changed the flooring and painted the interior hallways. We recognize that student housing is not for everyone and that all current residents are not a student however we do manage 4 other properties nearby that are all rent by the room options. This model benefits the residents to only be responsible for their room rent and not an entire unit. We understand that parking can be difficult at times but to ensure that everyone does have at least one available space we do have to limit the amount of parking spaces that are given out. Tickets are distributed through our parking lot monitor to any car that does not display a permit in their window and/or is parked incorrectly in the lot. It looks like your move out date is coming up but we are happy to provide you with an additional permit to ensure this doesnt continue to happen. The mailboxes were vandalized and we replaced the part that was our responsibility within a week and a half (mostly due to shipping). Unfortunately the Post Office took more time to replace the panel with the lock. They are the only ones that can have the key so our hands were tied but we did follow up each week and every time we received an update we would send one out to the residents. After looking through the emails that were sent it does look like the address of where the mail was being held was at the bottom of each one. We are happy to discuss any areas of improvement that you feel the management could have done better. Please feel free to reach out to skyvue@plpinc.net or if you would like to set up a time to meet at the leasing office we are happy to do that as well. We appreciate your residency and hope to hear from you soon.\". Please reach out to us directly if there is anything further we can do for you."
        }
      },
      {
        "author": "Grace Robinson",
        "rating": 1.0,
        "review": "bear with me, this will be long,\n\nWhen this building was owned by Landmark it was fine, low prices (I paid $550 for a 3 bedroom with 2 closets & a private half bath) made the outdated interior, rough around the edges aspects of this place alright. Since it was purchased by Pacific Living (WWU living) its genuinely a scam. Prices for the 3 bedrooms went up $300 a person. For no reason. Literally no reason at all. Currently I am sitting in my third floor bedroom as my entire room shakes & my ceiling crumbles in my bathroom due to my ceiling fan being physically hammered out of my ceiling due to unnecessary re-roofing. They have been unbearably banging, yelling, dropping heavy wheelbarrows etc since 7am. Besides the current situation I am in they promised updates to make the costs worth it. this included paint (ugly paint at that) fixing a roof that nobody felt needed fixing or complained about, pressure washing the entire building which ended in water leaking in from all windows & doors because of how poor the structure of this building is & promises of covered parking (doesnt exist) & other useless cosmetic features nobody asked for. I have to run my dryer 3 times to get my clothes dry, the microwave doesnt open all the way & makes a super loud scary noise when used, weve had our freezer, fridge, sink, dishwasher, & mold on our ceiling fixed & weve been here for less than a year. Theyve been doing updates for the past month & have offered no accommodation or apologies for how unbearably inconvenient it is for their tenants. Nobody is renewing their lease that I know of and theres an entire facebook page where people posts complaints & even are considering legal action against this company. The WWU Off Housing department is NOT ASSOCIATED with this company in any way & have sent complaints & attempted legal action against Pacific Living for using WWU as a marketing scam. They are genuinely trying to scam college kids. The images online dont look like the actual apartments, their promises are empty & I cannot wait to move out. They are attempting to force everyone to sign a document that has agreements not within our personal lease so that they can charge us $200 if our apartment isnt clean enough when they do tours. They are trying to change our lease agreement in the middle of our lease. Do not move in here, do not pay the ridiculous rent, do not believe this company when they say anything. People who have lived here for 5+ years are moving out. Adults live here & are moving out. Everyones moving out. Find another place to live, trust me.",
        "ownerResponse": {
          "text": "Thank you for taking the time to write a review. We are sorry for any inconvenience caused by the updates we are doing to the community. Although we understand the increase can seem high, we would also like to thank you for recognizing that we are following through with the updates. Renewals are receiving upgrades in the apartment such as new fixtures, hardware, and new flooring in the kitchen/bathroom. We will also be painting the outside of the building, re-landscaping the property, updating the lighting in the hallways as well as painting the walls.\nWe recognize that student housing is not for everyone and that all current resident are not a student however we do manage 4 other properties nearby that are all rent by the room options. This model benefits the residents to only be responsible for their room rent and not an entire unit. We are sorry to hear that you are wanting to move, but please know that you can contact the office to put in work orders for any items which need repair. Thanks."
        }
      },
      {
        "author": "Brady Hanson",
        "rating": 5.0,
        "review": "The 1-star Reviews are from a bunch of entitled college freshmen.\nThe two most popular moans and groans:\n- The rent is average for Bellingham\n- \"Theres too much construction\"  Construction projects end and you'll be living in a great place after them.\n\nI walked in and was able to take over a lease in the same week.  The staff office on the university has some very good people running it, though it seems like they could use a couple more hands sometimes, just from the queue I have seen.  They're friendly and even though my move-in had a half dozen complications, they were there for me.  So ignore the reviews from the crybabies who want to live in a penthouse for $500 bucks a month.",
        "ownerResponse": {
          "text": "Hi Brady, this is Wendee from Customer Service.  Thank you for your review and kind words.  Our team does take the good and bad reviews to heart so when there is a good one we get excited to hear it.  I will be sure to pass this along to the team.  Take care, Wendee"
        }
      },
      {
        "author": "Zachary Smith",
        "rating": 5.0,
        "review": "Well I originally gave this place a nasty review, however that was under the last management company. I can say that the new management company has turned this place around! The maintenance workers have been on top of everything and they single handedly changed my view of this place! Great place to live for the price point!",
        "ownerResponse": {
          "text": "Hi Zachary, we regret to hear that you're initial experience has been negative, but would appreciate the chance to turn your experience around. Our team has been in contact to help address these issues, and we hope you will really enjoy your time at Sky Vue. Thanks so much for bringing these concerns to our attention so we can make them right for you. Take care!"
        }
      },
      {
        "author": "Joseph Killdiedeath",
        "rating": 1.0,
        "review": "Theres something to be said about any place immediately going up by 50% over market price  with new owners. And a fresh coat of paint isnt fooling anyone. PLP are profiteers and they are disrespectful of existing tenants who still have leases through Landmark. Maintenance requests and other help is being ignored or handled with minimal effort.\nMost notably they are charging THE SAME rent for units with two VASTLY different sized rooms. These apartments originally considered the second bed in our unit as a master bedroom. It has its own bathroom. Under PLP, its now going to be charged the same as the smaller bedroom at HALF the size - seven hundred fifty dollars. Each. The new leases have far stricter rules than necessary as well.\nThe website literally lists features that this apartment does not have. The mailbox was broken into recently, and at last look its been a week with no signs of the issue being addressed. So were not getting mail now and unsure whether or not its getting regularly stolen. I reported it myself and was met with a rude yeah were aware and no further information.\nParking here sucks, and theres no indication that they will address the issue, despite the (and I cannot stress this enough) 50% increase in rent over market price. Prepare to go looking for street parking at night or occasional parking tickets.\nEven if you can afford this place, look elsewhere.",
        "ownerResponse": {
          "text": "Thank you for your candid review, Joseph. Honest observations from residents help us make decisions for the future of our community, and we appreciate the time you took to share. Our intention is to create a pleasing environment for all of our residents with pricing that reflects its quality. We have profound respect for all our residents, and we sincerely apologize if you have had any experience that leads you to feel otherwise. At your earliest convenience, will you please email us at skyvue@plpinc.net, so we can have an open dialogue about your concerns? We welcome the opportunity to improve."
        }
      },
      {
        "author": "Jeremy Poppert",
        "rating": 1.0,
        "review": "Their management is terrible since being acquired from landmark. They are terrible about communicating and have vastly over priced these apartments for what they are. Also, some of the amenities they claim, are just marketing scams. For example, the bbq area is not on site, but actually at their office away from the apartments. Also the shuttle they claim as a perk, is not a shuttle run by them, but just rather the fact that they are located to the bus lines that go to campus. If you want a better bang for your buck in an over priced apartment complex, go to Lark, like a block down the road. They actually have some awesome perks including a private shuttle run by them to campus, and private bathrooms for each room, and are priced similarly to this dump of a place. Id give anything to have landmark management back, and thats saying something because they were not amazing, just average.\n\nOh, to top it all off, my lease ended on July 26th, and it is now August 25th, and I still have yet to see my deposit back, or at least a letter for what they claimed my deposit for (and our apartment was spotless when we left).\n\nWWU living are thieves. Avoid at all costs. Living in a van would be better than them. They call themselves WWU living and are not even affiliated with the school...",
        "ownerResponse": {
          "text": "Hi Jeremy, this is Wendee from Customer Service.  Thank you for letting us know about your concerns and giving us the opportunity to improve.  I wanted to let you know that your check was mailed out on 8/16 to the forwarding address that was provided to the office.  You can reach me directly at wmiller@plpinc.net."
        }
      },
      {
        "author": "Geoffrey McPherson",
        "rating": 1.0,
        "review": "This use to be a decent place to live, but after it was bought by Pacific Living, it has become a total scam. Prices were significantly jacked up. If you choose to live here, you will likely be paying close to 750$ a month per person (no matter what size your apartment), and that does not include water, electric, internet, or parking (before it was 475-650$, depending on your apartment size, and water was included). The interiors are outdated, and maintenance requests take far too long to be processed. I would STRONGLY recommend finding different place to live, because Pacific Living and Sky Vue apartments are just looking to rip you off.",
        "ownerResponse": {
          "text": "Hi Geoffrey, Thank you for taking the time to provide feedback. We're sorry you were displeased by the change in management. We manage other communities in the area and have found that the rent per room option provides the benefit of not being responsible for a roommate if they fail to pay rent. We hope you'll consider coming back to check out the updates we've made."
        }
      },
      {
        "author": "Benjmain Button",
        "rating": 1.0,
        "review": "There are so many things wrong with my apartment first of all my room smells like cigarettes, our mailbox is missing the door so we cant receive mail, we have cockroaches all over the apartment, the dryer doesnt work, the doors are broken, and things that are supposed to be there arent. I am paying 800 dollars a month to live in this garbage and we were told the apartment was ready to move in. We have been here for a week and a half and nothing has been done about these issues despite mentioning it to them multiple times.",
        "ownerResponse": {
          "text": "Hi there, this is Kailey from Customer Service. I am sorry to hear you did not have a pleasant experience with your apartment. We do offer complimentary pest control, and our team would be happy to address your concerns. I apologize that we missed the mark would love the opportunity to turn around your experience. We are working through our new move in requests, and we will address your concerns promptly. Thanks again for reaching out and allowing us the opportunity to make it right. Take care, Kailey"
        }
      },
      {
        "author": "Susel",
        "rating": 1.0,
        "review": "I saw they had a 1 Br on their website but no rent amount listed. I submitted an application right away (Friday evening). Its Wednesday and I have not heard back. Ive called and it goes straight to voicemail. Ridiculous that even when you are proactive these companies treat you like you are expendable. They must be used to students and treating them like less. I can take my money elsewhere.",
        "ownerResponse": {
          "text": "Hi Susel, this is Kailey from Customer Service. I apologize that you did not hear from our team immediately following your application. We are closed on weekends, and I see that the application came through on Sunday. I understand that at this point, you have been contacted by one of our leasing team members, and I hope this has helped answer your questions. We do strive to offer outstanding customer service, and have used this experience to better our team. Please feel free to contact me directly at 425-287-7438 or email me at customerservice@plpinc.net should you need. Take care, Kailey"
        }
      },
      {
        "author": "Marilyn Valdez",
        "rating": 5.0,
        "review": "As a parent I was impressed with the onsite management team doing their best to meet all of our requirements. Haley and Abby were always accessible and offered great tips and resources for a first time student living away from home.  Really appreciated the helpful onsite. MV",
        "ownerResponse": {
          "text": "Hi Marilyn, it is wonderful to hear how much you enjoy the time our team spent with you and your child. We strive to offer great service at Sky Vue Apartments. Thanks for tossing out a little online love for the team, it will make their day! Take care!"
        }
      },
      {
        "author": "Julie Rounds",
        "rating": 5.0,
        "review": "I love my apartment! The staff really cares about the property and the residents. They keep hallways and parking lot clean.",
        "ownerResponse": {
          "text": "Thanks so much for the feedback! We're so glad you enjoy the team and community :)"
        }
      },
      {
        "author": "Xavier Van Diest",
        "rating": 4.0,
        "review": "Very generous, understanding, and kind! Difficult to get a hold of, but once done, extremely easy to talk to!",
        "ownerResponse": {
          "text": "Hi Xavier, thanks for the honest & kind feedback! We were swamped getting everything prepared for move in weekend with hundreds of new move ins. Our team is ALWAYS here for you though! Thanks again!"
        }
      },
      {
        "author": "Mayu Molina",
        "rating": 5.0,
        "review": "Working with Cholee was a pleasure! Great apartment complex!",
        "ownerResponse": null
      },
      {
        "author": "Mgtn",
        "rating": 5.0,
        "review": "Great place to live.",
        "ownerResponse": null
      },
      {
        "author": "Pootaro",
        "rating": 5.0,
        "review": "Great place to stay and amazing staff much better than any of the dorms",
        "ownerResponse": {
          "text": "Hi there, this is Kailey from Customer Service. Thank you for taking the time to post your review for Sky Vue Apartments. I am so happy to hear that you are loving your apartment and our team. I agree that it's a great choice for student housing! Have a great day, Kailey"
        }
      },
      {
        "author": "Morgan Ebert",
        "rating": 5.0,
        "review": "Super polite staff that are more than willing to help you with whatever you need!",
        "ownerResponse": {
          "text": "Hi Morgan, Thank you so much for taking the time to share your feedback. We are happy to hear your experience has been so pleasant. We will work hard to ensure that you continue to have a great experience and always provide you with the best service possible. Thank you again for choosing Sky Vue Apartments and for being a valued member of our community!"
        }
      },
      {
        "author": "D",
        "rating": 1.0,
        "review": "This place kinda blows super close to Interstate constant construction and out dated apartments",
        "ownerResponse": {
          "text": "Hi there, this is Kailey with the Customer Service team. Thank you for taking the time to post your review for Sky Vue Apartments. I am so happy to hear that you are loving your clean apartment and our helpful team. I will be sure to pass your review along, it will make their day! Take care, Kailey"
        }
      },
      {
        "author": "bv lv",
        "rating": 5.0,
        "review": "Friendly staff, great amenities, super clean!",
        "ownerResponse": {
          "text": "Hi there, Thank you for taking the time to share your feedback. We are happy to hear your experience has been so great with our team and that you are enjoying the amenities! Thank you again for choosing Sky Vue Apartments!"
        }
      },
      {
        "author": "Debbie Roe",
        "rating": 5.0,
        "review": "Very friendly staff, thank you!!",
        "ownerResponse": {
          "text": "Hi Debbie, thanks so much for the great feedback!! We appreciate it :)"
        }
      },
      {
        "author": "Binyamin Soup",
        "rating": 1.0,
        "review": "Where's my mailbox",
        "ownerResponse": {
          "text": "Hi Binyamin, will you please email us at skyvue@plpinc.net, so we can assist you? Thank you."
        }
      },
      {
        "author": "natalie boad",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Neil Davis",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for showing your support for Sky Vue Apartments! We appreciate it :)"
        }
      },
      {
        "author": "allison jones",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Allison, happy move in!! Thanks for the feedback :)"
        }
      },
      {
        "author": "Julian Partman",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Julian!! We appreciate your 5 stars :)"
        }
      },
      {
        "author": "Katelyn Breault",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Katelyn, thanks for the review! Please let us know what else we can do for you - we hope to turn your feedback into 5 star asap! :)"
        }
      },
      {
        "author": "max",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for showing your support for Sky Vue Apartments! We appreciate it :)"
        }
      },
      {
        "author": "Sydney Yenokida",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for the feedback Sydney! Please let us know if there is anything further we can be of assistance with."
        }
      },
      {
        "author": "Evan Johnson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the feedback, Evan. It is much appreciated!"
        }
      },
      {
        "author": "Katherine Eckhardt",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the shout out!"
        }
      },
      {
        "author": "Natalie Harris",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for showing your support for Sky Vue Apartments! We hope your week is off to a great start!"
        }
      },
      {
        "author": "Morgan Burgener",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you Morgan!!"
        }
      },
      {
        "author": "Justin Rios",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the feedback Justin!"
        }
      },
      {
        "author": "Caleb Huffman",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for your feedback for Sky Vue Apartments! We hope you had a great move in!"
        }
      },
      {
        "author": "Anthony Walborn",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for showing your support for Sky Vue Apartments! We appreciate it :)"
        }
      },
      {
        "author": "Conor Mittauer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for showing your support for Sky Vue Apartments! We appreciate it :)"
        }
      }
    ]
  },
  "adjusted_review_count": 27,
  "adjusted_average_rating": 2.74,
  "summary": {
    "text": "<section><h2>Good</h2><p>The Sky Vue Apartments have showcased instances of solid performance, particularly in communication and professionalism, as some users have expressed satisfaction with the improvements after a management change. There are mentions of decent quality in the units, which demonstrates that the property has desirable features for potential residents. The narrative of positive experiences is further supported by a handful of users who commend the responsiveness and consistency in maintenance service, suggesting that for some, the Sky Vue Apartments are meeting expectations.</p><p>Further good impressions are made by the prompt approval process lauded by a user, indicative of an efficient administrative process that benefits those in urgent need of accommodation. This suggests that for some tenants, Sky Vue Apartments provides a serviceable and timely solution to their housing needs.</p></section><section><h2>Great</h2><p>In terms of exceptional service experiences, certain residents have praised individual staff members at Sky Vue Apartments for being understanding, helpful, and accessible. These staff members have been commended for offering valuable tips and resources for new tenants, reflecting a commitment to tenant support and satisfaction. Additionally, some tenants have noted the cleanliness of the apartment community, including well-kept hallways and parking areas, fostering a positive and welcoming living environment.</p><p>Compliments towards the staff's politeness and eagerness to assist with tenants' requests further reinforce the perception of a dedicated and caring management team. These accolades suggest that when tenants successfully connect with the management, their concerns are addressed with a commendable level of customer service and attention to detail.</p></section><section><h2>Bad</h2><p>On the negative side, certain user reviews illustrate a troubling pattern of failure to honor commitments, such as uncredited rent concessions, which resulted in unwarranted late fees for tenants. Difficulty in contacting the management, coupled with unfulfilled promises to rectify issues, has understandably been a point of discontent among residents. Such experiences underline operational shortcomings and a lack of follow-through on the part of the property management.</p><p>Communication stands out as an area in dire need of improvement, with user reviews citing slow or lack of responses to pressing issues. This is compounded by indications of disorganization, such as charges for non-applicable rent periods, which have caused inconvenience and frustration. The importance of clear and efficient communication channels between management and tenants is a lesson that is repeatedly evidenced in user reviews of Sky Vue Apartments.</p></section><section><h2>Ugly</h2><p>The most disconcerting reviews highlight critical maintenance and privacy concerns, with reports of prolonged wait times for essential utilities like hot water and electricity. Unauthorized entries by maintenance staff without notice, as recounted by tenants, raise serious privacy and safety issues. Moreover, instances of prolonged unavailability of maintenance services have caused some users to feel neglected and undervalued.</p><p>Allegations of deceptive marketing tactics, rent hikes without corresponding value addition, and an unresponsive customer service team add to the property's woes. The aggregation of these issues in user reviews paints a grim reality for some current and former tenants, who depict a living environment far from the standards that one would reasonably expect given the price point. This underscores a need for Sky Vue Apartments to address not only these practical concerns but also to uphold transparency and integrity in their dealings with tenants.</p></section>"
  }
}