{
  "name": "Sky View Apartments",
  "slug": "sky-view-apartments",
  "company_type": "Property",
  "address": "1800 Texas St, Bellingham, WA 98229",
  "review_count": 6,
  "average_rating": 3.83,
  "reviews": {
    "google_reviews": [
      {
        "author": "Teasa B",
        "rating": 2,
        "review": "Wasn't the best or safest place to live. My husband and I lived in a front apartment and had very few problems with our neighbors, none after the one got evicted. I had very kind and chatty neighbors and I actually miss them now that we've moved. My suggestion is to take pictures of everything and stay in top of complaints. Our apartment started growing mold despite our efforts and money put into trying to clean and kill it. We complained and asked for help to get rid of the mold. When nothing happened and it continued to grow we found out I was pregnant and we decided to move out to somewhere safer.",
        "owner_response": null
      },
      {
        "author": "Joseph",
        "rating": 3,
        "review": "No problems with management or maintenance, as all employees are very charming and genuine people. Complaints and maintenance are dealt with in good time.\n\nOur issue is the residents. Over the time my boyfriend and I have been here, we've been called homophobic slurs late at night by drunk tenants, walked in on multiple times in our own livingroom by somebody wanting to buy drugs, witnessed domestic violence bi-monthly, stalked, harassed, almost robbed, and noises and screaming don't even phase us anymore it's so common.\n\nThe appliances are old and dirty, but it's a cheap place so we can't ask for the world. They allow pets which is nice, but the old tenant's fleas stuck around, which our cat didn't appreciate much... being a cat. Always strange people lurking about. Most likely someone selling something in a unit.\n\nI wouldn't recommend moving here unless you're desperate for a roof over your head as we were. It's cheap, warm, and flexible. No laundry, but good places nearby. Bus stops close-by every 15 minutes as well. If you do move here, just stick to yourself. The residents aren't worth getting involved with.\n----------------------\nUPDATE 2/7/19:\nMoved out a bit ago to Bellevue for school. Since this review was written, the neighborhood cleaned up, and I believe they installed a laundry room to be shared by tenants. Rent also increased as per the usual gentrification of Washington continues.",
        "owner_response": null
      },
      {
        "author": "Maria Dalzot",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Shattersphere",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jerry Franklin",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 2.5,
  "distribution": {
    "1": 0,
    "2": 1,
    "3": 1,
    "4": 2,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739095143,
    "text": "<section id=\"good\"><h2>Good</h2><p>This article reviews the experiences of tenants at Sky View Apartments, highlighting some positive aspects of living there. Several users noted that the management and maintenance staff were charming and genuine individuals. Complaints were addressed in a timely manner, indicating a level of responsiveness from the property management team that is appreciated by residents.</p><p>Additionally, the apartments are pet-friendly, which is a considerable advantage for tenants with animals. Many users found the location to be convenient due to nearby bus stops and affordable rent prices. Although some physical features of the apartments may be dated, these aspects help make living at Sky View Apartments accessible to those looking for budget-friendly options.</p></section><section id=\"great\"><h2>Great</h2><p>User reviews indicate a few standout moments that some tenants may consider great. For instance, the social environment can foster community as residents find friendships among longtime neighbors. Some tenants expressed positive feelings about their experiences and the low costs associated with living there, making it an attractive option for individuals or couples looking for a starting point.</p><p>Furthermore, the recent implementation of a shared laundry room is a great improvement that enhances convenience for current and prospective tenants. The hope for ongoing enhancements reflects a management team that is willing to invest in better facilities, thus potentially increasing satisfaction among residents.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positive feedback, there are significantly troubling aspects noted in user reviews of Sky View Apartments. Some tenants have experienced serious issues with the surrounding environment, describing unsafe situations such as witnessing domestic violence and facing harassment from other residents. These concerns can overshadow the benefits of the affordable rent, creating a challenging living atmosphere.</p><pAdditionally, maintenance issues, such as mold in the apartments, have not been adequately addressed by the management. One tenant expressed the need for urgent action regarding mold growth, which remained unresolved, leading to their eventual decision to move out. Such neglect indicates a potential weakness in management’s ability to maintain a healthy living environment for residents.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The reviews also reflect some alarming experiences that tenants have faced while living at Sky View Apartments. Some residents reported frequent exposure to alarming behaviors from other tenants, such as drug transactions and entry into their apartments without permission. With such safety concerns, one might feel that the surrounding community is hostile rather than welcoming.</p><p>In summary, the prevalence of concerning resident behavior coupled with unresolved maintenance issues paints a troubling picture for potential renters. The lack of proactive management responses—none of the negative reviews provided from tenants received any replies—could exacerbate resident frustration, suggesting that issues may remain unresolved for future tenants. This could deter individuals seeking a safe and reliable living environment.</p></section>"
  }
}