{
  "name": "Son-Rise Property Management",
  "slug": "sonrise-property-management",
  "company_type": "company",
  "address": "3800 Byron Ave Ste 112 Bellingham, WA 98229",
  "review_count": 28,
  "average_rating": 1.82,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Balto S.",
        "rating": 1,
        "review": "worst management in all of Bellingham area. the landlords have dodge my emails and phone calls ask why they haven't fixed a roof leak which has cause mold to grow, it has been 2 months and going. A soon as we got a hold of someone we got hit with a 'we decided to now renew your lease\" we have told them about our own dog being attacked by our neighbors aggressive poodle and had go out a buy a gun so if the guys dog tries to attack again we now have the right to shoot to kill his dog! now the property owners deserves to be held accountable for these unhabitable living conditions! All this happened in the last 2 years I been living here and my former roommate has moved out. All Son-Rise says \"well since you were on a partial moveout were not going to look at any of your maintenance requests\" SON-RISE property does discriminate against!\n\noh their new maintance guy is shitty! says if he has to come in a fix something  that isn't needing to be fixed he will falsely report as we broke it.",
        "ownerResponse": null
      },
      {
        "author": "Bryce T.",
        "rating": 1,
        "review": "I would give a 0 star if available they are a bad company they take your money and not fix anything when you need it fixed.I have mold in my apartment and they make me pay an extra $300 to have it removed because they don't want to fix the water leaks in the roof. We have cleaned it our self multiple times. And it just comes right back.",
        "ownerResponse": null
      },
      {
        "author": "Paul L.",
        "rating": 1,
        "review": "After being hustled to pay an application fee for a rental for my son, I waited several days and heard nothing back. I reached out for certainty and clarification. Nothing. A week passed and my son still had no place to live in Bellingham. I let go of Son-Rise and spat the bad taste from my mouth. What would Jesus do? Certainly not bait and go silent like this group did.",
        "ownerResponse": null
      },
      {
        "author": "Hasina S.",
        "rating": 1,
        "review": "***I'll preface this by saying that we are not the type of people who post negative feedback on a public site, quite the contrary actually. We understand that humans are imperfect, and that we all are trying our best, but we want to warn the rest of the Bellingham community to stay away from Son-Rise.***\n\nThis was the worst experience I've ever had at a property management. My husband and I applied for a house with Son-Rise, along with one of our friends as a roommate. After 3 days of silence post submission of our applications, we reached out only to hear that we had \"missing items\" from our application. (This struck me as unprofessional, and awkward seeing that I was the one who had to seek THEM out to hear what I was missing versus the other way around.) Two days after we retrieved the missing items from our application, (items weren't even really missing, just lost in their emails) I called them back to see what our status was (since I didn't ever get a call from them) and found out there was yet ANOTHER item we were \"missing.\" Twice I had to reach out to find what we owed. Twice they were vague about the items we needed to complete this process. After two more weeks of playing tag with this property management, we found out we needed a co-signer. After we sent in the application for the co-signer, they reached out (FINALLY) saying we needed to track down our rental reference, because they themselves couldn't get ahold of them. It has been another week since we got all of the loose ends tied up, and we still have not heard back from Son-Rise about the property. Not only was our time and money wasted, it was unappreciated. Such an awful experience with a property manager who couldn't care less about the livelihood of future tenants.",
        "ownerResponse": {
          "text": "Thank you for taking the time to leave us a review. We strive to make each customer experience a positive one and are disappointed that this wasn't the case for you. We would appreciate feedback on how we can improve and make your visit memorable for the right reasons. Please call (360) 738-3700 at your earliest convenience."
        }
      },
      {
        "author": "Melissa S.",
        "rating": 1,
        "review": "This review is specifically for Virginia who works for Son-Rise. Virginia is the property manager for a condo I had lived in up until recently. She is horrible at her job and should be removed from her position immediately. She takes sides in neighbor disputes and is the most condescending and rude a hole I have ever had the misfortune of speaking with. The way that she speaks to people (and I am one of four other people who have said similar things about her) is never okay in any situation, but as someone who works for the owners of the condo she should definitely not be rude to owners. If you ask her a question, she acts like the whole world is falling apart and speaks to you like you're a child. Selling the condo was the best thing I ever did, and I celebrate never having to look at her or speak to her again. Cheers!!",
        "ownerResponse": {
          "text": "We are sorry to hear that your experience was not an exceptional one. Please reach out to us at (360) 738-3700 as we want to hear your concerns and address them in the most suitable way. We look forward to hearing from you."
        }
      },
      {
        "author": "Susan W.",
        "rating": 1,
        "review": "Not thrilled to find the amount of compact snow & ice covering walkways & stairs. Someone could break a hip!\n( it's been days in this condition)\nAccording to Washington Landlord/Tenant law- the property managers will be liable when that occurs.",
        "ownerResponse": {
          "text": "Hey there, Karin. Our customers are very important to us and we are sorry to hear we may have let you down! Please reach out to us at (360) 738-3700 to let us know how we can improve."
        }
      },
      {
        "author": "Arynn M.",
        "rating": 4,
        "review": "I rented two units from SonRise in two years; both in the 808s. I have found the staff to be courteous and helpful both on the phone and in person. I had appliances break (dishwashers) in each apartment. They were replaced promptly and it was not taken out of my deposit. They were lenient and charged no fee for the one time we were late paying rent. It was only a day late, but still.  I got my full deposit back (minus like $10) from each house. The key is to remember the details; windows and sills, behind appliances, inside cabinets, etc. They give you a list, it's super easy. \n\nThe two problems I ever had both involved the parking lot. 1) SonRise will never call a tow-truck company to move cars without passes. 2) When it snows they do not shovel and only sometimes salt. If you plan on living in one of their units take some initiative and sweep/shovel your own stairs and walk ways and move your cars to street parking when the flakes start falling if you want to get out the next morning.",
        "ownerResponse": {
          "text": "Hey there, Arynn. Thank you so much for taking the time to share your feedback with us. We truly appreciate any comments we receive as it's a great way to gain unbiased insight on how we're doing. We're so glad to know that you had a positive experience and we hope to see you again soon at Son-Rise Property Management, Inc.."
        }
      },
      {
        "author": "Jenn E.",
        "rating": 1,
        "review": "Ok you guys this is beyond the worst management company I've ever dealt with! I have rented at places in Miami, Los Angeles, Laguna Beach and Scottsdale which all are high well educated places. Ever since I started renting from this company it's been nothing but a hassle first week of renting their asked to up my rent because they had made a mistake on the price and asked for more money? Then I had signed a six-month lease with the option to renew for another year after living here for 60 days they had told me the owner is selling the place and I will not be able to re-sign my lease for another year. And then as a renter it is my job to maintain the yard as in no trash don't make it look sloppy if my grass is a little too long that's my opinion and I have got asked to cut the grass for the realtor to stage photos which I will be leaving in 10 days and I'm traveling in those 10 days while trying to move there telling me if I don't they're taking it out of my damage deposit which isn't right. I have a life and my life isn't mowing the grass if it's too long as a realtor or management company that's their responsibility they think it's out of control.  There all under graduated people working there that I don't think know what they're talking about and their guessing they're rude not respectful people. Please never rent from them you will regret it and get taken advantage of!",
        "ownerResponse": {
          "text": "Thank you for taking the time to voice your concerns. Please reach out to us at (360) 738-3700 to discuss how we can improve. Thank you and we hope to hear from you promptly."
        }
      },
      {
        "author": "Tim M.",
        "rating": 1,
        "review": "I don't expect the red carpet to be rolled out for my money.  I don't even need the people to smile or be happy.  But the staff at the front desk is so rude and they acted like the three questions I asked were just too much for them to trouble themselves with.  Then after I was approved for the apartment I wanted to move into, it was more of the same.  So I went elsewhere.  Maybe they were just having a bad day. But is it that hard to be polite and smile?",
        "ownerResponse": null
      },
      {
        "author": "Cameron F.",
        "rating": 1,
        "review": "Lived in one of their brand new houses for a total of 2 years. As for bothering tenants they are fine, barely interacted with us. Yet the company is extremely unprofessional. To start, we were told when moving in \"We installed wood chips so that yard work will not be involved with the house\" then later received a notification that we needed to remove weeds that were growing. Glad they gave us an unusable heinous yard yet still expected us to maintain it like it was grass. They did inform us 24 hours in advance of yearly inspection, but they never informed us when the owner would randomly show up. A few times the owner would show up at our door without giving us any prior knowledge and inform us he was there to replace a filter or something (we always let him in because the owner is actually a super awesome guy, son-rise is the problem). We also informed them that our glass chandelier broke when our tall roommate hit it with his head, they never helped us fix or replace it, yet charged us at the end. We told them we were moving out 3 months before the end of the lease, which they forgot about until we had to remind them 10 days before our move-out. Now for the real KICKER: we put a couple thousand dollars down in the deposit. When we moved out we asked them when we would receive it. They said \"we have 21 days until we have to send it\". A month later I asked where it was and there response was \"Since no one informed us of an address to send it to, we mailed it to the house you leased from us.\" YES! Son-rise mailed an extremely valuable check to a VACANT house which is up for rent even though they have permanent addresses from the 3 people on the lease. Communicating with this company slightly feels like you are talking to a kindergarten class. Nice in person but I swear to god, behind closed doors they are as chaotic as a propane factory hosting a fireball juggling tournament. Bellingham rental companies are not the best and take advantage of college kids, so pick your poison.",
        "ownerResponse": {
          "text": "Our team wants to extend our sincerest apologies. We have listened to your feedback and have changed our policy regarding security deposits. We hope you will give us an opportunity to discuss your concerns further with you. You can reach out to us at (360) 738-3700. Thank you."
        }
      },
      {
        "author": "Mariachristina R.",
        "rating": 1,
        "review": "Worse place to rent from in all of Bellingham. We had a signed lease saying no one could enter our apartment unless we were home, that doesn't mean anything to them or at least the people they have working for them, maintenance guys where in our apartment while we were out to come home and them be in our bedroom saying they were fixing the doors? Nothing was wrong with bedroom doors and we didn't okay it. Worse one was when one maintenance guy let himself in and sat on the couch watching tv with my 7year old son while i was taking a shower, VERY MESSED UP, again entered without any permission or warning. Last but not lease they don't keep there word for anything. DO NOT MAKE THE SAME MISTAKE. rent from someone else. 1800 Alabama Street threw Son-Rise is the worse place to rent in Bellingham. I would rather live at the mission.",
        "ownerResponse": {
          "text": "We're sorry to hear your experience with us was less than amazing. Please reach out to us at (360) 738-3700 so we can better understand what happened. We look forward to hearing from you."
        }
      },
      {
        "author": "Kathryn D.",
        "rating": 1,
        "review": "My roommate and I were both quite put off by the knowledge of staff here. They will constantly give us two different answers, and then we're stuck in the middle trying to figure out who is right. After making the drive up from Seattle to close out my part of the lease, I came back to find out that they needed me to sign something else. This was extremely frustrating, and I think that they need to develop some sort of standardization for their moves, since they currently don't seem to know the process (which is one that they are constantly dealing with) for move outs. I'd look to other rental agencies.",
        "ownerResponse": {
          "text": "Hello Kathryn. We're sorry to hear that you didn't have a great experience. Please call us at (360) 738-3700 to let us know more."
        }
      },
      {
        "author": "Sarah H.",
        "rating": 1,
        "review": "DO NOT RENT FROM THESE PEOPLE... regardless of how nice the property is. Every time we have an issue at our house, it takes days from them to call a maintenance guy or plumber.. even when it is an emergency! One of the front desk receptionists is extremely rude, and every time we call we have a very unpleasant experience. There is no customer service what-so-ever and they make everything a way bigger deal than it should be. I have rented for seven years from other rental agencies in the same town and i have never had such a bad experience in my rental history. We have spent countless hours away from work to allow workers into our home to fix appliances, windows, plumbing... you name it! .\n\nAvoid this company at all costs...",
        "ownerResponse": null
      },
      {
        "author": "Amanda B.",
        "rating": 4,
        "review": "I have been well-taken care of at son-rise. I took over the lease of a friend who moved away. The apartment is fairly well taken care of and any little issues that I have had, I have only had to call and things were taken care of. I appreciate how friendly they are, and how quickly they they got me into that place. I pay my rent online and I haven't had any problems.",
        "ownerResponse": {
          "text": "Thank you for the wonderful review, Amanda! We're happy to hear you had an awesome time with us at Son-Rise Property Management, Inc.. We hope you stop by and see us again soon!"
        }
      },
      {
        "author": "John G.",
        "rating": 5,
        "review": "I don't usually write reviews for this kind of stuff because it's a waste of my time. However, I have had a really good experience with son rise reality. They always are there to help and are not trying to screw people on little stuff. They were very understanding whenever there was a problem and were quick to rectify any mistakes. Best rental place in Bellingham that I have had.",
        "ownerResponse": {
          "text": "That is so amazing to hear, John! Thank you so much for taking the time to share your feedback with our team at Son-Rise Property Management, Inc.. It's great to know that we continue to provide our customers with everything they need. Have a great day!"
        }
      },
      {
        "author": "Rebecca H.",
        "rating": 5,
        "review": "I recently worked with Kandis Lindgren on a duplex listing I handled for a seller in the South Hill neighborhood. Kandis was the account manager for the property and does a great job for her clients. She was also helpful, kind and considerate throughout the listing process. She keeps the tenants happy and takes good care of an owner's property.",
        "ownerResponse": {
          "text": "Thank you for your five-star review, Rebecca. Our team at Son-Rise Property Management, Inc. always strives for the highest standards. We are delighted we made your experience a positive one. Until next time, take care!"
        }
      },
      {
        "author": "Willow B.",
        "rating": 5,
        "review": "I was pretty impressed with Son-rise. They were our property manager for a year. We had few repairs but they did them pretty fast when needed. They generally communicated promptly with us. I was most impressed that we got our whole deposit (minus a small carpet cleaning fee) back. This honest behavior is fairly uncommon in Bellingham as our last two property managers tried to steal our deposit and had to be threatened with legal action to surrender the money. Definitely one of the better property manager in a city full of sleazy ones.",
        "ownerResponse": null
      },
      {
        "author": "Thomas V.",
        "rating": 1,
        "review": "Don't trust them. They are fake and manipulative. They reference Jesus in their company name, but there is nothing saintly about how they treat their tenants. Our house was in terrible shape when we moved in, big holes in the wall, weird stains, wood floors that give you splinters, and the house was white but covered in filth. \"We're the dirty house on the corner\" we would say. But it was cheap and in a good location. It wasn't until we started getting harassing emails about our lawn needing mowed that we started to realize that their quality of professionalism is as cheap as the rent. We mowed our lawn every few weeks but they kept charging us as if they had to pay someone for lawn service. When we moved out we cleaned the house and garage way better than it was before we moved in. They charged us for 12 hours of 'cleaning', batteries, carpet cleaning (there was one room with carpet) and other random fees I've never experienced before. We made sure all batteries and lights worked before we left, and We scrubbed that housed. I called them and they were extremely rude, told me they couldn't do a walk through with us because someone else had moved in already. And then hung up on me. Very Christ like. I went over to the house, it was empty and all the windows were open. I peaked in and the house had definitely not had 12 hours of anything done to it since we left nor was anyone living there yet.",
        "ownerResponse": {
          "text": "We're sorry to hear that you didn't have a great experience. Please call us at (360) 738-3700 to let us know more."
        }
      },
      {
        "author": "Spam M.",
        "rating": 5,
        "review": "Super easy to work with and never invade your space. They make everything easy and enjoyable and they will come to the property for maintenance or help anytime. Wish they had more houses on the market right now so I could stay with them :(",
        "ownerResponse": {
          "text": "We appreciate your kind review of Son-Rise Property Management, Inc. and hope you will visit us again soon. As a valued customer, we look forward to taking care of your needs in the future. Until we see you, take care!"
        }
      },
      {
        "author": "ashley h.",
        "rating": 1,
        "review": "Very rude and terrible service. Do NOT rent from them - you will regret it. One of the worst property management companies in Bellingham! They don't take care of their properties and they are rude to tenants.",
        "ownerResponse": {
          "text": "Hello Ashley. While we are thankful for your feedback, we would like to learn more about why your experience was not an exceptional one. Reach out to us at (360) 738-3700 to let us know how we can improve."
        }
      },
      {
        "author": "S B.",
        "rating": 1,
        "review": "Absolutely horrible. Do not rent. Withheld over half of our security deposit for unspecified extra \"cleaning\" (my family scrubbed it from top to bottom) and Sandy has been ignoring our calls for a month now. Parking was a nightmare, employees rude, unit shabby. We were told we had a 10 month lease, that's the only reason we went there then on moving in day, they say that's not true and that the lady who told us that is no longer with them. They are taking advantage of young people because they think they can get away with it. Go somewhere where you will be respected.",
        "ownerResponse": {
          "text": "We're extremely sorry that you had to face such difficulties. We pride ourselves on providing great service and we'd like to do the same for you. We may not be able to change the past, but if you give us a chance, we can work to make things right. Please give our office a call at (360)738-3700 at your earliest convenience. Thank you."
        }
      },
      {
        "author": "Patrick S.",
        "rating": 1,
        "review": "I've had a horrible experience with this rental company. When we moved into the house it was full of items from the previous tenants and not in particularly good shape. When we moved out they kept half of our deposit for cleaning even though we thoroughly scrubbed the house and I have never had my deposit withheld from previous landlords. They put a bill on our account in error, told us twice that they would remove it since they agreed it was in error, never took it off, and then deducted that from our deposit as well. The most frustrating part however was how incredibly and consistently condescending they were to us, constantly referring to us as \"kids\" and \"college students\" when my roommates and I are graduate students and teachers in our late 20's and early 30's. They seemed to think we were idiots who had never rented before. When I informed them that the house had mold (our lease said that they would take care of mold) they kept telling me that it probably wasn't mold and I was just confused about what mold looked like. If you do rent from them be sure to well document everything and get things in writing, especially if you are younger since they seem to see that as an opportunity to take advantage of you. \nMight be helpful:\nhttp://www.tenantsunion.org/en/rights",
        "ownerResponse": null
      },
      {
        "author": "Shay V.",
        "rating": 1,
        "review": "I really  wanted to like Son-Rise. I loved the apartment, and the service was great when we were signing our lease but the past months have completely changed my perspective. As we prepared to move out we began to find out about all the extra fees and cleaning charges they require you to pay (even if you leave your apartment spotless). This would have been fine if they had been outright about it from the start but all we got was sweet talking and patronizing lectures. They have truly been quite rude to us. Basically, this is just another one of those realty companies that does whatever possible to take money from defenseless tenants. When  we finally moved out they ended up charging us for the time the apartment was vacant even though we had specifically asked them if they would only charge us to the day we vacated. Again, all I ask is that you say things outright and not twist legal language to your profit, is that too much to ask. These are sleazy untrustworthy people, don't do business with them.",
        "ownerResponse": null
      },
      {
        "author": "m. m.",
        "rating": 1,
        "review": "Don't do business here. The agent where I rented a few years said he has many many apartments to manage. The company doesn't have enough employees to take care of apartment problems. One agent forgot to respond for a whole year. Son-Rise runs on a shoe-string budget, if you make the mistake to rent from the company don't expect much in return for the high rents charged. I'm not a university student but I think that's their attitude about everyone. The web site is pretty words but some of it's claims are false in my direct experience. They didn't always screen applicants for the best of renters, believe me.",
        "ownerResponse": null
      },
      {
        "author": "Heather P.",
        "rating": 1,
        "review": "Sonrise has been an awful property management company. It took them 3 months and 4 separate visits to my apartment to find a fix a basic leak. I'm assuming it took them this long because they hired people who would work for cheap and acted completely unprofessional, not giving my roommate and i proper amounts of time before they entered our apartment. They have left multiple notes on our doors telling us how much money the leak has cost them yet the only reason it cost as much as it did is because they did not maintain the plumbing system previous to the leak.",
        "ownerResponse": null
      },
      {
        "author": "Lauren T.",
        "rating": 1,
        "review": "The place looked nice, but when I moved in I asked them to replace the electrical panel that they had left off, and the closet doors.  That never happened.  Also, the toilet ran the whole year.  The dryer was taking longer and longer to dry clothes, up to 3 hours by the time I moved out.  Asked them for 6 months to fix it.  The dishwasher detergent dispenser didn't work.  Even though they wouldn't fix anything, they certainly have alot of rules for their tenants to follow.    In general just a frustrating experience.",
        "ownerResponse": null
      },
      {
        "author": "Ian T.",
        "rating": 2,
        "review": "Renter beware. My wife and I just finished renting from Son-Rise in August. We had nothing but issues in our dealings with this rental company. I can provide proof for nearly all of my issues below. \nHere is why I would steer clear of Son-Rise:\n- Unit was never cleaned prior to moving in\n- Water stains on floor of unit had not been fixed as I was told they had been\n- Dishwasher never worked properly\n- Numerous light bulbs were burned out when I moved in\n- Fixing my hot water heater took 3 visits from two different maintenance men\n- A bullet hole that occurred in my wall was never repaired. At first I was told it would be my cost to fix as it was not a result of the units owner. When I pressed the issue, Son-Rise agreed to fix it at their cost. It was never repaired while I lived in the unit.\n- Upon terminating my lease (admittedly late, but only by three days) I was responsible for September's rent (moved out in August). Within the rights of Washington Landlord-Tenant law.\n- Paid September rent knowing our unit had been viewed by multiple people and an application had been submitted prior to the end of August.\n- Was never informed when a new lease was signed (When a new lease is signed, I would be due a prorated amount of September's rent).\n- I found out a new renter was in the unit when I contacted the energy company to arrange my last bill.\n- I was only refunded rent when I contacted Son-Rise and pressed the issue about the rent as well as some absurd charges made on my deposit (fire alarm batteries for $45?)\n-Oh, beware of the automatic $25 taken out of your deposit as \"Administrative Fee\"\n\nSome other items to be warned about are the poorly written lease (several sections seem to say one thing, but Son-Rise interprets them another). The company overworks their employees (in my opinion) and this slows down all action on maintenance requests outside of legally required responses (so water/electric/heat) as well as any inquiries. I could continue, but would begin entering my personal feelings and not fact. The only reason that I gave Son-Rise two stars is that the rent was easily cheaper by $100 a month than elsewhere and that they did end up refunding the rent due to me in addition to most of the charges to my deposit (and I still contend they owe me all but the $25, but getting that would cost me a lawyer and that costs more than the other charges)",
        "ownerResponse": null
      },
      {
        "author": "Michelle J.",
        "rating": 1,
        "review": "I have been renting from them for over a year...and now we are having a plumbing issue. I work at Gary's Plumbing and Heating and we have amazing technicians and trust their work. We are licensed and bonded just to note. On the phone to the front desk lady I was calling in my plumbing issue and asked ya know \"hey I work at Gary's Plumbing and Heating and is there anyway...\" Didn't even get to finish my sentence before she cut me off and said \"they have to be licensed and bonded\" and I said \"Oh of course they are..\" cut off again I got to hear \"Um yea, so no\". Rude much? And when she asked is it okay for us to enter your home while you're not there and I said no, I'd would like to be there, she almost sounded like \"well.....okaaaaay\". Yes, well okay...do not enter my home without my permission while I am not there. End of story. So now I'm a little apprehensive whether they will actually follow what I asked and hope I don't show up from work to see someone I don't know in my house.",
        "ownerResponse": {
          "text": "Thank you for your feedback, Michelle. We're sorry to hear that you didn't have a great experience. Please call us at (360) 738-3700 to let us know more."
        }
      }
    ]
  },
  "adjusted_review_count": 28,
  "adjusted_average_rating": 1.82,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the context of local property management, Son-Rise has received some commendations from tenants who have had positive experiences with the company. A few tenants have reported professional and courteous interactions with staff while addressing concerns and that maintenance requests, when made, were handled in a timely manner. These isolated cases indicate that Son-Rise has the potential to provide satisfactory service, given the right circumstances.</p><p>Furthermore, there are instances where tenants have successfully retrieved the majority of their security deposits, which is a noteworthy positive, considering the common issues surrounding deposit returns. Tenant experiences vary, but those who meticulously adhered to checklist details upon move-out found the process straightforward and were met with fair treatment regarding their deposits.</p></section><section><h2>Great</h2><p>Amidst the critiques, it's important to acknowledge the instances where Son-Rise Property Management has excelled. Tenants have cited experiences where the staff was helpful and approachable, assisting them through the rental process. Taking over an existing lease was made uncomplicated for some, and any maintenance issues raised were quickly addressed and resolved satisfactorily by Son-Rise.</p><p>Positive experiences were marked by prompt communication from the property management. For some renters, there was leniency shown regarding late payments and appreciation expressed for the ease of online rent payments. These small gestures of good service can make a significant difference in the tenant-landlord relationship, representing the high points of interacting with the company.</p></section><section><h2>Bad</h2><p>On the other hand, some user reviews point towards a worrying trend of unprofessionalism within the company. Examples include inconsistent information being provided by staff, which caused confusion and frustration for tenants. Additionally, there are reports of significant delays and unresponsiveness to application queries and maintenance issues, contributing to a negative perception of Son-Rise Property Management's operations.</p><p>In certain reviews, tenants narrate how their maintenance concerns went unaddressed for extended periods, detrimentally affecting their quality of living. Concerns over aspects like lawn maintenance and unwarranted additional clean-up fees also paint a picture of a company that could be more attentive to tenant rights and respectful communication.</p></section><section><h2>Ugly</h2><p>The “ugly” side of Son-Rise Property Management’s service is a portrayal of disappointment and frustration echoed in several reviews. There were alarming reports of staff entering apartments without permission, which is a severe violation of privacy and indicates a lack of professional boundaries. Furthermore, a disturbing account from a tenant highlights an unsettling scenario where a maintenance worker entered the property unauthorized and interacted inappropriately with a minor.</p><p>Add to that the accusations from users about the property management withholding a significant portion of security deposits without clear justification and providing a poor level of cleanliness and maintenance in their properties. These distressing experiences reflect a dire need for improvement in the way Son-Rise conducts business and respects its tenants' rights and well-being.</p></section>",
    "disclaimer": "Son-Rise Property Management was acquired by the California-based PURE Property management sometime between 2020 and 2023. It is unclear whether Son-Rise simply rebranded under PURE or if PURE replaced existing management with their own."
  }
}