{
  "name": "Soria Real Estate",
  "slug": "soria-real-estate",
  "company_type": "Company",
  "address": "515 E Fairhaven Ave Burlington, WA 98233",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "P B.",
        "rating": 1,
        "review": "Amber was extremely rude and condescending when we met. She was sent as \"An appraiser\" from Piazza Realty Property Mgmt, and low & behold, she was with another agent with the last name of Piazza! (No appraisal was done, just a lie to get them on the property and in my home. LOL\n She basically told me, we are going to start bringing people through your house whenever we please, even if nobody is home!\nI told her I would rather move out than face that type of invasion of my privacy.\nShe snidely replied (SEVERAL TIMES) You better get busy and move then!\nAfter about the 4th or 5th repetition of this statement, I used my outside voice and told her I heard her the 1st time & invited her to leave my property.\nUpon signing the papers at my new residence, I relayed this info to my realtor & when I told him what her name was, he rolled his eyes.. Apparently she has a reputation..\nI will never do business with them or recommend them.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>Given the available data, specific instances where Soria Real Estate has exceeded expectations in their property management duties are not evident. This lack of positive feedback does not necessarily mean the absence of satisfactory experiences with the company, but rather that the company's strengths are not reflected in the user reviews provided. The review data set has limited narratives to draw from in highlighting the positive aspects of Soria Real Estate's service offerings.</p></section><section><h2>Great</h2><p>Since the user reviews do not reflect instances of great service, this article cannot provide an accurate description of excellence within Soria Real Estate's operations. It is important to note that there may be tenants or property owners who have had positive interactions with the company, but such experiences have not been documented in the available user reviews.</p></section><section><h2>Bad</h2><p>The single user review for Soria Real Estate points to an encounter where the staff, specifically an individual named Amber, demonstrated rudeness and a condescending attitude during their meeting. The reviewer felt disrespected and uncomfortable with the nature of the interaction, specifically mentioning feeling as if their privacy was invaded. Furthermore, the reviewer expressed a willingness to move out rather than endure the proposed frequency of property showings.</p></section><section><h2>Ugly</h2><p>The experience as described by the reviewer also involved deceit, with the staff from Soria Real Estate allegedly falsely presenting themselves as appraisers to gain access to the property. This account of dishonesty raises serious concerns about ethical practices within the company. It's also worth mentioning that the reviewer's recounting of their realtor's reaction suggests that the reputation of the involved staff member from Soria Real Estate might be known in the wider real estate community, which could indicate a pattern of such behavior.</p></section>"
  }
}