{
  "name": "South Hill Apartments",
  "slug": "south-hill-apartments",
  "company_type": "Property",
  "address": "255 N Forest St APT 116, Bellingham, WA 98225",
  "review_count": 22,
  "average_rating": 2.86,
  "reviews": {
    "google_reviews": [
      {
        "author": "Lani Suyama",
        "rating": 5.0,
        "review": "Im really surprised this complex doesnt have a better rating. I thought the South Hill Apartments were lovely, and my time as a tenant here was hands down the best experience Ive had as a renter in Bellingham. The staff is friendly and helpful, neighbors were nice, and the location of the building itself is unbeatable. Its an old building, so its no surprise that there were somewhat frequent water shut offs, but they never lasted super long and we were always given a gracious heads up. This was perhaps the only negative thing I could think to say about these apartments. Its been a little less than a year since Ive had to move out and I really miss it!",
        "ownerResponse": null
      },
      {
        "author": "Aaron Sime",
        "rating": 5.0,
        "review": "This was our Bellingham home for nearly 4 years. It was an excellent place to call home for us. The location was perfect for us. The commute to work in Fairhaven was easy. To get to downtown was just a short drive or 10-15 minute walk. The south hill neighborhood is beautiful. The views from the apartments are spectacular. The staff were super helpful and supportive. I will cherish my time spent living here.",
        "ownerResponse": null
      },
      {
        "author": "Kai Wittenberg",
        "rating": 5.0,
        "review": "Going on my second year here and could not be more impressed, particularly when comparing this site to other apartment rentals in Bellingham. I've never once had a problem with anyone here (neighbor or employee), in fact, the employees who work here are incredibly kind and friendly. Any maintenance normally happens within a day of requesting it, and the maintenance guy Jeff and his crew are always super friendly.\n\nOverall, I've thoroughly enjoyed myself here and the view just can't be beaten",
        "ownerResponse": null
      },
      {
        "author": "Brenda Baker",
        "rating": 4.0,
        "review": "The staff here try hard to accommodate everyone's request whether it is moving to another apartment, work orders or just general questions. Both office staff have at least 15 years experience in Property Management so Ms. Dumas needs to have the correct info before she writes a review. The staff here is quite qualified to run this property. To respond to Sarah's review,  there are not enough parking spots to accommodate all tenants so guests are required to park down on state street including weekends. She was not told by me that her boyfriend could park on site on weekends. Jeff  is our maintenance Lead who has been here for close to 13 years and only targets those vehicles parking on site without a site parking sticker. They are given a first warning notice and if a second warning is issued, it is automatically towed. Signs are also posted on the property.  Her boyfriend's car got towed when he got the second warning. Jeff also does work orders. The tenant is first called, then the work is completed usually the same day unless there is a part to be ordered.  We try not to inconvenience our tenants and do the job quickly and always clean the site before leaving. If he did leave the place in a mess as described, then that tenant should have called the office to complain not on the website. If she is not happy here as stated in her review as in her own words as old and falling apart,  the office would be glad to accept her notice to vacate once her lease is completed this spring. We here at South Hill try to make South Hill a safe, quiet and a wonderful experience to all who reside here. Anyone else who would like to write a review on their experiences here at South Hill (positive or negative) are more than welcomed. In fact, we look forward to hearing your comments.",
        "ownerResponse": null
      },
      {
        "author": "Zach Bastian",
        "rating": 1.0,
        "review": "Here were my main issues with living at South Hill Apartments for just over a year:\n\n1.  They are having some major issues with the piping in the building.  It's understandable, considering it's a very old building.  That doesn't change the inconvenience of them turning your water off roughly once a month for prolonged periods of time with minimal notice.\n\n2.  The water isn't good quality and the pipes are very old.  When you turn your water on after it had been shut off, the running water was dark brown in color.\n\n3.  The heat is all connected to the main boiler on the first story.  You never have any control over when they turn it on.  It seemed like they only turned it on when it was at or below freezing.  I'm assuming this was to save them money.\n\n4.  When the heat is turned on, the heater pipes clank incessantly.  Hopefully you're a sound sleeper, because if not, you'll be waking up at 4-5 AM when the telltale clanking begins.\n\n5.  The gas range in our kitchen had no ventilation.  We couldn't even use the oven without the entire apartment smelling like gas and setting off the smoke alarm.  Having no ventilation left the entire kitchen coated in a greasy film eventually, regardless of keeping things clean.\n\n6.  When we gave them 30 days notice to move out, we were informed that you can only give them notice on the 1st of every month if you don't want to pay extra.  We had to pay for almost two weeks when we were not occupying the apartment.\n\n7.  During the weeks leading up to our move out, they stopped by our apartment on two separate occasions to show it to prospective renters without giving notice.  We complained after the first time it happened, and then it happened again just a few days later.  Very unprofessional.\n\nThat being said, it is a shame we had such a negative experience at this property.  It is definitely located in a pretty nice area, and the price includes utilities - not to mention that rent is fairly cheap.  Well, now we know why.\n\nI would advise anyone thinking of moving in to look elsewhere.",
        "ownerResponse": null
      },
      {
        "author": "Emily Hie",
        "rating": 5.0,
        "review": "I think this is one of the best places to live in Bellingham.  Affordable living with a view, clean and updated, full of light, and a friendly community.  The property managers are extremely friendly and reasonable, and go above and beyond what other managers do.  They are on-site and communicate regularly with tenants about updates, maintenance, etc, but are not nosy.  The maintenance crew is also on-site and keeps everything looking beautiful.  They respond quickly to requests and are very friendly.  This has been my favorite living experience so far since moving to town!",
        "ownerResponse": null
      },
      {
        "author": "Ryan Darian",
        "rating": 1.0,
        "review": "We were told in November of 2016 that there would be construction occurring in a unit adjacent to our apartment. For the next five months, we lived next door to a automated concrete sledgehammer banging away next to our bedroom. That five months included invasive and unprofessional behavior from maintenance staff and the construction staff that they hired. We had ant infestations for multiple months. The staff did not address the issue for multiple weeks sometimes and we ended up just stepping on dead ants in our bathroom for a few weeks at a time.\n\nMaintenance staff is required to call the tenant before entering the home for any reason other than emergencies. South Hill's maintenance staff likes to call right outside your door, if you don't answer they walk in. If you're in the shower, SURPRISE!\n\nWe were told when we moved in that we are required to keep the windows cracked because the boiler system that heats the entire Manor building provides a bit of moisture. Well, we did that and then the steam escaping out of the boiler system would rise up from under the apartment and flow directly into our bedroom window causing MOLD. Washington state law RCW 59.18.060 states that landlords are required to provide a weathertight home, with functioning water and heating. Steam from a leak was coming directly in the window and to stop the flow. The mold we found was unable to be looked at for four days after discovered because staff was gone on vacation. So, we had an independent indoor air quality specialist assess the situation. He informed us that we should clean up what we could and dry out the unit as quickly as possible. We took photos of the damage and cleaned the walls and the furniture, but when the South Hill maintenance staff looked at the mess, they condemned us for cleaning anything and told us they could do nothing but spray a mix of bleach and water. We are very uncomfortable that we were asked to ignore a health hazard. The rubble and construction material from the unit next door was stored in a pile outside our bedroom window. This blocked our view of the bay that we had been so happy to see before, and the tarps covering the mounds of dirt would loudly flap in the wind at night. We hoped that the construction noises would solve the clanging in the pipes but still, after all these months, we are kept from sleeping by a broken heating and water system that sounds like pots and pans rattling together in the pipes suspended above our bedroom.We were given a notice, on what was supposedly a final day of work that would disturb us, that work would begin at 10 a.m. Instead, at 7:40 a.m. we were woken by voices outside the window. By 8 a.m. power tools were loudly being used and the fumes and dust coming in the window smelled of chemicals and gasoline and set off both fire alarms in our unit. When we asked the maintenance staff if we could close the window, they said it was just the dirt from the pipes and recommended taking the batteries out of the fire alarms to stop them from going off. We stated we preferred to close the window and stop the toxic fumes from entering the unit all together. The recommendations given by the maintenance staff had no consideration for tenant safety or health. Long-term health issues can be attributed to toxic fumes from gas powered tools in confined spaces.\n\nNow comes the kicker: when I decided, enough is enough, I emailed the property manager. She did not respond for months, I sent letters and made phone calls too. It wasn't until I had emailed of one of her subordinates (who mentioned to me how repulsive my living situation has been and could not believe the treatment I received), that she finally responded to me. I requested a renegotiation of rent and outlined the reasoning and mentioned that I'd be willing to talk it over with civility, all I wanted was a little bit of reasonable compensation for the hell I lived through.\n\nAs a response she served me a 20 day termination of tenancy.\n\nCool.\n\nIf you want to live at South Hill Apartments, don't.",
        "ownerResponse": null
      },
      {
        "author": "Jared Ross",
        "rating": 1.0,
        "review": "Make sure you read the fine print on the lease. When they mention the monthly rate, they say \"the rent is (X) amount per month untill adjusted by manager/landlord\", meaning they can raise your rent at anytime during your lease. This just happened to my mother. They told her it would be $975 a month for her lease, two months into the lease she gets a note on her door, saying that rent will be raised by $50 in August. She rented from them because it fit her budget. Now she will not be able to afford one of her medications because they upped the rent as she just started her lease.",
        "ownerResponse": null
      },
      {
        "author": "Adriana Guerrero",
        "rating": 4.0,
        "review": "I absolutely love everything, but the single paned windows. This is a future project of thiers, but otherwise it's an amazing place to live! It's especially nice when you have the hardwood floors and the view! Maintenance is very prompt on answering calls and management is very friendly.",
        "ownerResponse": null
      },
      {
        "author": "Julia Moss",
        "rating": 5.0,
        "review": "A wonderul location with a beautiful view. The staff are amazing and make this apartment complex feel like home.",
        "ownerResponse": null
      },
      {
        "author": "Morgan Strand",
        "rating": 1.0,
        "review": "Won't answer the damn phone and won't call me back about the 300 dollar deposit that is refundable to hold a unit and we weren't able to get the place. JUST ANSWER YOUR DAMN PHONE!!!!",
        "ownerResponse": null
      },
      {
        "author": "Bre Sanders",
        "rating": 4.0,
        "review": "We miss Dee very much! But great apartments overall.",
        "ownerResponse": null
      },
      {
        "author": "Maxim Bryson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Gavin Christensen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Briana Mihelich",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "A J",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sarah Dumas",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Tad Beavers",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Yip E.",
        "rating": 1,
        "review": "They never showed up to our appt to view the apartment....we drove 4 hours to view, as we don't live in Bellingham & NO ONE WAS THERE!\n\nWaited and hour, left 2 more messages...it was a WHOLE DAY WASTED.",
        "ownerResponse": null
      },
      {
        "author": "Sarah D.",
        "rating": 1,
        "review": "To start off, the Office Staff is incredibly unprofessional. The assistant manager has been quite difficult to work with. She never remembers who I am when I walk through the door. If I am living at the complex she works at, I feel as though it might be important to know who your tenants are and what they look like. Her emails and responses to issues I have had have been very out of line. She is very disorganized and unprofessional. \n\nOn another note, the maintenance staff could use a little work. They are constantly shutting off the water or doing renovations to the apartment. It is always one thing after another, and I do not feel at home.\n\nThe parking lot has been an ongoing issue for me for quite a while. Several months ago, I had to be rushed to the emergency room on a Sunday. I was there for several hours. My boyfriend was the one who took me. When we got back to my complex he parked in the parking lot to immediately get me inside. He was taking care of me the rest of the night, in the morning when he remembered he needed to move his car (roughly around 9AM) he found his car had been towed. After just getting out of the hospital I had to drive him to pick up his car. The first warning he received was on a weekend which, when I moved in, I was told specifically by the office staff that guests could park in the parking lot on weekends. To give perspective, the parking lot is huge and is rarely ever full. Now, because of this, my family members and friends do not feel comfortable coming to my apartment complex in fear their car will receive a warning sticker, or get towed.\n\nThe buildings (Manor and Terrace) are incredibly old and falling apart. The pipes are in pretty bad shape and there always seems to be something wrong. As I have said above, there is constant maintenance, so when they need to enter the apartments as much as they have been, I feel as though it becomes an invasion of privacy. In one instance there was a notice on the door saying they needed everyone to move the furniture away from the heaters so they could turn the heat on. So, I moved all the furniture out of the way and they never came in to the apartment. I called the office staff and all they said to me was \"yeah we didn't get to it, not sure when we will.\" It was already November here in Washington and that will make any room without heat almost unbearable.\n\nIf you want to feel at home, do not home here. I will never recommend this complex to anyone.",
        "ownerResponse": null
      },
      {
        "author": "Honestabe N.",
        "rating": 2,
        "review": "This place likes to try to come off as a small company, but it could not be farther from the truth, if you are one day late they give u 3 days to pay or vacate. I can understand that in some situations, but there has also been time when I prepaid rent months in advance so you think I would get a smidge of leeway. The maintenance people are nice, but I am not a fan of how this place is run (it doesn't help that every time I need to talk to the manage they are out during business hours), if this continues I will be looking for a new place when my lease ends, and I know I am not the only person here that is thinking that way.\nThis place isn't all bad, rent is reasonable, close to WWU, and downtown, and while I am not a fan of their policies the management is a little friendly.",
        "ownerResponse": null
      },
      {
        "author": "Jennifer S.",
        "rating": 1,
        "review": "South Hill Apartments treated me and my roommate with disrespect in regard to health hazards, privacy, simple maintenance requests, and human decency over the year I lived there. We moved in July 2016 and stayed for the one year lease. I chose to move at the end of the year and my roommate took over the lease for one month. He then was given an unreasonable termination of housing. To begin, we complained about bad maintenance and mismanagement using every acceptable avenue and request. I never belligerently complained or harassed the on-site personnel but they gave me a wide berth the second I began to note odd things. First, it was an infestation of ants that then continued off and on for over six months.  Then, it was questions about seemingly unending maintenance in an adjacent unit, so loud it was distrusting our ability to work, sleep, and study. If you want a legal explanation, feel free to reach out to me, because I have a long list of recorded problems. But on a personal level, I never felt comfortable at South Hill. Once, I walked out of the bathroom to maintenance staff standing in the living room, not caring that I was given no notice. After I complained, the head of maintenance, Jeff, would suddenly glare and mumble when he saw me. Once, in the laundry room, he side-eyed me while talking to another tenant about football and how some people annoy the hell out of him and then he switched the subject to his guns that he owns. (Note the moment he looked at me). It was just weird. The two on-site managers were ignorant of their rights as middlemen and help for tenants, at best, but that might be giving them too much credit. As often as we had to wait for exterminators, or scream to order lunch over the sound of a jackhammer, or tip toe through piles of dead ants, it's insulting that we were shrugged off and treated like children. They have condemned our unit, which is the reason given to my roommate for terminating his tenancy. \"The problems you cannot live with will not change and this unit is not fit to inhabit, so you have until the end of the month.\" If you rent unit 107, we paid $895/month for that place and it is not considered fit for human habitation, so be sure to ask if they really remedied the place before you move in and adopt our issues. If you expect respect, don't live here. If you expect basic human decency, apply elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 16,
  "adjusted_average_rating": 2.88,
  "summary": {
    "text": "<section><h2>Good</h2><p>Many residents of South Hill Apartments have enjoyed their stay, lauding the complex for its welcoming atmosphere and scenic location. Residents appreciated the responsive staff and the sense of community fostered within the apartment complex. Some user reviews highlighted the pleasant interactions with the employees, describing the property management as friendly and attentive. The sentiments were echoed by tenants who found the living experience in South Hill Apartments to be among the best they’ve had, with the location offering easy commutes and a beautiful neighborhood to call home.</p><p>Several tenants have had positive experiences with the maintenance team, noting that issues are addressed promptly, often within a day of reporting. The maintenance crew was appreciated for their friendliness, which helped to create an overall satisfactory living environment. Tenants also expressed satisfaction with the views and the vibe of the neighborhood, suggesting that South Hill Apartments provides a combination of affordability, utility inclusion, and a friendly community that many find appealing.</p></section><section><h2>Great</h2><p>Residents have celebrated the views from the apartments, with some describing them as spectacular, contributing to the charm of living at South Hill Apartments. This factor was often highlighted as a standout feature that enhanced the residents' overall experience. Tenants have also been impressed by the property management's long tenure and dedication to accommodating requests, and these aspects of service have been cited as factors that make South Hill Apartments stand out in comparison to other local options.</p><p>The amenities and apartment features, such as hardwood floors, have been applauded by the residents. Positive experiences with the property managers, who have been described as going above and beyond in their roles, have fostered an environment where tenants feel taken care of. The combination of skilled management, well-maintained properties, and attention to the need for updates, like the plan to replace single-pane windows, demonstrates the commitment of South Hill Apartments to creating a desirable living space for its tenants.</p></section><section><h2>Bad</h2><p>Despite the positive aspects, certain residents have faced issues during their tenancy. Some user reviews reported frequent and inconvenient water shut-offs due to plumbing problems in the older building. Moreover, these interruptions often arrived with minimal notice, causing significant inconvenience. Additionally, the quality of the water was a concern for some tenants, with reports of discoloration following service interruptions. The heating system also garnered criticism, as residents had no control over its operation and experienced difficulties with both temperature regulation and noise from the pipes.</p><p>The process of moving out was another pain point highlighted in the user reviews, where tenants faced stringent move-out notice requirements and encountered unexpected financial burdens due to pro-rated rent charges. Challenges with parking space availability and towing policies also contributed to frustration, leading to discomfort and dissatisfaction for some residents. These aspects of property management could certainly benefit from review and improvement to better meet tenant needs and expectations.</p></section><section><h2>Ugly</h2><p>Some user reviews detailed deeply troubling experiences, describing scenarios where maintenance and construction were handled unprofessionally, leading to safety concerns and a lack of privacy. Residents recounted instances of unscheduled entry into their apartments by maintenance staff and encounters with disturbing noise levels due to adjacent construction work, which lasted for months and significantly disrupted their home comfort and peace. These experiences have unfortunately tarnished the living experience for some, casting a shadow on the professionalism expected of property management companies.</p><p>The complaints have extended to mention health hazards such as mold and ant infestations that were not promptly or effectively addressed, contributing to an environment that felt unsafe and neglectful. The communication mishaps and perceived disrespect from supporting personnel, along with aggressive rent policies described in reviews, added to the gravity of dissatisfaction, leading some tenants to express that they felt undervalued and mistreated. These serious concerns signal an urgent need for South Hill Apartments to reassess their property management practices and strive for a more respectful, tenant-centric approach.</p></section>"
  },
  "timestamp": "September 7 2024"
}