{
  "name": "Spring Creek Apartments",
  "slug": "spring-creek-apartments",
  "company_type": "property",
  "address": "196 E Kellogg Rd, Bellingham, WA 98226",
  "review_count": 11,
  "average_rating": 3.55,
  "reviews": {
    "google_reviews": [
      {
        "author": "Storrie Morrow",
        "rating": 5.0,
        "review": "My partner and I have lived here for almost 2 years now, and I couldn't have imagined a better place for us to land. The complex has a lot of amenities. I love the sense of community I've felt here. My neighbors and the staff are so welcoming and quick to fix any issues that have come up. And the location in Bellingham is very convenient.",
        "ownerResponse": null
      },
      {
        "author": "Luke Rose",
        "rating": 5.0,
        "review": "Latisha and her staff were absolutely wonderful the year I lived here. They have strict rules in place which Makes for a wonderful experience both inside and outside of the apartments. They were very attentive to any fixing needs, usually fixing appliances and such within the hour of me calling them. The recently remodeled apartments are absolutely beautiful inside. I would highly Recommend them to anyone looking for a quiet, nicely kept, and well run apartment complex.",
        "ownerResponse": null
      },
      {
        "author": "John Currier",
        "rating": 5.0,
        "review": "I lived here for 5 years after I got divorced.  It was a great home.  The staff was always wonderful to deal with, and 7 years later they're all still there.  The recent remodel looks wonderful and they make a genuine effort to make everyone feel that this is their home.  The opportunity for a large garden is rare for an apartment, and the grounds are amazing.  Walking trails, an old growth apple orchard, etc.",
        "ownerResponse": null
      },
      {
        "author": "Kate Schultehenrich",
        "rating": 1.0,
        "review": "My partner, brother, and I called this complex to gather more information for a 2 bed/1 bath unit as we are planning to move to Washington in the next few months. We were in the process of being put on the wait list when they asked \"Will it be a family moving in?\" When we explained it would be us three she immediately told us that they wouldn't be able to accept us. We were confused because my partner and I have been living in other apartment units in California together for the past three years and have had no issues regarding us not being a hetero-normative married couple. We further asked why that was an issue and she explained that they've had problems with people breaking leases that made it difficult for the property management. We were trying to explain how discriminatory this sounded while explaining our situation and she said, \"Well this isn't the right place for you then\" and hung up. I have never had an experience quite as homophobic as this. If possible to give a 0 star I would.",
        "ownerResponse": null
      },
      {
        "author": "Ai Leen",
        "rating": 1.0,
        "review": "The community is okay, amenities are average BUT the manager is RUDE & OBNOXIOUS! She is very condescending, arrogant & really really rude. Walls are thin so be prepared to hear your neighbor snore & other things that happens at night that should be private between couples.",
        "ownerResponse": null
      },
      {
        "author": "Dr Brenda Kotewa",
        "rating": 5.0,
        "review": "The staff here is responsive, friendly, and compassionate. They consider their renters part of their family and plan events accordingly. No discrimination here based on ability, ethnicity, religious beliefs, or gender diversity. Been here five years and no plans to move from this awesome location.",
        "ownerResponse": null
      },
      {
        "author": "Ellie R.",
        "rating": 1.0,
        "review": "The apartment itself is cheaply made and the walls are so thin so you can hear your neighbors even if they are having a normal conversation. The manager and maintenance team are great, though.",
        "ownerResponse": null
      },
      {
        "author": "Mia C",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joe Chavira",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Deanna T.",
        "rating": 5,
        "review": "I've only been here a week...I am overwhelmed with the beauty of the interior of my apartment as well as the elegance of the newly remodeled  exterior. The management team is phenomenal! I feel truly fortunate.",
        "ownerResponse": null
      },
      {
        "author": "Kaitlyn S.",
        "rating": 1,
        "review": "My partner, brother, and I called this complex to gather more information for a 2 bed/1 bath unit as we are planning to move to Washington in the next few months. We were in the process of being put on the wait list when they asked \"Will it be a family moving in?\" When we explained it would be us three she immediately told us that they wouldn't be able to accept us. We were confused because my partner and I have been living in other apartment units in California together for the past three years and have had no issues regarding us not being a hetero-normative married couple. We further asked why that was an issue and she explained that they've had problems with people breaking leases that made it difficult for the property management. We were trying to explain how discriminatory this sounded while explaining our situation and she said, \"Well this isn't the right place for you then\" and hung up. I have never had an experience quite as homophobic as this. If possible to give a 0 star I would.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 9,
  "adjusted_average_rating": 3.22,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is generated by ChatGPT and is only intended to be a tool to help individuals find a property management company or rental property. The summary below reflects a collection of user reviews without revealing any personal or identifiable information. The intent of this article is to provide a balanced view of Spring Creek Apartments by summarizing the various experiences shared in user reviews.</p>  </section>  <section>    <h2>Good</h2>    <p>Spring Creek Apartments boasts numerous positive testimonials from residents who have appreciated the community and the management staff. Several residents have highlighted the complex's amenities and the welcoming sense of community that pervades the atmosphere. The management staff has been described as approachable, which contributes significantly to the enjoyable living experience of many tenants. For some reviewers, this has been a perfect landing place post significant life events such as divorce.</p>    <p>The convenience of the location in Bellingham has been singled out, with many appreciating the accessibility to local services and the overall lifestyle offered by the area. The complex's adherence to rules and the quick response of the maintenance team have been lauded, with instances cited where repair needs, including appliance malfunctions, were attended to with impressive promptness, often within an hour of reporting.</p>  </section>  <section>    <h2>Great</h2>    <p>Residents have expressed their contentment with the recent remodels, which have added a touch of modernity and elegance to the apartments and the exterior of the complex. Positive reviews frequently mention the responsive and friendly nature of the property's staff, indicating an environment that is both welcoming and attentive to renters' needs. The property has strived to create a non-discriminatory environment, acknowledging and appreciating diversity among its community members.</p>    <p>Additionally, the property offers unique amenities that are uncommon for apartment living, such as the opportunity to maintain a large garden. The availability of walking trails and an old-growth apple orchard provides a serene and aesthetically pleasing living environment, which many tenants find delightful. Such features have encouraged long-term residency and fostered a sense of pride and belonging among the renters.</p>  </section>  <section>    <h2>Bad</h2>    <p>However, not all residents have had a favorable experience at Spring Creek Apartments. One recurring complaint pertains to the alleged thinness of the walls, which allows sound to travel between units easily. This has affected the privacy and comfort of some tenants, as even normal conversations can be overheard. Despite the maintenance team being commended, the materials and construction quality of the apartments themselves have been called into question by some reviewers, with the term 'cheaply made' surfacing occasionally.</p>    <p>Furthermore, some interactions with the management staff have been described as less than satisfactory. Reports of rude and obnoxious behavior by the manager have surfaced in user reviews, creating an uncomfortable situation for those affected. These issues, particularly related to managers' attitudes and communication, introduce friction and occasional dissatisfaction among current and prospective residents.</p>  </section>  <section>    <h2>Ugly</h2>    <p>The most pressing concerns come from allegations of discriminatory practices by the apartment's management, with at least one review detailing an account that suggests a bias against non-traditional family setups. This particular reviewer expressed disappointment and frustration after an inquiry into renting an apartment seemingly led to a refusal based on the composition of their moving party, which they perceived as an act of discrimination.</oop>    <p>This sentiment was echoed by another user who faced a similar situation, leading to feelings of being unwelcome and judgments made about their lifestyle. Such experiences can tarnish the reputation of the property management company, suggesting an area that requires immediate attention and rectification. As the reviews on this topic have been particularly forceful, prospective tenants may give considerable weight to these testimonies when making their rental decisions.</p>  </section></article>"
}