{
  "name": "Stateside",
  "slug": "stateside",
  "company_type": "Property",
  "address": "929 N State St Bellingham, WA 98225",
  "review_count": 21,
  "average_rating": 2.24,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Abbi M.",
        "rating": 2,
        "review": "I don't wanna make a long review so here's a bullet list somewhat in order of worst to least worst parts of my experience here: \n- SO HOT. no ac with floor to ceiling windows. ac in the hallways tho???\n- parking is SO expensive. for what? i thought this was student housing \n- bad experiences w/ the ppl I have talked to on the phone \n- terribly built - random gaps in the cupboards where cats heads can get stuck. also, random paint splatters all over the floor. not that big of a deal but so annoying \n- i lived in a 4 bedroom, and one of them is wayyyyy bigger than the other three (almost 3x) and this was not advertised when we toured/signed lease. the person doesn't pay more rent \n- i lived in the smaller building, at least one washer/dryer was out of order almost always \n- stove and microwave suckkkkk\ndon't get me wrong, this place is beautiful and i was super grateful to be able to live there, but these are the things that gave me difficulties and think that stateside could improve! i would rather my expensive rent go to ac so my pets and I aren't roasting, rather than activities that I can't even attend due to my school or work schedule",
        "owner_response": {
          "text": "Than you for your evaluation and ultimate appreciation of the community, Abbi. We do our best to help residents find cooling options as we're not built with central A/C, and we apologize this was a breaking point for you. Parking in downtown is very expensive at any complex accommodating a garage, and we do what we can to keep it competitive while also bearing in mind student budgets. Your note about the room sizes will definitely be taken into account for our team, as well as addressing phone call courtesy. We'd also be happy to help repair any downed appliance if notified. If there's anything else you'd like to share with our team, we're always available to you. Thanks again, Abbi."
        }
      },
      {
        "author": "Dima B.",
        "rating": 1,
        "review": "evil place. you will only like your apartment if you get the bay view otherwise you will be looking at a parking garage. management hires only personality hires that are bad at managing basic apartment building issues. it's a great location if you can afford a premium price for mid apartment that has the bare minimum to call it an apartment, it's a glorified dorm room with a shared living room and kitchen. they will try to make you pay for anything. they tried charged us 170$ per shitty chair that we were never given. the last year has been a little better, still not happy with this place.",
        "owner_response": {
          "text": "We are truly sorry that this has been your experience at Stateside, Dima. We don't quite know if you're expecting to have a conversation after this, but would be happy to review particulars of your experience in-office if it meant we could find a path forward together. We hope to talk with you soon."
        }
      },
      {
        "author": "Wren G.",
        "rating": 2,
        "review": "The employees were very friendly and the common areas were well-maintained. The bedrooms are very small, but there is a lot of storage space throughout the apartments. The windows only open about 6 inches from the bottom and there is no ventilation. It was unlivable in the summer and I had to couch surf because it was consistently at 95 degrees inside. There was also horrible chemical smells from high-VOC building materials. \n\nThe offsite parking is far away, expensive, and dangerous. I was put in quite a few bad situations while parking there, and my car was vandalized...twice. \n\nUpon moving out I spent days cleaning and left the apartment spotless.  Days later they sent everyone I know who was moving out a threatening email demanding at least $200. They managed to swindle over $1000 for carpet cleaning and a little repainting from me and my roommates. However, carpet cleaning is a move-in fee!",
        "owner_response": {
          "text": "Thank you so much for providing us with your feedback about living at Stateside, Wren. When residents move out, we have to ensure that apartments are given to the next resident in a condition theyre comfortable moving into. This is often a higher level of cleanliness than the apartments are left to us in, and we saw this primarily with paint and carpet cleaning this turn. Photos and final account statement insight were emailed to you in October related to your concerns about the charges, but if you need to discuss further we are happy to do so over the phone. Stateside does not have any move-in fees that would include any kind of cleaning, so unsure as to what you're referencing there. We have not heard any complaints about chemical smells from the building materials, so please clarify where this odor was represented most if you could. Our off-site parking is managed by the City of Bellingham and they provide 24/7 security and monitoring. Any concerns or circumstances involved with that amenity should be properly reported so that the proper authorities can conduct an investigation. As this merely serves as a review response, we do hope that you understand we're trying to communicate effectively about the elements of your review, though would love for any further discourse to occur over the phone or in-office if the opportunity allows. Thank you again for your time, Wren."
        }
      },
      {
        "author": "Maxwell S.",
        "rating": 1,
        "review": "I (tried) living here but quickly found it to be 80% a total money scheme directed at pet owners and students / 20% an actual space to rent equitably. \n\nThis place is largely geared towards a demographic of people who haven't rented before and simply do not know any better in terms of how the process gives and takes; it's an exchange between tenant and landlord.\n\nIn the case with Stateside, the narrative handed down from day 1 is that \"we are your dystopian overlords until your lease is up.\" \n\nI moved there because it was the only dog friendly, affordable option in Bellingham, sight unseen from NY because I wanted to start a new life there. Everything seemed nice and the staff seemed willing to help and communicate well throughout the whole process...so long as the concerns didn't in any way actually translate to addressing a real issue. That's because the people running the show here are under qualified, underpaid, and overworked, in conjunction with a business model that slightly resembles a pyramid scheme.\n\nThings seemed fine until a sprinkler system busted in the neighboring apartment, flooding the whole hallway at 3am and evacuating the building. According to a press release emailed to the residents, it was because a student had placed lights near the sprinkler head but upon asked my neighbor about it who lived in the same apartment, I was informed that there were actually no lights present on her ceiling and that she was receiving some form of compensation for keeping it on the hush. IE THEY CHEAPED OUT ON THE FIRE SYSTEM CONSTRUCTION AND THEN BLAMED A STUDENT SCAPEGOAT WHEN IT FAILED\n\nI come home from work the next day, no communication, no warning that my apartment was going to be entered, to 150 decibel air fans and dehumidifiers strewn throughout the place (6 total) and took them out. \n\nYou can't sign the lease without them having the explicit right to relocate you at any time, and for me, after I took the fans out, they threatened me with just that if I didn't just be a good little boy and capitulate to terrible landlord practices that make the idea of having a piece of mind obsolete in this scenario. \n\nTHESE PEOPLE ARE NOT LANDLORDS, THEY ARE DYSTOPIAN ALGORITHMS TRYING TO VACUUM YOUR MONEY.\n\nI left 6 months ago because I couldn't get a response to replace my door handle that my dog had figured out how to open when I was at work, making the apartment no long feasible since my roommates were uninterested in allowing him to roam the common area or properly storing trash so he can't get to it. The apartment was no longer feasibly dog friendly at that point. \n\nA few days ago I got a bill from a collections agency for the rest of the sum of rent for AFTER they wouldn't address my dog's concerns! 7k\n\nThis was after PLEADING with the manager to let me out of my lease because it was completely shady.\n\nI urge anybody considering this place as a living option to keep looking in your search and to try to find the least built up organization possible to rent from. \n\nUnscrupulous, predatory, business model.",
        "owner_response": {
          "text": "Maxwell, unfortunately, due to vacating your apartment before the lease was over, we had no other choice but to send your account to collections as required by Washington state law. As you know, we reached out a number of times to discuss matters, including the door handle issue, but you left before it could be addressed in a timely manner. Regarding the fire sprinkler incident, this was due to a plant hanging from it, and to accommodate residents affected by the minor flooding, not only did our maintenance team act swiftly, we also provided gifts cards for the inconvenience, of which you received. If you would like to discuss this further, our management team is happy to provide whatever details you need."
        }
      },
      {
        "author": "Kiersten C.",
        "rating": 1,
        "review": "Stateside overcharges college students. parking went from less than $100/mo for the first year of leases to $350/month for the upcoming year. I live in a 4 bedroom and the rent will increase to $1000/mo after I leave. Absolute trash. The furniture is cheap, the online rent pay has a $20 charge (which is why i use cashier's checks). \n\nThe most frustrating of all is Stateside does raffles, giveaways, \"workshops\" and events for residents that NOBODY ASKED FOR. This is why they charge so much in rent, to give a handful of residents a smoothie or a plant every single month. I'm one of the many residents who would rather be charged less in rent and just live in my own space and not get bothered by stupid raffles every month. No, I don't give two shits about a \"pool party\" for dogs or a coffee bar where the machine craps out every week. Stop spending our rent money that way you unprofessional greedy idiots !",
        "owner_response": {
          "text": "Kiersten - thank you for your review and evaluating your experience as a Stateside resident. We are truly sorry that the combined elements mentioned in your review have resulted in an overall negative sentiment, especially in regards to pricing fluctuations and events onsite. As a downtown Bellingham property, we are very limited to our currently sold-out parking spaces as we only have 90 spaces available in an area where, as you know, parking is extremely sparse. The events we offer have been well-received by most, as it's our effort to help build community within the walls we all inhabit, but we'd love more feedback from you or others on how we can best improve them to match your needs or better influence your lifestyle. We can also advise a way for you to avoid the larger charging fee for online payments moving forward. We know this only serves as a response online, so if we could, let's talk this week in-office about your review and any other components maybe unmentioned. Thank you again, Kiersten."
        }
      },
      {
        "author": "Dylan L.",
        "rating": 2,
        "review": "Loved the maintenance crew, but every day there's a new issue with how they're gonna try and get your money from you, with the overpriced rent, pet rent, the overpriced onsite and offsite parking, etc. The only thing cheap is the build quality.",
        "owner_response": {
          "text": "Dylan - appreciate your insight about Stateside as a resident here. It goes without saying we certainly are also very thankful for the maintenance crew comment, as they're essential to the operations here. We do regret that our operations aside from that have made your experience feel negative, primarily in the financial sense. If you'd like, we would greatly appreciate the chance to discuss any matters concerning fees/parking with you to further elaborate on pricing, structure and kinda why things are the way they are. If that conversation intrigues you, stop by the office and mention your Yelp review to our GM Laura and we can take things from there. Thanks again, Dylan!"
        }
      },
      {
        "author": "Luke L.",
        "rating": 1,
        "review": "Construction has been going on right below my unit for MONTHS. It is so loud we often have to leave our apartment. Other residents have complained and nothing has been done. Losing sleep almost daily now becasue the walls here are so thin it sounds like we are in a battle field as early as 7am. The managers have done nothing about this issue and said it would only last weeks. It's been months, DO NOT MOVE HERE.",
        "owner_response": null
      },
      {
        "author": "Maria S. B.",
        "rating": 1,
        "review": "Beware of off-site parking! \nMy daughter (Junior at WWU) signed a lease in May, 2021 for the 2021-2022 school year. At that time, the apartment building was not yet completely built and there were very few specifics available from Stateside (didn't know who roommates would be, etc.). She added an off-site parking space to her lease not knowing anything about it - but assuming it would be a reasonable distance away within a couple of blocks and it would be easier than having to constantly find street parking. \nThey did not provide complete information about the parking space (or cancellation policy) until move-in weekend in September. At that time she was told it was in an underground parking garage downtown (.6 miles away - and in the complete opposite direction of campus) and that she would have to move her car every 3 days. She does not feel safe in the parking garage when she's by herself - especially in the dark. \nShe immediately asked to cancel the space - and Stateside would not let her unless she can find another apartment resident to take the space over.  None of this information was spelled out in the lease at all, and once they had specific information they did not give her the option to opt out of that part of the contract. \nVery deceptive and very poor service especially for students who are likely signing a lease for the first time. \nMost other aspects of the apartment have gone well, but this is not unacceptible.",
        "owner_response": null
      },
      {
        "author": "Profound H.",
        "rating": 5,
        "review": "Nothing but good things to say about Stateside. Super close to WWU and downtown. Wonderful, accommodating staff + maintenance team. It has been a joy to live here- highly recommend.",
        "owner_response": null
      },
      {
        "author": "Connor K.",
        "rating": 1,
        "review": "Stateside apartments has been extremely frustrating. Not really sure where to start. First of all, they have been terrible as far as the process of renewing goes. They have repeatedly threatened that our room isn't going to be available for the next leasing cycle (which is 6 months away) if we don't renew ASAP. Many of us are unsure about whether to renew, and these threats over email about taking our room away from us a half a year from the next lease don't help. They have been extremely shady overall about this stuff, claiming that they told us that our rent would go up, and then in turn raising our rent for the next leasing cycle over $100 a month, even though they never told us specifically that this rate would increase, and never contacted our guarantor about it. I am expected to pay $200 more than my roommate, for a smaller room in the same apartment, just because stateside feels like raising our rate because I haven't renewed yet, when again, the next lease isn't for MONTHS, and we had been planning on renewing. Stateside has also been awful about maintenance. They have now postponed their maintenance scheduled dates 3 or 4 times, on late notice, so we've been waiting around for them to do their inspections for weeks now, with little communication on when it'll actually happen. Stateside has also sent other threatening emails about fining their tenants for silly things that are not included in the leasing agreement. They have said that noise, not wearing masks, skateboarding inside and other small things will warrant a $100 fine from them, which is ridiculous. Overall a very vague, shady group that doesn't care about their tenants needs or opinions. If you're going to rent at stateside, keep all of the above in mind, and expect it to happen to you.",
        "owner_response": null
      },
      {
        "author": "Jillian S.",
        "rating": 1,
        "review": "would rate lower if i could. they had issues clearing my check (they kept saying my bank couldn't find my account). i went to my bank twice in one day because i wanted to get it in writing that personal checks printed there are always linked to an account. couldn't get anything in writing because that branch couldn't speak for the entirety of chase, but they helped me try to cancel checks already written. stateside wouldn't give me back my check that didn't go through and charged me $90 for it not going through and for it being \"late\". i put my check well before the 1st of the month and they didn't try clearing it until then and then didn't notify me that it didn't go through on the day it was considered late. the next day, they tried depositing my check again. they will not give it back and kept saying the person who deals with checks is out sick. i'm reporting them to the better business bureau and the irs.",
        "owner_response": {
          "text": "Jillian, we are so sorry for the frustrations you've encountered with getting your rent paid. We understand that you spoke with our GM Laura yesterday about this situation and the late fee reversal, and we will update you at any point if the check doesn't clear this time around. Again, we do not wish this situation upon any resident and hope that this will be the last time we have to deal with this together."
        }
      }
    ],
    "google_reviews": [
      {
        "author": "Kenyon Woodley",
        "rating": 4,
        "review": "Ive been living at Stateside for 2 years, and overall, it's been a great experience. The location is super convenient, especially for students, with easy access to campus and local amenities. The building is well-maintained, and the staff has always been friendly and responsive to any concerns or maintenance requests.\n\nThe amenities, like the gym and study lounges, are a nice touch, making it easy to balance work and relaxation. The apartments themselves are modern and spacious, with plenty of natural light, and Ive found the noise level to be pretty manageable, even in a busy student area. Fully-furnished apartments are quite nice as well. The only minus was the apartment was not fully cleaned upon move-in, so that took a bit of effort to get it really nice. And definitely recommend getting a 2 in.+ mattress topper as well, it is a lifesaver for a comfy bed.\n\nIf you're looking for a solid place to stay thats close to campus and has everything you need, Id definitely recommend Stateside!",
        "owner_response": {
          "text": "Your positive feedback on your experience at Stateside is greatly appreciated, Kenyon - thank you so much for sharing your thoughts! It's wonderful to know that you've found our staff friendly and responsive, and that you're making good use of our amenities. We're glad you appreciate the modern, spacious apartments and the fully-furnished options, and want to apologize for the cleanliness issue you encountered upon move-in as we work to improve our move-in preparation process. Thank you again for your recommendation and for choosing Stateside as your home!"
        }
      },
      {
        "author": "Annie Tran",
        "rating": 5,
        "review": "Ive lived here for three years and had a great experience. The staff is friendly and maintenance is always fast and efficient. The apartment has nice amenities and fun monthly events. As long as you keep the place clean and tidy, there are no additional move-out charges. The only downside is that parking is a bit expensive, but its a safe parking garage. At least I havent had a problem parking there throughout my lease.",
        "owner_response": {
          "text": "Thank you for being a loyal resident for the past three years Annie and for sharing your great experience! We're glad you've enjoyed the amenities, monthly events, and fast maintenance service. We truly appreciate your feedback and look forward to continuing to provide you with 5 star service!"
        }
      },
      {
        "author": "Karis Felton",
        "rating": 1,
        "review": "Feels very corporate and pushy when it comes to leases. They started pushing renewing leasing in December which is slimy because everyone only just got settled. The longer you wait the more the lease rises. Horrible. The fact that you have to pay a ridiculous amount of money to use the parking garage when there is limited parking on the streets is absurd. They are just sucking people dry because they know peoples parents are paying for their college rooming. Sickening. The washers and dryers didnt work well. Never felt clean or they didnt drain properly so my stuff would be soaking, had to wring it out in the sink. I always had to add extra time to my dry time even after adding additional time to start the load. These loads ranged from big ones to small ones. There is also no wheelchair button on the laundry door which makes it inaccessible to those who need additional assistance or people with a big load. The mini market they put in was just another way to get peoples money which feels disgusting. Then they raised rent for next years people and I have a feeling thats got something to do with it. The quarterly room checks are crazy. This is an apartment, not a dorm. There is no reason that someone should be coming into my apartment without an invitation. No ac makes it really hard to live in during the summer. The building is so new that its stupid there is no ac except in the hallways. The location of the building makes it inconvenient for those that go to WWU. There is no bus that comes to that end of town so its inconvenient to go anywhere.\n\nI do not recommend living here.",
        "owner_response": {
          "text": "Karis, thank you for your perspective and offered insight. We do start renewal season early as the spots tend to fill up rather quickly at Stateside, and we'd like to give those living here the best chance at securing another year with us before opening it up to those who don't yet reside here. Understandably, that decision is not always easy to make so far out and there is nothing wrong with declining the renewal offers. This area as any local will tell you is extremely limited in parking, and we have to be both competitive and fair in our pricing for residents when it comes to what we have available. We do apologize for this inconvenience as we know it can be a hassle. If you're experiencing any issues with the washers/dryers, we can have a vendor look into this but want to follow process there and help you get a clean, dry load on the first time every time. For the micro market: we do not receive any revenue from that and the prices and revenue are set by the vendor. Our closest bus stop is 1 block away -  to campus, the bus stop is 4 blocks away. We can review the routes with you or anyone curious if need be as well. We know this serves as answers to some, but should prompt conversation for others and are happy to do so over the phone, in-office, via email - whatever works best. Thank you again for your time, Karis. "
        }
      },
      {
        "author": "AJ",
        "rating": 1,
        "review": "Elevator not working for months. Charged us over 700 dollars for forgetting to take a small bag out when moved out. We did leave a half inch mark on the wall which we repainted, but they charged us for that saying they needed to repaint the whole apartment. Take pictures before moving in since they charge for damage already existing.",
        "owner_response": {
          "text": "Thank you for your review and perspective, AJ. While many take to Google reviews to discuss their move-out reports, we trust a more thorough conversation can be had through the prior established mediums (in-office, over the phone, email) should you wish to learn more about your move-out charges. Painting over a mark on the wall does require the whole unit to be repainted per your lease agreement. We highly recommend reviewers to heed your last sentence as a part of the move-in process requests all incoming tenants to evaluate, analyze and report on the condition of their unit upon entry. We cannot compare the conditions together without proof of the damage/situation beforehand. We hope if there's any further questions you have that you'll reach out so we can better help both parties understand the charges. Thank you again, AJ."
        }
      },
      {
        "author": "Sophia Leonard",
        "rating": 4,
        "review": "This is my first year living here, although I have known residents for the past 2 years so I am very familiar with the property. Overall, I love living here. The apartment is beautiful and in my opinion, it's the nicest apartment complex in Bellingham that caters to WWU students. It looks very modern and has wonderful furnishings. The amenities are amazing- great gym, huge laundry rooms, kind staff, ect. The only critique I have is that when you first move in you are told that the apartment has been cleaned before you arrive, but when I moved in it was very clear what they meant by cleaning is just sweeping the floors. I had to spend a full day deep cleaning to get the apartment fully cleaned. Besides that, I haven't had an issue since, and have really enjoyed my time here.",
        "owner_response": {
          "text": "Thank you so much for your thoughtful review and kind words about Stateside, Sophia. Were thrilled to hear that youre enjoying your overall experience with us. We do apologize for the cleaning oversight when you moved inthats definitely something well work on improving and if you still need us to assess that with you, happy to do so. If you ever need anything else or have additional feedback, dont hesitate to reach out. We're glad to have you as part of our community!"
        }
      },
      {
        "author": "Oscar Naim",
        "rating": 1,
        "review": "As a parent, I was not satisfied at all with Stateside. They run as a business, with not enough interest on what's most beneficial to our kids. We were charged the wrong amount of money on several occasions, and even though my son vacated his room two months before the end of the lease, we still had to pay for the full 12 months (which was expected). Plus, in the end, there were significant charges made for \"cleaning and repairs\" fees and a terrible customer service (and good luck finding a number to call!). I would highly recommend the university dorms instead, given the terrible experience we had with Stateside.",
        "owner_response": {
          "text": "We appreciate your feedback and perspective, Oscar - it is always important to hear back from the parents about the experience they also have with our community. Our move-out guide was sent out to all residents on 7/31 to ensure folks knew what to expect in terms of how charges and such are allocated, the process of receiving your ledger, formal disputes and the like. Attached to this move-out guide was a phone number to help folks easily communicate with our team. There is always the office line at the signature of every email that comes from a Stateside employee in the event you need it. We did dialogue with you about this circumstance on 9/26 since the ledger had a duplicating error when originally sent, and did not hear back further after confirming with you that the final ledger was distributed. If you did have further concerns, please reply to that thread and we can continue the conversation at that time. Thank you again, Oscar."
        }
      },
      {
        "author": "Kaitlyn Schroeder",
        "rating": 4,
        "review": "For 2 years now for living at Stateside, it has been a great and safe community to be a part of! The accomidations like the food market and accessible gym makes my busy days so much easier, and not to mention how clean everything is! Would recommend to those looking for a lot of accommidations for a reasonable price!",
        "owner_response": {
          "text": "Thank you so much for your kind words, Kaitlyn - stoked to hear that youve loved living at Stateside for the past two years. Its great that the gym, food market, and clean spaces make your busy days easierexactly what we aim for! Were really happy that you feel safe and part of the community here. Thanks again for the recommendation!"
        }
      },
      {
        "author": "Filip",
        "rating": 5,
        "review": "I have lived here for the past 2 months. As a newly enrolled college student, I really enjoy Stateside. The apartments are spacious enough for your needs, with basic amenities already stocked (refrigerator, TV). The communal garbage disposal system is sophisticated, there is a clean, well-maintained gym and laundry room and, if you ever need to purchase small snacks, there's a self checkout store, that's always stocked. I would definitely reccomend Stateside for university students coming to Bellingham. The only qualm I have is its awkward site relative to WWU (although its not that horrible, just a bit of a walk even if you take the bus).",
        "owner_response": {
          "text": "We appreciate your wonderful review Filip! We're glad to hear that you're enjoying your time at Stateside and that our apartments and amenities have exceeded your expectations. Thanks for your recommendation, and if there is anything we can help with in the future, don't hesitate to reach out!"
        }
      },
      {
        "author": "Emily Ashley",
        "rating": 2,
        "review": "I lived here for a year and loved it...HOWEVER...I moved out in June and its now October and they are just now doing their move out walkthroughs and charging me $300+. When I moved in the place was DISGUSTING and I had to spend a full day scrubbing each inch of the place. The bathroom reeked of pee and the kitchen was so so gross with food waste. Now, they are charging me for the toilet being slightly dirty (Mind you it sat for 2 months...) the bathroom fan being dusty (it would get like that after a few weeks) and UNDER the oven being dirty (they literary pulled out the oven drawer which I never used because it was so gross from the previous tennant). They are also charging me for small holes left in the wall, some of which were there when I moved in, and this is after I even asked if I could put nails in the wall and they said yes just dont be excessive about it. Really really disapointed with how they are charging me so much money for things that happen when you wait this long to do walk throughs, especially given the condition of the place when I moved in...because I highly doubt they actually use my money to clean the place.",
        "owner_response": {
          "text": "We value your input and apologize for any inconvenience, Emily. We do see that while your balance has been paid, you are eligible to submit a dispute if you'd still like to do so. Please feel free to reach out to us at (360) 762-3972 to discuss anything further - our GM Lindsay would be happy to assist you!"
        }
      },
      {
        "author": "Nico Lee",
        "rating": 2,
        "review": "Stateside has no AC. This is normal for single-family homes in the PNW, and Im relatively used to it. However, this did not prepare me whatsoever for stateside in summer. Especially on the upper floors, add 10-15 degrees to the heat outside and thats what it will be in your apartment, at least. Most air conditioners are also not comparable with statesides windows, you will need a floor-standing one. Essentially: it gets dangerously hot here in summer, i really cant recommend this building to anyone but especially not those with any chronic health concerns like me. I could not stay here during the hottest days of the year without endangering my health, and in my opinion building a new place like this with no temp control while summers get hotter every year was a mistake. I also know of many other residents who have couch surfed or gone home for summers only because of the heat. its basically unlivable.",
        "owner_response": {
          "text": "Thank you for your insight, Nico. We definitely can experience some hotter summers in the PNW, and would be happy to share some in-unit A/C models that would fit your space best since some of our staff has also purchased them for their own occupancy. If there is ever a threat heath-wise based on the heat, we would be happy to discuss this with you as we're not aware of any situation like that until it's brought to our attention. We do appreciate your feedback and perspective on this matter, and invite you to continue this chat with us this weekend or next week if you'd like. "
        }
      }
    ]
  },
  "adjusted_review_count": 21,
  "adjusted_average_rating": 2.24,
  "distribution": {
    "1": 10,
    "2": 5,
    "3": 0,
    "4": 3,
    "5": 3
  },
  "summary": {
    "created_timestamp": 1739205605,
    "text": "<section id=\"good\"><h2>Good</h2><p>Stateside has earned some positive remarks from its residents, particularly for its convenient location and well-maintained amenities. One user highlighted that the apartment's proximity to the university offers significant convenience for students, with local amenities within easy access. Moreover, users have appreciated the modern and spacious design of the apartments, with one mentioning how the abundant natural light enhances their living experience. The fully-furnished apartments are noted as a favorable aspect as well, particularly for those who are new to living away from home for the first time.</p><p>Another bright spot in user feedback is the positive interactions with the maintenance team. Multiple users have pointed out that the maintenance staff is both friendly and efficient in addressing concerns. A resident mentioned that the amenities, such as the gym and study lounges, provide a balanced living environment where work and relaxation can coexist beautifully, thus enhancing their overall experience. The management’s efforts to address minor issues swiftly, like the cleanliness upon move-in, have been acknowledged in the feedback loop.</p></section><section id=\"great\"><h2>Great</h2><p>In terms of outstanding experiences, some users have cherished their time at Stateside, particularly praising the management and community-centric efforts. A resident expressed great satisfaction with the friendly and accommodating staff, noting that their proactive approach and responsiveness have contributed greatly to their overall contentment. Positive user reviews also appreciate the vibrant community vibe fostered through various events and activities organized by the management. These initiatives not only make living enjoyable but have established a sense of community among the residents.</p><p>Another user was thrilled with the quality of amenities offered, such as the gym and the safe parking facilities. They emphasized that the Safety of their vehicle in the designated parking areas was a huge relief. Furthermore, the promptness of the staff in addressing maintenance requests and cleanliness in shared spaces like laundry rooms and common areas were highly applauded. The atmosphere within the complex is perceived as clean and safe, contributing significantly to residents' positive living experiences.</p></section><section id=\"bad\"><h2>Bad</h2><p>Stateside, however, has also faced criticism in certain areas, notably regarding issues like high rent and unexpected charges. Several users cited frustration over being charged excessively for everyday amenities like parking, which reached up to $350 monthly—a steep increase from previous rates. Other users pointed out that while the apartments are beautiful, the building issues such as thin walls and inadequate ventilation have been problematic, particularly during the hotter months without AC.</p><p>Difficulty with communication and cumbersome management practices have also been a source of discontent for several residents. Some users reported feeling overwhelmed by the pressure to renew leases with substantial price hikes without adequate notice or clarity. Additionally, instances where users were charged hefty fees for minor damages or uncleanliness that pre-existed their tenancy were highlighted, casting doubt on the fairness and transparency of these charges.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>In the more severe user reviews, there are accounts of mismanagement and unsettling experiences that have deeply affected certain tenants' views of Stateside. One former resident alleged that the management’s primary focus seemed to be monetary, often imposing unreasonable fines for what they deemed were trivial infractions. The lack of proper handling of maintenance issues, particularly elevator malfunctions that were only temporarily addressed, added to the residents’ frustration.</p><p>Reports of exploitation through unexpected bills and unauthorized entries into apartments have also surfaced, leading to significant mistrust. Residents who felt their complaints were not adequately addressed, or those who felt financially tuned were particularly disillusioned, suggesting a culture of poor communication and customer service. These experiences, unfortunately, overshadow the potential benefits and have resulted in stern warnings from past residents to potential newcomers about the management practices at Stateside.</p></section>"
  }
}