{
  "name": "Stoneway Apartments",
  "slug": "stoneway-apartments",
  "company_type": "Property",
  "address": "245 32nd St, Bellingham, WA 98225",
  "review_count": 2,
  "average_rating": 2.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Kenya Kay",
        "rating": 3,
        "review": "Great location except for the mail delivery issue however there's luckily a ups store right next to it so we just have a po box. Some of the apartments lack natural lighting and ventilation on the first floor but the 3rd floor is very enjoyable and let's lot of natural light in. Responsive management.",
        "owner_response": null
      },
      {
        "author": "Jimmer Shine",
        "rating": 1,
        "review": "Great location and somewhat safe building. However, no package companies deliver here. It's a secured building with no mail room. Be aware.\nManagement and owners seem to be somewhat concerned about keeping the place comfortable, but turned out to be untrustworthy on multiple occasions. Would steer clear if possible.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 2,
  "adjusted_average_rating": 2.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 1,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739095148,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Stoneway Apartments boast a great location that many users appreciate, particularly for its proximity to local amenities and safety features. Some reviews highlight the third-floor units as particularly enjoyable, benefiting from ample natural light and good ventilation, which improves the living experience in this complex. Additionally, users indicated that the management team is responsive, which can be a positive aspect when needing assistance or support.</p></section><section id=\"great\"><h2>Great</h2><p>Despite mixed reviews overall, the apartments do offer a balance between potential living space and location. Users have pointed out that having a nearby UPS store provides a solution to mail delivery issues, which some tenants deemed problematic due to the lack of a mailroom. This convenience can be a significant factor for individuals seeking a reliable package delivery option while residing at Stoneway Apartments.</p></section><section id=\"bad\"><h2>Bad</h2><pSeveral concerns have been voiced regarding the mail delivery situation, as multiple residents mentioned that package companies do not deliver directly to the complex. This has been frustrating for tenants, especially those reliant on regular deliveries. Furthermore, while management is noted to be responsive, there are question marks around their trustworthiness, as some residents felt their concerns were not fully addressed on multiple occasions.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Some reviews depict a less-than-ideal experience at Stoneway Apartments, particularly highlighting issues with management's reliability. One user expressed serious concerns about management being untrustworthy, indicating a possible pattern of neglect in dealing with tenant issues. Furthermore, the ambiance of the lower floors, which lack natural lighting, could detract from overall tenant satisfaction and comfort, leading to a more negative perception of the property.</p></section>"
  }
}