{
  "name": "Sun-Mark Properties",
  "slug": "sunmark-properties",
  "company_type": "Company",
  "address": "1200 Lakeway Dr # 1, Bellingham, WA 98229",
  "review_count": 8,
  "average_rating": 1.88,
  "reviews": {
    "google_reviews": [
      {
        "author": "Sophia Bentz",
        "rating": 1,
        "review": "Do Not Rent!!! She is Rude & Awful to rent from! I had the displeasure of renting from Azam for years! I really wish I could spread this to everyone & warn more people about how terrible, stressful harassing she is. She raised our rent by $800 with NO warning, suddenly. She harassed us for rent every single month even before the 5th day! She let people come to the house many times with NO notice even after I asked her to not do that. She would harass and name call me. Our end she just complained about how messy the house was even after we emptied and cleaned it for days! I know she will try to charge more than necessary. Her business needs to get SHUT Down! Worst landlord I ever had. So beyond Glad to be OUT of her house!",
        "owner_response": null
      },
      {
        "author": "huggins scott",
        "rating": 1,
        "review": "I rented a property owned by Christopher Hammond, with Sun-Mark Properties as the manager. Azam Nader handled the property. Note that she herself has given the only five-star review here. Renting through Sun-Mark Properties has been a horrible experience. This was an expensive four bedroom house. First of all, she advertised the property as air-conditioned, but the air conditioning did not work, and after I moved in I was told that the landlord had no intention of fixing it. I paid a huge amount in rent, but the master bedroom shower was unusable, repairs were only done slowly and in a shoddy way, the landlord only used the cheapest materials and appliances. The ancient boiler blew, flooding my belongings. And the roof leaked, but the landlord only threw a tarp over it, leaving the leak, with a giant bubble filled with water in the ceiling. The skylight was covered over by the ugly tarp, leaving it dark and gloomy inside. Despite the terrible living conditions and the damage to my belongings, as a final insult the landlord tried to make me pay to power wash his driveway and decks and wash the windows, even though I had not caused any damage, and I had already paid over $1200 to clean, fill picture holes, and paint the interior, and clean the carpets. Azam said I also had to pay for power washing to \"put things in the condition they were in when I moved in,\" but the darkening of the exterior surfaces over the years, and the build-up of dirt on the windows falls under normal wear. I had to resort to filing with the Better Business Bureau and the courts to get my security deposit back. Overall, dealing with Sun-Mark and the landlord Christopher Hammond was like dealing with slumlords and scammers. I am sorry I ever got involved with them and am glad to finally be free of them. Avoid at all costs.",
        "owner_response": null
      },
      {
        "author": "Whitney Eichler",
        "rating": 1,
        "review": "My husband and I called on a house to rent. The first thing she asked was if we had good credit. I have great credit but my husband doesn't due a divorce and custody battle.  As soon as I mentioned that she immediately snubbed us. AlthoughI'm unemployed due to covid, my husband is working.  But she had already lost interest in allowing us to even look at the house.  She was rude and quickly jumped to conclusions.  I wouldn't recommend anyone renting through this office.",
        "owner_response": null
      },
      {
        "author": "Katie Blackwell",
        "rating": 1,
        "review": "Wow. I have to say I'm taken aback. I missed a viewing when I regretfully entered it into my calander wrong. I called back to apologize and reschedule and was shamed by the woman who answered. Completely unnecessary. I'll be taking my business elsewhere. I'm glad she outed herself as a bad potential landlord. Mistakes happen. But she \"Pretty Womaned\" herself out of a big commission. No thank you.",
        "owner_response": null
      },
      {
        "author": "tjseren",
        "rating": 1,
        "review": "My experience was at the lake what com blvd office, NOT the lake way office.....\n\nMy wife and I went into sun-mark properties today to look for a rental house in the sudden valley area. I was absolutely blown away at how rude and judgmental the woman who we talked with was. I am a 28 year old man with dreadlocks. I am hard working, have a REAL job, and have perfect rental history for the past 9 years that i have been renting houses and apartments. The first thing she asked us was wether we were going to \"grow marijuana\". We were both completely taken aback by this and told her that we definitely were not planning on growing any marijuana. She then asked about our jobs and how we would pay for the rental. We told her we had both been traveling for the past year, but had a large amount of money saved, and both have steady jobs in bellingham that we were going back to as soon as we finished the stressful process of finding a new rental to move into. I also informed her that we had a co-signer lined up, at which point she literally scoffed at us and asked \"who would co-sign for YOU???\" I had had enough at that point and told her i felt she was being very judgmental and making assumptions based on our appearance. She claimed they ask everyone these questions. And mind you, this is before we had even been by to look at a property. My wife and I had both had enough and knew there was NO WAY we would EVER rent a property from someone so rude. We walked out and as we were getting in our car, she followed us out the front door to personally insult me by yelling something about my \"ratty hair\". It was absolutely unbelievable. Like i said, i have been renting for nine years, and NEVER been asked any of those questions in such an accusatory way, and have NEVER been treated so poorly by anyone. DO NOT RENT FROM THESE PEOPLE. THEY ARE RUDE, JUDGMENTAL, AND EXTREMELY PREJUDICE. . . . PS: this review wouldn't allow me to give ZERO STARS. They certainly do not deserve even one.",
        "owner_response": null
      },
      {
        "author": "Tc",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Azam Nader",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Barry Zwiers",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 6,
    "2": 0,
    "3": 0,
    "4": 1,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739095150,
    "text": "<section id=\"good\"><h2>Good</h2><p>While Sun-Mark Properties primarily garners negative feedback, a couple of reviews do highlight some positive aspects. One user provided a five-star review, potentially indicating that, under certain circumstances, tenants have had satisfactory experiences. However, the lack of detail in this positive review makes it difficult to paint a comprehensive picture. The limited praise suggests that there might be isolated incidents where tenants feel respected or valued, but these instances seem to be the exception rather than the rule.</p></section><section id=\"great\"><h2>Great</h2><p>In examining the overall user reviews, there is scant evidence supporting an exceptionally positive experience with Sun-Mark Properties. Although one review indicates a high rating, the absence of detailed feedback prevents any exploration of what could be considered a 'great' experience. This lack indicates a consistent trend of dissatisfaction from tenants, overshadowing any potentially great experiences that might have taken place.</p></section><section id=\"bad\"><h2>Bad</h2><p>The majority of user reviews portray a troubling picture of Sun-Mark Properties, indicating severe management issues. Reports of unaddressed maintenance concerns, like non-functional air conditioning and severe leaks, leave many former tenants feeling stranded and frustrated. Additionally, there are complaints about rude behavior from staff, with instances of harassment regarding overdue rent and unprofessional conduct in interactions with potential renters. This behavior not only diminishes tenant satisfaction but also raises concerns about the company's overall professionalism and respect for those engaging their services.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The negative experiences reported by users are strikingly severe, with many describing Sun-Mark Properties as untrustworthy and dismissive. Numerous tenants have claimed issues like unjustified rent hikes, inability to retrieve security deposits, and a general lack of regard for tenant well-being. One user specifically mentioned resorting to filing claims with the Better Business Bureau and courts to recover a security deposit, highlighting the extreme lengths to which individuals have had to go to receive fair treatment. Moreover, some users reported feeling discriminated against and ridiculed by staff, pointing to an unwelcoming atmosphere that could deter future renters.</p></section>"
  }
}