{
  "name": "Sun-Mark Properties",
  "slug": "sunmark-properties",
  "company_type": "Company",
  "address": "1200 Lakeway Dr # 1, Bellingham, WA 98229",
  "review_count": 8,
  "average_rating": 1.88,
  "reviews": {
    "google_reviews": [
      {
        "author": "Sophia Bentz",
        "rating": 1,
        "review": "Do Not Rent!!! She is Rude & Awful to rent from! I had the displeasure of renting from Azam for years! I really wish I could spread this to everyone & warn more people about how terrible, stressful harassing she is. She raised our rent by $800 with NO warning, suddenly. She harassed us for rent every single month even before the 5th day! She let people come to the house many times with NO notice even after I asked her to not do that. She would harass and name call me. Our end she just complained about how messy the house was even after we emptied and cleaned it for days! I know she will try to charge more than necessary. Her business needs to get SHUT Down! Worst landlord I ever had. So beyond Glad to be OUT of her house!",
        "owner_response": null
      },
      {
        "author": "huggins scott",
        "rating": 1,
        "review": "I rented a property owned by Christopher Hammond, with Sun-Mark Properties as the manager. Azam Nader handled the property. Note that she herself has given the only five-star review here. Renting through Sun-Mark Properties has been a horrible experience. This was an expensive four bedroom house. First of all, she advertised the property as air-conditioned, but the air conditioning did not work, and after I moved in I was told that the landlord had no intention of fixing it. I paid a huge amount in rent, but the master bedroom shower was unusable, repairs were only done slowly and in a shoddy way, the landlord only used the cheapest materials and appliances. The ancient boiler blew, flooding my belongings. And the roof leaked, but the landlord only threw a tarp over it, leaving the leak, with a giant bubble filled with water in the ceiling. The skylight was covered over by the ugly tarp, leaving it dark and gloomy inside. Despite the terrible living conditions and the damage to my belongings, as a final insult the landlord tried to make me pay to power wash his driveway and decks and wash the windows, even though I had not caused any damage, and I had already paid over $1200 to clean, fill picture holes, and paint the interior, and clean the carpets. Azam said I also had to pay for power washing to \"put things in the condition they were in when I moved in,\" but the darkening of the exterior surfaces over the years, and the build-up of dirt on the windows falls under normal wear. I had to resort to filing with the Better Business Bureau and the courts to get my security deposit back. Overall, dealing with Sun-Mark and the landlord Christopher Hammond was like dealing with slumlords and scammers. I am sorry I ever got involved with them and am glad to finally be free of them. Avoid at all costs.",
        "owner_response": null
      },
      {
        "author": "Whitney Eichler",
        "rating": 1,
        "review": "My husband and I called on a house to rent. The first thing she asked was if we had good credit. I have great credit but my husband doesn't due a divorce and custody battle.  As soon as I mentioned that she immediately snubbed us. AlthoughI'm unemployed due to covid, my husband is working.  But she had already lost interest in allowing us to even look at the house.  She was rude and quickly jumped to conclusions.  I wouldn't recommend anyone renting through this office.",
        "owner_response": null
      },
      {
        "author": "Katie Blackwell",
        "rating": 1,
        "review": "Wow. I have to say I'm taken aback. I missed a viewing when I regretfully entered it into my calander wrong. I called back to apologize and reschedule and was shamed by the woman who answered. Completely unnecessary. I'll be taking my business elsewhere. I'm glad she outed herself as a bad potential landlord. Mistakes happen. But she \"Pretty Womaned\" herself out of a big commission. No thank you.",
        "owner_response": null
      },
      {
        "author": "tjseren",
        "rating": 1,
        "review": "My experience was at the lake what com blvd office, NOT the lake way office.....\n\nMy wife and I went into sun-mark properties today to look for a rental house in the sudden valley area. I was absolutely blown away at how rude and judgmental the woman who we talked with was. I am a 28 year old man with dreadlocks. I am hard working, have a REAL job, and have perfect rental history for the past 9 years that i have been renting houses and apartments. The first thing she asked us was wether we were going to \"grow marijuana\". We were both completely taken aback by this and told her that we definitely were not planning on growing any marijuana. She then asked about our jobs and how we would pay for the rental. We told her we had both been traveling for the past year, but had a large amount of money saved, and both have steady jobs in bellingham that we were going back to as soon as we finished the stressful process of finding a new rental to move into. I also informed her that we had a co-signer lined up, at which point she literally scoffed at us and asked \"who would co-sign for YOU???\" I had had enough at that point and told her i felt she was being very judgmental and making assumptions based on our appearance. She claimed they ask everyone these questions. And mind you, this is before we had even been by to look at a property. My wife and I had both had enough and knew there was NO WAY we would EVER rent a property from someone so rude. We walked out and as we were getting in our car, she followed us out the front door to personally insult me by yelling something about my \"ratty hair\". It was absolutely unbelievable. Like i said, i have been renting for nine years, and NEVER been asked any of those questions in such an accusatory way, and have NEVER been treated so poorly by anyone. DO NOT RENT FROM THESE PEOPLE. THEY ARE RUDE, JUDGMENTAL, AND EXTREMELY PREJUDICE. . . . PS: this review wouldn't allow me to give ZERO STARS. They certainly do not deserve even one.",
        "owner_response": null
      },
      {
        "author": "Tc",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Azam Nader",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Barry Zwiers",
        "rating": 4,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 6,
    "2": 0,
    "3": 0,
    "4": 1,
    "5": 1
  },
  "summary": {
    "created_timestamp": 1739205609,
    "text": "<section id=\"good\"><h2>Good</h2><p>User reviews of Sun-Mark Properties are overwhelmingly critical, leaving little to highlight in a positive light. However, two reviews stand out, though specifics are scant due to the absence of detailed feedback. One positive review, rated four stars, does exist, but without additional information, its benefits remain unclear. To its credit, the mere presence of this review hints that not every client walks away dissatisfied.</p></section><section id=\"great\"><h2>Great</h2><p>In this article, identifying greatness in Sun-Mark Properties' operations proves challenging due to the lack of detailed positive user reviews. A five-star rating was provided by Azam Nader, who is affiliated with the company, but without accompanying details, it's difficult to assess any outstanding qualities the company may possess. As such, truly great experiences with the property management firm are not captured within the reviews available.</p></section><section id=\"bad\"><h2>Bad</h2><p>Many user reviews reflect dissatisfaction with Sun-Mark Properties, often mentioning poor communication and unprofessionalism. For example, one individual felt dismissed by the agent due to presumed stereotypes, despite having a steady financial standing. Instances where maintenance issues were reported but not addressed timely or effectively further marred renters' experiences. Dissatisfaction also stemmed from property conditions not matching advertisements, leading to a sense of deceit.</p><p>Slow and shoddy repairs were a common grievance among tenants, with some citing prolonged exposure to structural issues, such as defective air conditioning and leaking roofs. Several users reported challenges in retrieving their security deposits, claiming the company appeared unjustifiably demanding on move-out cleanliness. Such practices have left many renters feeling exploited.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>User reviews frequently categorize the dealings with Sun-Mark Properties as beyond merely unpleasant. One tenant recounted being harassed over payment, including frequent, unwarranted visits and name-calling. Another noted harrowing experiences with dilapidated living conditions and being forced into unnecessary cleaning fees, culminating in legal action to reclaim their security deposit. The indignities some renters faced included prejudiced assumptions based on appearance and scolding over missed appointments due to honest mistakes.</p><p>Anger and frustration highlight these reviews, with tenants narrating scenarios where they felt personally attacked over personal and financial misfortunes. Such frantic narratives paint the company not just as negligent but at times aggressive and dismissive toward tenant concerns. It's clear from these accounts that for many, renting with Sun-Mark Properties has been an experience fraught with stress and indignity.</p></section>"
  }
}