{
  "name": "Sunset Pond Apts",
  "slug": "sunset-pond-apts",
  "company_type": "property",
  "address": "1205 Woodstock Way Bellingham, WA 98226",
  "review_count": 48,
  "average_rating": 2.54,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Marissa C.",
        "rating": 1,
        "review": "Not a safe place to live. Outside: trash everywhere, homeless people, car windows bashed in, property stolen off porch. Inside: overflowing toilets, standing water inside that management not only won't care about but would then probably charge you for water damage upon move out. \n\nI was forced to pay other peoples bills when I lived here or threatened with eviction. I was never compensated for their mistake, just treated with hostility. \nI was also forced to pay for the carpets to be replaced when I moved out based on how the carpets looked on the bottom once ripped out, not the top that you can see. They did not let me see the state the bottom of the carpet upon move in yet that's what they judged it off of upon move out... they really just make their own rules here and will continue to take advantage of people\n\nDon't risk it! Live anywhere else.",
        "ownerResponse": null
      },
      {
        "author": "Jessica P.",
        "rating": 1,
        "review": "Avoid this place at all costs especially if you are a single woman! \nWe had issues on several occasions with the cleaner harassing and peering in windows, taking pictures, when many other units were far worse than my daughter's . Piles of trash all over balconies, throwing trash over the edge, screaming and yelling from other units. People park huge vehicles in compact spaces and others have to crawl in and out of cars. The office is always closed and the staff mean and rude.\n\nMy daughter was also harassed by homeless people and we called the police on several occasions. The police said the landlords were responsible to keep homeless people off of peoples patios and that motion lights/cameras should be installed. When I contacted the management they said it wasn't their problem.\n\nMy daughter has been targeted by rude bitter people who excuse the behavior of some and harass others.",
        "ownerResponse": null
      },
      {
        "author": "Taylor C.",
        "rating": 5,
        "review": "We had a 2nd floor apartment with a stunning view of the pond. Our apartment came with a discount and even though we had our rent raise it was still a very good price compared to those in town. The front office people were always kind to us, the maintenance here are hard workers and treat you with kindness. Overall we enjoyed our experience here.",
        "ownerResponse": null
      },
      {
        "author": "Farnoosh R.",
        "rating": 3,
        "review": "My wife lived there for a year (2017-2018), and I visited regularly. \n\nPros: \n-The area is clean and well taken care. \n-Contrary to the past the neighborhood is pretty safe. \n- In unit laundry \n-It's a walking distance to several shopping places in Sunset square \n- Adequate quest parking space \n- Most tenants were decent and respectful \n\nCons: \n- Parking is pretty tight especially if you have a mid to large size car. \n- Office staff, especially the old lady that works there was remarkably rude and condescending on many occasions when I visited the office\n- Our upper floor was unusually squeaky anytime someone walked up there to the point that it wakes you up if you're sleeping \n- It would take maintenance staff several days to come over and fix something simple",
        "ownerResponse": null
      },
      {
        "author": "Brianna M.",
        "rating": 2,
        "review": "Apartment has great view of the pond- Third floor, great window and balcony. We moved into the maintenance manager's old place so everything was in working order, cheap carpeting and plastic shower inserts, but very livable. We cleaned when me moved in. Parking spaces are very small and cars will be dinged by doors. I did also hear of a few neighbors cars being stollen.\n \nBeware of move out fees! We moved out and cleaned, but it was an off time when we were leaving so the apartment manager did not check us out. They charged us 5 hours of cleaning to a total of $159.87. Fine, whatever, I have always walked through before and if anything was not up to par, I would re-clean, but it was cleaner than when we moved in. We had steam cleaned the carpet, oven was clean, bathrooms spotless, balcony wiped down (moss & mold-less). We paid the bill, check cleared, no problem. Then a month later, we have collections trying to recollect this. \n\nThe office simply does not have their stuff together. Incorrectly sending a paid bill to collections should have some reprocussions, but it simply doesn't. \n\nRead more: http://www.apartmentratings.com/WA/Bellingham/Sunset-Pond-Apartments_360734772298226/review-111205729#ixzz2jh5WuC2P",
        "ownerResponse": null
      },
      {
        "author": "Ben B.",
        "rating": 4,
        "review": "Overall this place is very livable.  The area has been quiet, clean and I have appreciated the friendly neighbors.  The club is great!  A place to get away after a long day and get a quick workout in or soak in the hot tub.  The main complaint is the tight parking spaces and a lack of them for guests.",
        "ownerResponse": null
      },
      {
        "author": "Heather E.",
        "rating": 4,
        "review": "This was my second time living in these apartments while in my hometown and I have nothing but love for the managers and staff at this complex. Karl and Jeeter always are prompt, efficient and friendly. They helped me out more times than I can count. They kept the apartments, community rooms and parking lots looking clean and presentable. \n\nThe only reasons why the apartments themselves do not rate 5 stars in my book was the noise from the neighbors beside me penetrated through my walls, and the townhouse parking, although covered, was further away from my unit, so my children and i often got wet before getting to our car. That's Bellingham for ya, not that we mind to much.\n\nI highly recommend this complex and if my husband and I don't end up purchasing a house, we'll more than likely reside there again.",
        "ownerResponse": null
      }
    ],
    "google_reviews": [
      {
        "author": "Gurpreet Duhra",
        "rating": 1.0,
        "review": "It doesnt even deserve the one star. We were robbed in multiple ways including, by a intruder, of our deposit, paying more due to fabricated lies of how we kept the condition of the place, management is not approachable and non supportive. After having a truder enter our apartment, we were verbally told that we could purchase security devices that would be reimbursed. Management refused to pay and stated she did not agree to that statement. Also, kept and left the space very clean to have lies stated of the condition the space was left in. Also, have to pay more than double the deposit. Very disappointed and definitely not recommend!",
        "ownerResponse": null
      },
      {
        "author": "Dona Nelson",
        "rating": 4.0,
        "review": "I want to reach out to the office and maintenance staff for all they do to around here. Every times I've had issues in our apartment it has been handled, in a timely fashion. It's not an easy job for them with apartment complex of this size. Good job!",
        "ownerResponse": null
      },
      {
        "author": "Lu Banyan",
        "rating": 5.0,
        "review": "I rented this gorgeous 3 bedroom 2 bathroom SPACIOUS unit here sight unseen. Admittedly I was extremely nervous to see it having had bad experiences in the past. I've been here 1 week and my jaw keeps hitting the floor with how amazing this place is and how kind and helpful the staff are. My first day here, the dryer wasn't working properly and maintenance showed up within the hour! Kasha at the front desk is warm and friendly, and she is the reason everything went so smoothly for us. She is an advanced problem solver and I feel very lucky to be here with my two kids.",
        "ownerResponse": null
      },
      {
        "author": "Karen Dickinson",
        "rating": 4.0,
        "review": "We've been here a year and are impressed with the management and maintenance to promptly help with problems or concerns.\nThe price might seem high, but the amenities, the nearby bus line and the convenient location really does help our day to day lives.",
        "ownerResponse": null
      },
      {
        "author": "Antoinette Munn",
        "rating": 5.0,
        "review": "I moved into sunset pond apartments at the end of March 2023. The application process was smooth and predictable thanks to Kasha, the office manager. Kasha is professional and kind. She made the acceptance criteria clear and was certain to reach out promptly if more information was required for approval. After approval I was given a move in date. Maintenance efficiently turned my unit and I moved in on schedule. Maintenance clearly takes pride in their work and it was obvious that they paid attention to the details while turning my unit. The cleaner also left my unit spotless.\n\nDo your research on the area so you understand and are comfortable in your new neighborhood. Overall I am completely satisfied with Sunset Pond Apartments, excited to live here, enjoy the amazing amenities, and pleased to work with Sunset Pond staff!",
        "ownerResponse": null
      },
      {
        "author": "Lisa",
        "rating": 5.0,
        "review": "I lived at this complex for many years, and had nothing but great experiences with the office manager Kasha she is very nice and does good at her job she always has a smile on her face . Apartments are nice and maintenance always comes and does the work orders in a timely manner. There is some homeless you will see but they are pretty harmless. I really enjoyed living here and will miss it!",
        "ownerResponse": null
      },
      {
        "author": "Rebecca Herman",
        "rating": 4.0,
        "review": "The apartment: Very large 2 bedroom with huge walk in closet, open concept living room/kitchen, nice locking storage off the patio, nice vinyl double pane windows and sliders lets in plenty of daylight, stack washer dryer too!. For the rent amount, you can't get better square footage.  The property: Free assigned, covered parking, large indoor pool, hot tub and sauna, nice workout room , pool table in clubhouse and yes, you can reserve the clubhouse for a party or gathering! Water, sewer and garbage is paid which is excellent! Walk-ability: Within walking to stores, movie theatre, restaurants, etc... On Site manager and Staff:  Kasha is a highly trained professional manager who happens to live on site.  This is getting rare as most apartment management companies are faceless and have no real vested interest in their home.  This is her home and she continually makes property improvements. The maint. staff are friendly and prompt. The housekeeper/groundskeeper does an excellent job as well.  We're moving to a warmer climate but I would recommend Sunset Pond Apartments.",
        "ownerResponse": null
      },
      {
        "author": "Nick Green",
        "rating": 2.0,
        "review": "Not a safe place to live, only has residents due to there not being many options elsewhere. Loud neighbors who threw toys and trash onto our patio. Didn't seem to be any consequences because of how often it happened. Loud all the time, had my car broken into, and bike stolen here. Parking sometimes wasn't guaranteed because cars had been abandoned there for months. Paying rent in out dated inconvenient ways, with only check or money order. Better off anywhere I promise you. 2 stars because you can sign a month to month lease, letting you move out as soon as you can.",
        "ownerResponse": null
      },
      {
        "author": "Lisa Loleas",
        "rating": 5.0,
        "review": "I am a current tenant here and have nothing but good thing to say about the manager Kasha and maintenance team! They are all very good at what they do. The manager is very professional and make sure she keeps the property is in good condition. She does everything in her power to take care of the homeless situation. Some of the reviewes are not fair she does all that she can when dealing with homless. I have lived here several years and plan on being here for several more. Keep up the good work Kasha!  You do a good job at doing your job.\n\nhave nothing but",
        "ownerResponse": null
      },
      {
        "author": "S D",
        "rating": 1.0,
        "review": "Worst place to live. Break ins and junkies running around in the buildings. Not a safe place to call it a home. On top of this, the management is very hostile and they lie to keep the deposit and charge more.",
        "ownerResponse": null
      },
      {
        "author": "Crystal Lavallee",
        "rating": 5.0,
        "review": "We absolutely enjoyed living at sunset pond.\n\nKeisha was always so pleasant to talk to and any time we had a service request,  she was polite and prompt.\nWhen my mailbox was broken into,  she made sure my lock was replaced.\nWhen we thought our car was stolen, she was prompt to check the cameras for us.\nShe made our move out process as smooth as could be.\nWe miss you Keisha!!\n\nThe apartments are nice and spacious.  Location is pretty great.\nThere's plenty of homeless in the area,  but they mainly keep to themselves.  Cars get broken into,  but there's not much you can do to change that.. it's the area. So if you don't mind putting up with some slight inconveniences by homeless population,  you might enjoy living here.",
        "ownerResponse": null
      },
      {
        "author": "Mikel Bryant",
        "rating": 5.0,
        "review": "Came to view the property and met with Kasha. She was so friendly and knowledgeable! I dont often leave public reviews but it was such a pleasant experience that I wanted to give a shout-out for her taking the time and answering all of my questions.",
        "ownerResponse": null
      },
      {
        "author": "M C",
        "rating": 1.0,
        "review": "This was the worst place I have ever lived and I do not have one positive thing to say about it.  Management was hostile and I have evidence of them lying and charging me wrong multiple times. They did not care about me being harassed by my neighbors, did not care that my toilet overflowed everytime the neighbors did laundry, did not care when there was standing water in my kitchen, did not care when my property was stolen off my porch or my car windows bashed in. There's always trash all over the parking lot, they raise rent every few months, post office even told me they won't deliver packages to this location because they got in an argument with the office.... not shocking.\nWhen I moved out of here my life improved tenfold. Do not sign a lease here, I promise you it is not worth it and your health will suffer- and don't believe the obviously fake bought reviews all saying this is a magical place. No one who lived here and has dealt with the property manager would ever honestly say that.",
        "ownerResponse": null
      },
      {
        "author": "Mona Santos",
        "rating": 5.0,
        "review": "Sunset Pond Apartments is a nice place to live. The 3 bedroom 2 bathrooms are very comfortable with plenty of space. It's a quiet complex that is beautifully landscapes. The pool and clubhouse is kept in excellent condition and a great place to have a gathering or just relax at. The office lady Kasha is amazing. She is so kind and professional. She stays on top of keeping the complex well maintained and running as smoothly as possible. If I call with a maintenance request she put the order in right away and has the issue addressed. Kasha does an amazing job and I don't think she is given enough praise for all that she does.\nThank you Kasha ",
        "ownerResponse": null
      },
      {
        "author": "Ezra McConnell",
        "rating": 3.0,
        "review": "Sunset Pond has a nice walking area. They do not allow pets and have an interesting group of staff members. The one thing that is quite annoying is the amount of times they need to come into your apartment. We are constantly getting notices on our door of them 'fixing something' we didnt do, and checking around the apartment. It seems a little suspicious. Other then that, its fine. A good starting aparment.",
        "ownerResponse": null
      },
      {
        "author": "Cathie Oberg",
        "rating": 5.0,
        "review": "I have lived at Sunset Pond Apartments for ten years.  I have been very happy with the personnel and physical appearance of the facility.  The management has always been very supportive.  I hope to be here another ten years.",
        "ownerResponse": null
      },
      {
        "author": "Yvette Salazar",
        "rating": 1.0,
        "review": "Good Ole Sunset Pond.. ONLY good thing about these apartments is how affordable this trashy place is. If you can avoid leasing/renting here, do yourself the favor of paying the extra hundred somewhere far away from here in a safer/cleaner environment. I definitely learned my lesson.\n\nThe first year of living here, I experienced MANY random knocks at my door in the middle of the night when Im by myself leading me to have full panic attacks. My family that lives 10minutes away would have to come over @3am to check up on me. How can I not feel safe in my very own home??\n\nMy brand new 2020 car was hit in my very own designated parking space. (Mind you I was given the worst parking space here; by the entry way into the gravel parking lot where theres a big pothole and dumpster where all the homeless people dumpster dive 24/7) I asked for them to please help with my police report by sending in footage which was asked of me and not once did Janice or Kasha help me nor reach back out to let me know that they did.\n\nI started parking my car out in the gravel to avoid this situation again but the amount of homeless people that hangout in that lot with their broken down cars makes me feel incredibly unsafe as a women. One night my 16 year old brother was chased after in his truck by them and he called me freaking out not knowing what to do! Not to mention my sweet neighbors car was broken into recently and not Janice or kasha did anything about it!\n\nKasha confirmed they only have one camera that faces the gravel and it is very faint and hazy. Maybe you guys should get a better security system just in case something really bad happens? Just a thought you guys.\n\nSunset pond apartments, do better.",
        "ownerResponse": null
      },
      {
        "author": "nicole Derscheid",
        "rating": 1.0,
        "review": "Dont be fooled by their cheap rent they will just raise the price without warning and keep your deposit. Awful ",
        "ownerResponse": null
      },
      {
        "author": "Davi Weasley",
        "rating": 2.0,
        "review": "I've lived in this place for five years, and there's not much to recommend.\nThe maintenance staff is amazing but the admin staff is extremely mediocre. Just today we arranged a schedule around an alleged water shut off that we got last minute notice about. It turns out the notice was posted to the wrong building, but no one on the office staff bothered to walk a block and let folks know about the mistake.\nThat is the kind of utterly atrocious customer service I have come to expect from the office staff. They won't tell me who their managers are so I am resorting to posting this publicly.\nOnce again, I think the apartments are fine, the maintenance staff are amazing, but unfortunately if you're looking you can probably do better. (or maybe the apartment market in Bellingham is tight enough that you are willing to deal with a lot of nonsense from ownership and their office employees, if so, I look forward to meeting new friendly neighbors, there's a lot of great folks here and if you play your cards right you rarely have to interact with the office folks.)\n\nIt's entirely possible that the office staff is over stressed in a difficult job, but once I called to complain about not getting advance notice for a water shut off and the office employee said \"f*** you\" and hung up the phone.\n\nThat's what you're getting yourself into if you move here, but again, great maintenance staff if you can successfully get the office to take down a maintenance request, which to be fair they do somewhat accurately about two thirds of the time.\n\nThis might be a two and a half star review but I'm rounding down to let prospective renters know about this major issue.",
        "ownerResponse": null
      },
      {
        "author": "Drew Buchhaas",
        "rating": 1.0,
        "review": "Literal thieves. I will never rent from these apartments or recommend them after hearing they steal deposits for no valid reason!",
        "ownerResponse": null
      },
      {
        "author": "Sama",
        "rating": 5.0,
        "review": "Sunset pond apartments is a great place to live its located near everything you need in town the complex is well taken care of and  the manager kaysha with the red hair is really nice and helpful :)",
        "ownerResponse": null
      },
      {
        "author": "Richie Virtanen",
        "rating": 1.0,
        "review": "Shady business practices from this place youd be better off living under a bridge than here",
        "ownerResponse": null
      },
      {
        "author": "Erin Heft",
        "rating": 1.0,
        "review": "Absolutely incompetent management, unprofessional, they will rip you off! Run!",
        "ownerResponse": null
      },
      {
        "author": "Travis Bessey",
        "rating": 1.0,
        "review": "Another awfully run complex stealing, and not fixing issues",
        "ownerResponse": null
      },
      {
        "author": "F S",
        "rating": 1.0,
        "review": "All the 5 star reviews here are fake. This place is an absolute nightmare.",
        "ownerResponse": null
      },
      {
        "author": "Phoenix",
        "rating": 5.0,
        "review": "Great management, beautifully maintained grounds, quality apartments at affordable comparable rates.",
        "ownerResponse": null
      },
      {
        "author": "Anon 1",
        "rating": 1.0,
        "review": "Thiefs.",
        "ownerResponse": null
      },
      {
        "author": "charles koenig",
        "rating": 1.0,
        "review": "Horrible place dont live there.",
        "ownerResponse": null
      },
      {
        "author": "Jacob Tartaglioni",
        "rating": 1.0,
        "review": "thiefs",
        "ownerResponse": null
      },
      {
        "author": "Shelby Dinnison",
        "rating": 1.0,
        "review": "thieves",
        "ownerResponse": null
      },
      {
        "author": "Daija Heyward",
        "rating": 1.0,
        "review": "Thief",
        "ownerResponse": null
      },
      {
        "author": "Nicholas Green",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jennifer Hiegler Pickett",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Selena star",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "colton braswell",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "David Craig",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Bryce Davidson",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kiana Straka",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Inderjit Singh",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Luis Carbajal",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Saba Hassan",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 38,
  "adjusted_average_rating": 2.74,
  "summary": {
    "text": "<section><h2>Good</h2><p>The Sunset Pond Apts offer some undeniable charms that residents appreciate. Tenants have praised the property for its spacious apartments, particularly highlighting units with views of the pond as a distinct advantage. The inclusion of amenities such as in-unit laundry facilities and sufficient guest parking add to the comfort of the living experience. As for the staff, there are remarks that point to the kindness and efficiency of the front office and maintenance teams, which contribute to a generally pleasant living environment.</p><p>Furthermore, the proximity to shopping areas and public transportation has been noted as a convenience that enhances the quality of life for the residents. Some tenants have also expressed gratitude towards the property's open concept living spaces and the amenities like the clubhouse and hot tub, which provide places of relaxation and community engagement.</p></section><section><h2>Great</h2><p>In terms of exceptional experiences, some residents have had extremely positive interactions with the office manager, who has been described as professional, warm, and accommodating. Instances of timely and efficient maintenance responses also reflect great experiences, with one user review recounting how a dryer issue was resolved within an hour of being reported. Additionally, residents appreciate the complex's beautiful landscaping and the attention to detail shown by the maintenance staff in preparing units for new tenants.</p><p>Shared amenities like the indoor pool and fitness center receive high marks for their quality and upkeep, providing residents with valuable leisure and health benefits. Moments where the management's proactive approach to solving problems stands out to contribute to the overall perception of a well-managed property with attentive and caring staff.</p></section><section><h2>Bad</h2><p>However, the negative aspects of Sunset Pond Apts cannot be overlooked. Several user reviews have mentioned concerns about the property's safety, citing instances of theft, vandalism, and a persistent problem with the homeless population loitering on the property. The parking situation has been an area of discontent, where small parking spaces lead to dinged cars, and sometimes, cars are left abandoned for months, limiting available parking for residents. Additionally, some general maintenance issues within the apartments, such as squeaky floors and long wait times for repairs, have been points of dissatisfaction.</p><p>Moreover, there have been complaints about management behavior, with some tenants feeling that their issues were treated with hostility or downright ignored. Communication issues with the office staff, particularly concerning the return of security deposits and abrupt rent increases, have tarnished the reputation of this property for some of its former tenants.</p></section><section><h2>Ugly</h2><p>The ugliest aspects of living at Sunset Pond Apts seem to be related to what some tenants describe as devious management practices. Accusations of wrongful deposit withholding and additional charges levied under dubious circumstances leave a bitter taste for ex-tenants. Allegations also extend to instances where the management failed to deal with serious concerns, such as break-ins and harassment, inadequately. As per one startling user review, even after experiencing middle-of-the-night disturbances and property damage, no tangible action was taken by the management to address these critical security issues.</p><p>Some tenants have felt so negatively impacted by their experiences at Sunset Pond Apts that they have warned others to steer clear altogether, using words like \"thieves\" and \"nightmare\" to describe their experience. It's evident from the reviews that while some aspects of the property are genuinely appreciated, there are glaring failures in management and safety that significantly detract from the quality of life at Sunset Pond Apts.</p></section>"
  }
}