{
  "name": "Sycamore Corporation",
  "slug": "sycamore-corporation",
  "company_type": "company",
  "address": "1200 Harris Ave # 413, Bellingham, WA 98225",
  "review_count": 6,
  "average_rating": 3.17,
  "reviews": {
    "google_reviews": [
      {
        "author": "Skylar Smith",
        "rating": 5.0,
        "review": "Sycamore Square building is awesome! The history is sooo much fun to learn about. I invite you all to go to \"the creepy corner\" and see if you feel anything/anyone with you...",
        "ownerResponse": null
      },
      {
        "author": "Si H",
        "rating": 1.0,
        "review": "Extremely unprofessional. Doesn't answer calls during business hours and didn't respond to voicemails. When we did get in contact with the company, we were met with very unfriendly responses, almost giving us the feeling that we were an inconvenience to the employees. We were told that we would get the apartment we applied for and heard nothing back for two weeks. Then we received an email saying they had given it to someone else, wasting our time which could have been spent looking for other places. If you are looking for a competent, trusted property management company please look elsewhere.",
        "ownerResponse": {
          "text": "Hi Simon,\nI'm so sorry that was your experience with us. Recently we did undergo a change in staff and property management. If you're ever looking into another apartment don't be afraid to call and set up an appointment. We'd love another chance to change your mind!"
        }
      },
      {
        "author": "Steve Skippy Austin",
        "rating": 2.0,
        "review": "Need to get their act together. Lawns are un kept and land shaping sucks. Parking lots need striping. Rent is prohibitive.",
        "ownerResponse": {
          "text": "Hi Steve,\nI'm so sorry about your experience. Recently we did undergo a change in management and staff. We appreciate your continued patronage! If there is ever another issue feel free to contact us personally, and we will do our best to rectify the situation!"
        }
      },
      {
        "author": "Jesse",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Jesse Graf,\n\nWe assume that based on this one star review of our management firm that you are displaying your frustration for the timeframe for repair of your back slider door at Briarwood Terrace Apartments.  \n\nWe do understand your frustration; however, please understand that glass companies are booked 6-8 weeks out, and the timeline for repair is outside of our control.  \n\nYour glass door was not the only one which ended up broken due to a stray rock during landscaping, and we are doing our very best to get this repaired.  \n\nWe ask that you look for better ways to communicate your frustrations to our office other that resorting to petty reviews."
        }
      },
      {
        "author": "Viet Le",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for your review! We are pleased to serve our tenants and owners!"
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Monica R.",
        "rating": 5,
        "review": "Sycamore Square\n\nThe famous beautiful brick building on the corner of 12th and Harris in Fairhaven was built in 1890 and still charms tourists and visitors alike. Make sure to reserve a whole afternoon to spend at this unique indoor shopping community. \n\nStroll through Sycamore Square and find a wide variety of shops, restaurants, spa services, with 12th Street Shoes, Mambo and The Black Cat being among the most famous. What a  unique building to dine, browse and shop in Bellingham. Many professional offices round out this beautiful space. Big plus with plenty of parking (which is tough to find sometimes in Fairhaven) Sycamore Square owns the  parking lot on the corner of 13th and Harris.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 4,
  "adjusted_average_rating": 3.25,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This summary article is generated by ChatGPT and is only intended to be a tool to help individuals find a property management company or rental property. The contents within are based on user reviews and do not include any identifiable information about the reviewers. This article's intent is to provide a balanced and comprehensive view of Sycamore Corporation based on available user reviews.</p>  </section>  <section>    <h2>Good</h2>    <p>Sycamore Corporation has garnered praise for some of its managed properties, particularly the Sycamore Square building, which is noted for its historical charm and a delightful mix of shops, restaurants, and professional offices. Visitors and tourists alike appreciate the ambiance and unique setting of this location, which is regarded as a centrally located venue with ample parking in Bellingham. The aesthetics and convenience of this property seem to be a significant highlight in the positive reviews.</p>    <p>From the user reviews, it is evident that there is satisfaction among some clients with the corporation's offerings. A notable mention within a five-star review includes the appreciation for the wide variety of services and facilities at Sycamore Square. The character and rich history of the building create a unique and inviting atmosphere, which seems to be a hit among locals and tourists.</p>  </section>  <section>    <h2>Great</h2>    <p>User reviews indicate that when Sycamore Corporation correctly manages a property, it can lead to high tenant satisfaction, particularly in regards to space value and customer service. A user review accentuates the nostalgic and fun experience offered by the company, inviting others to explore what they label as \"the creepy corner\" for an adventurous touch. The presence of businesses and shops within the properties under their management seems to enhance the value of residing or conducting business there.</p>    <p>The company's responsiveness, as seen in instances where they have replied to negative reviews, indicates a willingness to acknowledge issues and provide some level of customer support. For example, Sycamore Corporation has taken steps such as changing staff and property management in an attempt to improve service quality, based on owner responses to user reviews. This shows that they are, to some extent, listening to feedback and acting upon it.</p>  </section>  <section>    <h2>Bad</h2>    <p>However, Sycamore Corporation's performance has not been without criticism. Several user reviews express disappointment in how the company handles their property management responsibilities. Customers have experienced unprofessional behavior, such as difficulty in getting in contact with the company during business hours, unreturned voicemail messages, and unfriendly responses from staff. Furthermore, some reviews point to a sense of disorganization and lack of competence, resulting in a frustrating customer experience with ineffective communication.</p>    <p>Another recurring theme in the negative user reviews is the alleged neglect of property maintenance, wherein unlawful conditions like unkempt lawns and poorly maintained parking lot striping are mentioned. These deficiencies suggest a potential oversight in crucial aspects of property upkeep, which could detract significantly from the living and functional quality of the properties managed by Sycamore Corporation.</p>  </section>  <section>    <h2>Ugly</h2>    <p>On the more concerning end of the spectrum, one review suggests a serious lapse in customer relations and crisis management. The user describes an indirect but vivid narrative of frustration over the delay in repairing a glass door, implying a lack of urgency or inadequate handling of the issue by Sycamore Corporation. The response given by the company, while offering an explanation, also exhibits a defensive tone and a suggestion that the customer's method of expressing dissatisfaction is petty.</p>    <p>Additionally, there are reported instances where the company has allegedly not honored commitments, such as assurances given to prospective tenants about the availability of an apartment that was later rented to someone else. This misstep, as recounted in one of the user reviews, represents a serious breach of trust and professionalism and highlights concerns over the operational reliability of Sycamore Corporation.</p>  </section></article>"
}