{
  "name": "Sycamore Corporation",
  "slug": "sycamore-corporation",
  "company_type": "Company",
  "address": "1200 Harris Ave # 413, Bellingham, WA 98225",
  "review_count": 4,
  "average_rating": 3.25,
  "reviews": {
    "google_reviews": [
      {
        "author": "Skylar Smith",
        "rating": 5,
        "review": "Sycamore Square building is awesome! The history is sooo much fun to learn about. I invite you all to go to \"the creepy corner\" and see if you feel anything/anyone with you...",
        "owner_response": null
      },
      {
        "author": "Si H",
        "rating": 1,
        "review": "Extremely unprofessional. Doesn't answer calls during business hours and didn't respond to voicemails. When we did get in contact with the company, we were met with very unfriendly responses, almost giving us the feeling that we were an inconvenience to the employees. We were told that we would get the apartment we applied for and heard nothing back for two weeks. Then we received an email saying they had given it to someone else, wasting our time which could have been spent looking for other places. If you are looking for a competent, trusted property management company please look elsewhere.",
        "owner_response": {
          "text": "Hi Simon,\nI'm so sorry that was your experience with us. Recently we did undergo a change in staff and property management. If you're ever looking into another apartment don't be afraid to call and set up an appointment. We'd love another chance to change your mind!"
        }
      },
      {
        "author": "Steve Skippy Austin",
        "rating": 2,
        "review": "Need to get their act together. Lawns are un kept and land shaping sucks. Parking lots need striping. Rent is prohibitive.",
        "owner_response": {
          "text": "Hi Steve,\nI'm so sorry about your experience. Recently we did undergo a change in management and staff. We appreciate your continued patronage! If there is ever another issue feel free to contact us personally, and we will do our best to rectify the situation!"
        }
      },
      {
        "author": "Viet Le",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for your review! We are pleased to serve our tenants and owners!"
        }
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 2.67,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739095154,
    "text": "<section id=\"good\"><h2>Good</h2><p>Sycamore Corporation has received some positive feedback from users, particularly related to their properties. One user praised the Sycamore Square building for its fascinating history and inviting atmosphere, highlighting an intriguing spot known as \"the creepy corner.\" Such enthusiasm indicates that the property's uniqueness resonates with some residents, making for an enjoyable living experience.</p><p>Another user experience showcased a strong customer service aspect, as the owner promptly acknowledged and thanked a user for their positive review. This responsiveness indicates a desire to maintain communication with tenants and a commitment to providing a satisfactory rental experience.</p></section><section id=\"great\"><h2>Great</h2><p>Some users have highlighted the potential that Sycamore Corporation has, particularly in their properties' historical character and atmosphere. The mention of the engaging \"creepy corner\" suggests that there are elements of charm and uniqueness that residents appreciate, enhancing the overall living experience. Moreover, the company's acknowledgement of positive reviews reflects their openness to feedback and willingness to connect with their tenants.</p><p>In addition, a user expressed satisfaction with the responsiveness of the management team to tenant feedback, underscoring a proactive approach to customer service. Such efforts can help foster a more inviting community for current and prospective tenants alike, showcasing the potential for improved service in the future.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews reveal some significant issues with Sycamore Corporation's communication and management practices. One reviewer reported extreme difficulty connecting with the management team, describing their experiences of unreturned calls and voicemails that went unacknowledged. This lack of responsiveness can lead to tenant frustration and diminishes the perception of reliability.</p><p>Another individual echoed similar sentiments, criticizing the professionalism of the management staff. Feeling as though they were treated as an inconvenience rather than a valued tenant, the reviewer mentioned a frustrating application process that ended with no follow-up or feedback regarding their interest in an apartment. Such experiences highlight the need for improvement in their customer relations and operational efficiency.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most concerning reviews for Sycamore Corporation revolve around ongoing maintenance issues and neglected property care. One dissatisfied tenant pointed out that the lawns were not maintained, noting overgrown areas and poor landscaping, which raises concerns about the overall management of the properties. These issues can lead to negative perceptions of living environments that could deter potential renters.</p><p>Additionally, a review highlighted the stress caused by a lack of communication during the application process, further exacerbated by the late notice of an apartment being rented to another party. This indicates a troubling trend of neglecting tenant communication, which can seriously impact the trust and satisfaction of current and prospective tenants. Overall, these issues suggest that Sycamore Corporation may need significant improvements in their operational practices to create a more positive living experience for residents.</p></section>"
  }
}