{
  "name": "Sycamore Corporation",
  "slug": "sycamore-corporation",
  "company_type": "Company",
  "address": "1200 Harris Ave # 413, Bellingham, WA 98225",
  "review_count": 4,
  "average_rating": 3.25,
  "reviews": {
    "google_reviews": [
      {
        "author": "Skylar Smith",
        "rating": 5,
        "review": "Sycamore Square building is awesome! The history is sooo much fun to learn about. I invite you all to go to \"the creepy corner\" and see if you feel anything/anyone with you...",
        "owner_response": null
      },
      {
        "author": "Si H",
        "rating": 1,
        "review": "Extremely unprofessional. Doesn't answer calls during business hours and didn't respond to voicemails. When we did get in contact with the company, we were met with very unfriendly responses, almost giving us the feeling that we were an inconvenience to the employees. We were told that we would get the apartment we applied for and heard nothing back for two weeks. Then we received an email saying they had given it to someone else, wasting our time which could have been spent looking for other places. If you are looking for a competent, trusted property management company please look elsewhere.",
        "owner_response": {
          "text": "Hi Simon,\nI'm so sorry that was your experience with us. Recently we did undergo a change in staff and property management. If you're ever looking into another apartment don't be afraid to call and set up an appointment. We'd love another chance to change your mind!"
        }
      },
      {
        "author": "Steve Skippy Austin",
        "rating": 2,
        "review": "Need to get their act together. Lawns are un kept and land shaping sucks. Parking lots need striping. Rent is prohibitive.",
        "owner_response": {
          "text": "Hi Steve,\nI'm so sorry about your experience. Recently we did undergo a change in management and staff. We appreciate your continued patronage! If there is ever another issue feel free to contact us personally, and we will do our best to rectify the situation!"
        }
      },
      {
        "author": "Viet Le",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thank you for your review! We are pleased to serve our tenants and owners!"
        }
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 2.67,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739205606,
    "text": "<section id=\"good\"><h2>Good</h2><p>Several user reviews highlight Sycamore Corporation’s involvement with engaging properties with rich histories. A standout mention was for the Sycamore Square building, where its historical background fascinated a reviewer who encouraged others to explore interesting spots within the property. Such elements contribute positively to tenant satisfaction, adding unique character to living experiences. These experiences showcase Sycamore Corporation's offering of properties with distinctive qualities.</p></section><section id=\"great\"><h2>Great</h2><p>There are some notably positive sentiments about the company, particularly regarding how tenants feel accommodated and understood. One reviewer left a high rating, even though their review did not contain specific commentary, which suggests satisfaction with their experience overall. Furthermore, an appreciatively personalized response from the management acknowledged their review and emphasized the company's dedication to serving their tenants well.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews reveal several areas where Sycamore Corporation falls short. Complaints about unprofessional communication practices, such as ignoring calls and voicemails, were prevalent, influencing potential tenants negatively. In one case, a reviewer detailed a frustrating experience with the company's responsiveness, leading to a missed opportunity to secure an apartment they were initially promised. Such communication issues create distrust and dissatisfaction among prospective renters.</p><p>Another review criticized the state of property maintenance, pointing out unkempt lawns and poorly maintained parking lots. These issues hint at a lack of attention to property upkeep, coupled with concerns about high rent prices. While Sycamore Corporation did respond to such feedback by acknowledging management changes, the persistence of these problems highlights ongoing challenges the company must address to improve customer experience.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>In one particularly troubling account, a reviewer expressed feeling like an inconvenience when attempting to communicate with Sycamore Corporation. Despite finally reaching out, they reported receiving dismissive and unfriendly responses from staff. This experience culminated in the unexpected and disappointing news that the apartment they applied for had been given to someone else without prior notice. Such instances of poor communication and mismanagement significantly taint the company's reputation and cause severe dissatisfaction.</p></section>"
  }
}