{
  "name": "Taylor Heights",
  "slug": "taylor-heights",
  "company_type": "Property",
  "address": "2115 Taylor Ave, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 3.55,
  "reviews": {
    "google_reviews": [
      {
        "author": "keashaa",
        "rating": 1,
        "review": "I wish I could give zero stars, they never answer their phone, that'd be fine if they responded to emails but they don't do that either. They always have an excuse as to why they can't answer the phone or why they didn't respond to emails but how can you have the same excuse every time. Once is okay, twice maybe a coincidence but every single time? That's just their habits at this point, I think I've only got them when I called one time. Going straight to the leasing office is the best way to contact them and they're not even there on time majority of the time and even if they're there, the sign says their open, and their cars are in the parking lot, they have the door locked and don't respond to knocking on the door or phone calls. They say they'll be back at one time and don't return until way past that time. Contacting them is their main issue and also the most important one. All the apartments have different things though we all say the same price. Some have nicer washer dryers, the bathrooms are different the flooring and kitchens are different. If youre going to have different values in each apartment the prices should reflect that or they should all be upgraded the same. Why is the hot water heater in the closet? It takes up half the room for me to put clothes, yet I pay the same price as others with a full closet? It's a nice community of college students but staff even thought theyre doing their best fails miserably when it comes to contacting them.",
        "owner_response": null
      },
      {
        "author": "Andres antal",
        "rating": 5,
        "review": "Andres Antal\n 19 August 2017\nI lived in Taylor Heights, one of the buildings managed by Pacific Living Properties (WWU Living), from Summer 2015 to Summer 2017.\n\nI would rate 4.5 stars if I could.\n\nDon't pay attention to reviews prior to September 2016; a different company, Painless Properties, managed the property during that time.\n\nSince Pacific Living Properties (PLP) took over, they invested a lot of time and money into the property. Unfortunately, a lot of residents, myself included, had to deal with constant construction, but that has been mostly completed. The property needed the work--BADLY. The previous management let it fall into shambles. Otherwise, it's a pretty good property, and I had an overall positive experience living here.\n\nPros:\n-You're on an individual lease; you don't need to hassle your roommates for rent money.\n-It's the cheapest single lease you will find remotely close to campus.\n-Sufficient parking, it would get tight on Sunday nights during the school year, but I always managed to park on the same block that I lived on.\n-Literally right next to campus\n-The office is located on site, and they are open 7 days a week.\n-The office staff is personable and tries to get to know residents, but I may be biased since I am working here.\n-The leasing office immediately texts you when they receive a package for you\n-Maintenance is prompt with work orders\n-Flat rate utilities\n\nCons:\n-Shared living\n-Random roommates if you don't come with a group--I've had mostly positive experiences\n-WiFi can be spotty in some rooms, but there are workaround. I had my own free modem\n\nFurther notes:\n-Leases generally start in September; if you want a good deal for September, start looking in early Spring\n-The rent may seem high, but they fill quickly--SIGN A LEASE EARLY.\n-In 2017 rooms were completely filled up by mid-August\n-If you want cheap housing, move to the Southwest. $350 a m/o for gorgeous new apartments",
        "owner_response": {
          "text": "Thank you for your review Andres."
        }
      },
      {
        "author": "Kristan Kottcamp",
        "rating": 1,
        "review": "I really wish I could give a zero star. The apartment itself is fine enough but the staff and management have been entirely useless ever since I moved in. It has been a complete nightmare. I wish I could escape but they lock you under a fascist lease agreement with very little options to get out. This place should honesty be shut down.",
        "owner_response": {
          "text": "Hello Kristan, Thank you for taking the time to leave your feedback. We are sorry to hear you do not care for our management team. We believe they do a wonderful job, and care about the wellbeing of our residents. We would like to hear more about your experience, as we believe feedback you provide could be a valuable coaching opportunity if we missed the mark. If you have additional information you wish to share regarding your experience, please reach out to me personally at customerservice@plpinc.net. Thank you! Kailey"
        }
      },
      {
        "author": "Sander Bakkely",
        "rating": 4,
        "review": "A bit difficult to get fully set up but afterwards was pretty painless!",
        "owner_response": null
      },
      {
        "author": "Yoel Merhu",
        "rating": 2,
        "review": "",
        "owner_response": {
          "text": "Thank you for your review. We're sorry to see that you aren't pleased with your experience, and if there is anything we can do to improve, please let us know."
        }
      },
      {
        "author": "rosario mendoza",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cole Price",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kev",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "oh beans",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenna Brock",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Avriel M.",
        "rating": 1,
        "review": "I wish I could keep them at zero stars, they never answer their phone, that'd be fine if they responded to emails but they don't do that either. They say they'll be back at one time and don't return until way past that time. They always have an excuse as to why they can't answer the phone or why they didn't respond to emails but how can you have the same excuse every time. Once is okay, twice maybe a coincidence but every single time? That's just their habits at this point, I think I've only got them when I called one time. Going straight to the leasing office is the best way to contact them and they're not even there on time majority of the time and even if they're there, the sign says their open, and their cars are in the parking lot, they have the door locked and don't respond to knocking on the door or phone calls. Parking is awful, the spaces are tight. My apartment had to use pliers to start our dryer for majority of the lease. All the apartments have different things though we all say the same price. Some have nicer washer dryers, the bathrooms are different the flooring and kitchens are different. It's a nice community of college students but the place is annoyingly atrocious",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.4,
  "distribution": {
    "1": 3,
    "2": 1,
    "3": 0,
    "4": 1,
    "5": 6
  },
  "summary": {
    "created_timestamp": 1739205605,
    "text": "<section id=\"good\"><h2>Good</h2><p>The user reviews indicate that Taylor Heights offers a location advantage with its proximity to campus, making it a convenient choice for students. Some reviews highlighted the community aspect, where the property is home to a vibrant college student environment, adding to the overall campus living experience. An individual lease option is another advantage; it removes the burden of coordinating rent payments with roommates, which is an appeal for many residents. Additionally, ample parking availability, while sometimes tight during peak times, generally gives residents peace of mind about vehicle accommodation. In particular, those who began their leases after the management transition note a marked improvement in the property conditions due to the effort invested by the new management company. It seems the renovations, although bothersome at times, have been mostly beneficial in improving the living conditions.</p></section><section id=\"great\"><h2>Great</h2><p>Several user reviews commend the promptness and efficiency of the maintenance team. Responding quickly to work orders, the maintenance staff ensures that residents experience minimal disruption due to apartment issues. The leasing office staff has been praised for being personable and actively trying to develop a rapport with residents, making the housing experience more pleasant for those living at Taylor Heights. A review also mentioned the ease of package management, as the office promptly notifies residents upon receiving deliveries, which assists in smooth handling of personal shipments. Affordability is another highlight, as Taylor Heights is noted as one of the cheaper individual lease options close to campus, providing value while maintaining quality living standards.</p></section><section id=\"bad\"><h2>Bad</h2><p>Communication appears to be a significant hurdle at Taylor Heights, as several tenants report frustration with inconsistent or completely lacking responses from the management team. A recurring theme in user reviews is the struggle to get in touch via phone or email, with some resorting to visiting the leasing office in person, only to find it closed during stated business hours. Another area of concern is the variability in apartment conditions; while tenants pay the same rent, there is a notable discrepancy in the quality of amenities, such as washer dryers and flooring between units, leaving some feeling unfairly treated.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>One of the most severe criticisms found in user reviews revolves around the management's general unreliability and a lack of professionalism. Some residents describe their lease agreements as overly restrictive, with little room for negotiation, making exiting difficult and stressful. Frustration also arises from specific maintenance issues reported that were not addressed promptly, such as malfunctioning appliances needing tools for everyday use. Moreover, some inhabitants have experienced ongoing issues with locked doors during office hours and numerous unreturned communications, leading to confusion and dissatisfaction.</p></section>"
  }
}