{
  "name": "Taylor Heights",
  "slug": "taylor-heights",
  "company_type": "Property",
  "address": "2115 Taylor Ave, Bellingham, WA 98225",
  "review_count": 11,
  "average_rating": 3.55,
  "reviews": {
    "google_reviews": [
      {
        "author": "keashaa",
        "rating": 1,
        "review": "I wish I could give zero stars, they never answer their phone, that'd be fine if they responded to emails but they don't do that either. They always have an excuse as to why they can't answer the phone or why they didn't respond to emails but how can you have the same excuse every time. Once is okay, twice maybe a coincidence but every single time? That's just their habits at this point, I think I've only got them when I called one time. Going straight to the leasing office is the best way to contact them and they're not even there on time majority of the time and even if they're there, the sign says their open, and their cars are in the parking lot, they have the door locked and don't respond to knocking on the door or phone calls. They say they'll be back at one time and don't return until way past that time. Contacting them is their main issue and also the most important one. All the apartments have different things though we all say the same price. Some have nicer washer dryers, the bathrooms are different the flooring and kitchens are different. If youre going to have different values in each apartment the prices should reflect that or they should all be upgraded the same. Why is the hot water heater in the closet? It takes up half the room for me to put clothes, yet I pay the same price as others with a full closet? It's a nice community of college students but staff even thought theyre doing their best fails miserably when it comes to contacting them.",
        "owner_response": null
      },
      {
        "author": "Andres antal",
        "rating": 5,
        "review": "Andres Antal\n 19 August 2017\nI lived in Taylor Heights, one of the buildings managed by Pacific Living Properties (WWU Living), from Summer 2015 to Summer 2017.\n\nI would rate 4.5 stars if I could.\n\nDon't pay attention to reviews prior to September 2016; a different company, Painless Properties, managed the property during that time.\n\nSince Pacific Living Properties (PLP) took over, they invested a lot of time and money into the property. Unfortunately, a lot of residents, myself included, had to deal with constant construction, but that has been mostly completed. The property needed the work--BADLY. The previous management let it fall into shambles. Otherwise, it's a pretty good property, and I had an overall positive experience living here.\n\nPros:\n-You're on an individual lease; you don't need to hassle your roommates for rent money.\n-It's the cheapest single lease you will find remotely close to campus.\n-Sufficient parking, it would get tight on Sunday nights during the school year, but I always managed to park on the same block that I lived on.\n-Literally right next to campus\n-The office is located on site, and they are open 7 days a week.\n-The office staff is personable and tries to get to know residents, but I may be biased since I am working here.\n-The leasing office immediately texts you when they receive a package for you\n-Maintenance is prompt with work orders\n-Flat rate utilities\n\nCons:\n-Shared living\n-Random roommates if you don't come with a group--I've had mostly positive experiences\n-WiFi can be spotty in some rooms, but there are workaround. I had my own free modem\n\nFurther notes:\n-Leases generally start in September; if you want a good deal for September, start looking in early Spring\n-The rent may seem high, but they fill quickly--SIGN A LEASE EARLY.\n-In 2017 rooms were completely filled up by mid-August\n-If you want cheap housing, move to the Southwest. $350 a m/o for gorgeous new apartments",
        "owner_response": {
          "text": "Thank you for your review Andres."
        }
      },
      {
        "author": "Kristan Kottcamp",
        "rating": 1,
        "review": "I really wish I could give a zero star. The apartment itself is fine enough but the staff and management have been entirely useless ever since I moved in. It has been a complete nightmare. I wish I could escape but they lock you under a fascist lease agreement with very little options to get out. This place should honesty be shut down.",
        "owner_response": {
          "text": "Hello Kristan, Thank you for taking the time to leave your feedback. We are sorry to hear you do not care for our management team. We believe they do a wonderful job, and care about the wellbeing of our residents. We would like to hear more about your experience, as we believe feedback you provide could be a valuable coaching opportunity if we missed the mark. If you have additional information you wish to share regarding your experience, please reach out to me personally at customerservice@plpinc.net. Thank you! Kailey"
        }
      },
      {
        "author": "Sander Bakkely",
        "rating": 4,
        "review": "A bit difficult to get fully set up but afterwards was pretty painless!",
        "owner_response": null
      },
      {
        "author": "Yoel Merhu",
        "rating": 2,
        "review": "",
        "owner_response": {
          "text": "Thank you for your review. We're sorry to see that you aren't pleased with your experience, and if there is anything we can do to improve, please let us know."
        }
      },
      {
        "author": "rosario mendoza",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cole Price",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Kev",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "oh beans",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenna Brock",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Avriel M.",
        "rating": 1,
        "review": "I wish I could keep them at zero stars, they never answer their phone, that'd be fine if they responded to emails but they don't do that either. They say they'll be back at one time and don't return until way past that time. They always have an excuse as to why they can't answer the phone or why they didn't respond to emails but how can you have the same excuse every time. Once is okay, twice maybe a coincidence but every single time? That's just their habits at this point, I think I've only got them when I called one time. Going straight to the leasing office is the best way to contact them and they're not even there on time majority of the time and even if they're there, the sign says their open, and their cars are in the parking lot, they have the door locked and don't respond to knocking on the door or phone calls. Parking is awful, the spaces are tight. My apartment had to use pliers to start our dryer for majority of the lease. All the apartments have different things though we all say the same price. Some have nicer washer dryers, the bathrooms are different the flooring and kitchens are different. It's a nice community of college students but the place is annoyingly atrocious",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.4,
  "distribution": {
    "1": 3,
    "2": 1,
    "3": 0,
    "4": 1,
    "5": 6
  },
  "summary": {
    "created_timestamp": 1739095157,
    "text": "<section id=\"good\"><h2>Good</h2><p>Many user reviews highlight positive aspects of Taylor Heights, particularly the recent management change to Pacific Living Properties, which has brought significant improvements to the property. Residents appreciate that the parking is generally sufficient, although it can become tight during peak times, and they find that having the leasing office on-site is a convenient feature. The office staff is praised for being personable and responsive, with one resident noting that they received immediate notifications when packages arrived.</p><p>Another advantage mentioned in the reviews is the individual lease structure, which relieves residents from the hassle of coordinating rent payments with roommates. This flexibility, combined with the property’s proximity to campus and affordability in comparison to similar housing options, makes it an appealing choice for many students. Furthermore, the maintenance team is described as prompt and proactive in handling work orders, showcasing a commitment to resident satisfaction.</p></section><section id=\"great\"><h2>Great</h2><p>Residents have expressed enthusiasm for the renovations that have taken place under the new management, with many mentioning that the property was in dire need of such upgrades. While some residents had to deal with construction, they acknowledge that it was necessary and that the end results have improved living conditions significantly. Previous reviews mentioning neglect from the former management have been largely overshadowed by the current positive experiences.</p><p>Moreover, several users commented positively on the leasing process. New tenants found it relatively painless to get set up in their apartments, indicating a well-organized and efficient management team. The overall atmosphere has been described as welcoming, particularly among the student community, which adds a social aspect that many residents value.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite some positives, numerous user reviews express frustration regarding the communication skills of the property management team. Several residents reported challenges contacting the leasing office, citing a lack of responses to phone calls and emails. This has become a recurrent theme, with complaints about staff not being available during posted office hours or locking their doors despite being on-site, leading to significant inconvenience for tenants.</p><p>Other issues mentioned include discrepancies in apartment conditions and amenities that residents are paying the same rent for. For instance, users pointed out that while some apartments have modern appliances, others do not, despite all residents being charged similar lease amounts. This inconsistency has contributed to dissatisfaction and is a point of contention among the tenants.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The negative experiences reported by some tenants at Taylor Heights have been quite severe, with reviews indicating that management has failed to address ongoing problems effectively. One resident described their living situation as akin to a “nightmare,” with an inability to escape a restrictive lease agreement stacked against them. This sentiment reflects a lack of tenant support and flexibility, creating an oppressive atmosphere for those seeking a better living arrangement.</p><p>Furthermore, the reviews frequently mention general feelings of unprofessionalism and neglect by the management team. Users expressed significant frustration over unresolved maintenance issues—such as needing pliers to operate the dryer—which suggests a troubling lack of attention to essential repairs. Collectively, these experiences contribute to a poor reputation that overshadows the improvements made since the new management took over.</p></section>"
  }
}