{
  "name": "Taylor Heights",
  "slug": "taylor-heights",
  "company_type": "property",
  "address": "2115 Taylor Ave, Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 3.69,
  "reviews": {
    "google_reviews": [
      {
        "author": "keashaa",
        "rating": 1.0,
        "review": "I wish I could give zero stars, they never answer their phone, that'd be fine if they responded to emails but they don't do that either. They always have an excuse as to why they can't answer the phone or why they didn't respond to emails but how can you have the same excuse every time. Once is okay, twice maybe a coincidence but every single time? That's just their habits at this point, I think I've only got them when I called one time. Going straight to the leasing office is the best way to contact them and they're not even there on time majority of the time and even if they're there, the sign says their open, and their cars are in the parking lot, they have the door locked and don't respond to knocking on the door or phone calls. They say they'll be back at one time and don't return until way past that time. Contacting them is their main issue and also the most important one. All the apartments have different things though we all say the same price. Some have nicer washer dryers, the bathrooms are different the flooring and kitchens are different. If youre going to have different values in each apartment the prices should reflect that or they should all be upgraded the same. Why is the hot water heater in the closet? It takes up half the room for me to put clothes, yet I pay the same price as others with a full closet? It's a nice community of college students but staff even thought theyre doing their best fails miserably when it comes to contacting them.",
        "ownerResponse": null
      },
      {
        "author": "Andres antal",
        "rating": 5.0,
        "review": "Andres Antal\n 19 August 2017\nI lived in Taylor Heights, one of the buildings managed by Pacific Living Properties (WWU Living), from Summer 2015 to Summer 2017.\n\nI would rate 4.5 stars if I could.\n\nDon't pay attention to reviews prior to September 2016; a different company, Painless Properties, managed the property during that time.\n\nSince Pacific Living Properties (PLP) took over, they invested a lot of time and money into the property. Unfortunately, a lot of residents, myself included, had to deal with constant construction, but that has been mostly completed. The property needed the work--BADLY. The previous management let it fall into shambles. Otherwise, it's a pretty good property, and I had an overall positive experience living here.\n\nPros:\n-You're on an individual lease; you don't need to hassle your roommates for rent money.\n-It's the cheapest single lease you will find remotely close to campus.\n-Sufficient parking, it would get tight on Sunday nights during the school year, but I always managed to park on the same block that I lived on.\n-Literally right next to campus\n-The office is located on site, and they are open 7 days a week.\n-The office staff is personable and tries to get to know residents, but I may be biased since I am working here.\n-The leasing office immediately texts you when they receive a package for you\n-Maintenance is prompt with work orders\n-Flat rate utilities\n\nCons:\n-Shared living\n-Random roommates if you don't come with a group--I've had mostly positive experiences\n-WiFi can be spotty in some rooms, but there are workaround. I had my own free modem\n\nFurther notes:\n-Leases generally start in September; if you want a good deal for September, start looking in early Spring\n-The rent may seem high, but they fill quickly--SIGN A LEASE EARLY.\n-In 2017 rooms were completely filled up by mid-August\n-If you want cheap housing, move to the Southwest. $350 a m/o for gorgeous new apartments",
        "ownerResponse": {
          "text": "Thank you for your review Andres."
        }
      },
      {
        "author": "Kristan Kottcamp",
        "rating": 1.0,
        "review": "I really wish I could give a zero star. The apartment itself is fine enough but the staff and management have been entirely useless ever since I moved in. It has been a complete nightmare. I wish I could escape but they lock you under a fascist lease agreement with very little options to get out. This place should honesty be shut down.",
        "ownerResponse": {
          "text": "Hello Kristan, Thank you for taking the time to leave your feedback. We are sorry to hear you do not care for our management team. We believe they do a wonderful job, and care about the wellbeing of our residents. We would like to hear more about your experience, as we believe feedback you provide could be a valuable coaching opportunity if we missed the mark. If you have additional information you wish to share regarding your experience, please reach out to me personally at customerservice@plpinc.net. Thank you! Kailey"
        }
      },
      {
        "author": "Sander Bakkely",
        "rating": 4.0,
        "review": "A bit difficult to get fully set up but afterwards was pretty painless!",
        "ownerResponse": null
      },
      {
        "author": "Yoel Merhu",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you for your review. We're sorry to see that you aren't pleased with your experience, and if there is anything we can do to improve, please let us know."
        }
      },
      {
        "author": "rosario mendoza",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Cole Price",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kev",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "oh beans",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jenna Brock",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Barbara Hawkins",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mary Burke",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Mary,\n\nThank you for your review. I am sorry to hear about your experience this far, but we will work hard to change your experience moving forward. It has been an incredibly busy time trying to move out all the former residents and move in all the new residents. If you need immediate response with any questions or issues, our office is open from 9:00am to 6:00pm. We would love to sit down with you and assist you any way we can. We are happy to have you as a resident, and want to turn this into a great experience for you!\n\nBest of luck with school starting right around the corner.\n\nSincerely,\n\nYour team at WWU Living"
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Avriel M.",
        "rating": 1,
        "review": "I wish I could keep them at zero stars, they never answer their phone, that'd be fine if they responded to emails but they don't do that either. They say they'll be back at one time and don't return until way past that time. They always have an excuse as to why they can't answer the phone or why they didn't respond to emails but how can you have the same excuse every time. Once is okay, twice maybe a coincidence but every single time? That's just their habits at this point, I think I've only got them when I called one time. Going straight to the leasing office is the best way to contact them and they're not even there on time majority of the time and even if they're there, the sign says their open, and their cars are in the parking lot, they have the door locked and don't respond to knocking on the door or phone calls. Parking is awful, the spaces are tight. My apartment had to use pliers to start our dryer for majority of the lease. All the apartments have different things though we all say the same price. Some have nicer washer dryers, the bathrooms are different the flooring and kitchens are different. It's a nice community of college students but the place is annoyingly atrocious",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.4,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is a summary generated by ChatGPT and only intends to serve as a tool to help users find a property management company or rental property. It is based on user reviews and does not contain any identifiable information about the reviewers. The aim of this article is to present a balanced overview of the different experiences shared by the occupants or clients of Taylor Heights. The sentiment expressed in the sections below reflects the themes common in the user reviews available for this property.</p>  </section>    <section>    <h2>Good</h2>    <p>Residents of Taylor Heights appear to appreciate the proximity to campus, making it an ideal location for students. The property is frequently cited as the most affordable single lease option near the campus, which is a significant advantage for those on a budget. Additionally, ample parking, even though tight on certain occasions, seems to consistently be available close to the residents' apartments.</p>    <p>The community reportedly exhibits a collegial atmosphere, favored by college students who constitute a majority of the occupants. Several users commend the efforts of the management in trying to foster personal interaction and getting to know the residents. The convenience of an on-site office that is open seven days a week has been noted as a positive aspect by some reviewers, along with the prompt and effective maintenance response that residents experience.</p>  </section>    <section>    <h2>Great</h2>    <p>One reviewer speaks highly of the significant improvements made to the property since the new management company took over. Investments in time and resources have been noticeable, resulting in essential renovations that were much needed after previous management let the property deteriorate. User reviews express satisfaction with the new individual lease terms and the installation of a flat rate for utilities, enhancing the appealing aspects of living at Taylor Heights.</p>    <p>Another aspect that received praise is the package handling system. The leasing office ensures residents are promptly texted upon the arrival of packages, which adds a layer of convenience. Moreover, the staff's attempts to establish a personal rapport with the residents, including efforts to be approachable and provide a community vibe, were seen in a positive light by several reviewers, which helps in delivering a more comfortable living experience.</p>  </section>    <section>    <h2>Bad</h2>    <p>Despite the convenient location and affordability, there are accounts of residents experiencing difficulty with the property's administration. The most common complaint seems to be the inability to get in touch with the staff, as phone calls and emails often go unanswered. This poor communication is a recurring theme in the reviews, with frustration expressed over the apparent lack of responsiveness, which has left several residents feeling neglected, and questioning the management's reliability.</p>    <p>There are inconsistencies in the quality and amenities across different apartments, which have led to concerns about the fairness of uniform pricing. Some tenants feel that the apartments are not equally upgraded and that the differences in offerings such as appliances and room sizes should be reflected in the pricing. The physical placement of elements like hot water heaters in inconvenient locations, taking up significant room space, is a specific example of the inconvenience faced by some renters.</p>  </section>    <section>    <h2>Ugly</h2>    <p>One of the most severe accusations from a tenant is that the management operates under a \"fascist lease agreement,\" suggesting oppressive or inflexible terms that leave little room for tenants to maneuver or address grievances. This kind of harsh criticism points towards a deep level of dissatisfaction and a desperate desire for improved management engagement. Furthermore, negative sentiment escalates with the mention of a dysfunctional laundry appliance requiring unorthodox methods to operate, implying neglect in maintenance and equipment standardization.</p>    <p>Moreover, parking, while available, has been described as inadequate by a user who labels the situation as \"atrocious,\" coupled with the description of the general attempt to get issues resolved with management as a \"complete nightmare.\" These experiences highlight extreme resident exasperation and suggest that, for some, Taylor Heights falls short of providing a satisfactory living environment and responsive property management.</p>  </section></article>"
}