{
  "name": "The Village Apartments",
  "slug": "the-village-apartments",
  "company_type": "Property",
  "address": "3310 Alderwood Ave Bellingham, WA 98225",
  "review_count": 5,
  "average_rating": 1.2,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "C G.",
        "rating": 1,
        "review": "Believe online reviews. Apartments.com rent.com google.com, they are all accurate!!   Walk away!! It's incredibly unfortunate that noone has done anything for current or past tenants. \nDefinition of slumlord\n\n:a landlord who receives unusually large profits from substandard, poorly maintained properties.",
        "owner_response": null
      },
      {
        "author": "Joshua D.",
        "rating": 1,
        "review": "Your review helps others learn about great local businesses.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.\n\nWOW is all I can say. Simply called to get basic information about complex. The women who answered was extremely unprofessional, had no idea of the square footage, or rent rates on any of the units. \nEvery question I asked was met with \"I don't know\" or \"I don't have that available\" We established that there were no units available this month early in the phone call, and that I was looking for information, nothing more. This was met with indifference, and dismissal.\n\nIf it was management that answered......\n\nGood Luck to anyone who Rents here... let alone looking INTO renting Lmao!\n\nyou gonna need it.",
        "owner_response": null
      },
      {
        "author": "Tyler L.",
        "rating": 1,
        "review": "Horrible. Horrible. Horrible landlord/ manager. Sharlene should not be the manager. She doesn't care about the tenants or anybody but herself. She refuses to work with you to make your stay here even remotely livable. Mold is everywhere because nothing is insulated right and not up to code. She refuses to fix it and blames you for it. She will not give you your direct depot back because of the mold and other things that are wrong with the place and blame you for it! Her dogs are always barking. I've recently called animal control because they will not stop barking. She is just a horrible human being. I've never met somebody so mean and heartless. Her bubbly attitude is all an act. TRUST me.",
        "owner_response": null
      },
      {
        "author": "John S.",
        "rating": 1,
        "review": "Apartments are not maintained at all. Management lies about everything and is slow to respond to problems. Lied about laundry machines not being coin operated(they are). Mold grows in the attic and they blame you for all of it. Ventilation fans do not work adequately. Bathroom was not sealed properly and led to water damage, which was blamed on me.  Management is very threatening and manipulative. Witnessed them perform unwanted door unlocks on other tenants and billing them for it. You will not get your deposit back no matter how much you clean. In fact they will invent anything they can to scam you for money as you leave. Hire a licensed mold inspector to come in before you leave. You will need it.",
        "owner_response": null
      },
      {
        "author": "Edward A.",
        "rating": 2,
        "review": "when we moved here two years ago, there was an excellent manager and an outstanding maintenance man.  both are gone now. the grounds and the apartments themselves have deteriorated.  the owners do not care about the welfare of the tenants.  these apartments do not have central heat or air. they are hot in the summer and very cold in the winter.  now that the maintenance man has quit (a significant loss) it is difficult to have a work order filled.  I would not recommend this place to anyone.  \n'",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 1.2,
  "distribution": {
    "1": 4,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739205630,
    "text": "<section id=\"good\"><h2>Good</h2><p>Though finding positive feedback for The Village Apartments is challenging, there are glimmers of praise from the past. According to a review, there was once a competent and helpful management team, along with a skilled maintenance man, which made the living experience pleasant for residents. This indicates that at one point, the community and its management worked harmoniously to provide a decent living environment.</p><p>Unfortunately, despite these past instances of positivity, the current sentiment seems significantly less favorable, leaving the good elements as stories from a better-managed time rather than the present standard. The historical glimpse into better management suggests potential for improvement if the property were to re-adopt previous practices.</p></section><section id=\"great\"><h2>Great</h2><p>It appears that there are currently no user reviews describing any aspects of The Village Apartments as \"great.\" The previous manager's reputation and maintenance service might have fit this category, but the lack of recent positive reviews makes it challenging to find recent examples of greatness. The article aims to shed light on the current state of affairs rather than live off past glories.</p></section><section id=\"bad\"><h2>Bad</h2><p>Many user reviews reflect dissatisfaction with The Village Apartments, particularly with the management and living conditions. A common theme is the unprofessional and unhelpful nature of interactions with staff, as reviewers reported issues such as lack of knowledge about unit details and indifferent responses to inquiries. This suggests a significant communication gap that leaves potential tenants frustrated and current tenants neglected.</p><p>Other criticisms include the deteriorating state of the apartments, as noted by residents who experienced faulty insulation, poor ventilation, and inadequate maintenance. The absence of central heat and air further exacerbates the discomfort, leading residents to describe the conditions as unbearable during extreme seasons. Such feedback readily points to neglected management duties exacerbating tenant dissatisfaction.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The Village Apartments have been portrayed in user reviews as having serious management and maintenance issues. Several reviews highlight allegations against the management of deceptive practices, such as unjustly withholding security deposits and fabricating damages to charge tenants unfairly. Mold growth and water damage, blamed on poor insulation and substandard ventilation, have been reported as persistent problems, which management refuses to address adequately.</p><p>One review describes invasive practices, such as unauthorized entry into tenants' apartments, contributing to an atmosphere of distrust and manipulation. Such experiences align with accusations of the management being threatening and uncooperative, painting an alarming picture of the property's operations. With no response from ownership to these reviews, the absence of accountability or attempts to resolve these issues creates an unpleasant scenario for any current or future tenant.</p></section>"
  }
}