{
  "name": "The Meadows by Vintage",
  "slug": "the-meadows-by-vintage",
  "company_type": "Property",
  "address": "355 Meadowbrook Ct, Bellingham, WA 98226",
  "review_count": 95,
  "average_rating": 3.62,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tanner B.",
        "rating": 5.0,
        "review": "My opinion on these apartments may be biased because when I was young I used to hang out here and stay with friends (back when they were Larkin Apartments)\n\nI live here now and have to say the apartments are big. The neighborhood is nice. There's trails right behind the apartments. Plenty of places to walk.\n\nThe people who work in the office are nice.\n\nJust as with any apartments you have to deal with certain things. But I don't hear my neighbors and they have said they don't hear me. Which is a blessing because I have 3 kids and live on the 3rd floor :)",
        "ownerResponse": {
          "text": "Hi. It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "tari blakesley",
        "rating": 5.0,
        "review": "Thanks Casey and Jim for the new toilet. It works  awesome. Casey did a great job on installing it in such a quick time, that I could not believe it was completed in such a record time. thanks again and I really appreciate the immediate response.",
        "ownerResponse": {
          "text": "tari, \n\n Theres nothing better than hearing our Meadows by Vintage customers positive feedback! Thanks for sharing your experience with us. \n\nJames DeGolier, Community Director, meadows.cd@fpimgt.com"
        }
      },
      {
        "author": "Ayelet Y",
        "rating": 5.0,
        "review": "We lived at the Meadows apartments for a year before we had to relocate for work.\n\nWe loved our spacious, comfortable and affordable apartment from the first moment we stepped in there and saw the duck pond from the living room door to the balcony.\n\nIt was a delight to be able to watch the view, the seasons change, the sun rise and the wild life at the pond from our porch. We did move in during the winter and it was very quiet. It does get noisier in the summer with the ducks, bull frogs and kids running around, but these are all sounds that I like hearing, so it wasn't an issue for me.\n\nThe one thing that I would change if I could was the insanely long paperwork process we had to go through to rent the apartment. We had no clue what we were getting into and probably wouldn't go through it if we knew, so it's good that we didn't. That's not on the company, it's the state requirements for this type of rental.\n\nFortunately for us, Jim, the office manager, helped us with every needed step. He truly has endless patience and we're super grateful for his professional help and support throughout the whole process and generally the whole time we lived there.\n\nJim also handled every request we had for things that needed to be fixed in the house very quickly and we very much appreciated having Casey, the maintenance man with a huge heart, come over and take care of things, when needed.\n\nAll together we liked the location, the neighborhood, the apartment, the view, the price and the good service we got from Jim and Casey, so I recommend this place to anyone who is willing to go though the lengthy required rental process.",
        "ownerResponse": {
          "text": "Hi Ayelet, we enjoyed having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback.  If you ever need any assistance in the future, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "lisa melia",
        "rating": 2.0,
        "review": "Maintenance super slow to respond. Ive been waiting over a month to have a functioning kitchen sink!",
        "ownerResponse": {
          "text": "We apologize for the delay. We're addressing this issue urgently to rectify it as soon as possible.\n"
        }
      },
      {
        "author": "tammy stewart",
        "rating": 5.0,
        "review": "Once again we had Casey and his associate in our apartment fixing several issues. Im always impressed with the efficiency and quality of the work. Way to go guys - thank you.",
        "ownerResponse": {
          "text": "Hi Tammy. It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Rebecca Jones",
        "rating": 5.0,
        "review": "Always clean around the property. Pretty quiet for being that big of an apartment complex. I love the apartments. The wood floors are dark but with enough lighting it's not too bad.",
        "ownerResponse": {
          "text": "Rebecca, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Cassiah Givens",
        "rating": 3.0,
        "review": "The light on my stairs is broken and it's been a week and a half if not longer,  It makes it hard to leave my house after dark, I even fell and broke my phone. I put in a maintenance request about a week ago and they haven't even came to look at it or try to fix it. Don't move into these apartments if you want your things to be fixed  without hassle.\n\nUpdate: Its now fixed, things are crazy right now because they are giving the place a face lift. I was told that's why it took so long",
        "ownerResponse": {
          "text": "Hi, Cassiah. Thanks for reaching out regarding your concerns about lighting issues. We value your feedback and use your comments to help us provide top-notch service for all our residents. Were sorry for any inconvenience you might have experienced. Please email us at meadows.cd@fpimgt.com so we can discuss this matter further and find a satisfactory solution as soon as possible. We look forward to hearing from you."
        }
      },
      {
        "author": "Alexa Kok",
        "rating": 2.0,
        "review": "I have lived here for five, almost six years and seen MANY changes. One of the most constant things that I have noticed is the kind, courteous, and professional way that I have been treated over the last several years. Living with a disability can be tough, but the staff here have never failed to treat me with the same kindness, and understanding as I treat them, and I really love that.  The rent here is super low, and the newest landlady, Melissa has been absolutely amazing. Her solid work ethic, big heart, and dedication have really done wonders in improving the place to not just livable, but absolutely high quality, family living. I wake up each and every day, and I know that I am blessed to have not just a lovely apartment, great room mates, and the most wonderful land lady and staff that I could ever ask for \n\nUpdate: I have lived here for ten years now and am now seeing some very big changes. The leases offered are now only 30 days which feels scary and sort of unstable but I may end up liking the auto renew more I'm not sure yet.  Parking is now all paid (you pay to register your car and now also pay additionally if you'd like it covered which is fine) I've recently had alot of experiences that have been really hard for me emotionally but I've chosen to leave them out. What I will tell you is this. Read reviews before moving in. Then make your decision. There are many pros to living here. After ten years this place has felt like my home. The location is PERFECT right on the busline every 30 minutes. Walking distance from Cordata school and whatcom community college, the mall and several stores. The maintenance guy Casey is kind, professional and experienced. I don't really have much else to say so I guess that's my update :)",
        "ownerResponse": {
          "text": "Name], thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Lance Schaumberg",
        "rating": 1.0,
        "review": "As mentioned earlier, this place has the makings of a real gang-infested complex. Section 8, SSI, welfare, and other such recipients make up a good chunk of the people here. I could write stories here of what I've seen and heard, but there might be children reading this. The weekend noise is awful, especially the drunks coming in at 2AM. Many parents let their children run loose in the parking lot all day unsupervised. The resulting noise is unreal. This may change in the winter. I'm not going to be here to find out (thank God). Good bye and good riddance! Avoid like plague. I should also mention that I made an appointment to sign the lease at move-in time and was rescheduled (to a later day) half an hour before the arranged time because, I was told, the person who had an appointment before me was late. Not my problem. Also overheard management in confrontations with other staff in front of tenants. Highly unprofessional. If you move here, you will be sorry.",
        "ownerResponse": {
          "text": "Lance, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Rosario Medina",
        "rating": 1.0,
        "review": "I want explanations on the behavior of Jim. He gave a wrong number for his supervisor when I complained to him about his behavior and I requested to discuss the issue with his supervisor.\n\nI want his manager to reach me and explain to me why he is employed there.  It is unacceptable that people with his demeanor to others have a positions he has.\n\nI am looking forward to hear from you regarding this matter.\n\nThank you",
        "ownerResponse": {
          "text": "Rosario, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Hang T",
        "rating": 1.0,
        "review": "DO YOURSELF A FAVOR, AVOID THIS PLACE AT ALL COST!!!\n\nThese people were nice and helpful when you live there, once you move out, they will show you their true faces. They billed me $3383 after we moved out!!!!\n\nBefore we moved out, the manager said that we had to pay only until the last day we stayed (which is only 2 days of the new billing circle) then they billed us for the whole month.\n\nThey also billed us for the new carpet replacement of more than $1600 saying that they replaced the carpet before we moved in and after we moved out, which is a lie. Before we moved in we were told to wait for a few days because they just shampooed the carpet. Then after we moved in, the carpet was still wet and it took almost a month till the carpet got dry. I also talked to the new tenant of the apt and he said the carpet was not replaced, they just cleaned it because when he moved in the whole floor was damp.\n\nToday I went there to talk to the manager, she was totally ignorant and rude. She asked me to talk to the credit company that handles my case while she was the one who prepared the bill to cheat my money. She even threatened to call the police on me. Such a horrible place, I so regret that I gave them 2 years of rent.\n\nThe Meadows by Vintage, dishonest business won't get you anywhere! You guys are supposed to help low income people, not to scam them. I hope there will be more people who raise their voices so police will investigate this place.",
        "ownerResponse": {
          "text": "Thank you for reviewing our community as feedback from former residents can be valuable to us. We regret any issues with your security deposit, especially because our team aims to communicate all policies and charges related to move-out in advance. We are discussing your situation with our team and someone will contact you shortly to discuss this further. In the meantime, if you wish to reach out to us, please email us at meadows.cd@fpimgt.com. We appreciate your review and wish you well."
        }
      },
      {
        "author": "tammy stewart",
        "rating": 5.0,
        "review": "I was not home when they came to fix my wash machine. I told them they were welcome to go in and service my machine without my being there. They did the repair and left without a hitch. Thank you!",
        "ownerResponse": {
          "text": "Hi Tammy, we enjoy having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback. We look forward to offering you many more positive experiences in our community. If you ever need any assistance, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "Nikki Love",
        "rating": 1.0,
        "review": "If I could give this place a 0 star i would..AVOID THIS PLACE! It recently got a remodel on the outside but the managment doesnt want to fix anything and always say that its not in their budget. The maintence guy/guy whos takes care of the garbage or icing, doesnt do ANYTHING. Literally avoids picking up the trash until he has to and the management doesnt seem to care but just smokes with her on their breaks. They just act like they dont really care about the residents concerns at ALL.",
        "ownerResponse": {
          "text": "Hi, Nikki. Thanks for reaching out regarding your concerns about the property maintenance. We value your feedback and use your comments to help us provide top-notch service for all our residents. Were sorry for any inconvenience you might have experienced. Please email us at meadows.cd@fpimgt.com so we can discuss this matter further and find a satisfactory solution as soon as possible. We look forward to hearing from you."
        }
      },
      {
        "author": "Garrett",
        "rating": 1.0,
        "review": "After reviewing some correspondence from Jim to some of his residents, I feel forced to leave a negative review. His inability to treat people like people instead of numbers is unprecedented, and I suspect fair housing laws are being violated at this property.",
        "ownerResponse": {
          "text": "Garrett, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your satisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Sherri Pullar",
        "rating": 2.0,
        "review": "Just wondering if new tenants have to purchase parking decals @ $50 (limit 2 vehicles per household) or just current tenants who purchased a vehicle not even two weeks ago and currently has only one vehicle registered. Inforcinging new parking policies within the last month I would think as a courtesy (and as a current resident) I would be allowed 2 decals free of charge, (since decals were not required before) I'm just curious cause my household was down a vehicle at the time of new parking policies last month, and now I'm required to purchase a decal, so does this mean all new residents and new vehicles with be charged $50? Is there now a limit to one vehicle per household?",
        "ownerResponse": {
          "text": "Thank you for sharing your experience in our community. Our team strives to thoroughly explain the pricing, amenities, and services included in the lease. We regret any confusion and would be happy to clarify any concerns you\nmay still have. Please stop by the office or contact us at meadows.cd@fpimgt.com to discuss this further. We look forward hearing from you."
        }
      },
      {
        "author": "Kori Austin",
        "rating": 5.0,
        "review": "Maintenance was really nice and fun",
        "ownerResponse": {
          "text": "Kori, \n\n Thanks for visiting Meadows by Vintage! It means so much when customers share their positive experiences with us. Thank you for your 5 star review. \n\nJames DeGolier, Community Director, meadows.cd@fpimgt.com"
        }
      },
      {
        "author": "Emily Banford",
        "rating": 1.0,
        "review": "A friend of mine lives here and honestly after reading some recent correspondence  with them and the manager, Jim, i would leave a zero star review if i could. The Manager does not follow proper RCW codes and is extremely unprofessional.",
        "ownerResponse": {
          "text": "Emily, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Maribel Ortiz",
        "rating": 5.0,
        "review": "Jackie and her staff were so gracious and knowledgeable not only about there property, but the surrounding area as well.  It made us feel like we were already home.",
        "ownerResponse": {
          "text": "Name], thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Daniel Ascencion",
        "rating": 4.0,
        "review": "good to say these apartments are the best are very good very clean apart from that they are finishing remodeling and they are putting an excellent floor the truth and good although they are a bit far from the establishments that for me is not a problem why the They are really in a place very not to say too calm if you do not like the noise of the city well let me tell you that this place is excellent for that since here is a very quiet place with very friendly people apart from the maintenance it is excellent in its work in order a magnificent place have excellent year 2018...!!!!",
        "ownerResponse": {
          "text": "Hi Daniel, we enjoy having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback. We look forward to offering you many more positive experiences in our community. If you ever need any assistance, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "Kris Countryman",
        "rating": 1.0,
        "review": "Unprofessional and rude office ladies! Glad we didn't get the place for some bs non compliance rule. Once they found that out, even though no one bothered to call me, they acted as if they didn't know me and hung up on me twice!",
        "ownerResponse": {
          "text": "Kris, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Alyssa Bavaro",
        "rating": 1.0,
        "review": "Horrible management. Jim is racist & is very unprofessional & makes it very clear he doesnt know what hes doing.  They are scam artist & will try to get every penny out of you. Dont not recommend living here just because its cheap.",
        "ownerResponse": {
          "text": "Alyssa, we're sorry that your move-out experience left you feeling disappointed. Our team aims to provide our residents the highest quality of service, even as they move on to a new home. Please accept our sincere apologies and know that we value all resident feedback. If we can address any unresolved concerns with the fees you were charged, then please email us at meadows.cd@fpimgt.com at your convenience. Thank you, and we wish you the best in your new home."
        }
      },
      {
        "author": "Ashley",
        "rating": 5.0,
        "review": "We lived there for 4 years and management was always great, I felt safe with my kids playing outside and the apartments are spacious.",
        "ownerResponse": {
          "text": "Ashley, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "B",
        "rating": 1.0,
        "review": "They dont salt or shovel the snow on the sidewalks or roads, making it a safety hazard for everyone. At least salt it! You dont really have to put that much back bone into it.",
        "ownerResponse": {
          "text": "Hello and thank you for taking the time to bring these issues to our attention. While we want to address your concerns, we are unable to contact you as your review is anonymous. Please reach out to our team at meadows.cd@fpimgt.com at your earliest convenience. We look forward to hearing from you and working to improve your living experience."
        }
      },
      {
        "author": "Clinton MacLeod",
        "rating": 4.0,
        "review": "9-5 hours. It's another decent rental company. Not the worst by any means, but at the same time nothing to set them apart.",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Tad Bock",
        "rating": 5.0,
        "review": "Casey always knows what he's doing and gets the job done. His attention to detail is much appreciated.",
        "ownerResponse": {
          "text": "Hi Tad, we enjoy having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback. We look forward to offering you many more positive experiences in our community. If you ever need any assistance, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "Maxim Anderson",
        "rating": 1.0,
        "review": "Dirty place and poor management. People leave trash out on patios and raccoons tear open bags at night. Most people that leave at this place are on welfare and smoke weed on balcony in front of their kids.",
        "ownerResponse": {
          "text": "Maxim, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Jojo Mars",
        "rating": 1.0,
        "review": "Common issues\n*lights was blinking and asked help since they refused to let us do it ourselves\n*washing machines they won't fix it themselves and won't admit they are broken\n*Service is lacking you would have to wait for months when they estimate within weeks for maintenance\n*there is a black mold infestation, that was covered by paint but will high probability to return\n*The people at the office are ill-mannered\nIt's okay to live there at a short period,but not reccomend  a long prolonged stay.",
        "ownerResponse": {
          "text": "We are disappointed to see you dissatisfied with our response to your service request. Please know that our maintenance team works diligently to resolve residents inquiries in a timely and efficient manner. As we look into your feedback, if there is anything else you wish to share, please contact our team at 360-715-9401. We are committed to earning your 100% satisfaction in our community. Thanks for your review."
        }
      },
      {
        "author": "Chris Beaulieu",
        "rating": 5.0,
        "review": "Melissa and the rest of the property management staff are friendly, professional and hard working. I really enjoy living at this complex.",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Jeffrey Goins",
        "rating": 5.0,
        "review": "Very respectful and courteous. Mike was very patient with us while we asked questions",
        "ownerResponse": {
          "text": "Jeffrey, it means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Calle Anne",
        "rating": 1.0,
        "review": "Honestly I don't know how anyone even lives here. I have emailed and called multiple times just requesting a little bit of information because they keep posting on craigslist. However, they can't even send me an email or give me a call back! Disappointing.",
        "ownerResponse": {
          "text": "Callie, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "E",
        "rating": 5.0,
        "review": "Very professional. I don't live there but I did inquire about residency, requirements, etc. Very friendly and knowledgeable staff",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Alicia Basham",
        "rating": 1.0,
        "review": "They let tenants suffer because they didnt take care of a sewer problem they knew about, its very close to slum lord.",
        "ownerResponse": {
          "text": "Alicia, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Gail Northey",
        "rating": 5.0,
        "review": "My sister and brother in law live there. They love it. Nice place.",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Dalia Huerta",
        "rating": 4.0,
        "review": "The apartment is very good for a nice family and there remodeling them and there looking really good.",
        "ownerResponse": {
          "text": "Dalia, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Jonathan Daniel",
        "rating": 2.0,
        "review": "Management is not around when they say they will be. Maintenance is aggravatingly slow with completing repairs.",
        "ownerResponse": {
          "text": "Hi, Jonathan. Thanks for reaching out regarding your concerns about slow repairs. We value your feedback and use your comments to help us provide top-notch service for all our residents. Were sorry for any inconvenience you might have experienced. Please email us at meadows.cd@fpimgt.com so we can discuss this matter further and find a satisfactory solution as soon as possible. We look forward to hearing from you."
        }
      },
      {
        "author": "A R",
        "rating": 4.0,
        "review": "Friendly and warm feeling, the staff and seniors seemed to all get along.",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Zeya187",
        "rating": 5.0,
        "review": "The new office lady Melissa is super nice, she works hard!",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Christopher Buss",
        "rating": 5.0,
        "review": "My friend has an apartment here pretty roomy... Seems great!",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "david cummins",
        "rating": 5.0,
        "review": "Great ol' tymie feel with cheap rent to boot!  Glad they fina",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Cristynn Portillo",
        "rating": 5.0,
        "review": "The management team is phenomenal and the neighborhood is wonderful!",
        "ownerResponse": {
          "text": "Hi Cristynn, we enjoy having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback. We look forward to offering you many more positive experiences in our community. If you ever need any assistance, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "Love Bts",
        "rating": 3.0,
        "review": "Ok for the price with lots of interesting characters.",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at meadows.cd@fpimgt.com to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Godisgood",
        "rating": 1.0,
        "review": "Some of the lowest life individuals live here. Don't rent from here",
        "ownerResponse": {
          "text": "Jacob, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Tracy Smith",
        "rating": 5.0,
        "review": "Nice place clean and nice ppl there .",
        "ownerResponse": {
          "text": "Tracy, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "jennifer willison",
        "rating": 5.0,
        "review": "Love my apt and it's quiet",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Four",
        "rating": 3.0,
        "review": "Eh. Not great, but its nice I guess...",
        "ownerResponse": {
          "text": "Thank you for sharing your review. Our team believes in going above and beyond to provide the most comfortable and convenient living experience for our residents, and wed like to connect with you to better understand your rating choice. When you have a moment, please email us at meadows.cd@fpimgt.com, so we can learn what would improve your living experience."
        }
      },
      {
        "author": "Michele Gailey",
        "rating": 4.0,
        "review": "Small but nice apartments",
        "ownerResponse": {
          "text": "Michele, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Raine McGovern",
        "rating": 3.0,
        "review": "Safe place to raise a family",
        "ownerResponse": {
          "text": "Thank you for sharing your review, Raine. Our team believes in going above and beyond to provide the most comfortable and convenient living experience for our residents, and wed like to connect with you to better understand your rating choice. When you have a moment, please email us at meadows.cd@fpimgt.com, so we can learn what would improve your living experience."
        }
      },
      {
        "author": "Kevin Studer",
        "rating": 2.0,
        "review": "Just don't seem right",
        "ownerResponse": {
          "text": "Kevin Studer, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "DAndy Brothers",
        "rating": 1.0,
        "review": "The office is closed all the time",
        "ownerResponse": {
          "text": "Hello and thank you for taking the time to bring these issues to our attention. While we want to address your concerns, we are unable to contact you as your review is anonymous. Please reach out to our team at 360-715-9401 at your earliest convenience. We look forward to hearing from you and working to improve your living experience."
        }
      },
      {
        "author": "The Cats M",
        "rating": 3.0,
        "review": "Lots of turnover in management",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at 360-715-9401 to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Jennifer Carnahan",
        "rating": 2.0,
        "review": "Cars get keyed",
        "ownerResponse": {
          "text": "Jennifer, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Cari H",
        "rating": 5.0,
        "review": "Went to see a friend",
        "ownerResponse": {
          "text": "Cari, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Carl Graber",
        "rating": 4.0,
        "review": "good place to live",
        "ownerResponse": {
          "text": "Carl, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "The Meliadonpepe",
        "rating": 5.0,
        "review": "Lots of kids.",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Bryana Kerntke",
        "rating": 3.0,
        "review": "Okay apartments",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at meadows.cd@fpimgt.com to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Medhat Khairy",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Dear Medhat, \n\n Thank you for your positive feedback! Our goal is to continue to provide a 5 star experience. We appreciate you and your business. \n\nJames DeGolier, meadows.cd@fpimgt.com"
        }
      },
      {
        "author": "Quinn Falcone",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "\"Thank you for your fantastic rating!\""
        }
      },
      {
        "author": " ",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "\"Thank you! Your satisfaction matters.\"\n"
        }
      },
      {
        "author": "Eddie Holmes",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Cambria Pederson",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Cambria, we enjoy having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback. We look forward to offering you many more positive experiences in our community. If you ever need any assistance, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "Milangela Diaz",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review.\r\n\r\n"
        }
      },
      {
        "author": "Santiago Olivares",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Santiago, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Denise Prowell",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at 360-715-9401 to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Halee Goodie2",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Ava Garfield",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Ava, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your satisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Jennifer Neustedt",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi, Jennifer. Thanks for reaching out regarding your concerns about your maintenance issue. We value your feedback and use your comments to help us provide top-notch service for all our residents. Were sorry for any inconvenience you might have experienced. Please email us at meadows.cd@fpimgt.com so we can discuss this matter further and find a satisfactory solution as soon as possible. We look forward to hearing from you."
        }
      },
      {
        "author": "Andy",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We appreciate working with our vendors like you to maintain a quality property.  We'd like to know any steps we can take to improve your experience, so please contact us at 360-715-9401 to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Cindy S",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Cindy, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Megan Lucas",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Megan, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Jesse Pullar",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Jessika Carr",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Name], thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Corie Jeffery",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Jasmine Gutierrez",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Darcy Lindenmuth",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Jacqueline Hall",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Name], thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "ShadyBacon",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Name], thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Anne Rupe",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Anne, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Jackie Hall",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Name], thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "James",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "James, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Gerent G",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Gerent, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Derek Quenneville",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Derek, thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Michael DuFour",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Dansie Lanz",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Dansie, we enjoy having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback. We look forward to offering you many more positive experiences in our community. If you ever need any assistance, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "Joshua veliz",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "leia neustedt",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Leia, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Ahavah Goldman",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Ahavah, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Alexa Briscoe",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Stephanie Todhunter",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Stephanie, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Jay Town",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Jonathan Sorrell",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Jonathan, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "Skye Veliz",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at 360-715-9401 to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Chena Fisher",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Chena, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      },
      {
        "author": "ValasVixson",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at 360-715-9401 to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      },
      {
        "author": "Jerry Franklin",
        "rating": 2.0,
        "review": "",
        "ownerResponse": {
          "text": "Thanks so much for rating our community. We'd like to know any steps we can take to improve your experience, so please contact us at meadows.cd@fpimgt.com to share any concerns. We appreciate your feedback and look forward to hearing from you."
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Ligma B.",
        "rating": 1,
        "review": "These are one of the worst apartments I've ever been in. The place is old on the inside even tho it looks nice on the outside. The counters are old and chipping off the cupboards are falling apart old appliances old carpet ext. I would not recommend ever living here.",
        "ownerResponse": {
          "text": "Hi, Ligma. Thanks for reaching out regarding your concerns about condition in your apartment. We value your feedback and use your comments to help us provide top-notch service for all our residents. We're sorry for any inconvenience you might have experienced. Please email us at meadows@fpimgt.com so we can discuss this matter further and find a satisfactory solution as soon as possible. We look forward to hearing from you."
        }
      }
    ]
  },
  "adjusted_review_count": 56,
  "adjusted_average_rating": 3.21,
  "summary": {
    "text": "<section><h2>Good</h2><p>Despite some criticism, The Meadows by Vintage has garnered positive remarks for its spacious apartments and pleasant neighborhood, with specific praise towards the nature trails behind the property and the serene views offered by some units, like that overlooking the duck pond. A recurrent theme in the user reviews is the commendable performance of the maintenance team, with Casey being mentioned several times for his efficient and rapid service, leaving residents impressed with the quality of the work completed within their homes.</p><p>Management received applause for their efforts in addressing matters diligently. Field specifics include an instance where maintenance was conducted swiftly for a new toilet installation, with the tenant expressing immense gratitude for the immediate response and exceptional work. A former tenant fondly recollected their time at the property, highlighting the consistently good service received from the staff, particularly Jim and Casey, who provided professional help throughout the rental process and promptly addressed repair requests.</p></section><section><h2>Great</h2><p>In terms of community engagement, the property's effort to keep the premises clean has been noticed and appreciated by residents, contributing to a relatively peaceful living experience for a large complex. Moreover, the property management's responsiveness to positive feedback indicates a desire to maintain good relationships with the tenants. The offices have shown appreciation for positive feedback, and there's evidence of improvements being actively made, with the community director reaching out to residents to express gratitude and openness to providing further assistance when needed.</p><parah>User reviews highlight the congeniality and professionalism of the office staff, with a resident emphasizing their positive experience with staff members who exhibit a strong work ethic and big heart. Residents appear to feel welcomed and at home, thanks to the graciousness of the property’s team. This embracing atmosphere, coupled with a favorable location near daily amenities and educational institutions, seems to contribute to a sense of community well-being.</p></section><section><h2>Bad</h2><p>While there are admirable traits, The Meadows by Vintage is not without its flaws. Residents have voiced complaints about slow maintenance response times, where issues like a malfunctioning kitchen sink were not promptly addressed, resulting in prolonged inconvenience. Additionally, another tenant experienced a delay in the repair of a broken light on their stairs, which posed a safety risk and directly caused personal injury and property damage.</p><p>The leasing process also received criticism for being excessively lengthy and convoluted, despite the help offered by the office staff. A particular problem that stands out is the thirty-day lease offers which, according to a long-time tenant, cause a feeling of instability despite their allegiance to their home of ten years. This, coupled with difficulties in parking policies and apparent changes in management, has led to unease among some residents.</p></section><section><h2>Ugly</h2><p>On a more disconcerting note, some tenants have experienced significant distress regarding management's conduct, with allegations of unprofessional behavior and disputes going unresolved. Cases such as providing a wrong number for supervisor contact and a perceived lack of respect towards residents' concerns are tarnishing the community's image. Furthermore, discriminatory remarks and indications of possible fair housing violations, as noted in a resident's feedback, suggest deeper managerial and ethical issues that may need investigation.</p><p>The most alarming review recounts a former resident being billed exorbitantly upon move-out, contradicting prior assurances about the payment terms. Accusations of deceptive practices, such as false claims of carpet replacement and threats of legal action when concerns were raised, raise serious concerns about the integrity and transparency of the property management. These grievous complaints need immediate attention, both to aid affected individuals and prevent potential exploitation of future or current residents.</p></section>"
  },
  "timestamp": "September 7 2024"
}