{
  "name": "The Meadows by Vintage",
  "slug": "the-meadows-by-vintage",
  "company_type": "Property",
  "address": "355 Meadowbrook Ct, Bellingham, WA 98226",
  "review_count": 10,
  "average_rating": 3.9,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tanner B.",
        "rating": 5,
        "review": "My opinion on these apartments may be biased because when I was young I used to hang out here and stay with friends (back when they were Larkin Apartments)\n\nI live here now and have to say the apartments are big. The neighborhood is nice. There's trails right behind the apartments. Plenty of places to walk.\n\nThe people who work in the office are nice.\n\nJust as with any apartments you have to deal with certain things. But I don't hear my neighbors and they have said they don't hear me. Which is a blessing because I have 3 kids and live on the 3rd floor :)",
        "owner_response": {
          "text": "Hi. It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": " ",
        "rating": 4,
        "review": "My husband and I lived in the Meadows by Vintage for seven months and this gives our impressions a certain validity. The location of this Community speaks for itself: parks, silence, beautiful air. The office staff is caring and we are grateful to Jim and Casey for all their efforts. However, it is obvious that such a small team is not enough to carry out all the work on the complex efficiently. We are glad to meet you and hope that in the future everything will change only for the better. Thank you !",
        "owner_response": {
          "text": "Hey !\n\n Thank you for your 4 star review. We appreciate you and your business. \n\nJames DeGolier, Community Director"
        }
      },
      {
        "author": "Ayelet Y",
        "rating": 5,
        "review": "We lived at the Meadows apartments for a year before we had to relocate for work.\n\nWe loved our spacious, comfortable and affordable apartment from the first moment we stepped in there and saw the duck pond from the living room door to the balcony.\n\nIt was a delight to be able to watch the view, the seasons change, the sun rise and the wild life at the pond from our porch. We did move in during the winter and it was very quiet. It does get noisier in the summer with the ducks, bull frogs and kids running around, but these are all sounds that I like hearing, so it wasn't an issue for me.\n\nThe one thing that I would change if I could was the insanely long paperwork process we had to go through to rent the apartment. We had no clue what we were getting into and probably wouldn't go through it if we knew, so it's good that we didn't. That's not on the company, it's the state requirements for this type of rental.\n\nFortunately for us, Jim, the office manager, helped us with every needed step. He truly has endless patience and we're super grateful for his professional help and support throughout the whole process and generally the whole time we lived there.\n\nJim also handled every request we had for things that needed to be fixed in the house very quickly and we very much appreciated having Casey, the maintenance man with a huge heart, come over and take care of things, when needed.\n\nAll together we liked the location, the neighborhood, the apartment, the view, the price and the good service we got from Jim and Casey, so I recommend this place to anyone who is willing to go though the lengthy required rental process.",
        "owner_response": {
          "text": "Hi Ayelet, we enjoyed having you as our loyal resident. We have been actively working to improve our amenities, and we appreciate the acknowledgment of our efforts. Thanks for taking the time to share your favorable feedback.  If you ever need any assistance in the future, please reach out to us at 360-715-9401."
        }
      },
      {
        "author": "tari blakesley",
        "rating": 5,
        "review": "Thanks Casey and Jim for the new toilet. It works  awesome. Casey did a great job on installing it in such a quick time, that I could not believe it was completed in such a record time. thanks again and I really appreciate the immediate response.",
        "owner_response": {
          "text": "tari, \n\n Theres nothing better than hearing our Meadows by Vintage customers positive feedback! Thanks for sharing your experience with us. \n\nJames DeGolier, Community Director, meadows.cd@fpimgt.com"
        }
      },
      {
        "author": "Larry Sand",
        "rating": 4,
        "review": "So far, pretty ok. Not a bad reveiw at all, only been a couple days, will update when i have more experience. Everyone I've met has been great, esp the front office",
        "owner_response": {
          "text": "Dear Larry, \n\n Thanks for being a part of the Meadows by Vintage family! We cant wait to share your positive feedback with the rest of the team. We hope to continue to provide you with a quality experience. \n\nJames DeGolier, Community Director, meadows.cd@fpimgt.com"
        }
      },
      {
        "author": "tammy stewart",
        "rating": 5,
        "review": "Once again we had Casey and his associate in our apartment fixing several issues. Im always impressed with the efficiency and quality of the work. Way to go guys - thank you.",
        "owner_response": {
          "text": "Hi Tammy. It means so much to read your incredible feedback about our team! We're honored to serve you and are gratified to know how much you value our improvements. Thank you for taking time to leave us your positive review."
        }
      },
      {
        "author": "Alexa Kok",
        "rating": 2,
        "review": "I have lived here for five, almost six years and seen MANY changes. One of the most constant things that I have noticed is the kind, courteous, and professional way that I have been treated over the last several years. Living with a disability can be tough, but the staff here have never failed to treat me with the same kindness, and understanding as I treat them, and I really love that.  The rent here is super low, and the newest landlady, Melissa has been absolutely amazing. Her solid work ethic, big heart, and dedication have really done wonders in improving the place to not just livable, but absolutely high quality, family living. I wake up each and every day, and I know that I am blessed to have not just a lovely apartment, great room mates, and the most wonderful land lady and staff that I could ever ask for \n\nUpdate: I have lived here for ten years now and am now seeing some very big changes. The leases offered are now only 30 days which feels scary and sort of unstable but I may end up liking the auto renew more I'm not sure yet.  Parking is now all paid (you pay to register your car and now also pay additionally if you'd like it covered which is fine) I've recently had alot of experiences that have been really hard for me emotionally but I've chosen to leave them out. What I will tell you is this. Read reviews before moving in. Then make your decision. There are many pros to living here. After ten years this place has felt like my home. The location is PERFECT right on the busline every 30 minutes. Walking distance from Cordata school and whatcom community college, the mall and several stores. The maintenance guy Casey is kind, professional and experienced. I don't really have much else to say so I guess that's my update :)",
        "owner_response": {
          "text": "Name], thanks for leaving us a rating. We're sorry to see your score is not higher, and we wish to understand any concerns you may have that are affecting your\nsatisfaction. Please email us at meadows.cd@fpimgt.com to share your detailed feedback. We are eager to learn what we can do to improve your experience in our community."
        }
      },
      {
        "author": "Cassiah Givens",
        "rating": 3,
        "review": "The light on my stairs is broken and it's been a week and a half if not longer,  It makes it hard to leave my house after dark, I even fell and broke my phone. I put in a maintenance request about a week ago and they haven't even came to look at it or try to fix it. Don't move into these apartments if you want your things to be fixed  without hassle.\n\nUpdate: Its now fixed, things are crazy right now because they are giving the place a face lift. I was told that's why it took so long",
        "owner_response": {
          "text": "Hi, Cassiah. Thanks for reaching out regarding your concerns about lighting issues. We value your feedback and use your comments to help us provide top-notch service for all our residents. Were sorry for any inconvenience you might have experienced. Please email us at meadows.cd@fpimgt.com so we can discuss this matter further and find a satisfactory solution as soon as possible. We look forward to hearing from you."
        }
      },
      {
        "author": "Hang T",
        "rating": 1,
        "review": "DO YOURSELF A FAVOR, AVOID THIS PLACE AT ALL COST!!!\n\nThese people were nice and helpful when you live there, once you move out, they will show you their true faces. They billed me $3383 after we moved out!!!!\n\nBefore we moved out, the manager said that we had to pay only until the last day we stayed (which is only 2 days of the new billing circle) then they billed us for the whole month.\n\nThey also billed us for the new carpet replacement of more than $1600 saying that they replaced the carpet before we moved in and after we moved out, which is a lie. Before we moved in we were told to wait for a few days because they just shampooed the carpet. Then after we moved in, the carpet was still wet and it took almost a month till the carpet got dry. I also talked to the new tenant of the apt and he said the carpet was not replaced, they just cleaned it because when he moved in the whole floor was damp.\n\nToday I went there to talk to the manager, she was totally ignorant and rude. She asked me to talk to the credit company that handles my case while she was the one who prepared the bill to cheat my money. She even threatened to call the police on me. Such a horrible place, I so regret that I gave them 2 years of rent.\n\nThe Meadows by Vintage, dishonest business won't get you anywhere! You guys are supposed to help low income people, not to scam them. I hope there will be more people who raise their voices so police will investigate this place.",
        "owner_response": {
          "text": "Thank you for reviewing our community as feedback from former residents can be valuable to us. We regret any issues with your security deposit, especially because our team aims to communicate all policies and charges related to move-out in advance. We are discussing your situation with our team and someone will contact you shortly to discuss this further. In the meantime, if you wish to reach out to us, please email us at meadows.cd@fpimgt.com. We appreciate your review and wish you well."
        }
      },
      {
        "author": "Rebecca Jones",
        "rating": 5,
        "review": "Always clean around the property. Pretty quiet for being that big of an apartment complex. I love the apartments. The wood floors are dark but with enough lighting it's not too bad.",
        "owner_response": {
          "text": "Rebecca, thanks for the excellent rating! If there's anything we can do to improve your experience even further, please dont hesitate to let us know."
        }
      }
    ]
  },
  "adjusted_review_count": 10,
  "adjusted_average_rating": 3.9,
  "distribution": {
    "1": 1,
    "2": 1,
    "3": 1,
    "4": 2,
    "5": 5
  },
  "summary": {
    "created_timestamp": 1739095162,
    "text": "<section id=\"good\"><h2>Good</h2><p>Many user reviews highlight the spaciousness and comfort of the apartments at The Meadows by Vintage. Residents appreciate the scenic views, such as the duck pond visible from their porches, which adds to the overall living experience. The quiet environment, especially during winter, is another positive aspect, allowing families to feel at home without the disturbances typically associated with apartment living. Furthermore, tenants often express satisfaction with the property's cleanliness and maintenance.<br>Positive remarks frequently focus on the helpfulness of the staff. Users have noted the attentive service provided by the office team, specifically highlighting a particular manager who goes above and beyond to assist residents with their needs. The quick response times for maintenance issues also stand out, with several users acknowledging the prompt and efficient service from maintenance staff, which enhances their overall satisfaction with their living situation.</p></section><section id=\"great\"><h2>Great</h2><p>In addition to the overall quality of living, The Meadows by Vintage's convenient location captivates residents. User reviews often mention the nearby parks and walking trails, contributing to an active and enjoyable lifestyle for families and individuals alike. Additionally, the friendly atmosphere and community spirit fostered by the staff leave a lasting impression, creating a welcoming environment for both new and long-term residents.<br>While positive experiences dominate, some user reviews reflect a hope that the management team will grow to effectively handle the challenges of the community as it continues to grow. Feedback suggests that enhancing the staff's capacity could further improve service efficiency and resident satisfaction, indicating a desire for continued improvement in overall management practices.</p></section><section id=\"bad\"><h2>Bad</h2><pSeveral user reviews point to frustrations regarding maintenance responses, particularly concerning delayed repairs. One resident recounted waiting over a week and a half for a broken stair light to be fixed, highlighting the risk to safety this scenario presents. While the issue was eventually resolved, the user felt the delayed response time could detract from the overall experience at the property.<br>Additionally, there are mentions of concerns surrounding communication. One user expressed a negative sentiment after experiencing billing issues upon moving out, prompting frustration with how management handled the situation and communicated their policies. The disappointment surrounding the out-going experience raised questions about the long-term reliability of the management team's practices, leaving some residents feeling dissatisfied.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>A particularly alarming user experience involved significant financial disputes following a move-out, wherein a resident encountered unexpected charges totaling over $3,000. The user felt misled about the billing process and reported a lack of adequate communication from management regarding move-out policies. Such experiences initiated feelings of distrust toward the management team, which may cause concern for future residents regarding transparency.<br>Reviewers also noted instances of perceived rudeness from management during disputes, which escalating tensions rather than resolving them. This pattern, alongside the negative financial experiences and harsh billing practices, creates a troubling narrative that stands in stark contrast to the otherwise favorable reviews, potentially deterring prospective tenants from choosing The Meadows by Vintage.</p></section>"
  }
}