{
  "name": "The Meadows at June Road",
  "slug": "the-meadows-at-june-road",
  "company_type": "Property",
  "address": "4355 Fuchsia Dr, Bellingham, WA 98226",
  "review_count": 50,
  "average_rating": 3.14,
  "reviews": {
    "google_reviews": [
      {
        "author": "Paloma R",
        "rating": 1,
        "review": "I am a current tenant here. I just moved in a couple days ago and already am having major issues. Signed a lease under false pretenses that there would be ample parking available outside of our one assigned spot (my partner and I each have a car). Then come to find out after lease is signed that most of the available parking is actually not part of this apartment complex and we risk being towed if we park in the overflow lot. There are literally only FOUR guest parking spots we have to work with now, in a complex full of probably hundreds of tenants. We now risk not being able to park one of our cars on any given day, and we pay to live here! We asked the leasing office what solutions they have for us since they were the ones who misinformed us. They looked right at my partner and said I dont have a solution for you. We are now hoping to get upper management involved since our leasing office has no intent to remedy the situation that they partly caused. Do not move here. ALSO the walls are extremely thin and we hear our tenants upstairs at every single moment they are in movement. Finally, our assigned parking spot is at the opposite end of the property. I now skateboard to my car to get there faster.",
        "owner_response": {
          "text": "Thank you for your feedback. We understand your frustration. This community does not have additional parking, and while this is clearly stated in the lease, we apologize if this was not clear during the leasing process. We try to make this as clear as possible up front, but it sounds like there may have been a misunderstanding.  "
        }
      },
      {
        "author": "Lia Tonella",
        "rating": 5,
        "review": "Just moved in a month ago and overall I have had a very wonderful experience. Prior to moving in, they were very nice and quick with the lease and information about moving in. Management has been helpful and supportive, maintenance is quick and responsive, and the overall property is well maintained and pleasant to live in. The only issue I have had is trash being improperly disposed of, but they have said they are working on it, and that is more the fault of the people living there.",
        "owner_response": {
          "text": "Thanks for your feedback! We're glad to hear your experience so far has been positive. If there is ever anything we can improve, please let us know!"
        }
      },
      {
        "author": "Megan Raetz",
        "rating": 1,
        "review": "PTLA is very difficult to get a hold of and has gone thru at least three community managers for Meadows at June Rd during the last six months. The parking at this property is atrocious and after moving in, they decided to change our assigned parking spot to one that doesnt even fit our stock F150. After three months of being told they will work to find us a new spot, they now refuse to help. The on site garbage bin areas are filled with trash daily and trash all over the ground. Its very clear there has not been a community manager capable of running this property for some time now.\n\nDo not recommend.",
        "owner_response": {
          "text": "Thank you for your feedback, Megan. We are sorry to hear that you have not had a good experience at our community so far, and we hope we can improve your experience going forward. We are working to address the property cleanliness concerns you brought up and appreciate you bringing your concerns to our attention."
        }
      },
      {
        "author": "Krista Calender",
        "rating": 1,
        "review": "I moved in September 30th, which was surprising considering how much trouble it was to even get the lease generated. I played phone tag with the leasing associate for over a week, clarifying several times which unit I wanted to move into. Then, another person called me to actually write up the lease and they STILL did not have the correct unit. Then, after my boyfriend and I both signed the whole lease and 26 pages of documents, we found out there was a mistake and had to do the process all over again. I thought that was going to be the last of the issues, but then I saw somebody was in my parking spot. I called several times and it still took over a month for them to have the motorcylce moved after it was stationary the whole time. We realized after about 2 weeks that our washer was not working and just soaking our clothes in water. The website boasts that maintenance requests are scheduled within 24 hours but I still had to call multiple times over the course of a week. Even after they scheduled it it is still a week before they will even look at it. Then, I noticed either our garbage disposal or dishwasher is leaking dirty water under our sink. Also, our lights are always flickering randomly both upstairs and downstairs. Our shower in the upstairs bathroom has 1 centimeter difference between cold and scalding, and the cold and hot water is opposite of what it says on the faucet. And, when we moved in it was not properly cleaned and the toilets were absolutely foul. This unit was clearly not move in ready at all and I am highly disappointed. There should be a huge discount on our rent until all of the amenities we were promised are actually available and yet all we get is a bunch of lousy sorry's and excuses. I definitely would not recommend this property or any properties managed by PTLA to anyone until they get their act together.",
        "owner_response": {
          "text": "We apologize for the experience you've had so far. That is certainly not how we like to handle things, and a member of our team will reach out to you shortly to address your concerns. Again, thank you for bringing this to our attention."
        }
      },
      {
        "author": "Desirae Bradley",
        "rating": 1,
        "review": "I'm so upset to hear their best manager, Caitlin, is no longer working with them. Caitlin was kind and generous. She made us feel SO welcome. There were so many issues, caused by PTLA that Caitlin worked hard to fix. I was so skeptical about this place when we first applied, due to all of the terrible reviews, but it was clear that Caitlin had this property's best interest in mind and was working hard to fix it. All of their recent great reviews were due to her! Every good review they have mentions her name. . .  I'm disgusted by PTLA and fear the future of my residency due to their discriminatory practices. We probably never would have signed the lease had Caitlin not made us feel so welcomed.",
        "owner_response": {
          "text": "Thank you for your review, Desirae! We're so glad to hear that you enjoy our community and service. Let us know if there is ever anything else we can do to take care of you!"
        }
      },
      {
        "author": "Suzanne Dean",
        "rating": 5,
        "review": "We were in the process of moving in from out of state. We had several hurdles and the office manager, Caitlin, did an admirable job assisting us and helping us get settled. She was very professional.\nWow! We are so happy with our new home and community! Caitlin has gone way above to help us settle in.\n\nabove  gone above and beyond to make our move",
        "owner_response": {
          "text": "Suzanne, we're so glad to hear that Caitlin was able to help you as you relocate. If there is ever anything else we can assist with, please don't hesitate to reach out!"
        }
      },
      {
        "author": "Andrew Miller",
        "rating": 5,
        "review": "I've lived in this complex for a year now and between the friendly tenants, safe area, great gym, these are great apartments! The only inconvenience is the parking situation but that's a minor enough thing to deal with given there's usually other vacant parking spots if you pay attention. Caitlin has also been a huge help when anything pops up!",
        "owner_response": {
          "text": "Thanks for your review! We're so glad our team has been able to assist you, and we're glad you enjoy the community! "
        }
      },
      {
        "author": "H C",
        "rating": 5,
        "review": "After dealing with so many chaotic and rude management staff at previous complexes I've lived in, Caitlin was a breath of fresh air. From the start she was kind, charismatic, and down to earth. She explained all details I needed to know, despite my thousands of questions, without getting irritated or pushy. If circumstances change, I'll definitely be reaching out to her for further assistance with this place.",
        "owner_response": {
          "text": "Thank you for your feedback! We're so glad our team was able to provide you with great service. We'd love to find you a home in the future! "
        }
      },
      {
        "author": "Vicki Fry",
        "rating": 5,
        "review": "I recently moved to the Meadows.\nSo far, great experience.!\nOur new manager, Caitlin, is on top of everything while also being professional and personableand available!\nAlso, can not say enough good stuff about maintenance man, Paia.\nHis attention to detail, and quick as possible response plus his kindness, makes it so easy to work with him.\nThank you, Paia.\nLooking forward to being part of this community for years to comeif it stays this way.\nVicki Fry\n\nH",
        "owner_response": {
          "text": "Thanks for your review, Vicki! We're so glad to hear that our team has provided excellent service. If there is ever anything we can help with, please don't hesitate to give us a call."
        }
      },
      {
        "author": "Kayli Robles",
        "rating": 1,
        "review": "Great place to live but dripping sound is a complete deal-breaker.  I love everything else about living here, the apartments are beautiful, safe, and there's a beautiful trail right next to it.  It's also in a great location.  However, half of the year when it rains you hear a loud, slow drip in your wall all day and all night long because the drains are positioned next to the only realistic place to put the bed in the room.  The only other place I can put the bed has another drain right by that part of the wall on the other side.  And management won't do anything about it.  Just drip, drip, drip all night long every day for many months of the year.  You can shove Earplugs in your ear but you have to put them in so far it hurts if you're not a deep sleeper because it's LOUD.  In addition, some apartments have it worse.  When I walk by the apartment next to mine when it rains, they have something on the roof that sounds like a helicopter going all day all night nonstop and I just KNOW they can hear it through the walls because these walls are thin.  I have contemplated moving out so many times because of the dripping sound.  Despite loving living here so much, I mean everything else is perfect.  But I can't wait to move out to get rid of this sound.  It's during the busiest time of my year at work so I can't sleep and wake up tired every day, or I miss my alarm because I have to wear ear plugs to sleep.  Trust me it's bad enough to not move here.  Especially for light sleepers.  If you can sleep through anything, this place is for you.  I live in one of the townhouses so some of the other types of units should be safe from this.  Check out where the drain is positioned next to your unit before you decide.",
        "owner_response": null
      },
      {
        "author": "Uri HEF",
        "rating": 2,
        "review": "Only gave 5 stars for Caitlyn I dont trust PTLA I will update if the new blonde male manager is good So far so bad Caitlyn is missed already.\n\nEnjoyed working with Caitlyn Shes professional and really kind. She listened to me and genuinely cared about my needs.\nShe said shes new to the company she was great to work with.",
        "owner_response": {
          "text": "Thanks for your review! We're glad our team was able to help you, and we hope you'll reach out if there is ever anything else we can do for you!"
        }
      },
      {
        "author": "Steve R",
        "rating": 2,
        "review": "Only good thing about this complex is that it is new construction and the interior looks nice.\nParking is an absolute joke, there are 4 unassigned spaces for the entire complex so you are forced to find parking for guests \"somewhere\" even though there isn't street parking within walking distance. Your car needs to have pretty good suspension and clearance to make it through the 4 ridiculously aggressive speed bumps installed, we've bottomed out multiple times going 5 mph over them(speed limit is 10).\nIf inclement weather is in the forecast make sure to dump all your trash right away, the trash areas were overflowing for weeks after the snow cleared, and on the snow issue, make sure to buy your own shovel and ice melt as there were multiple days of ice and snow build up on the communal walkways, or just fall and sue them.\nIf you do rent with this company, you aren't getting much of your deposit back. They are very transparent that there is about $120 carpet cleaning right off the top, but their additional cleaning fees seem extremely excessive. We've never been charged more than an hour cleaning on any of our other rentals but somehow managed to leave this one in such a state that it required a full day of professional cleaning. Save yourself the time and either hire a company, or accept that you'll be getting 1/4 of your deposit back",
        "owner_response": null
      },
      {
        "author": "Brooke Walling",
        "rating": 1,
        "review": "Parking situation was horrible. We have a two bedroom apartment and they gave us one parking pass when both my roommate and I have cars and jobs. I have asked multiple times if we can get another pass but they always respond rudely and say that we cant have another one. We were told when we signed the lease that we will get another one when we get our keys but to no surprise when we picked up our keys they said that we cant have another one. If we would have known we couldnt get that second one we would not have signed the lease. We will not be renewing at all and I dont recommend this apartment complex to anyone who is going to live with roommates who have cars.\n\nThe apartment itself is cheaply made and the walls are so thin so you can hear your neighbors even if they are having a normal conversation. I do not recommend this place. If we could get out of our lease with no complications we would.",
        "owner_response": null
      },
      {
        "author": "Monty Capy",
        "rating": 1,
        "review": "Apartments are brand new! Place feels super safe and clean. Management so far has been very good and the overall apartment is a great layout and I never hear my neighbors other than their dog, but thats to be expected. Gym and common area is kept clean and is really nice... EDIT:they are attempting to increase my rent by 1000 dollars! And they wonder why no one lives here STAY AWAY",
        "owner_response": null
      },
      {
        "author": "Mongol Rain Pix",
        "rating": 3,
        "review": "Went for a tour. Lovely place really. Layout doesnt suit our needs however. And looks like we found something else that fits better for us. Alarming on the parking situation. And the reviews are just horrible of this place. But, the lady we dealt with upfront was super professional and doing the best she can with what she has. Friendly and funny. Thanks Hope for being such a bright spot!!! Hang in there Hope",
        "owner_response": {
          "text": "Thanks for your review. We're glad that you had a positive experience with our team! "
        }
      },
      {
        "author": "Bridget Wilson",
        "rating": 1,
        "review": "My roommate and I came to do a tour after requesting one from Zillow. Got an email from them and they told us to come in whenever. Hours say 10am-5pm. We came multiple times to the leasing office different days at different times between 10-5 just incase they were on lunch and no one is ever there. Weve tried leaving voice mail after voice mail and no response. This place is absolutely garbage when it comes to their customer service. Dont rent here. No parking available aswell. Dont rent from this place or this company. Its garbage. Waste of money.",
        "owner_response": {
          "text": "Hi Bridget, we apologize for the experience you had so far. We appreciate your feedback and will make sure to take the appropriate action to address the communication issues you have experienced. We would love the opportunity to improve your experience and make things right. A member of our team will be reaching out to you soon."
        }
      },
      {
        "author": "Anne Binda",
        "rating": 1,
        "review": "I've lived here almost a full year and received a renewal offer increasing my rent about $250, making my rent higher than what they have listed on their website right now for 2 Bed 2.5 Baths. Why would they ask current tenants to pay more than new tenants? Makes zero sense. And no response to my email to try to renogiate.",
        "owner_response": {
          "text": "Hi Anne, thank you for your feedback, and we are sorry that you haven't heard from someone yet! A member of our team will be reaching out to you shortly to address your concerns."
        }
      },
      {
        "author": "James Stearns",
        "rating": 1,
        "review": "STEER CLEAR OF THIS TRAP.  First, right away I noticed an alarming number of large carpenter ants (hundreds) in the apartment the first day I showed up when the apartment was clean and vacant.The aren't the type of ants that come when you leave a mess, these are the type that eat wood and other materials. I promptly notified the maintenance staff through the online portal. I heard nothing for a couple weeks. I work a late shift and sleep in the am.  2 weeks later I received a text from the maintenance person at 6am (I was sleeping as well a lot of people would be) and his message was insinuating that it was because I was messy that the ants were there, even though I was clear they were there when the clean apartment was vacant and what type of ants they were.  The txt also requested pictures and said I should clean the apartment.  By 7am (1 hour after the 1st message, and 2 wks after my maint. request, & I was still sleeping) I received another txt that said the maintenance request was cancelled because I did not reply or show proof.  I WAS GIVEN ONE HOUR, VERY EARLY IN THE MORNING, AFTER WAITING 2 WEEKS.  Carin (the apt manager) would send very rude messages to all the tenants after several voiced concern over mail packages being stolen on a regular basis. Carin basically said \"oh well, go pick them up at the carrier.\"  I've rented for 20 years around the country and have never met a more unprofessional staff.  I wrote back with some possible options to better secure our packages for us and she wrote me back a nasty text telling me to back off.  Another incident was when I slowly went around another vehicle on some speed bumps in the entrance to the complex.  I thought the vehicle was stopping as it was barely moving so I slowly went around (there is a 10mph speed limit) I was going maybe 8mph with a couple friends with me. I backed into my parking spot when all the sudden a white suv swooped in and blocked my vehicle, effectively false imprisoning me.  A woman gets out and approached my drivers side door in an aggressive manner. I step halfway out of my vehicle (because clearly she was aggressive and I didn't know her intentions) and I ask her how I can help her.  She said that she was the apartment manager and I was going too fast through the parking lot (apparently she was the vehicle slowly creeping over the speed bump).  That's when I realized that this was the infamous Carin (we had never met before).  I told her I was uncomfortable with her blocking in my vehicle and coming at me aggressively.  She barked at me all the while my friends were sitting in my vehicle just blown away at her lack of decency and professionalism.  She threatened that she could fine me on my next rent payment. I knew this was the last straw.  I immediately drove to the APEX corporate building in Bellingham and requested a sit down with somebody in charge.  I had to tell her boss about all of these things.  The last reason I would say to never live in this complex or rent from any APEX property is because they absolutely burgled my security deposit.  I definitely expected them to keep a solid chunk of the deposit because I could just tell in the short time I lived there that APEX and The Meadows have no real character and I knew they would gouge what they could.  WOW, I could not know just how much they would embezzle from my deposit.  When I left this apartment it was in great shape.  I had 3-4 holes in the wall just from hanging things and every other apartment I have lived in across the country considers that \"normal wear and tear\", not APEX.  The apartment was a ONE BEDROOM apartment and they charged me 7.5 hours at $40/hr to clean it.  Even if the place was trashed (and it was not) you could not spend that long cleaning that place.  I definitely expected them to charge me a few hours because most places do even if you spend days cleaning it yourself but wow. They even charged me $5 for smoke alarm batteries.  When I was there 3 days before the lease ended the batteries were fine.  Dumbfounded.  They robbed me of $530. incredible.",
        "owner_response": null
      },
      {
        "author": "Joseph Mercil",
        "rating": 5,
        "review": "The community and the staff at meadows at June rd are very friendly nd I personally enjoy everything thank you very much  ",
        "owner_response": {
          "text": "We're so glad to hear you're enjoying the community and that our team has been helpful!"
        }
      },
      {
        "author": "caden larson",
        "rating": 1,
        "review": "Went to the leasing office 3 times on different days and nobody was in\nHorrible service also dont try calling them because they wont answer or return your calls\n\nEDIT: they responded to my original review, saying that I would be contacted by a leasing agent, which has yet to happen. Do not respond and say that I will be contacted if you do not intend to follow through highly disappointed. I would highly recommend not looking at this place whatsoever. Big let down. Found a place that has much better customer service, as well as actually follows through with their hours and is responsive.",
        "owner_response": {
          "text": "Thanks for providing us with this feedback, and we apologize for the communication issues you've experienced. A member of our team will be reaching out to you soon to discuss what we can do to make things right with you and hopefully improve your experience with us."
        }
      },
      {
        "author": "Lucas Swanberg",
        "rating": 5,
        "review": "I took a tour with Caitlin and she was friendly, knowledgeable and professional! All the facilities were well maintained, easy to access and inviting. Ill be having my next party here!",
        "owner_response": {
          "text": "Thanks for your review! We're so glad you can see yourself living here!"
        }
      },
      {
        "author": "Jill Mcadams",
        "rating": 5,
        "review": "Daughter just moved in PTLA assisted and made the process smooth. The Meadows is beautiful! So happy knowing she has a safe place to call home.",
        "owner_response": {
          "text": "Thank you for your review! We're so glad that you and your daughter were pleased with the move-in experience and with our community. Please let us know if we can help with anything else! "
        }
      },
      {
        "author": "S Callister",
        "rating": 5,
        "review": "As apartment complexes go, very new, nice, and *pet* friendly!  (btw, mgt co does UV tests on carpets & flooring after pet tenants, so non-pet tenants moving in will still get a fresh, clean apartment - no yucky surprises!). Our 2BR apt was brand new, and the largest we could find anywhere, vacant or otherwise -- over 1100sf, 2 levels, w/ deck & lg outside storage closet (almost 200cf in outside closet!). Decent inside storage & lg bedroom closets also. Kitchen has good counter space, full-extension drawers, soft-close cupboards, SS appliances, DW, micro, disposal, *Full Size* stacked W/D concealed in closet (but w/ room for supplies).  Well-built, energy-efficient, lots of large windows, attractive, well-maintained landscaping and lawns. Amazing gym w. machines, free weights, treadmills, bikes, and more (definitely don't need a separate gym membership!). Quiet location, surrounded by protected, wooded native growth green space and walking trails, yet super close to everything - 5 min or less to the mall & Meridian shopping, 3 min to Costco, or to the Bakerview or Northwest Ave I-5 on-ramps (then 10 min or less to anywhere in town - Downtown, Fairhaven, other parks and trails, dog parks.  Quiet tenants (enforced quiet hours late evening til morning). Mgt Co. very responsive; attends to issues & repairs quickly; apartments and grounds are well maintained. There are 2 seamless sections to the complex (Phase 1 and Phase 2) - Phase 2 is brand new, distinguishable by attractive black metal railings rather than wood.  Lower levels are usually studios or 1- BR's (some bldgs have 'accessible' 2BR apts on lower level); 2nd & 3rd levels are usually 2-BR 2-level apartments (open concept kitchen/dining/living plus a 1/2ba on 2nd level; 2 good sized bedrooms, each w/ full bath, on upper level.  Not all buildings are the same, though, so pay attention if you are evaluating vacancies.  Try to snag an apartment with a deck *and* outside storage closet  - some bldgs don't have either; some may have decks but not outside storage.  Also, apartments on the ends of buildings are larger than units in middle (+ many more windows obviously).  Some 2BR apartments have lower rent because they only come with *1* parking spot rather than the usual 2 spots. Some units have garages, though they are mainly built for small vehicles. Some garage units claim to have 2-car \"tandem\" garages (one car behind the other) but again, make sure you check the measurements of your cars vs garage size, because those units DON'T offer any outside parking spots.  Not the cheapest place in town, but it's *PET FRIENDLY* (hard to find). Even if you don't have a pet, it's very new, attractive,  quiet, and *large* well-appointed apts - so the $ per square foot is a pretty good value, especially considering the clubhouse/gym.",
        "owner_response": null
      },
      {
        "author": "Skylar Bunn",
        "rating": 5,
        "review": "Moved in two weeks ago with my boyf and we love it so much. The wetland and trails are super slay and Caitlyn the property manager is the coolest and super helpful!",
        "owner_response": {
          "text": "Thanks for the great review! We're so glad you enjoy calling The Meadows at June Road home!"
        }
      },
      {
        "author": "Jason Dougherty",
        "rating": 1,
        "review": "Nice apartments. Terrible parking, no visitor parking was just informed that where ppl were able to park they are going to paint it all red. Good luck have guests over. Very expensive place not to be able to have two cars let alone any company!!!!",
        "owner_response": {
          "text": "Hey Jayson - Please rest assured, we completely hear your frustrations. We certainly appreciate your patience as we work together with the owners of this property as well as the COB to solve parking issues at June Road - we are working diligently to find a solution that works for our residents and their guests."
        }
      },
      {
        "author": "Taylor Bagnariol",
        "rating": 5,
        "review": "Love how conveniently located it is. Friendly and helpful staff",
        "owner_response": {
          "text": "Thank you for your feedback! Let us know if there is ever anything we can help with in the future."
        }
      },
      {
        "author": "The Shiba Way",
        "rating": 5,
        "review": "Great complex, my favorite so far! Everything went smooth at move in, and the property is beautiful and reasonably priced!!",
        "owner_response": {
          "text": "Thank you for your feedback! We're so glad you're enjoying the community and had a smooth move in experience. If there is anything we can do to for you in the future, please don't hesitate to reach out!"
        }
      },
      {
        "author": "Aresius Ngemera",
        "rating": 5,
        "review": "Quiet place with spacial apartments.",
        "owner_response": null
      },
      {
        "author": "Ember Hamilton",
        "rating": 5,
        "review": "I loved the way the staff treated me and my family with so much respect definitely recommend  ",
        "owner_response": {
          "text": "Thanks for your review! We're so glad our staff was able to take care of your needs. If there's ever anything else we can assist with, please don't hesitate to ask!"
        }
      },
      {
        "author": "Jacob Rogers",
        "rating": 1,
        "review": "Scarry",
        "owner_response": null
      },
      {
        "author": "Beth Clark",
        "rating": 1,
        "review": "Management terrible.  Stay away.,",
        "owner_response": null
      },
      {
        "author": "Carl Graber",
        "rating": 5,
        "review": "Love the apartments",
        "owner_response": {
          "text": "Thanks, Carl! If there is ever anything we can help do to make your experience even better, please let us know!"
        }
      },
      {
        "author": "Manuel Villicana",
        "rating": 3,
        "review": "Working",
        "owner_response": null
      },
      {
        "author": "Mustafa Wadalhaj",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Shovia Muchirawehondo",
        "rating": 5,
        "review": "",
        "owner_response": {
          "text": "Thanks for your review!"
        }
      },
      {
        "author": "Jayna Ott",
        "rating": 4,
        "review": "",
        "owner_response": {
          "text": "Thank you for your feedback, Jayna! We're glad you have been pleased with your experience."
        }
      },
      {
        "author": "Dakota Meador",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Morgan Kinnaman",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Barrett Newman",
        "rating": 4,
        "review": "",
        "owner_response": {
          "text": "Thanks, Barrett!"
        }
      },
      {
        "author": "Alex Kelly",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi Alex, we are sorry to hear you are dissatisfied with our community! Please contact us at your earliest convenience on how we can improve our services."
        }
      },
      {
        "author": "Nate Samuelson (Grotesque Audio)",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Vic",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Hctor, Vzquez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Anne Rupe",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Gerent G",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Collin H",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Steve Christofferson",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenny Garcia",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "roc g",
        "rating": 2,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 33,
  "adjusted_average_rating": 3.0,
  "distribution": {
    "1": 18,
    "2": 4,
    "3": 2,
    "4": 5,
    "5": 21
  },
  "summary": {
    "created_timestamp": 1739205617,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Meadows at June Road has received positive feedback for its friendly community atmosphere and responsive property management team. Many residents have praised certain staff members for their professionalism and kindness, making their move-in process smooth and enjoyable. One reviewer highlighted the peaceful setting and well-maintained facilities, cherishing the convenient location close to shopping centers and walking trails. While the complex's design and new construction are seen as positive points, with attractive layouts and modern amenities, the pet-friendly policy is particularly appreciated by animal lovers. In addition to the community and management being responsive, some tenants have found the overall living experience to be positive, feeling safe and satisfied with the quality of services provided.</p></section><section id=\"great\"><h2>Great</h2><p>Several residents at The Meadows at June Road have shared exceptional experiences, emphasizing the supportive and accommodating nature of the property management. Staff members are frequently described as attentive and compassionate, significantly contributing to the residents' satisfaction. A notable mention is the positive influence of a past manager, Caitlin, who is credited with enhancing the property experience for many tenants. Her efforts in maintaining a welcoming environment and resolving issues effectively garnered high praise and created a lasting impression. Beyond individual staff efforts, the complex's communal facilities are applauded for being well-equipped and accessible, which enriches the living experience. Whether it's the well-maintained gym, appealing green spaces, or a responsive maintenance team, these attributes all contribute to an overall great residential environment.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the praise, The Meadows at June Road has its share of criticisms, especially regarding parking and maintenance. Numerous residents have expressed dissatisfaction over the limited parking availability, with complaints about the sparse guest parking spots leading to frustrations when hosting visitors. For some tenants, this issue is compounded by a lack of transparency during the leasing process about parking constraints. Maintenance problems are another recurring issue, with residents detailing slow responses to service requests. Problems such as malfunctioning appliances and poor communication with management are common themes among negative reviews. The complaints often point to a broader pattern of neglect and disorganization, which diminishes the overall experience for certain residents.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most severe grievances about The Meadows at June Road revolve around dramatic changes in management and unresolved significant issues. There are numerous accounts of poor communication, with some tenants highlighting how they faced unresponsiveness or outright dismissive attitudes from staff. One severe account includes a tenant battling an ant infestation without timely assistance, dealing with an unprofessional response that implied resident responsibility. Other grim reviews include residents experiencing frequent management turnover, contributing to instability and inconsistency in handling tenant issues. The struggle with noise disturbances due to thin walls and undisclosed water drainage issues further adds to the dissatisfaction. Additionally, the difficulty in retrieving security deposits combined with excessive and questionable cleaning fees has led tenants to feel cheated, casting a shadow over their entire experience at the complex.</p></section>"
  }
}