{
  "name": "The Edge Apartments",
  "slug": "the-edge-apartments",
  "company_type": "Property",
  "address": "960 Lincoln St, Bellingham, WA 98229",
  "review_count": 8,
  "average_rating": 3.38,
  "reviews": {
    "google_reviews": [
      {
        "author": "Diana D",
        "rating": 2,
        "review": "Take pictures and videos of your unit when you move out, because they will absolutely nickel and dime you. The cost to \"paint\" and \"clean\" (i.e., the things they don't have to itemize because it's labor) will be expensive. I lived there for 7 years and they didn't even replace the carpet after I moved out--it wasn't new when I moved in, either!",
        "owner_response": null
      },
      {
        "author": "Julie Miller",
        "rating": 5,
        "review": "Been living here for a bit and its been the nicest place I've lived in Bellingham (been here for 5 years). The apartments and appliances are well taken care of, there is little parking, but it hasn't been a problem for me. There is available parking 1 block away. The staff and manager are always friendly and helpful.",
        "owner_response": null
      },
      {
        "author": "Michael Gill",
        "rating": 5,
        "review": "Lived here for 3 years and love it. John the property manager is fantastic and if any problems with the unit arise he fixes them immediately. He has also been very helpful in a number of other aspects and I highly recommend living here.",
        "owner_response": null
      },
      {
        "author": "Kate Thiele",
        "rating": 1,
        "review": "If I could give this place 0 stars, I would. Ive lived here for about 6 months and the landlord can be very hard to deal with. Youd think for how much they charge on rent it wouldnt be an issue for maintenance fixes but thats clearly not the case. The landlord has an attitude and is not prompt about updates or handling requests for maintenance. Rent through Son-Rise and dont waste your time or money living here.",
        "owner_response": null
      },
      {
        "author": "J. Fedele",
        "rating": 2,
        "review": "Not a fan, mostly because of very poor parking. There are NO guests spots. Even if you so evade the tow trucks, get ready to cram into these unbelievably narrow spaces. Neighbor's intimate moments could easily be heard through walls. It is fancy, I'll give them that.",
        "owner_response": null
      },
      {
        "author": "Ele Nichols",
        "rating": 2,
        "review": "Thin walls, no screens, no bedroom lights, and don't expect to get much of your deposit back!",
        "owner_response": null
      },
      {
        "author": "Taylor Fievez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Anastasia Pizarro",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 6,
  "adjusted_average_rating": 2.83,
  "distribution": {
    "1": 1,
    "2": 3,
    "3": 0,
    "4": 0,
    "5": 4
  },
  "summary": {
    "created_timestamp": 1739205610,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Edge Apartments, located at 960 Lincoln St in Bellingham, offers some positive experiences according to user reviews. Some residents have praised the upkeep and condition of the apartments, noting that appliances are well-maintained. Additionally, while parking is scarce, some tenants have found nearby alternatives, minimizing inconvenience. The friendly and helpful demeanor of the staff and management has also been highlighted as a positive aspect of living at The Edge Apartments.</p></section><section id=\"great\"><h2>Great</h2><p>In terms of outstanding experiences, certain residents have shared glowing reviews. One tenant, who has been living at The Edge for three years, particularly appreciated the property manager's efficiency in handling maintenance requests. The manager's proactive approach and attentiveness to tenant needs have impressed residents, contributing to a highly recommended living experience. Another long-term tenant expressed that this had been the nicest place they've lived in Bellingham, underscoring the comfort and satisfaction enjoyed by some residents.</p></section><section id=\"bad\"><h2>Bad</h2><p>Conversely, certain aspects of The Edge Apartments have not met tenant expectations. Issues with maintenance and communication have been raised, such as a lack of promptness in addressing repair requests, leaving some residents frustrated. Additionally, soundproofing appears to be a concern, as thin walls have been reported, leading to privacy issues. Parking difficulties further detract from the living experience, with some residents frustrated by the lack of guest parking and narrow spaces.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>More troubling reviews have emerged concerning the financial aspects and specific interactions with management. There are significant grievances regarding the handling of security deposits, with accusations of unjustly excessive charges for standard move-out procedures like cleaning and painting. Some former tenants felt they were charged for maintenance issues that should have been anticipated, such as unreplaced carpets after years of occupancy. Discontent also arises from interpersonal conflicts, with some tenants citing a confrontational landlord attitude, negatively impacting their living experience.</p></section>"
  }
}