{
  "name": "The Village Apartments",
  "slug": "the-village-apartments",
  "company_type": "Property",
  "address": "3310 Alderwood Ave Bellingham, WA 98225",
  "review_count": 3,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "C G.",
        "rating": 1,
        "review": "Believe online reviews. Apartments.com rent.com google.com, they are all accurate!!   Walk away!! It's incredibly unfortunate that noone has done anything for current or past tenants. \nDefinition of slumlord\n\n:a landlord who receives unusually large profits from substandard, poorly maintained properties.",
        "ownerResponse": null
      },
      {
        "author": "Tyler L.",
        "rating": 1,
        "review": "Horrible. Horrible. Horrible landlord/ manager. Sharlene should not be the manager. She doesn't care about the tenants or anybody but herself. She refuses to work with you to make your stay here even remotely livable. Mold is everywhere because nothing is insulated right and not up to code. She refuses to fix it and blames you for it. She will not give you your direct depot back because of the mold and other things that are wrong with the place and blame you for it! Her dogs are always barking. I've recently called animal control because they will not stop barking. She is just a horrible human being. I've never met somebody so mean and heartless. Her bubbly attitude is all an act. TRUST me.",
        "ownerResponse": null
      },
      {
        "author": "Joshua D.",
        "rating": 1,
        "review": "Your review helps others learn about great local businesses.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.\n\nWOW is all I can say. Simply called to get basic information about complex. The women who answered was extremely unprofessional, had no idea of the square footage, or rent rates on any of the units. \nEvery question I asked was met with \"I don't know\" or \"I don't have that available\" We established that there were no units available this month early in the phone call, and that I was looking for information, nothing more. This was met with indifference, and dismissal.\n\nIf it was management that answered......\n\nGood Luck to anyone who Rents here... let alone looking INTO renting Lmao!\n\nyou gonna need it.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 1.0,
  "summary": {
    "text": "<section><h2>Good</h2><p>Unfortunately, based on the user reviews provided, there are no positive experiences or reports to highlight for The Village Apartments. All reviewers consistently gave the lowest possible rating, which does not allow for a substantive \"Good\" section to be developed.</p></section><section><h2>Great</h2><p>Similarly, the \"Great\" category does not have any content to include in this article. The user reviews have failed to mention any outstanding features, services, or interactions that would align with exceeding expectations or providing a satisfying living experience for tenants at The Village Apartments.</p></section><section><h2>Bad</h2><p>User reviews express intense dissatisfaction concerning the state of living at The Village Apartments. Mold issues have been reportedly rampant due to improper insulation and are alleged not to be addressed appropriately by the management. Furthermore, tenants have conveyed frustration over being blamed for these conditions, leading to disputes over security deposit returns without resolution evident in the management's approach.</p><p>The unfavorable sentiment extends beyond living conditions to include the management team, specifically pointing out the lack of empathy and unwillingness to assist residents in making their stay comfortable. Reviews mention that the manager's conduct fails to meet the expected standards of a responsible landlord, as tenants feel neglected, and their needs are apparently disregarded, leading to a deeply unpleasant living experience.</p></section><section><h2>Ugly</h2><p>Reviewers also highlight concerning interactions even before becoming tenants. One potential resident described the initial contact with the complex's staff as extremely unprofessional, with a failure to provide basic information on the apartments. Questions were frequently answered with \"I don't know\" or \"I don't have that available\", leading to a dismissive and indifferent phone call that discouraged prospective renters. Reflecting on this encounter, the reviewer ominously warned future renters about the challenges they might face should they choose to live at The Village Apartments.</p></section>"
  },
  "created_timestamp": 1725642000
}