{
  "name": "The U",
  "slug": "the-u",
  "company_type": "Property",
  "address": "2401 Taylor Ave Bellingham, WA 98225",
  "review_count": 1,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Mitchell C.",
        "rating": 1,
        "review": "As we moved in September we were promptly informed as we arrived at the apartment that the building would be under construction. We had received an email about this but it had described light touch-up work here and there. It was not touch-up work. The entire front face of the building was being remodeled and to move in we had to use scaffolding to get to our room. This however got worse as the entire front parking lot would be closed to the residents as construction continued. For those without a parking pass, they were forced to find parking elsewhere. As we got into the first few weeks of our living, we noticed the build quality and living space to be subpar in many areas including the living room, window sills, kitchen, and personal rooms. As we continued we ran into a not functioning dishwasher and a ladybug infestation from inside the walls. Maintenance was very helpful but impossible to get a hold of as the requests would often go unnoticed for a week at minimum. Management is doing everything they can and is usually extremely helpful just a challenge to get a hold of, I'm sure this is due to the widespread poor quality of properties all around and the need for help everywhere. That being said I would think having a team on site for the weekends to help with things in the properties would be beneficial as most of the residents are students and may not have time to get into the office to get anything scheduled or communicated during the week and the offices closed on the weekends. Many of the residents that I talked to expressed the same feelings of poor quality and continued issues. As I am writing this it is October 14th, 2024, and has been just barely over one month of living in the U apartments I feel as if I am being generous with the amount of problems I am leaving out. I do not recommend it and if you can find some other place to live I can confidently say that any other place than this would be better. All of this would be fixed or made easier with accommodations from the management company however nothing came from it until hundreds of requests from angry residents and co-signers of residents expressed their immense dissatisfaction. The accommodations included a gift card and two weeks off rent. These accommodations arrived in the order they were listed and about three weeks apart. The second set of accommodations only arrived because the construction is going longer than scheduled and I fully believe they would not have sent those out if construction had not gone longer. Do not live here.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 1,
  "adjusted_average_rating": 1.0,
  "distribution": {
    "1": 1,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 0
  },
  "summary": {
    "created_timestamp": 1739205624,
    "text": "<section id=\"good\"><h2>Good</h2><p>In this article, we examine the property management's efforts to address residents' concerns, though they often fall short of expectations. Many users note that the management is extremely helpful and appear to be doing everything they can to address issues, albeit with significant delays. Some examples include management offering solutions such as maintenance assistance, though accessibility is notably a challenge, especially as response times can extend to a week or more.</p></section><section id=\"great\"><h2>Great</h2><p>Despite the challenges, the property management did provide some compensation to the residents affected by prolonged construction. For instance, they offered gift cards and two weeks off rent as a form of accommodation to the residents. However, these forms of compensation were not provided promptly and seemed to be more of a reactive measure to ongoing dissatisfaction rather than proactive support.</p></section><section id=\"bad\"><h2>Bad</h2><p>Residents have had to contend with several pressing issues at The U, notably the unexpected extent of construction work. Upon moving in, tenants like Mitchell C. found the property undergoing significant renovation rather than the minor touch-ups initially communicated. This caused accessibility issues, as residents had to navigate scaffolding to access their units. Moreover, many aspects of their living spaces were reported to be of subpar quality, including the build quality of various rooms.</p><p>Beyond construction, maintenance proved problematic, with delays being a common complaint. Requests for assistance were often neglected for extended periods, leaving critical issues like non-functioning dishwashers and pest infestations unresolved. This led to a growing sense of frustration among the residents, who found the lack of timely support from maintenance to be a significant inconvenience.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The overall experience reported by residents points to a deeply unsatisfactory living situation at The U. Many user reviews describe a pervasive sense of neglect from the property management, with essential community amenities rendered unusable during ongoing construction. Most alarmingly, the management's responses seemed insufficient and delayed, which only compounded the dissatisfaction among residents. The sentiment culminates in strong advice against living at The U, with reviewers stating that nearly any other accommodation would be preferable.</p></section>"
  }
}