{
  "name": "Varsity village",
  "slug": "varsity-village",
  "company_type": "Property",
  "address": "2475 Donovan Ave, Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 3.23,
  "reviews": {
    "google_reviews": [
      {
        "author": "Auston Olapas YouTube",
        "rating": 5,
        "review": "I don't remember being here so it must have not been that bad five stars",
        "owner_response": null
      },
      {
        "author": "Michael Johnson",
        "rating": 4,
        "review": "Great low income housing!  Long waitlist for singles..",
        "owner_response": null
      },
      {
        "author": "Desi J",
        "rating": 1,
        "review": "It's not really a good place",
        "owner_response": null
      },
      {
        "author": "Derek Rider",
        "rating": 3,
        "review": "Nice quiet place to live.",
        "owner_response": null
      },
      {
        "author": "Janine Richardson",
        "rating": 1,
        "review": "Run down",
        "owner_response": null
      },
      {
        "author": "Laura Mansanarez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "H K",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Shawna Sessions",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Christina Hampton",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "c",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Art Miller",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cassie W",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.8,
  "distribution": {
    "1": 2,
    "2": 2,
    "3": 4,
    "4": 1,
    "5": 4
  },
  "summary": {
    "created_timestamp": 1739205633,
    "text": "<section id=\"good\"><h2>Good</h2><p>Varsity Village has received some positive feedback from residents who appreciate the affordable housing options it provides. One user review highlights it as \"great low income housing\" with a note on the long waitlist, indicating its desirability among budget-conscious tenants. This suggests that for those able to secure accommodation, the community meets expectations as a cost-effective living solution. Another resident describes it as a \"nice quiet place to live,\" which could appeal to individuals seeking a peaceful environment, furthering the appeal of Varsity Village as a decent residential area.</p></section><section id=\"great\"><h2>Great</h2><p>A few reviews praise Varsity Village highly, giving it a perfect rating which hints at satisfactory experiences. One user, although humorously, mentioned that not remembering being there might mean it wasn't bad, indicating a neutral to positive stance. The lack of detailed reviews in this section means it's challenging to pinpoint specific great features of the property, but the indication of perfect scores by some, hints at overall satisfaction from a segment of its residents.</p></section><section id=\"bad\"><h2>Bad</h2><p>There are several reviews highlighting issues at Varsity Village that potential tenants might find concerning. The lack of substantive responses from management might suggest a pattern of communication gaps which can frustrate residents. Moreover, some user reviews have pointed out maintenance concerns indirectly by describing the property as a \"run down\" place. These factors contribute to a perception of neglect in upkeeping the property, which could detract from the living experience. It's important for potential tenants to weigh these reviews carefully alongside the positive ones to get a comprehensive view of living in Varsity Village.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The most critical reviews bring attention to significant shortcomings in the management of Varsity Village. One user outright called it \"not really a good place,\" strongly suggesting dissatisfaction without providing specific details. There are no recorded responses from the management to address these complaints, indicating a possible neglect in addressing resident grievances. This lack of engagement with resident concerns could suggest deeper systemic issues in the property's management approach, which significantly hampers the reputation of Varsity Village. Prospective tenants should be cautious and perhaps seek further assurance from current residents or management before making a decision.</p></section>"
  }
}