{
  "name": "Varsity village",
  "slug": "varsity-village",
  "company_type": "Property",
  "address": "2475 Donovan Ave, Bellingham, WA 98225",
  "review_count": 12,
  "average_rating": 3.08,
  "reviews": {
    "google_reviews": [
      {
        "author": "Auston Olapas YouTube",
        "rating": 5.0,
        "review": "I don't remember being here so it must have not been that bad five stars",
        "ownerResponse": null
      },
      {
        "author": "Desirre J",
        "rating": 1.0,
        "review": "It's not really a good place",
        "ownerResponse": null
      },
      {
        "author": "Michael Johnson",
        "rating": 4.0,
        "review": "Great low income housing!  Long waitlist for singles..",
        "ownerResponse": null
      },
      {
        "author": "Derek Rider",
        "rating": 3.0,
        "review": "Nice quiet place to live.",
        "ownerResponse": null
      },
      {
        "author": "Janine Richardson",
        "rating": 1.0,
        "review": "Run down",
        "ownerResponse": null
      },
      {
        "author": "H K",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shawna Sessions",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Christina Hampton",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "c",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Art Miller",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "cassie w",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.8,
  "summary": {
    "text": "<section><h2>Good</h2><p>User reviews for Varsity Village have highlighted some positive aspects of living there. Some residents have found the location to be a quiet place to live, indicative of a peaceful living environment that many tenants may appreciate. Moreover, tenants appreciate the affordability of the property, with specific mentions of it being good low income housing, suggesting that it provides economic accommodation options for its residents.</p><p>The presence of long waitlists for singles as mentioned in a user review can also be interpreted as a sign of high demand, suggesting that the property might offer desirable living conditions in that context. This could point towards a generally positive perception amongst potential residents, which is further evidenced by some high-star ratings on user reviews, without detailed comments to support the ratings.</p></section><section><h2>Great</h2><p>There are sparse details in the user reviews that point towards any exemplary or 'great' experiences at Varsity Village. The mere mention of a tranquil environment could imply that some residents find exceptional value in the serenity of their surroundings at the property. However, without more detailed accounts of residents' experiences, it is challenging to elaborate on the 'great' elements of Varsity Village based on the reviews provided.</p><p>Furthermore, while some user reviews do not provide context to their high ratings, it can be inferred that those residents had a satisfactory stay, leading them to leave a five-star rating. It is worth noting, though, that the user reviews do not mention the property management directly, nor do they provide specific anecdotes that showcase the company going above and beyond typical expectations.</p></section><section><h2>Bad</h2><p>The user reviews have also shed light on some less favorable aspects of Varsity Village. One user has outright stated that \"It's not really a good place,\" although details as to why this sentiment was felt are not given. Similarly, another review briefly describes the property as \"run down,\" pointing towards potential neglect or underinvestment in the facilities or infrastructure of the property.</p><section><h2>Ugly</h2><p>The 'ugly' aspects of the property are not distinctly outlined in the user reviews, as the majority of the comments are brief and lack specificity. However, what can be inferred from the comment about the property being \"run down\" is that there may be significant room for improvement in terms of property maintenance and overall condition, which might severely impact the living experience of the tenants. Without more specific narratives from the residents, it is difficult to provide a fuller picture of any deeply concerning issues at Varsity Village.</p></section>"
  },
  "timestamp": "09/07/2024"
}