{
  "name": "Varsity village",
  "slug": "varsity-village",
  "company_type": "property",
  "address": "2475 Donovan Ave, Bellingham, WA 98225",
  "review_count": 12,
  "average_rating": 3.08,
  "reviews": {
    "google_reviews": [
      {
        "author": "Auston Olapas YouTube",
        "rating": 5.0,
        "review": "I don't remember being here so it must have not been that bad five stars",
        "ownerResponse": null
      },
      {
        "author": "Desirre J",
        "rating": 1.0,
        "review": "It's not really a good place",
        "ownerResponse": null
      },
      {
        "author": "Michael Johnson",
        "rating": 4.0,
        "review": "Great low income housing!  Long waitlist for singles..",
        "ownerResponse": null
      },
      {
        "author": "Derek Rider",
        "rating": 3.0,
        "review": "Nice quiet place to live.",
        "ownerResponse": null
      },
      {
        "author": "Janine Richardson",
        "rating": 1.0,
        "review": "Run down",
        "ownerResponse": null
      },
      {
        "author": "H K",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Shawna Sessions",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Christina Hampton",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "c",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Art Miller",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "cassie w",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.8,
  "summary": "<article>  <section>    <heading>      <h2>Disclaimer</h2>    </heading>    <p>This article is generated by ChatGPT and is intended to be a tool to help potential clients and tenants make an informed decision about the property management company, Varsity Village. The summary provided below is based on user reviews and does not include any identifiable information about the reviewers.</p>  </section>  <section>    <heading>      <h2>Good</h2>    </heading>    <p>Varsity Village has received some praise for providing low-income housing options, indicating that they are contributing to an underserved segment of the community. One user review specifically mentioned \"Great low income housing,\" highlighting the positive impact Varsity Village has on individuals or families in need of affordable living arrangements.</p>    <p>A few users appreciated the quietness of the property, with one user review stating \"Nice quiet place to live.\" This suggests that Varsity Village offers a peaceful living environment, an important aspect for many when choosing a residence.</p>  </section>  <section>    <heading>      <h2>Great</h2>    </heading>    <p>Among the reviews, there are instances where users have rated Varsity Village positively, with a couple of 5-star reviews. These high ratings indicate that some tenants are quite satisfied with their experience, though specific details behind these ratings have not been disclosed in the user reviews.</p>    <p>It's also noteworthy that the absence of negative remarks in certain reviews may imply a level of contentment or an absence of major issues for these residents. The satisfaction of these individuals contributes to the property's overall rating.</p>  </section>  <section>    <heading>      <h2>Bad</h2>    </heading>    <p>However, not all feedback is favorable. Some user reviews are less positive, with one stating, \"It's not really a good place,\" which hints at general dissatisfaction. A review reflecting on the property as \"Run down\" points to concerns about the upkeep and condition of Varsity Village.</p>    <p>Additionally, several reviews do not contain text, which hinders a comprehensive understanding of the reviewers' experiences. These non-descriptive ratings, including a couple of 2-star reviews, suggest that improvements could be made, although specific issues are not detailed in the user reviews provided.</p>  </section>  <section>    <heading>      <h2>Ugly</h2>    </heading>    <p>Notably, the user reviews for Varsity Village highlight a critical theme of potentially poor property management and maintenance concerns. Descriptions such as \"run down\" imply a lack of attention to the structural and aesthetic aspects of the property. Additionally, no owner responses have been recorded within the supplied user reviews, leading to a perception of poor communication and customer service.</p>    <p>The absence of detailed user feedback may further underscore communication issues and a possible gap between management and tenants. While this article's intent is to convey the experience of past residents, the lack of engagement from Varsity Village in addressing these reviews on public forums could be indicative of their approach to feedback and tenant relations.</p>  </section></article>"
}