{
  "name": "Varsity village",
  "slug": "varsity-village",
  "company_type": "Property",
  "address": "2475 Donovan Ave, Bellingham, WA 98225",
  "review_count": 13,
  "average_rating": 3.23,
  "reviews": {
    "google_reviews": [
      {
        "author": "Auston Olapas YouTube",
        "rating": 5,
        "review": "I don't remember being here so it must have not been that bad five stars",
        "owner_response": null
      },
      {
        "author": "Michael Johnson",
        "rating": 4,
        "review": "Great low income housing!  Long waitlist for singles..",
        "owner_response": null
      },
      {
        "author": "Desi J",
        "rating": 1,
        "review": "It's not really a good place",
        "owner_response": null
      },
      {
        "author": "Derek Rider",
        "rating": 3,
        "review": "Nice quiet place to live.",
        "owner_response": null
      },
      {
        "author": "Janine Richardson",
        "rating": 1,
        "review": "Run down",
        "owner_response": null
      },
      {
        "author": "Laura Mansanarez",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "H K",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Shawna Sessions",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Christina Hampton",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jenna Kennedy",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "c",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Art Miller",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cassie W",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 5,
  "adjusted_average_rating": 2.8,
  "distribution": {
    "1": 2,
    "2": 2,
    "3": 4,
    "4": 1,
    "5": 4
  },
  "summary": {
    "created_timestamp": 1739095182,
    "text": "<section id=\"good\"><h2>Good</h2><p>Several user reviews highlight some positive aspects of Varsity Village. One reviewer mentioned that it was a nice, quiet place to live, suggesting a peaceful environment for residents. Another user praised it as a great low-income housing option, indicating that despite the long waitlist, it is considered a viable choice for affordable living arrangements.</p><p>Additionally, there are several positive ratings of five stars from users indicating that their overall experience wasn't negative. Even a reviewer who did not recall specific experiences rated it five stars, hinting at a sense of general satisfaction. While these reviews are limited, they reflect that for some residents, the property can meet their needs and expectations positively.</p></section><section id=\"great\"><h2>Great</h2><p>The property management at Varsity Village appears to have successfully created a community that some residents appreciate for its affordability. A review highlighted the existence of a long waitlist for singles, which suggests a high demand and perceived value for the property among tenants. This points to a positive reputation within the local housing market.</p><p>Moreover, the presence of multiple five-star reviews signifies that a subset of residents feels that the management and facilities may have exceeded their expectations. While the details are scarce, it's important to note that when residents have good experiences, they often lead to word-of-mouth recommendations which can enhance the community’s overall standing.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews have also uncovered some significant criticisms regarding Varsity Village. Some residents described the property as run down, suggesting neglect or a lack of adequate maintenance from management. Additionally, a couple of users offered two-star ratings, which may point to dissatisfaction with specific aspects of their living experience or management practices.</p><p>It is worth noting that while there are a few commendations, the average rating of 3.23 indicates that there are indeed mixed feelings among the residents. Some users may have faced issues that managed to dampen their experience, leading them to share concerns that may not be fully addressed by the management.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The ugliest part of the user experience can be gleaned from the one-star reviews, where residents expressed their disappointment with the property. Comments like “It’s not really a good place” and “Run down” reflect a negative sentiment about the general condition of the facilities. This suggests that some tenants may be feeling the toll of poor property maintenance and management neglect.</p><p>Additionally, no responses were recorded from the property management in relation to the negative user reviews, which raises concerns about their engagement with tenant feedback. A lack of communication from management on these pressing issues can lead to further dissatisfaction and a degradation of community trust, indicating possible management shortcomings that could turn away potential future residents.</p></section>"
  }
}