{
  "name": "Village Apartments",
  "slug": "village-apartments",
  "company_type": "Property",
  "address": "3310 Alderwood Ave j1, Bellingham, WA 98225",
  "review_count": 31,
  "average_rating": 2.94,
  "reviews": {
    "google_reviews": [
      {
        "author": "Paige Pettit",
        "rating": 5,
        "review": "I had a wonderful experience renting with Village apartments 2022-2023. If I was back in town and could get in a two bedroom unit, I would jump on it. I was absolutely hesitant with the Google reviews that mentioned a terrible property manager- but thank God for turnover because we had an excellent experience with Morgan (new PM). She was confident, helpful, kind, and knowledgeable. She treated all tenants with respect, loves pets, and was so amazing",
        "owner_response": null
      },
      {
        "author": "Rachelle T.W.",
        "rating": 1,
        "review": "I lived there for a few years and the building is old and has mold and make sure you look for bugs and everything.",
        "owner_response": null
      },
      {
        "author": "Dana Carlson",
        "rating": 5,
        "review": "Morgan, the property manager has been great! Very responsive, explaining everything clearly, professional and helpful. My neighbors have been amazing as well. Friendly and introduced themselves. People always walking dogs. Nice atmosphere!",
        "owner_response": null
      },
      {
        "author": "Wendy Tung",
        "rating": 5,
        "review": "Firstly, the property manager Morgan is amazing. I was thrown off by some of the reviews for the previous property manager... but Morgan is CHEFS KISS fantastic. She's responsive, personable, and goes above and beyond if you encounter any issues. Just the best person to deal with.\n\nMy cat and I moved here when I needed to downsize. The 1br/1bth is small, but I've made it work. You'll definitely need to buy furniture that doubles as storage as storage space is very limited. Neighbors are very respectful about the parking spaces and everyone parks in the same spots... so you're never struggling trying to find parking.\n\nI would recommend purchasing a dehumidifier to use during the spring/summer months to kick the moisture issue.\n\nIf you're looking for a fancy place... this isn't it. But it's comfortable and I've made it cozy. So there's that!",
        "owner_response": null
      },
      {
        "author": "Brian Kirst",
        "rating": 5,
        "review": "New manager Morgan is amazing. All previous reviews were due to bad manager previous to Morgan. Trust me! I lived here for three years. Former manager Charlene was not a great fit for the apartments. She was very difficult and not a great charmer.\nLook, this place isnt perfect. If you are looking for basic, no thrills, no special treatment. This is your place. Pay your rent on time, follow the rules and communicate with Morgan, she is great. If you do this, this place will be a good home.",
        "owner_response": null
      },
      {
        "author": "Kelsey",
        "rating": 1,
        "review": "Moldy, cheap, slow response to repair requests, and worst of all: property manager is neurotic and one of the strangest and most aggressive people I have ever had the misfortune of dealing with.\nShe seems to have little to no supervision and does what she wants. She will not send you statements or receipts for anything you pay for. She will not mail you your security deposit. She will not share the owners contact information because she does not want to be in trouble. As soon as you ask for proof of anything, for information, or for any updates about repairs or charges or anything -  she will shut down and be completely uncooperative and combative.\n\nShe will enter your apartment unannounced and while you are not home. She will walk around the back of the properties and peep through windows if you leave the curtains open.\n\nYou wont get your money back and she wont return calls from new landlords checking on rental history. Her office is like a black hole where your receipts, money, and paperwork disappear. Just avoid this place.",
        "owner_response": null
      },
      {
        "author": "Ty-Hawk Sabin",
        "rating": 1,
        "review": "Be very careful renting here. Small apartments, high rent, rude landlord. You have to ask a hundred times to have anything fixed and even than they will clam you are harassing them. My elderly mom lives here. The landlord has harassed, me her son, for visiting, and even worse tried to say she is not allowed to babysit her grandson. My mom is an excellent renter, she keeps everything clean and neat, pays rent on time, but because she is on housing and elderly they will be rude to her even to her face .Currently trying to get her out of here, renter be warned.",
        "owner_response": null
      },
      {
        "author": "kevin curtis",
        "rating": 1,
        "review": "Very small and old, no a/c and only baseboard heat.  No parking controls, some people have multiple vehicles and if anyone has guests there may be no parking for you when you come home.  Its been 2 months since my move out and I still haven't received a refund or accounting of my deposit.\nI will live in my car before I ever move back into a Speck property  ....",
        "owner_response": null
      },
      {
        "author": "Jamie Alvarez",
        "rating": 4,
        "review": "Definitely one of the cleanest and cheapest laundry facilities I've seen at apts.",
        "owner_response": null
      },
      {
        "author": "Campn Pro",
        "rating": 2,
        "review": "Apt manager very unprofessional. Small place. Parking issues. I like the location though. Somewhat quiet.",
        "owner_response": null
      },
      {
        "author": "Edward Aguirre",
        "rating": 2,
        "review": "Overpriced..no ac no c\n\nentral heat. No maintenance man..they use contract labor, but you can't get anything fixed.",
        "owner_response": null
      },
      {
        "author": "Denise Prowell",
        "rating": 3,
        "review": "They are fairly up to date and the grounds are kept up fairly good",
        "owner_response": null
      },
      {
        "author": "Jim Mercer",
        "rating": 1,
        "review": "Buy a van and live down by the river before ever considering moving to this dump!",
        "owner_response": null
      },
      {
        "author": "Shann Ruggles",
        "rating": 1,
        "review": "They absconded my $825 deposit!! What more can I say. ",
        "owner_response": null
      },
      {
        "author": "Austin ___",
        "rating": 3,
        "review": "Very small and seems overpriced. Disclaimer: I do not live here, my girlfriend does.",
        "owner_response": null
      },
      {
        "author": "Mary Griffin",
        "rating": 1,
        "review": "I lived there for several years, it's a hor",
        "owner_response": null
      },
      {
        "author": "Carl Graber",
        "rating": 5,
        "review": "excellent place for everyone",
        "owner_response": null
      },
      {
        "author": "Carl G",
        "rating": 5,
        "review": "Great appatarpments",
        "owner_response": null
      },
      {
        "author": "Amy Record",
        "rating": 1,
        "review": "Discriminatory",
        "owner_response": null
      },
      {
        "author": "Sierra Vasquez",
        "rating": 1,
        "review": "Unprofessional.",
        "owner_response": null
      },
      {
        "author": "Bshk Bob",
        "rating": 4,
        "review": "These are Apartments",
        "owner_response": null
      },
      {
        "author": "Mustafa Wadalhaj",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Trinity Banks",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "jess mcnutt",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Dani Freeland",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Dana Eckert",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Natasha Aven",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cara Rasmussen",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Ashley Pederson",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Snowy",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 21,
  "adjusted_average_rating": 2.71,
  "distribution": {
    "1": 11,
    "2": 2,
    "3": 6,
    "4": 2,
    "5": 10
  },
  "summary": {
    "created_timestamp": 1739095180,
    "text": "<section id=\"good\"><h2>Good</h2><p>Many users have highlighted the positive impact of the new property manager, Morgan, who seems to have turned around the reputation of Village Apartments. Tenants have praised her for being responsive, professional, and concerned about the well-being of residents. One user shared that they were apprehensive about renting due to negative reviews about the previous management but found Morgan's demeanor refreshing and helpful.</p><p>Another tenant praised the community atmosphere, indicating that most neighbors were friendly and that the environment was pleasant for both people and pets. The cleanliness of the apartments and shared facilities like the laundry room also received some commendations, suggesting that overall, the management is making efforts in upkeep. For those who align expectations with the apartments' simplicity, many found it a solid choice.</p></section><section id=\"great\"><h2>Great</h2><p>The emergence of positive accounts about the new management provided a sense of hope and renewal among residents. Reviews written after Morgan’s arrival often convey a sense of relief and satisfaction, greatly differing from prior experiences with previous management. Tenants noted that with Morgan at the helm, communication has improved, which contributed significantly to an enhanced living experience.</p><p>The welcoming charm of the neighbors and the supportive community atmosphere is also a theme present in great reviews. Residents not only expressed appreciation for the in-house management but also relayed their enjoyment of living in a pet-friendly community where their furry friends were well-accepted, enhancing their overall experience.</p></section><section id=\"bad\"><h2>Bad</h2><p>While some tenants have had good experiences with the apartments, multiple user reviews indicate significant issues with maintenance and property conditions. Complaints about mold, bugs, and general disrepair surfaced prominently, noting the age of the building and the lack of proactive maintenance. Long response times to repair requests were also noted by previous tenants, creating dissatisfaction among those expecting timely resolutions.</p><p>Additionally, many users have voiced concerns regarding the transparency and professionalism of the management team. Issues related to unreturned security deposits and unclear billing practices have also been highlighted, causing frustration and distrust among residents. Several complaints indicated that secure communication about safety and maintenance requests often felt neglected.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThe challenges faced by tenants at Village Apartments include serious allegations regarding the property manager's behavior, described as neurotic and aggressive. Instances of unannounced entries into apartments and a confrontational approach to tenant interactions were particularly alarming for some residents. This bred an atmosphere of discomfort and distrust, particularly for users dealing with ongoing issues with the management.</p><pMoreover, the lack of professionalism among some staff members contributed to a negative experience for many residents, as evidenced by multiple reports of rude interactions and perceived harassment. The enormity of complaints about lost deposits and withheld communication is a clear indicator that some tenants did not see their concerns adequately addressed, creating an overall sentiment of disillusionment within the community.</p></section>"
  }
}