{
  "name": "Village Apartments",
  "slug": "village-apartments",
  "company_type": "Property",
  "address": "3310 Alderwood Ave j1, Bellingham, WA 98225",
  "review_count": 31,
  "average_rating": 2.94,
  "reviews": {
    "google_reviews": [
      {
        "author": "Paige Pettit",
        "rating": 5,
        "review": "I had a wonderful experience renting with Village apartments 2022-2023. If I was back in town and could get in a two bedroom unit, I would jump on it. I was absolutely hesitant with the Google reviews that mentioned a terrible property manager- but thank God for turnover because we had an excellent experience with Morgan (new PM). She was confident, helpful, kind, and knowledgeable. She treated all tenants with respect, loves pets, and was so amazing",
        "owner_response": null
      },
      {
        "author": "Rachelle T.W.",
        "rating": 1,
        "review": "I lived there for a few years and the building is old and has mold and make sure you look for bugs and everything.",
        "owner_response": null
      },
      {
        "author": "Dana Carlson",
        "rating": 5,
        "review": "Morgan, the property manager has been great! Very responsive, explaining everything clearly, professional and helpful. My neighbors have been amazing as well. Friendly and introduced themselves. People always walking dogs. Nice atmosphere!",
        "owner_response": null
      },
      {
        "author": "Wendy Tung",
        "rating": 5,
        "review": "Firstly, the property manager Morgan is amazing. I was thrown off by some of the reviews for the previous property manager... but Morgan is CHEFS KISS fantastic. She's responsive, personable, and goes above and beyond if you encounter any issues. Just the best person to deal with.\n\nMy cat and I moved here when I needed to downsize. The 1br/1bth is small, but I've made it work. You'll definitely need to buy furniture that doubles as storage as storage space is very limited. Neighbors are very respectful about the parking spaces and everyone parks in the same spots... so you're never struggling trying to find parking.\n\nI would recommend purchasing a dehumidifier to use during the spring/summer months to kick the moisture issue.\n\nIf you're looking for a fancy place... this isn't it. But it's comfortable and I've made it cozy. So there's that!",
        "owner_response": null
      },
      {
        "author": "Brian Kirst",
        "rating": 5,
        "review": "New manager Morgan is amazing. All previous reviews were due to bad manager previous to Morgan. Trust me! I lived here for three years. Former manager Charlene was not a great fit for the apartments. She was very difficult and not a great charmer.\nLook, this place isnt perfect. If you are looking for basic, no thrills, no special treatment. This is your place. Pay your rent on time, follow the rules and communicate with Morgan, she is great. If you do this, this place will be a good home.",
        "owner_response": null
      },
      {
        "author": "Kelsey",
        "rating": 1,
        "review": "Moldy, cheap, slow response to repair requests, and worst of all: property manager is neurotic and one of the strangest and most aggressive people I have ever had the misfortune of dealing with.\nShe seems to have little to no supervision and does what she wants. She will not send you statements or receipts for anything you pay for. She will not mail you your security deposit. She will not share the owners contact information because she does not want to be in trouble. As soon as you ask for proof of anything, for information, or for any updates about repairs or charges or anything -  she will shut down and be completely uncooperative and combative.\n\nShe will enter your apartment unannounced and while you are not home. She will walk around the back of the properties and peep through windows if you leave the curtains open.\n\nYou wont get your money back and she wont return calls from new landlords checking on rental history. Her office is like a black hole where your receipts, money, and paperwork disappear. Just avoid this place.",
        "owner_response": null
      },
      {
        "author": "Ty-Hawk Sabin",
        "rating": 1,
        "review": "Be very careful renting here. Small apartments, high rent, rude landlord. You have to ask a hundred times to have anything fixed and even than they will clam you are harassing them. My elderly mom lives here. The landlord has harassed, me her son, for visiting, and even worse tried to say she is not allowed to babysit her grandson. My mom is an excellent renter, she keeps everything clean and neat, pays rent on time, but because she is on housing and elderly they will be rude to her even to her face .Currently trying to get her out of here, renter be warned.",
        "owner_response": null
      },
      {
        "author": "kevin curtis",
        "rating": 1,
        "review": "Very small and old, no a/c and only baseboard heat.  No parking controls, some people have multiple vehicles and if anyone has guests there may be no parking for you when you come home.  Its been 2 months since my move out and I still haven't received a refund or accounting of my deposit.\nI will live in my car before I ever move back into a Speck property  ....",
        "owner_response": null
      },
      {
        "author": "Jamie Alvarez",
        "rating": 4,
        "review": "Definitely one of the cleanest and cheapest laundry facilities I've seen at apts.",
        "owner_response": null
      },
      {
        "author": "Campn Pro",
        "rating": 2,
        "review": "Apt manager very unprofessional. Small place. Parking issues. I like the location though. Somewhat quiet.",
        "owner_response": null
      },
      {
        "author": "Edward Aguirre",
        "rating": 2,
        "review": "Overpriced..no ac no c\n\nentral heat. No maintenance man..they use contract labor, but you can't get anything fixed.",
        "owner_response": null
      },
      {
        "author": "Denise Prowell",
        "rating": 3,
        "review": "They are fairly up to date and the grounds are kept up fairly good",
        "owner_response": null
      },
      {
        "author": "Jim Mercer",
        "rating": 1,
        "review": "Buy a van and live down by the river before ever considering moving to this dump!",
        "owner_response": null
      },
      {
        "author": "Shann Ruggles",
        "rating": 1,
        "review": "They absconded my $825 deposit!! What more can I say. ",
        "owner_response": null
      },
      {
        "author": "Austin ___",
        "rating": 3,
        "review": "Very small and seems overpriced. Disclaimer: I do not live here, my girlfriend does.",
        "owner_response": null
      },
      {
        "author": "Mary Griffin",
        "rating": 1,
        "review": "I lived there for several years, it's a hor",
        "owner_response": null
      },
      {
        "author": "Carl Graber",
        "rating": 5,
        "review": "excellent place for everyone",
        "owner_response": null
      },
      {
        "author": "Carl G",
        "rating": 5,
        "review": "Great appatarpments",
        "owner_response": null
      },
      {
        "author": "Amy Record",
        "rating": 1,
        "review": "Discriminatory",
        "owner_response": null
      },
      {
        "author": "Sierra Vasquez",
        "rating": 1,
        "review": "Unprofessional.",
        "owner_response": null
      },
      {
        "author": "Bshk Bob",
        "rating": 4,
        "review": "These are Apartments",
        "owner_response": null
      },
      {
        "author": "Mustafa Wadalhaj",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Trinity Banks",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "jess mcnutt",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Dani Freeland",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Dana Eckert",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Natasha Aven",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cara Rasmussen",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Ashley Pederson",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Snowy",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 21,
  "adjusted_average_rating": 2.71,
  "distribution": {
    "1": 11,
    "2": 2,
    "3": 6,
    "4": 2,
    "5": 10
  },
  "summary": {
    "created_timestamp": 1739205663,
    "text": "<section id=\"good\"><h2>Good</h2><p>In this article, Village Apartments receive credit for some positive aspects worth noting. Several user reviews highlight the welcoming atmosphere cultivated under the management of Morgan, who appears to have made significant improvements since taking over. Tenants appreciate the respectful community, and Morgan's friendly demeanor has played a key role in shaping a pleasant living environment. Additionally, the apartment complex offers one-bedroom units that are small but manageable with creative storage solutions. Tenants have described the area as somewhat quiet and conducive to a comfortable lifestyle, with a nice balance of price and amenities.</p><p>Besides the responsive management, some reviewers have praised the basic but adequate laundry facilities. One tenant specifically stated that the laundry setup is among the cleanest and cheapest they've encountered in apartment complexes. Others mention the well-maintained grounds and a fairly modern appearance, which contribute to a decent residential experience. The property's location near Bellingham offers convenience, further enhancing its appeal, especially for those seeking a cozy place to call home.</p></section><section id=\"great\"><h2>Great</h2><p>Morgan, the new property manager, is a recurring highlight in several user reviews. Residents commend her for being supportive, responsive, and very professional, emphasizing how these qualities have significantly transformed their experience at Village Apartments. Some renters noted how her clear communication and dedication have set a friendly tone throughout the complex. They appreciate the pet-friendly environment and how Morgan handles issues proactively, instilling confidence and satisfaction among tenants.</p><p>Another impressive aspect highlighted by tenants is the sense of community among the neighbors. Many find the atmosphere at Village Apartments inviting and inclusive, with neighbors introducing themselves and maintaining friendly interactions. This positive neighborly conduct cultivated a harmonious living experience for many. Tenants also mention their satisfaction with the ability to find consistent parking spaces due to the respectful parking habits among residents, enhancing their overall living experience.</p></section><section id=\"bad\"><h2>Bad</h2><p>Despite the positive feedback, Village Apartments have not escaped criticism according to user reviews. Some tenants have highlighted drawbacks related to unit conditions, such as issues with mold and the age of the buildings. A few renters noted how these older apartments can come with their share of inconveniences, such as bugs and limited space. Furthermore, maintenance services have been criticized for slow response times, particularly under a previous property manager, which resulted in unresolved repair requests.</p><p>Besides maintenance issues, parking difficulties are a recurring theme among dissatisfied tenants. Some users pointed out the lack of designated parking, leading to scenarios where parking spaces become scarce, especially when visitors are around. This oversight in parking management contributes to the frustration experienced by residents, impacting their overall satisfaction with living at the complex. The property's lack of modern amenities, like central air conditioning, also adds to the negative sentiment expressed by some tenants.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Some user reviews of Village Apartments reveal more severe concerns, specifically focusing on previous management. Under the former property manager, tenants reported various issues, including breaches of privacy, unprofessional behavior, and poor communication. Several reviews narrate troubling experiences where the manager allegedly entered apartments unannounced and peeped through windows, raising significant privacy and ethical concerns. These allegations explain why several former tenants strongly advise avoiding this property—citing these encounters as principal reasons for their dissatisfaction.</p><p>Moreover, there are worrying accounts of financial disputes. A few previous residents claim they never received their security deposits back or even statements explaining withheld amounts. Such experiences have led to significant mistrust, with some users describing management practices as discriminatory and uncooperative. The absence of a clear and proper protocol for handling tenant fines and issues exacerbates the difficulties faced by residents, resulting in some distressing assessments of living conditions at the property.</p></section>"
  }
}