{
  "name": "Village at Baker Creek",
  "slug": "village-at-baker-creek",
  "company_type": "Property",
  "address": "3811-3974 Primrose Ln, Bellingham, WA 98226",
  "review_count": 52,
  "average_rating": 2.15,
  "reviews": {
    "google_reviews": [
      {
        "author": "Gabriela Torres",
        "rating": 1,
        "review": "Zero star!!! Terrible place. My cousins lived here for 3 years and never came to fix anything. Their upstairs flooded multiple times cause the walls to get black mold and never came to fix it or even try to clean it! Then hit them with a 60 day notice for no reason. The landlords were constantly causing drama and telling lies to their neighbors and even the owners daughter was causing issues saying my cousins did drugs etc. crazy how these buildings are still being rented out or even lived in. How unfortunate we pay such high prices for a place to live that dont even care to look after their tenants or their buildings! Do not come here. Exactly why it has 2.2 star rating.",
        "owner_response": null
      },
      {
        "author": "Abraham A.",
        "rating": 1,
        "review": "By far some of those most disrespectful set of women I've probably ever met in a professional setting. Imagine recieving passive-aggressive texts from the office and seeing anxiety filled faces when you show up to them. Lady sits in the office with her child regularly, unprofessionally carying the baby around as she speaks to tenants. There's this other linebacker of a woman that tries to express authority but sounds more like a crazed baboon, cursed me out and told me she was gonna charge me another months rent",
        "owner_response": null
      },
      {
        "author": "Brenda",
        "rating": 2,
        "review": "The management is very friendly in person but send very passive aggressive and sometimes aggressive texts. The emails and messages usually feel a little more aggressive than necessary. Overall, far from the worst place to rent from in Bellingham. I would rent here again.\n\nIt also seems like a safety hazard to only have one exit for all of the parking, especially when that exit sometimes gets blocked by large trucks with nowhere else to park and no hurry to get going.",
        "owner_response": null
      },
      {
        "author": "Haleigh Williams",
        "rating": 1,
        "review": "Honestly shocked this apartment complex hasnt been sued out of their minds yet. From not deeming apartments unlivable for the sake of insurance so their tenants can have safe dwellings to letting people go weeks without power. I hope the city comes for this complex and every wicked and cruel person involved.",
        "owner_response": {
          "text": "Hello, I don't see that you are a tenant with Village at Baker Creek, so I am wondering if you meant to leave this review elsewhere. If you meant to leave it on Village at Baker Creek website then you have been misinformed about the situation. There were 3 units that had a partial power outage, and it wasn't for weeks. It also wasn't the fault of Village at Baker Creek or staff. The power was shut off for safety issues by PSE and a licensed electrician. Over 100 feet of wire had to be excavated and replaced due to a manufacturing issue that caused the wires in the ground to actually melt. This work took some coordination and time because PSE, the electrician and the City all had to be on site at the same time to get buildings disconnected and then back on again once the work was inspected. You mention the City \"coming\" for the complex, but the City knew what was happening. The City inspected it all and signed off on it all. Nothing illegal was done. The wires in the ground needed to be replaced. We had to call before digging to get all utilities in ground marked before any work could be done. Vendors don't work 24/7 and every single vendor involved got to the complex as quickly as they possibly could to get the work started. Tenants were notified every step of they way, and even given updates during the weekend while the work was being done. As soon as management was notified that the power needed to be off for an extended time all tenants were contacted with that information. We understand the frustration with it all and wish there was something else that could have been done, but there wasn't and we followed every legal protocol we are required to. Tenants are required to have renters insurance for things like this. In case of an outage and a hotel being needed. The actual  full outage lasted a day and a half. PSE, the electrician and all other vendors work overtime through the weekend to get it repaired in a safe manner for everyone and get the approval from PSE to turn it back on. This was out of our hands completely. We didn't ask for this happen, and certainly hope it never happens again. Unfortunately, things do happen that are out the hands of staff and owners. This situation doesn't make the unit \"unlivable\" as you claim. We took care of an unsafe wire like we are required to do. Our units are inspected on a regular basis from the City and nothing has ever been deemed unlivable. We hope this clears up the misinformation you were told and the misinformation in this review. Have a great day. "
        }
      },
      {
        "author": "Marie Clarice Blair",
        "rating": 1,
        "review": "The management staff here is very unprofessional. The front desk person is wonderful. The other two ladies are the worst people to deal with. They selectively enforce rules, they make you feel like you are the problem. They don't want anyone to enter their office, they prefer to treat you like trash through text. Please leave and do something else because you are obviously not happy working here. Terribly terribly terribly",
        "owner_response": null
      },
      {
        "author": "rimple kaur",
        "rating": 1,
        "review": "I dont live here. I have family that live here and we had some questions about some transactions going through automatically from their online portal my family uses to pay their rent. we didnt go in accusing anyone. We just wanted a simple explanation on the transactions. instead, what we faced was a furious, aggravated woman who used the F word and retarded. we still stayed calm and said we just wanted you to explain it to us which she did but while explaining she kept on getting heated. After our conversation I let her know I did not appreciate her language and she said that was my opinion, being hostile towards a customer is not an opinion it is a verbal assault towards us.\n\nRimple Kaur",
        "owner_response": null
      },
      {
        "author": "Nick Rose",
        "rating": 5,
        "review": "Im shocked by the things some people have experienced here. My girlfriend and I have lived here for a year and a half now. We moved in by taking over a lease. While the office did seem a bit disorganized during the lease takeover process, they were very straightforward about what we and the current tenants needed to do to complete the lease takeover. We had no problems whatsoever moving in. In the time that we have lived here, we have never had a poor experience with management. In fact, when the stay at home order began, we became concerned with how we would pay our rent. We emailed management and they simply asked us to pay what we could and that we could arrange the leftover on a payment plan. While that was unnecessary, we were very appreciative that they were willing to help. Overall, everyone will have their own experience, but I suggest that people at least give this company a chance rather than believing some poor google reviews.\n\nAlso, whenever we have had issues in our unit, maintenance has always been very prompt and happy to help with whatever we needed. All of our issues were resolved the day of or the following Monday if we reported it over the weekend. It is honestly a pleasure to see the maintenance man around the complex. He always has a smile on his face and a couple jokes to add as well. Of the 3 apartments we have had in Bellingham, Village at Baker Creek has by far been the best experience.",
        "owner_response": null
      },
      {
        "author": "Casey Hokanson",
        "rating": 4,
        "review": "We moved in here shortly after moving back from Yakima. We knew that it was going to be a short stay. The management was very helpful with getting our lease takeover done. The location is nice and our newer apartment building was nice and well kept up. The only issue we had here is we had our stove stop working and we were practically called liars from management. It was a very frustrating experience. Other than that it was a fine experience.",
        "owner_response": {
          "text": "Thank you for the kind words. It was our pleasure to have you live with us. You were fantastic tenants. "
        }
      },
      {
        "author": "Shan Main",
        "rating": 2,
        "review": "Great place to live. Apartment was nice and had no issues with the office staff. Maintenance was prompt. My only problem was they only gave us $35 of our deposit back. My roommate and I cleaned that place from top to bottom. It was literally cleaner than when we moved in and they charged us over $250 for a cleaning fee. The $140 for the carpets, fine. But the amount for the cleaning fee was kind of BS.",
        "owner_response": null
      },
      {
        "author": "Emmett Whitehall",
        "rating": 1,
        "review": "DO NOT RENT FROM HERE!\n\nIf I could give this place a zero I would. Neighbors were great and so was the maintenance crew. The management, however, were the absolute rudest, the most passive-aggressive, unqualified, unprofessional staff I've EVER had to deal with in all my years of renting. From the constant rude emails, letters, texts and even being screamed at in person by the manager. They also always seemed to \"lose\" important paperwork/documents.\n\nAs for the buildings, all cheaply made and falling apart constantly. I've never in my life had to put in so many maintenance requests in because the structure it constantly falling apart. At one point, we had to have our ceilings ripped out because pipes connecting to the bathroom were not insulated properly and leaked through the ceiling. In the winter the insulation is so poor, that when it snows, icicles grow from windows and vents.",
        "owner_response": null
      },
      {
        "author": "Mike Agnini",
        "rating": 1,
        "review": "Id give zero if I could. The mgmt staff here is very unprofessional and do things that should get them fired, from screaming at tenants to keeping the fitness room closed while health department isnt requiring it. They selectively enforce rules ( I see dogs off leash all the time, I went out after waking up to let my dog go to the bathroom for 3 minutes, not a walk, and the old lady screamed at me from across the street, then sent a notice to comply or vacate threat which is supposed to come after 3 warnings). I hate moving but may consider leaving after the 1st year just because of the office staff. Maintenance is nice and on their tasks, A+ for them. Parking is a nightmare. The units to the right of the complex (which I reside in) are old and not well kept, but come with a higher price (although lower than new construction). The unit was dirty when I moved in and had to deep clean it myself, even though they will charge me a cleaning fee when I move and not clean the apt again. Pretty slummy actions on just the mgmt staffs end Location is great, could be a nice complex with competent mgmt.",
        "owner_response": null
      },
      {
        "author": "Bella mango",
        "rating": 1,
        "review": "Theyve cost me now $600 in parking tickets on their private property because i have nowhere to park. If you work nights dont move here.\nEdit: Just found mold around a window. On not even three year old apartments.\nEdit again: No fault evicted for who knows what reason. Absolutely not raising the stars they were rude to the end. When we first got here it was good, but was quickly bought by Belleau Woods and went through so many management changes I dont even know who is in the office any more. They yelled at us for parking the moving van out of the way too. I'm just really disappointed, we were quiet and never paid late. Pretty sure they are just remodeling to hike up rent but trust me these aren't worth the money either way.\nEdit yet again: Google it no fault eviction is what we got you can couch this in any language you like to try and diminish fault, given no reason so seriously their response is poor damage control. I'm not trying to hose them honestly our new place is really nice! But not these guys.",
        "owner_response": null
      },
      {
        "author": "Izabela Ramos",
        "rating": 5,
        "review": "I have nothing but good things to say about VABC! They have made the crazy process of finding an apartment so much easier for my partner and I! Out of all the places we considered no place was as kind or helpful as VABC! Both Brandee and Haleigh have been amazing! We just got our keys this week and the complex is amazing also! Very nice location, close to the mall but just off to the side enough to not feel suffocated by the city. Overall the complex is really nice and well maintained. When we first made it into our unit there were a few things that needed fixed and had been left poorly by the old tenants. We filled out our move in sheet and within the hour we were reached out to and they set up maintenance to come in the next morning for us! I couldnt have any greater things to say about the team at VABC!",
        "owner_response": null
      },
      {
        "author": "Jos",
        "rating": 1,
        "review": "We have been long time renters and this place has drastically gone down hill since the day we moved in. Ever since we moved in years ago we've been waiting on an ordered item to come in so that they could fix an item in our apartment. Years later, and after constantly bugging the leasing office, we are STILL waiting and the item is \"still on order\" to present day. Not to mention we have also been waiting on several other items to be fixed since the day we moved in that havent. We've literally just given up on fighting them about it.\n\nIf and when you need to fill out a maintenance form the follow up can take around two weeks or more for any response, let alone any work to actually be done. Even then, nothing is genuinely fixed. The maintenance workers slap a bandaid on it and call it good until the minor problem becomes an even bigger problem. A huge reflection on their low budget for maintenance. One time, we were even told to go to Home Depot, buy the item, and fix it ourselves. While I'm sure it's none of the maintenance workers fault directly, and more or less just cruddy management, the complex goes through maintenance workers quicker than a speeding bullet. So by the time that a minor problem becomes a bigger problem the new maintenance worker has no idea what the last one did and just manages to put yet another bandaid on the problem and leaving it for the next guy. It's not just the maintenance workers either. Receptionists here in the leasing office change every two to three months as well, which leads to even more confusion all around. It's a huge mess.\n\nLastly, for the longest time we were notified in our mail boxes if we received a package. However, since Graeme Dyehouse became apart of management we no longer receive any notification at all. We have had care packages sent to us by family that didn't get picked up for months because of the sudden change in management. No notification at all of this change either. He has been the major downfall to the management here at Village at Baker Creek. Very difficult to work with, rude, and has a \"I'm-better-than-you\" egotistical complex. If you can manage to, stay away and find a better complex!!!",
        "owner_response": null
      },
      {
        "author": "gurbinder garcha",
        "rating": 1,
        "review": "My friends live in these apartments they are the worst apartments to live in the whole entire what come county not only they have mold growing everywhere from windows to  underneath the sinks they are the worst management ever to manage a apartment complex there is no parking no cleaning the owners need to take action fast before they turn this property into trash they need to immediately get new management to take over these people in the office are rude disrespectful and lazy. It snowed for a whole week pretty much they did not care to clean or shovel any snow at all please friends do not move to this trash apartments.",
        "owner_response": null
      },
      {
        "author": "Carter Thomas",
        "rating": 1,
        "review": "Great location near Bellis Fair mall.  The complex is beautifully maintained by hard working staff.  The parking is plenty decent for such a big complex.  It would probably be close to ideal if you could only remove and replace whoever it is \"managing\".  There's a reason all these reviews keep mentioning all the ways they're terrible.  Expect absolutely no compassion or assistance from them unless explicitly required by the lease.",
        "owner_response": null
      },
      {
        "author": "Strateleven",
        "rating": 1,
        "review": "Management is the worst here that I have ever seen. They do not care about anybody except themselves, they close down the office whenever without telling anybody, they send back your packages without warning you, and they do not care for your safety or wellbeing. During my time living at Village, they tried to increase my rent mid-lease and when I asked them about it they refused to fix the lease, reduce my rent, told me I was wrong and that if I don't pay it that I'll be late on rent and will have to pay added fees. Told management I knew my legal rights and they better fix this, so they agreed to look into it and get back to me. They never got back to me and forced me to hunt them down, again, and when I finally got ahold of somebody they told me they were wrong and it was illegal for them to try to do that. They also took over 2 weeks to fix my washing machine, same deal with my dryer when it broke, they try to charge you for others not following the rules, but when you go to report issues (such as being harassed by neighbors because they're drunk and disorderly) management refuses to do anything about it. This management is the sleaziest, sketchiest, careless bunch of people I have ever met. Rent at your own risk, do not recommend it here.",
        "owner_response": null
      },
      {
        "author": "brian DeFries",
        "rating": 1,
        "review": "Im giving 1 star, but that is still to good of a rating for this mgmt service. Very pleased when starting process to move in. Once that was complete the respect and professionalism was nonexistent. When asked questions about issues with the residence they yell and scream at you then refuse to listen to the issue and hang up. I had lease take over, which was set to expire 3 months later. Rent was 1600 and they raised it to 1800. One staff member tells you one thing, then the next tells you something different. Upon move out and turning keys in I mentioned I wanted to be present for the walkthrough. I was told that wasnt possible. Then the next person says you needed to arrange that before the keys were turned in. My request was made at the time of turning the keys in.  After receiving my move out statement I was told to call the office on a specific number. I did just that. While waiting to be transferred, something came up and I said \"jesus christ\" completely unrelated to the call or a specific person. Heather picked up the phone and throughout cussed me out for saying jesus christ to her coworker and when it explained she called me a liar and hung up on me. The staff has no respect for clients, tenants, or themselves. The level of professionalism lacks beyond belief.  If you are on the fence about this company, it's for good reason and I'd strongly suggest finding a different mgmt company to find housing with.",
        "owner_response": null
      },
      {
        "author": "Yawen GAO",
        "rating": 1,
        "review": "I took a day off to drive to Bellingham for apartment viewing. They forgot about my appointment which I made three days ago, and told me I can't view the unit because they needed 24-hour notice to the current resident. The manager sat at her office, letting the receptionist to pass her messages to me. No apology. If they treated a potential tenant this way, I can't imagine how the current ones will be treated.",
        "owner_response": null
      },
      {
        "author": "Ahren Rhoden",
        "rating": 1,
        "review": "Wildly unprofessional and rude staff, inconsistent application of their rules, frequent passive agressive door mailers, emails, and texts. Grounds are poorly maintained with several major safety hazards. I don't think in my multiple years living here I've met a single neighbor who likes living here",
        "owner_response": null
      },
      {
        "author": "Jill Robey",
        "rating": 5,
        "review": "Management and staff are wonderful! Maintenance requests are done in a timely manner. I would highly recommend living here.",
        "owner_response": null
      },
      {
        "author": "Tiarrah Banks",
        "rating": 1,
        "review": "Front Desk Receptionist Alena is very unprofessional. This office does not give good customer service, especially for someone who never is late on rent or other utilities.",
        "owner_response": null
      },
      {
        "author": "Raphael Grover",
        "rating": 5,
        "review": "Great location near Bellis Fair mall.  The complex is beautifully maintained by hard working staff.  The parking is plenty decent for such a big complex.",
        "owner_response": null
      },
      {
        "author": "Scott McKeever",
        "rating": 1,
        "review": "Poor management.  They don't even regulate their own rules or do anything about them.  The whole place should be shut down.  Or bought by a respectable, responsible, local owner.",
        "owner_response": null
      },
      {
        "author": "Bronnie Sawicki",
        "rating": 5,
        "review": "Lived here  6 years. I lovevit",
        "owner_response": null
      },
      {
        "author": "Jeffery Schwarz",
        "rating": 1,
        "review": "They were the worst landlords I have ever had. It seemed to me like they made every attempt to cheat me and squeeze extra money out of me.",
        "owner_response": null
      },
      {
        "author": "Howard Valentine",
        "rating": 5,
        "review": "Great meal of Black Cod, scallops, asparagus, corn on the cob, sweet potato and tomatoes",
        "owner_response": null
      },
      {
        "author": "Jeremy Walker",
        "rating": 5,
        "review": "Really nice place to live!",
        "owner_response": null
      },
      {
        "author": "Ryan Nelson",
        "rating": 5,
        "review": "Very nice neighborhood and the site is well maintained.",
        "owner_response": null
      },
      {
        "author": "Jessica Thomas",
        "rating": 1,
        "review": "Awful service, office never keeps your paperwork filed properly and when you have copies they argue.",
        "owner_response": null
      },
      {
        "author": "Joe Skar",
        "rating": 1,
        "review": "I wouldn't wish these apartments on my worst enemy.",
        "owner_response": null
      },
      {
        "author": "Tristen rector",
        "rating": 4,
        "review": "A little to expensive for my family and I but we called it home.",
        "owner_response": null
      },
      {
        "author": "Ali Kurtz",
        "rating": 5,
        "review": "Very beautiful apts...",
        "owner_response": null
      },
      {
        "author": "Melissa Maxwell",
        "rating": 1,
        "review": "Very unprofessional staff for management.",
        "owner_response": null
      },
      {
        "author": "Clinton Jameson",
        "rating": 2,
        "review": "Units are way to small.",
        "owner_response": null
      },
      {
        "author": "Eric Isenhart",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Jack",
        "rating": 1,
        "review": "",
        "owner_response": {
          "text": "Hi. We would love to have you stop by the office so we can discuss why you gave us 1 star and hear what you have to say. Please give us a call to set something up so we can discuss steps to take to change your mind. Thank you and have a great day! "
        }
      },
      {
        "author": "Denise Prowell",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Milangela Diaz",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "loveleen virk",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "N H",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Joshua Crabtree",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Natalie Olsen",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Raphael G.",
        "rating": 5,
        "review": "Great location in town near all the shops clean and well maintained ample parking.",
        "owner_response": null
      },
      {
        "author": "Paige N.",
        "rating": 5,
        "review": "Not sure what all the bad reviews are about. I've lived here for just about 9 months so I haven't gone through a lease renewal but so far this place has been awesome. Management has been great and super friendly and helped out with any issues or questions I've had in a timely manner. Maintenance requests have always been taken care of either same day or the next day as long as it's not on a weekend (I imagine they would tend to urgent issues on the weekend too). The maintenance guy is super friendly and always cracking jokes and says hello anytime you pass him by.\nI really love the apartment because there's hardly any freeway noise, the unit and deck are both very spacious, the place has a nice view, it's a very central location to Bellingham, parking has never been an issue and its affordable for Bellingham prices. Of course issues can arise when either ending a lease or renewing so I'll update if that's the case but I really don't imagine having any issues considering how great it's been so far.",
        "owner_response": null
      },
      {
        "author": "Mike A.",
        "rating": 1,
        "review": "I'd give zero if I could. The mgmt staff here is very unprofessional and do things that should get them fired, from screaming at tenants to keeping the fitness room closed while health department isn't requiring it. They selectively enforce rules ( I see dogs off leash all the time, I went out after waking up to let my dog go to the bathroom for 3 minutes, not a walk, and the old lady screamed at me from across the street, then sent a notice to comply or vacate threat which is supposed to come after 3 warnings). I hate moving but may consider leaving after the 1st year just because of the office staff. Maintenance is nice and on their tasks, A+ for them. Parking is a nightmare. The units to the right of the complex (which I reside in) are old and not well kept, but come with a higher price (although lower than new construction). The unit was dirty when I moved in and had to deep clean it myself, even though they will charge me a cleaning fee when I move and not clean the apt again. Pretty slummy actions on just the mgmt staffs end Location is great, could be a nice complex with competent mgmt.",
        "owner_response": null
      },
      {
        "author": "Lisa W.",
        "rating": 1,
        "review": "Lived here 5 years, always paid the rent and bills on time,  never asked the management for anything except once to repair the broken washing machine...the washer - dryer unit finally got replaced with an older one after more than a month with no washer-dryer.. Didn't complain and just used it when I finally got it. I have been a homeowner and a landlord myself ... I cleaned the place conscientiously and thoroughly when I moved out, did not damage anything, including the walls, but still got charged a $125 cleaning and painting fee. (in addition to the deep carpet cleaning fee which was an expected cost).  When asked to explain the cleaning fee, the current manager was rude, disrespectful and nitpicking. In retrospect I should not have even bothered to take such time and care cleaning the unit before I left, since there was no appreciation expressed and they only look for ways to keep your money however they can. Not impressed. Bad management and interpersonal skills. My car was broken into, parked in front of my unit, and things were stolen... after reporting it to the management, they agreed to notify the other tenants, but they did nothing. \nDon't expect to get back your security deposit and don't expect to be treated in a courteous or professional manner if you ever have to ask the management about anything at this complex. So glad to have moved out and bought my own place now. I hope the manager learns some management skills and how to be courteous with people. And lesson learned: don't bother cleaning the unit when you move out because you won't get your rightful security deposit back, anyway.",
        "owner_response": null
      },
      {
        "author": "Drift C.",
        "rating": 1,
        "review": "The worst experience ever! During a lease take over the management leaves the negotiation up to the tenants. This caused some problems because no help was received during the whole process. When I went to to the office to sign for the lease the manager YELLED at me and the current tenant \"You have been a waste of my time\"... Now that I am the tenant nothing but horrible manners and service from the manager.\n\nThe apartments are new and nice but the management is so bad I recommend others to reconsider and look for other places because they can ruin your experience living there.",
        "owner_response": null
      },
      {
        "author": "Tom D.",
        "rating": 1,
        "review": "1. Paper thin walls- We always hear our neighbors on all sides and we're sure they can hear everything we say\n2. Something always needs fixing- From the moment we moved in over a year ago things have been breaking and were already broken when we moved in. The kitchen island wasn't mounted to the ground, the toilet leaks, etc. We have friends who complain of the same thing.\n3. Rude neighbors- This is probably just a personal thing to hate about this disgusting apartment complex\n4. Poor parking availability- Part of the reason we moved here in the first place was for improved parking. They just built newer apartments and yet the parking is still horrendous if you get home after 5pm\n5. Hidden fees- After you pay all of the ridiculous expenses and deposits to move in, they'll get you with some hidden extra deposits or charges. They also raise rent every year to where it's just funny how much they think it's worth to live here. I'm currently paying almost $1,000 a month for this shit hole.\n6. AWFUL management- The current landlord/manager is unbelievably rude, inconsiderate, and disrespectful. Having an issue with your apartment? He doesn't give a shit. Not feeling safe? He'll threaten you and disrespect you.",
        "owner_response": null
      },
      {
        "author": "Patience M.",
        "rating": 1,
        "review": "Management is the worst here that I have ever seen. They do not care about anybody except themselves, they close down the office whenever without telling anybody, they send back your packages without warning you, and they do not care for your safety or wellbeing. During my time living at Village, they tried to increase my rent mid-lease and when I asked them about it they refused to fix the lease, reduce my rent, told me I was wrong and that if I don't pay it that I'll be late on rent and will have to pay added fees. Told management I knew my legal rights and they better fix this, so they agreed to look into it and get back to me. They never got back to me and forced me to hunt them down, again, and when I finally got ahold of somebody they told me they were wrong and it was illegal for them to try to do that. They also took over 2 weeks to fix my washing machine, same deal with my dryer when it broke, they try to charge you for others not following the rules, but when you go to report issues (such as being harassed by neighbors because they're drunk and disorderly) management refuses to do anything about it. This management is the sleaziest, sketchiest, careless bunch of people I have ever met. Rent at your own risk, do not recommend it here.",
        "owner_response": null
      },
      {
        "author": "David H.",
        "rating": 1,
        "review": "POOR MANAGEMENT!  RIP OFF ARTISTS!!!  The management was unresponsive to multiple maintenance problems.  The management office was totally disorganized and their staff was always changing.  The staff never was able to give you a straight answer on anything.  When I finally moved out, they never sent me my deposit even though they sent mE a letter indicating that they would.  They refused to talk with me after telling me the check totaling hundreds of dollars was sent, but NEVER ARRIVED!!!!  DON'T BE FOOLED!!!",
        "owner_response": null
      },
      {
        "author": "Rehelin Z.",
        "rating": 1,
        "review": "In one year, three managements and turnovers with the office people. When trying to move into a smaller unit, they had no intention to help out, but insisted in paying another $45 application fee, $100 admin fee, another $500 deposit along with paying rent in the new unit even though I just paid my rent in the current apartment. So after paying 1100 for current apartment, they needed the rent \"right away\" for the new unit without giving any of the rent I just paid back. there was no compensation or working with me to avoid all the fees that are not necessary, especially because I've been a tenant for a long time and have already paid these fees and have an application.  They were acting like I was brand new. They said there's nothing they can do because \"they have other priorities right now\". Oh by the way, they purposely install the carpet like crap by making it loose in areas and separated  so they have to replace it when you move out and take your deposit.",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 44,
  "adjusted_average_rating": 2.2,
  "distribution": {
    "1": 33,
    "2": 4,
    "3": 0,
    "4": 4,
    "5": 11
  },
  "summary": {
    "created_timestamp": 1739095187,
    "text": "<section id=\"good\"><h2>Good</h2><p>Some user reviews highlight the pleasant aspects of living at Village at Baker Creek. Many residents appreciate the location, which is conveniently near shopping areas, and mention that the complex is generally well-maintained. A few tenants also reflect positively on their interactions with the maintenance staff, noting that they are friendly and prompt in addressing maintenance requests. For instance, one user indicated that maintenance issues were resolved quickly, often on the same day or the following weekend, showcasing a commitment to responsiveness in that area.</p><p>Furthermore, several reviews suggest that the apartments themselves are aesthetically pleasing and spacious, with a few residents mentioning that they enjoyed the layout and features of their units. The apparent efforts of management to provide assistance during challenging times, such as during the pandemic, where flexible payment arrangements were offered, also received commendation from some users. These experiences seem to propel a small but noticeable positive sentiment about certain operational aspects of the property.</p></section><section id=\"great\"><h2>Great</h2><p>While there are limited user reviews that can be categorized under 'Great,' a few tenants expressed strong satisfaction with their overall experiences. Specific individuals noted exemplary service from certain office staff who were reportedly friendly and helpful in addressing questions and concerns. These users highlighted efficient processes such as lease takeovers and that management responded swiftly when they had queries. This positive interaction seems to have made a significant impact on some residents, potentially offsetting some negative experiences others reported.</p><p>Moreover, some commendable characteristics of the community aside from maintenance include a sense of community and pleasant interactions with neighbors. A few users felt comfortable and safe in their units, indicating that their living experience outweighed some administrative issues. This positive rapport among tenants and the overall community ambiance can contribute to a more enjoyable living environment, reflective of a well-rounded experience.</p></section><section id=\"bad\"><h2>Bad</h2><p>User reviews reveal a consistent theme of poor communication and responsiveness from the management team. Several tenants reported frustrating experiences in trying to resolve maintenance issues, often having to wait extended periods for responses, sometimes weeks. For instance, one user described being told to resolve certain problems on their own, which indicates a lack of sufficient management support. On the administrative front, many users expressed dissatisfaction with the management's handling of deposit returns and the application of cleaning fees that seemed excessive following their move-outs.</p><p>In terms of professionalism, many felt that the management team was often rude and dismissive, creating an unwelcoming environment for residents. Some user reviews recounted experiences involving screaming management during disputes, contributing to a tense and uncomfortable atmosphere. These patterns suggest that while maintenance staff might be well-regarded, management's reputation leaves much to be desired, underscoring systemic issues related to tenant relations and accountability.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>The reviews for Village at Baker Creek reveal alarming issues regarding overall management quality and tenant mistreatment. Numerous users expressed outrage over purported mold problems, safety hazards, and general unprofessional conduct from staff members. One tenant shared a deeply unsettling experience about compromised living conditions, alleging that proper repairs were ignored, leading to situations like flooding due to inadequate responses from management. Such reports raise significant concerns regarding the safety and livability of the apartments.</p><p>Additionally, several reviews pointed to deceitful practices, particularly concerning security deposits, with many residents believing they were unfairly charged fees or not refunded amounts owed upon moving out. For instance, one user described the management's failure to return their deposit, further compounded by ongoing issues with poor maintenance and inconsistent rules enforcement. The consistency in negative user reviews paints a concerning picture of a management team that many believe fails to prioritize tenant welfare, making Village at Baker Creek a difficult recommendation for potential renters.</p></section>"
  }
}