{
  "name": "Vintage at Bellingham",
  "slug": "vintage-at-bellingham",
  "company_type": "Property",
  "address": "4625 Cordata Pkwy, Bellingham, WA 98226",
  "review_count": 42,
  "average_rating": 4.62,
  "reviews": {
    "google_reviews": [
      {
        "author": "Sandra Sowada",
        "rating": 5.0,
        "review": "I met with Jackie and she explained the apartment application process in clear understandable language but also with warmth and clarity about the property and how living at Vintage might be for me. On the tour she showed me everything and every where, even the trash room (which was clean and freshly scrubbed). When we passed other residents they greeted each other and it was evident Jackie has a great relationship with them. The building is in excellent shape even taking in its age; No obvious wear and tear or deferred maintenance. I am looking forward to a future with my dog living at Vintage Bellingham.",
        "ownerResponse": {
          "text": "Thank you Sandra for the 5 star review!  We look forward to having you be part of our community!\n"
        }
      },
      {
        "author": "LER",
        "rating": 5.0,
        "review": "Jackie, the Community Director, gave me a wonderful tour of the apartment amenities and property  this week.  She was very welcoming and informative . The property is very clean and well-maintained so I would feel safe living there. There are  also lots of fun activities to join in on.  Very good impression...",
        "ownerResponse": {
          "text": "Hi Lynn,\nThank you so much for the 5 star review!  We look forward to seeing you soon!"
        }
      },
      {
        "author": "Christine Bickel",
        "rating": 5.0,
        "review": "The manager, Jackie, is great and made the application/move in process for my dad super easy! I'm so happy he'll be living at Vintage at Bellingham - the building is clean and well maintained, the grounds are beautiful, and it's convenient for his needs.",
        "ownerResponse": {
          "text": "Thank you for the 5 Star review!  It is so nice to have your dad here.  If he needs anything, we are here for him!"
        }
      },
      {
        "author": "Anne Steirer",
        "rating": 5.0,
        "review": "Im grateful to live in my quiet, safe and clean building, thanks to the careful attention to details by Jackie, our marvelous, calm, caring and efficient Community Director. The experienced maintenance crew work to care for the indoors as well as the outdoor lawn, flowers and trees during every season. Friendly, interesting tenants daily enjoy a variety of active or quiet pursuits. Meet them at coffee hour, bingo, dominoes, card games, pool table, WII bowling, movies, books, puzzles and Seahawks pep rallies.",
        "ownerResponse": {
          "text": "Hi Anne,  Thank you so much for the 5 star review!  We do the best we can.  Thank you for being such a wonderful resident!"
        }
      },
      {
        "author": "Barb Clark",
        "rating": 5.0,
        "review": "I moved in iNov\nAbsolutely love it\nEveryone so friendly and Jackie (manage ) is wonderful!\nI feel so safe and comfortable here!\nIy is so quiet\nLots of activites\nThe grounds and indoors are kept beautiful\n\nDo wish had a little dog park\nAre dog walking areas but wish could turn loose to run and play",
        "ownerResponse": {
          "text": "Thank you so much Barb!  We try very hard to make sure you and the rest of our residents are well taken care of."
        }
      },
      {
        "author": "Berneta Von Essen",
        "rating": 5.0,
        "review": "I love the care & respect that The Vintage gives me & all residents.\nMaintenance is solved in a mannner of days but most likely same day.\nI've never been in a place like this before!\nTHANK YOU!",
        "ownerResponse": {
          "text": "Thank you for the 5 star review Berneta!  We do the best that we can and it wonderful to be appreciated!"
        }
      },
      {
        "author": "Frank",
        "rating": 1.0,
        "review": "The facility looked nice from the outside, but a completely undeserved rude reception this morning from the office manager was a turn off. Dour and unfriendly from the first words out of her lips, to potential new residents no less, is a key indicator of how they operate normally. Yes, we were let in by friendly residents after they saw us struggling to get an answer from the front call button first (which the manager bluntly admitted she didn't answer).   We live by the Golden Rule so were shocked at being treated so coldly for no reason.  We quickly left and found very friendly walk-in receptions at both Spring Creek and Affinity.   I don't normally post comments, but felt anyone looking here should be forewarned.",
        "ownerResponse": {
          "text": "I'm sorry that you felt that way.  We are a secure community for the benefits of our residents.  You followed people in and when I asked you about it, you misrepresented yourself and chose to leave rather than visiting with me.  We protect our residents and their privacy.  If you would like to set an appointment and visit further please call me at 360-715-0871. Thank you!"
        }
      },
      {
        "author": "Charlyn Whitlock",
        "rating": 5.0,
        "review": "I'm a new resident and the few times I have requested maintenance they have responded the same day and resolved the issue, which was minor each time. It's been an absolutely positive experience!",
        "ownerResponse": {
          "text": "Thank you Charlyn!  We try very hard to make sure you and all of our residents are taken care of!  Welcome to the Vintage at Bellingham!"
        }
      },
      {
        "author": "The Cats M",
        "rating": 5.0,
        "review": "I have been here for nearly 10 years.\n\nLocation of our apartment is nice and quiet. We have city bus service right out our front door.\n\nJackie our Manager and staff work hard to make sure we have a nice clean and safe place to live.\n\nSenior living at its finest!\n\nCathyM",
        "ownerResponse": {
          "text": "Hi Cathy,\nThank you for the 5 Star Review!  We love having you and Owen as residents!  Please let us know if you need anything."
        }
      },
      {
        "author": "Kim Duff",
        "rating": 5.0,
        "review": "My mother moved into the Vintage at Bellingham 4.5 years ago and it has been a blessing. There is a real family feel here and the community is so supportive and caring of each other. The apartments are very nice with multiple floor plans to choose from. The laundry and garbage are conveniently located on each floor. The grounds are beautiful and it's relaxing to sit on your balcony or in the gazebo by the flower garden and enjoy nature. Jackie the manager does an amazing job of organizing events for the residents and the Seahawks rallies are a favorite. She is helpful to the community in every way!! David the maintenance supervisor keeps the building in great working order. Jackie and David work so hard to make the Vintage at Bellingham a wonderful place to live. I would recommend it to anyone!",
        "ownerResponse": {
          "text": "Hi Kim,\nThank you so much for the 5 Star Review!  We really appreciate you taking the time to share your experience with everyone.  Your mom is one in a million and loved by everyone!  It is always nice to see you when you come to visit.  If there is anything you need please let us know.  Take care, Jackie"
        }
      },
      {
        "author": "Stephanie Russell",
        "rating": 5.0,
        "review": "My mom lives here, and she is really happy. The apartment manager Jackie is wonderful to work with - super responsive and kind. They recently updated the place (new paint, furniture, landscaping) and it looks great. The Cordata area is such a great place for seniors, as the Peace Health Cordata building is so close for doctor appointments, and a park was just built down the road - in fact, the whole neighborhood is great for walking. An affordable place for seniors to live, that won't bankrupt you!",
        "ownerResponse": {
          "text": "Hi Stephanie, Thank you so much for the 5 Star Review!  We love having your mom here, she is a real joy to the community!  I appreciate you taking the time and energy to leave such a thoughtful review!"
        }
      },
      {
        "author": "Howard Hopkins",
        "rating": 5.0,
        "review": "Great place to live.  Management and support staff do an excellent job.  They go above and beyond and try to make our stay here at the Vintage as pleasant as possible. The maintenance team always delivers.",
        "ownerResponse": {
          "text": "Hi Howard,\nThank you for the 5 star review!  We appreciate you!\nTake care,\nVintage at Bellingham"
        }
      },
      {
        "author": "Ralph Akins",
        "rating": 5.0,
        "review": "I have been a resident of The Vintage at Bellingham for four and a half years and I am very happy here. Management (Jackie) and maintenance (Dave) have combined to be a perfect fit here. Together they make living here pleasant,  peaceful, safe and relaxing and trouble free. The  place is always kept cleaned and when something needs to be repaired they do the best they can to repair it as soon as possible. If you want to make friends there are card games,  movies,  bingo,  and  a pot luck once a month. Management  has gone out of her way to keep everyone safe from the COVID19  (0 cases)  and while enforcing the rules and regulations keeping everyone happy. I would HIGHLY recommend The Vintage at Bellingham for any Senior single or married.",
        "ownerResponse": {
          "text": "Hi Ralph,\nThank you for the 5 Star Review!  We love having you as a resident and it makes us very happy that you HIGHLY recommend the Vintage at Bellingham!"
        }
      },
      {
        "author": "Leesa Callon",
        "rating": 5.0,
        "review": "The Vintage is a great place for anyone who needs a cozy apt. at a fair price. My elderly father has lived here for a year and is very happy. Before COVID there were many opportunities for residents to get together and socialize. These were planned by the manager Jackie who has done a great job. I am very impressed that she has managed to keep the virus out of this complex. Thanks Jackie  and your crew for taking good care of my dad.",
        "ownerResponse": {
          "text": "Hi Leesa,\nThank you so much for the kind words and the 5 star review!  Your dad is a great guy!  We love having him as part of the community.  If there is anything you need, please let us know."
        }
      },
      {
        "author": "marie jennings",
        "rating": 5.0,
        "review": "I have only been here for a couple of weeks but so far I find the residents and staff to be friendly and welcoming.  Jackie  has been very  helpful and kind.  The building is clean and well maintained and the services meet my needs.  I am sorry that activities are canceled because of covid 19 but grateful that staff are doing everything possible to keep us safe.  it wasn't easy deciding to move into an apartment but now that I\"m here I feel confident that it is the best thing for me.",
        "ownerResponse": {
          "text": "Hi Marie,\nWe are so happy to have you as part of our community!  Thank you for the 5 Star Review!  Please stop by or give me a call if you need anything!"
        }
      },
      {
        "author": "Dave Krah",
        "rating": 5.0,
        "review": "We looked for months to find the right place for my mom.  When we walked into Vintage at Bellingham I new we had found it.  Jackie was great to work with to get my mom through the paper work process and made her feel welcome from the very first meeting.  The space is warm and welcoming, even during COVID I felt my mom could sit in any of the open reading area's on each floor and read and have the opportunity to meet people in the community in a safe space.  She has only been there a few weeks but the experience has been very positive.  I can see her enjoying it for many years to come.",
        "ownerResponse": {
          "text": "Thank you for the 5 Star Review!  We try very hard to make this a safe and welcoming community.  It makes my heart warm that your mom feels safe and welcome!  Thank you for selecting the Vintage at Bellingham!"
        }
      },
      {
        "author": "Marilyn Oebel",
        "rating": 5.0,
        "review": "I have lived here at Vintage 4 1/2 years. I love it here. It's a well kept and quite place. We are very lucky to have Jackie as manager. She stays on top of everything and especially during Covid. David takes care of our maintenance problems in short order. It is a very nice place to live.",
        "ownerResponse": {
          "text": "Hi Marilyn,\nThank you for the 5 star review and your kind words!  We appreciate you and love having you as long term resident!"
        }
      },
      {
        "author": "Bonniem Shriver",
        "rating": 5.0,
        "review": "I love it here!  It's quiet and beautiful.  The property is well maintained and landscaped.  The maintenance is responsive, timely and very nice people. Our manager is wonderful and is great if you need help with something. We use to have great community activities but Covid has put that on hold for now.  Normally the pool table room, tv room, and game areas are open.  The computer room and exercise room is currently open.. The hairdresser lady still works on second floor but you have to make appt. Some apartments are handicap ready. The apartments are clean and really very lovely but smaller than in older buildings. Perfect for one or two people.",
        "ownerResponse": {
          "text": "Hi Bonnie,\nThank you for the 5 star review!  Your opinion makes a difference with us at the Vintage at Bellingham and we are thrilled that you love it here!"
        }
      },
      {
        "author": "Lori Hamilton",
        "rating": 5.0,
        "review": "Ive lived at the Vintage for four years. Jackie (community Director) and David (maintenance expert) have made this community so cozy and safe before and during COVID-19. Its their passion and pride that make this such a happy place to live. The grounds are gorgeous and the apartments have all the amenities you need. Jackie always has something positive to say and if you have a situation, shell sit down and truly listen to you, offer any guidance and if necessary call David to help. We havent had one  case of Covid and thats because of her daily diligence of keeping everyone safe. Its so nice when she has special bbqs, or ice cream specials delivered to your apartment. I feel that she is very, very honest about what goes on in the community and surrounding area. That is the reason so many come to her for advice. Thank you for your commitment to our community and your passion for everyone here. Its so greatly appreciated!",
        "ownerResponse": {
          "text": "Thank you Lori!  We love having you as a resident and want this to be the best home for you!  We appreciate your kind words!"
        }
      },
      {
        "author": "Pamela",
        "rating": 5.0,
        "review": "Our maintenance man  Joel is awesome, efficient and innovative!",
        "ownerResponse": {
          "text": "Dear Pamela, \n\n Thank you for your positive feedback! Our goal is to continue to provide a 5 star experience. We appreciate you and your business. \n\nJackie Hall, vintagebellingham.cd@fpimgt.com"
        }
      },
      {
        "author": "Shaughnessy Blake",
        "rating": 5.0,
        "review": "I have lived at Vintage since 2013 when I moved back home from Pennsylvania.  I decided before moving that this was where I wanted to live. I am happy to say that it worked out for me the way that I hoped it would.  I am very pleased with the current management and feel that they are responsive to our needs. Additionally, they have kept us safe during our current COVID situation.  I am proud to be part of this community.",
        "ownerResponse": {
          "text": "Shaughnessy, thank you so much for the 5 Star Review.  We are proud to have you as part of this community!"
        }
      },
      {
        "author": "Melvin Lyles",
        "rating": 5.0,
        "review": "Vintage of Bellingham I am glad that I live here, I am a retired corrections officer at 4625 Cordata pkw. of Bellingham. I have a dog and it is great here for being able to walk her here at the park and around this area. Now they have just built a million dollar park which is called Cordata Park which is wonderful for all ages including all seniors across the street. The building is very clean around here. The property is very clean and landscaped and nice around here. The property manager here is wonderful. I also really like that it is on the bus line even though I drive, but sometimes I ride the bus. It's great that we have all of these amenities, exercise room, tv and pool table room and several areas to lounge around in the building as well as kitchen and beauty salon to get your hair done when you don't want to go out. There is a laundry room and rest rooms on every floor. We also have a pop machine and snack machine for those who want to snack that don't always want to leave the building. Also a outdoor patio on the 3rd floor and main floor. It's really a positive place, likeable place it grows on you and you can go to church when things go back to normal. There is always a gathering of some sort on Sundays, Bingo, Card games, dominos , movie nights and coffee for those who like and wish to use a computer we have a business center as well. Plus the entire staff is working very hard for all the seniors at vintage clean and sanitized and David is doing a really great job in fixing things and with the garbage around here.\n\nSo if that all sounds good come and check it out.",
        "ownerResponse": {
          "text": "Hi Melvin,\nThank you for your review!  It means the world to the Vintage at Bellingham, David, and myself.  You and Magic are wonderful residents!  We hope to keep you happy for years to come!  Take care!"
        }
      },
      {
        "author": "Emma Reid",
        "rating": 5.0,
        "review": "To whom it may concern,\n\nI am a resident at The Vintage at Bellingham, I am retired and moved here 4 1/2 years ago. Looking for a place to live that not only would be convenient to services and shopping but would have a community feel to it also. Not only is it convenient but it goes beyond that with The Manager who truly takes her job to heart and has come to this community and within one year has cleared up many issues including giving the tenants the feeling of inclusiveness and the feeling of safety that they did not have. Everyone is treated equally and respectfully. The Vintage at Bellingham has a cleaning crew, maintenance person and Lanscaping crew that always keep us looking clean and tidy. During the Covid-19 pandemic the manager and fpi management have kept every resident up to date as to CDC recommendations as well as coverage from the governor of Washington state.\n\nIf Clean, tidy, close to shopping, access to medical facilities , safety , well maintained property and great management and staff mean something to you then I would seriously tell you to come check out a great place to live Vintage at Bellingham.",
        "ownerResponse": {
          "text": "Hi Emma,\nThank you for your awesome review of the Vintage at Bellingham and our staff!  We work hard to make this community a great one and reading your review brings a smile to my face.  We love having you at the Vintage at Bellingham!"
        }
      },
      {
        "author": "Chena Fisher",
        "rating": 5.0,
        "review": "This place is full of sunshine. Community director Jackie is super friendly and so very helpful! Always has a smile on her face. The building is updated and very clean. Thank you David and ABT Unique. FPI management",
        "ownerResponse": {
          "text": "Hi Chena,\nThank you for the FIVE STAR review!  We are pleased that you took the time to make this review.  We love how you help us maintain a clean and safe place for our residents.  Keep up the great work!"
        }
      },
      {
        "author": "Tess Lowe",
        "rating": 5.0,
        "review": "Very friendly and helpful. So grateful for all that you do in our community!",
        "ownerResponse": {
          "text": "Thank you for the 5 star review!  We hope that we will see you soon!"
        }
      },
      {
        "author": "Linda Sweeney",
        "rating": 3.0,
        "review": "Could not get online scheduling to work.  Multiple attempts today as there is an open unit available",
        "ownerResponse": {
          "text": "Hi Linda,\nI tried calling you several times over the past 3 days and I have left you several emails.  You last message to me was that your phone is not working and to email you.  I emailed you two more times and still no response.  \nThe online tour is booked solid due to our vacancy.\nI' sorry that we are having trouble touching base.  Hopefully, we can connect today!\nThank you for your interest in Vintage at Bellingham!"
        }
      },
      {
        "author": "Cathy Owens",
        "rating": 5.0,
        "review": "I love this place!  Clean, quiet, friendly. Our manager, Jackie and our maintenance fella David are unsurpassed. My kids  this place, too as they feel that I am safe here.",
        "ownerResponse": {
          "text": "Hi Cathy,\nThank you for the 5 Star Review!!  We sure enjoy having you as a resident.  Please let us know if you need anything.  Take care, Jackie"
        }
      },
      {
        "author": "peter nesbitt",
        "rating": 5.0,
        "review": "Well managed by Jackie in the front office. She works hard. Going above and beyond her regular duties to help every single resident. She writes newsletters and delivers important information pamphlets to keep us safe and informed.",
        "ownerResponse": {
          "text": "Thank you for the 5 star review Pete!"
        }
      },
      {
        "author": "Carol Stewart",
        "rating": 5.0,
        "review": "Jackson was into check my smoke alarm this morning. This was the first time I met the young man. He was very polite, very competent, and was able to fix the problem quickly.",
        "ownerResponse": {
          "text": "Hi Carol,\nThank you for letting me know about Jaxon. I will pass your comments on to him!  Thank you for taking the time to give us a five star review and the great comments for Jaxon.  We appreciate you!"
        }
      },
      {
        "author": "Mary Breuning",
        "rating": 5.0,
        "review": "I've been here going on 7 years and am really pleased with this place and the manager.  It is clean and quiet, and well tended to.  The manager is terrific and listens to positive and any negative issues and then sets out to make it a great place for Seniors to live.",
        "ownerResponse": {
          "text": "Sister Mary, thank you so much for the 5 star review!  We appreciate the time and energy you gave to make this review.  We look forward to many years with you and Emma!"
        }
      },
      {
        "author": "Brigitte Molitor",
        "rating": 4.0,
        "review": "Friends' mother is staying here.  Very nice place and clean. Staff nice and competent",
        "ownerResponse": {
          "text": "Thank you so much for taking the time and energy to give us a 4-star review!  We hope to make that a 5-star soon!"
        }
      },
      {
        "author": "Kathryn Breuning",
        "rating": 5.0,
        "review": "Exceptional place.  Manager Jackie is a jewel. Would recommend this facility to all seniors.",
        "ownerResponse": {
          "text": "Thank you for the 5 star review Kathy!"
        }
      },
      {
        "author": "Jerry Win",
        "rating": 5.0,
        "review": "Nice low income place for 55 and older",
        "ownerResponse": {
          "text": "Thank you for the great review!"
        }
      },
      {
        "author": "Jack Laque",
        "rating": 4.0,
        "review": "Nice clean and quiet place!",
        "ownerResponse": {
          "text": "Hi Jack, Thank you for the wonderful review!  Have a fabulous day!  Jackie"
        }
      },
      {
        "author": "David Forslund",
        "rating": 4.0,
        "review": "For a retirement community this is perfect",
        "ownerResponse": {
          "text": "Thank you for the awesome review!"
        }
      },
      {
        "author": "Don Chatman",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Don, \nThank you for the 5 Star review!\nVintage at Bellingham\n\n Theres nothing better than hearing our Vintage at Bellingham customers positive feedback! Thanks for sharing your experience with us. \n\nVintage at Bellingham, Team, vintagebellingham.cd@fpimgt.com"
        }
      },
      {
        "author": "Lori Rojas",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Lori, \n\n Thanks for the 5 stars! We appreciate you taking the time to share your feedback. Please let us know if we can do something to make your experience even better! \n\nVintage at Bellingham"
        }
      },
      {
        "author": "Tanya Bishop",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Hi Tanya,\nThank you so much for the 5 Star Review!!  Thank you for taking the time and energy to post.  We appreciate you!"
        }
      },
      {
        "author": "Jose Martinez",
        "rating": 4.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you! Please let me know how I can turn this into a five star!"
        }
      },
      {
        "author": "Synphony Gleason",
        "rating": 3.0,
        "review": "",
        "ownerResponse": {
          "text": "Would love to make this a 5 star!  Please let me know if there is anything we can do for you."
        }
      },
      {
        "author": "Lorraine Howard",
        "rating": 5.0,
        "review": "",
        "ownerResponse": {
          "text": "Thank you!"
        }
      },
      {
        "author": "Jeannie Feller",
        "rating": 1.0,
        "review": "",
        "ownerResponse": {
          "text": "Good afternoon Jeannie, I'm so sorry that you had a negative experience with The Vintage at Bellingham.  We would love to get more information from you on how we can improve and create a positive experience for you. Please feel free to call, email, or stop by the office to get this issue resolved."
        }
      }
    ]
  },
  "adjusted_review_count": 35,
  "adjusted_average_rating": 4.74,
  "summary": {
    "text": "<section><h2>Good</h2><p>Residents of Vintage at Bellingham have expressed satisfaction with the apartment complex, highlighting its cleanliness and maintenance. The community’s sentiment reflects well on the property management, specifically noting the prompt and efficient handling of maintenance requests, affirming that issues, even if minor, are resolved on the same day. The property's state of upkeep is corroborated in multiple user reviews, with one resident emphatically indicating their appreciation for the experience of living in a quiet, safe, and clean facility, which is attributed to the meticulous attention to detail by the management staff.</p></section><section><h2>Great</h2><p>Exceptional management seems to be a recurring theme in the user reviews, with the Community Director, Jackie, receiving acknowledgments for her responsiveness, kindness, and the sense of safety she provides for the residents. The proactive approach by the property management to organize activities and maintain a vibrant community spirit, despite the ongoing COVID-19 pandemic, is also commended. The grounds of Vintage at Bellingham are consistently described as beautiful and inviting, which, along with the personalized attention from the staff, including a helpful maintenance team, contributes to a highly regarded living environment for seniors.</p></section><section><h2>Bad</h2><p>While mostly favorable, there are instances where user experiences have been less than ideal. A reviewer who experienced difficulty with the online scheduling system voiced frustration, indicating potential technical or communication shortcomings. Additionally, one episode of reportedly rude reception by the office manager stands out among the largely positive narratives, suggesting that on rare occasions, interactions with management may not meet expectations, which could be an area for further attention and improvement by the property management team.</p></section><section><h2>Ugly</h2><p>Amidst the overwhelming positive feedback, there's an isolated incident of dissatisfaction from a user who felt compelled to leave a negative review after an apparently unpleasant encounter with the office manager. This reviewer felt that they were treated coldly and abruptly, which led them to seek accommodation elsewhere. While such incidents seem to be uncommon, as indicated by the property’s high adjusted average rating, they nevertheless highlight that even a single negative experience can resonate deeply with prospective residents and potentially affect the property's reputation.</p></section>"
  },
  "timestamp": "09/07/2024"
}