{
  "name": "Vintage at Bellingham",
  "slug": "vintage-at-bellingham",
  "company_type": "Property",
  "address": "4625 Cordata Pkwy, Bellingham, WA 98226",
  "review_count": 11,
  "average_rating": 4.27,
  "reviews": {
    "google_reviews": [
      {
        "author": "Brenda Sherrer",
        "rating": 5,
        "review": "I've been extremely pleased with how fast my maintenance problems have been taken care of plus Joel has also gone above and  beyond on several small things I needed help on and didn't have the strength to do. Thank you Joel.\n\nJackie is the best manager I have had in Bellingham.  I've been here several years and seen her improve on many areas in the complex. I also realize that there may be many behind the scenes things in a 3 story plus large grounds facility that we do not understand or know about and how they need to be handled. Thank you Jackie.",
        "owner_response": {
          "text": "Thank you for the wonderful review!  We love having you and Lily here.  We will keep up the good work!"
        }
      },
      {
        "author": "Peggy Manatad",
        "rating": 5,
        "review": "The property to look wonderful even in the midst of fall with lots of leaves. But obviously well taken care of. The manager was friendly and she took her time when touring us with the property. She showed all the amenities and they were awesome. Their calendar had lots of activities on. It. Was a great experience",
        "owner_response": {
          "text": "Hi Peggy, Thank you so much for the 5 star review!  We appreciate the time you took to give us a rating and your comments.  We hope to see your friend soon!\nTake care,\nJackie"
        }
      },
      {
        "author": "Jennifer Lynn",
        "rating": 1,
        "review": "I don't recommend any place where a manger/owner allows there maintenance man too block delivery drivers in for 45 minutes because the delivery driver parked in a employee parking spot too help a resident of there's carry up 8 bags of groceries to the third floor cause this place offers no help or carts for there seniors. That type of kid behavior isn't where I would want any family of mine or my worst enemy. They have a lot of growing up too do it seems. Very sad and disgusting behavior considering it's a facility for our elderly.",
        "owner_response": {
          "text": "I apologize for any inconvenience you've experienced regarding parking in our community. To ensure a smoother experience, I invite you to visit our leasing office so we can review our parking policies for service providers who assist residents with tasks such as grocery delivery.\n\nWe have numerous service providers who support our residents, and typically, adherence to standard parking regulations ensures a seamless process. It's important for each service provider to supply their own equipment necessary for their services.\n\nBy discussing our parking guidelines together, we aim to prevent any future misunderstandings and ensure compliance with our community's rules. Your cooperation is appreciated, and we look forward to resolving this matter amicably."
        }
      },
      {
        "author": "Ronita Phillips",
        "rating": 5,
        "review": "We were looking for a 1 bedroom for my mother. During the tour, Jackie, the Community Director, was very friendly and helpful. She explained the application process thoroughly and was extremely patient with my mother. It was a great experience.",
        "owner_response": {
          "text": "We are sincerely grateful for your wonderful feedback and thrilled to hear that Jackie was able to assist you so effectively in finding a suitable 1 bedroom place for your mother. It is always our aim to provide thorough explanations of our processes and be patient with all individuals involved. Thank you once again, we're delighted we could make it a great experience for you and your mother."
        }
      },
      {
        "author": "Sandra Sowada",
        "rating": 5,
        "review": "I met with Jackie and she explained the apartment application process in clear understandable language but also with warmth and clarity about the property and how living at Vintage might be for me. On the tour she showed me everything and every where, even the trash room (which was clean and freshly scrubbed). When we passed other residents they greeted each other and it was evident Jackie has a great relationship with them. The building is in excellent shape even taking in its age; No obvious wear and tear or deferred maintenance. I am looking forward to a future with my dog living at Vintage Bellingham.",
        "owner_response": {
          "text": "Thank you Sandra for the 5 star review!  We look forward to having you be part of our community!\n"
        }
      },
      {
        "author": "LER",
        "rating": 5,
        "review": "Jackie, the Community Director, gave me a wonderful tour of the apartment amenities and property  this week.  She was very welcoming and informative . The property is very clean and well-maintained so I would feel safe living there. There are  also lots of fun activities to join in on.  Very good impression...",
        "owner_response": {
          "text": "Hi Lynn,\nThank you so much for the 5 star review!  We look forward to seeing you soon!"
        }
      },
      {
        "author": "Christine Bickel",
        "rating": 5,
        "review": "The manager, Jackie, is great and made the application/move in process for my dad super easy! I'm so happy he'll be living at Vintage at Bellingham - the building is clean and well maintained, the grounds are beautiful, and it's convenient for his needs.",
        "owner_response": {
          "text": "Thank you for the 5 Star review!  It is so nice to have your dad here.  If he needs anything, we are here for him!"
        }
      },
      {
        "author": "Anne Steirer",
        "rating": 5,
        "review": "Im grateful to live in my quiet, safe and clean building, thanks to the careful attention to details by Jackie, our marvelous, calm, caring and efficient Community Director. The experienced maintenance crew work to care for the indoors as well as the outdoor lawn, flowers and trees during every season. Friendly, interesting tenants daily enjoy a variety of active or quiet pursuits. Meet them at coffee hour, bingo, dominoes, card games, pool table, WII bowling, movies, books, puzzles and Seahawks pep rallies.",
        "owner_response": {
          "text": "Hi Anne,  Thank you so much for the 5 star review!  We do the best we can.  Thank you for being such a wonderful resident!"
        }
      },
      {
        "author": "Jaw Breaker",
        "rating": 1,
        "review": "Ill mannered and always cranky manager and her cronies who are also biggest jerk i have encountered in any old folk places, Awful management and who knows what else happens here and how the elderly who live here are treated.",
        "owner_response": {
          "text": "We take all feedback very seriously, and we appreciate you bringing these concerns to our attention. We are sorry to hear about your negative experience. We strive to provide a positive and supportive environment for all our residents, and we are concerned to hear that this has not been your experience. We would appreciate the opportunity to discuss your concerns in more detail so we can understand what happened and take appropriate action. Please contact us directly at vintagebellingham.cd@fpimgt.com so we can schedule a time to talk."
        }
      },
      {
        "author": "Barb Clark",
        "rating": 5,
        "review": "I moved in iNov\nAbsolutely love it\nEveryone so friendly and Jackie (manage ) is wonderful!\nI feel so safe and comfortable here!\nIy is so quiet\nLots of activites\nThe grounds and indoors are kept beautiful\n\nDo wish had a little dog park\nAre dog walking areas but wish could turn loose to run and play",
        "owner_response": {
          "text": "Thank you so much Barb!  We try very hard to make sure you and the rest of our residents are well taken care of."
        }
      }
    ],
    "yelp_reviews": [
      {
        "author": "Leslie W.",
        "rating": 5,
        "review": "I have lived at the Vintage in Bellingham for the last five years and love it. Jackie our manager is great and David our maintenance guy is helpful to us old folks :) The apartments are very nice and the grounds lovely. I have made some great friends and that is important as you age and need to rely on others more often, we are all in the same boat!",
        "owner_response": {
          "text": "Thank you for the 5-star review, Leslie!  We love having you at the Vintage at Bellingham.  We are thrilled that you appreciate us."
        }
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 4.27,
  "distribution": {
    "1": 2,
    "2": 0,
    "3": 0,
    "4": 0,
    "5": 9
  },
  "summary": {
    "created_timestamp": 1739095184,
    "text": "<section id=\"good\"><h2>Good</h2><p>The Vintage at Bellingham has received positive remarks for its well-maintained facilities and friendly management staff. Many users highlight the responsiveness of management, specifically singling out the Community Director, Jackie, for her attentive and patient approach during property tours and application processes. Residents appreciate her efforts in keeping the grounds and building clean, noting that the property looks great even during the fall season when maintenance can be challenging.</p><p>The maintenance team has also been commended for their promptness in addressing issues. A user shared their satisfaction with how quickly their maintenance concerns were resolved, which contributed to a positive living experience. There are numerous activities available for residents, fostering a sense of community that many respondents find enjoyable and comforting.</p></section><section id=\"great\"><h2>Great</h2><p>The overall sentiment among many residents points to an excellent living environment at Vintage at Bellingham, where the combination of nice apartments and community activities enhances their quality of life. User reviews emphasize the importance of social connections formed among residents, with one tenant noting the supportive and friendly atmosphere. Remarkably, Jackie has been highlighted as a key factor in providing personalized attention to each resident's needs and feelings of well-being.</p><p Furthermore, the property has received additional praise for the available amenities and the clean, orderly state of common areas. From engaging social activities to maintaining a vibrant community, users feel that Vintage at Bellingham greatly enhances their living conditions. This has resulted in multiple five-star ratings from satisfied residents who appreciate a place they can truly call home.</p></section><section id=\"bad\"><h2>Bad</h2><pDespite many positive reviews, some users have expressed dissatisfaction with specific management and operational issues at Vintage at Bellingham. A significant concern raised involved parking management, where one user described an unfortunate incident where maintenance staff blocked a delivery vehicle that was assisting an elderly resident. This situation highlighted a lack of understanding and support for residents' needs regarding delivery services, which was seen as a significant oversight by management.</p><pAdditionally, a different user experienced what they deemed poor customer service from management, labeling them as \"ill-mannered.\" This negative experience raises questions about consistency in the management's approach and their ability to resolve conflicts amicably. It's clear that experiences can vary greatly within the community, and while many thrive under the current management, the negative feedback indicates areas where improvement is necessary.</p></section><section id=\"ugly\"><h2>Ugly</h2><pThe experiences noted in user reviews concerning the management style at Vintage at Bellingham include serious complaints about treatment and responsiveness. One resident described the manager and staff as \"the biggest jerks,\" suggesting a troubling culture that may not prioritize respect towards residents. Such accusations point to a potential issue with management that needs to be addressed to ensure a safe and welcoming environment for all tenants, particularly since the community primarily serves elderly residents.</p><pMoreover, despite management's responses to concerns voiced by disgruntled residents, they have yet to establish clear actions reflecting a commitment to change or improve user experiences. This disconnect may lead to ongoing dissatisfaction and a toxic atmosphere that contradicts the otherwise positive aspects highlighted by more satisfied residents. Thus, the disparities between positive and negative feedback illustrate a pressing need for better management practices and communication within the community.</p></section>"
  }
}