{
  "name": "Walton Place",
  "slug": "walton-place",
  "company_type": "Property",
  "address": "1511 N State St APT 303, Bellingham, WA 98225",
  "review_count": 7,
  "average_rating": 3.14,
  "reviews": {
    "google_reviews": [
      {
        "author": "Jordan Graves",
        "rating": 1,
        "review": "If I could give 0 stars, I would. They took my application fee and an almost $200 holding fee and I never heard from them. No confirmation email, no phone call. Absolutely no follow up for months. I thought Id been scammed.\n\nRecieved a call several months later saying that they had a property manager quit on the spot. And that theyd get my money back to me. Its been months since then and Ive still heard nothing. Do not apply to this place. They will scam you out of your money. The lack of professionalism is insane.",
        "owner_response": null
      },
      {
        "author": "Brooke Nilsson",
        "rating": 3,
        "review": "For subsidized low income apartments the ground level suites are nice, large apartments. Modern appliances, no frills. No air conditioning though. Proportions of living room size to bedrooms isn't ideal, unless you entertain and use the living room a lot. Second bedroom is office sized, not a full bedroom.\nMaster bedroom has great lighting from the wall of windows. High ceiling is the best feature.  Energy from the street. You need to be creative in positioning the furniture.\n\nMaintenance is all right but not consistent. Different person each time, some more helpful than others. Don't expect disability alterations the building isn't equipped for those despite what the ADA state law requires.\n\nThe application process needs improvement. Be prepared for confusing government forms and a month long process. It was traumatic.  Applying for government housing isn't the same as market rate, they don't follow the regular timelines of when you have to give notice to your previous landlord, they just tell you when you can move in at the last moment, so planning is difficult.\nMiscommunications occur frequently.   We had to spend a week in a hotel waiting for the forms to be processed, fearing we'd be homeless because we'd already used up our rent money. Sacrifices had to be made though.",
        "owner_response": null
      },
      {
        "author": "Leah Steele",
        "rating": 1,
        "review": "Put a 150 dollar holding deposit that was refundable on an apartment and never got the money back after I decided to cancel on the apartment. Noted that the manager never disclosed there was a 3rd party involved with the money until after I inquired about getting my money back. What a dissapointment.",
        "owner_response": null
      },
      {
        "author": "Evelyn Thompson",
        "rating": 4,
        "review": "I have lived here for over 5 years. It's great besides the occasional inspections and fire alarm testing.",
        "owner_response": null
      },
      {
        "author": "Tessa",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Leann AZGirl Keith",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Daniel Crutchfield",
        "rating": 3,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 4,
  "adjusted_average_rating": 2.25,
  "distribution": {
    "1": 2,
    "2": 0,
    "3": 2,
    "4": 1,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739205652,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite the mixed reviews, there are some aspects of Walton Place that current and former tenants appreciate. The property offers large ground level suites, which, according to some user reviews, are well-suited for individuals seeking subsidized low-income housing. The modern appliances and well-lit master bedrooms with high ceilings are features that have not gone unnoticed by residents. One reviewer highlighted that living there for over five years has been largely positive, apart from routine inspections and fire alarm testing, suggesting a satisfying long-term living experience. Furthermore, there are high ratings from some users who did not provide specific details, but whose satisfaction contributes positively to the overall sentiment of the property.</p></section><section id=\"great\"><h2>Great</h2><p>For some residents, Walton Place offers an excellent living experience, as evidenced by the maximum ratings given by several reviewers. While detailed comments are sparse, the high ratings suggest that these tenants found the property management and living conditions to exceed their expectations during their time at Walton Place. The abundance of natural light in the master bedrooms and the impressive high ceilings may be contributing factors to the satisfaction expressed by tenants. Despite being geared towards low-income housing, the property seems to deliver on key aspects that matter to its residents, which is reflected in the higher ratings given by some.</p></section><section id=\"bad\"><h2>Bad</h2><p>On the downside, some user reviews have expressed dissatisfaction with Walton Place's management and processes. One complaint was regarding the management's handling of application and holding fees, with a user highlighting that they never received their money back even after months of waiting. Further frustration was voiced about the lack of communication and transparency, particularly in relation to application processing. The inconsistency and perceived incompetence of the maintenance service were also noted, with some residents facing challenges due to frequent changes in maintenance personnel. Additionally, the application process for the subsidized apartments was criticized for its complexity and length, presenting significant planning challenges for prospective tenants.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Unfortunately, there are instances reported by former applicants that paint Walton Place in a negative light. One such case involved a potential tenant who was charged an application fee and a holding deposit but never received confirmation or a refund, an experience they described as feeling scammed. This lack of professionalism and customer service is a recurring theme, as another reviewer also mentioned not receiving their refundable deposit after deciding to cancel the apartment lease. These negative experiences point to significant issues in financial management and communication, which have left some users feeling deeply dissatisfied and wary of recommending the property. It is noteworthy that these critical reviews often lack responses from Walton Place, suggesting a missed opportunity to address grievances and improve customer relations.</p></section>"
  }
}