{
  "name": "Weatherby Apartments",
  "slug": "weatherby-apartments",
  "company_type": "Property",
  "address": "2314 Weatherby Way, Bellingham, WA 98226",
  "review_count": 5,
  "average_rating": 3.4,
  "reviews": {
    "google_reviews": [
      {
        "author": "Glenn F",
        "rating": 4.0,
        "review": "My mother and I rented a 2 bedroom 2 bathroom unit a couple of months ago. The initial relationship with the leasing staff was rocky, but I feel has improved since weve moved in. The unit is as advertised, and the appliances are very nice. The dishwasher is so quiet! We rarely hear our neighbors and our fellow residents are nice. The leasing office have been very responsive to the few2 maintenance requests since we moved in. The maintenance team have been professional and prepared to complete work in an efficient manner. My mother was so pleased that Kim and the maintenance team had installed a safety bar in her bathroom before we moved in. The hallways and trash areas are kept clean, the garage doors actually work to keep your car safe and the garage is well lit. What we would have liked to see when we moved in; how to operate the BBQ grill (the power source is not anywhere youd expect and not labeled at the time), a map that indicates where the mail room is for large packages (didnt know there was one, but there is), where the trash area is and what the process is to use the club room (still a little confused about that one). Im sure that Covid precautions had a lot to do with how tours were/were not done and move-in tours done. Anyway, for us it is a nice complex thats close to everything we need to keep our life moving. The relationship with the leasing staff is much better and I dont worry about anything anymorewe actually plan on signing another lease. I do want to mention that though I have a Service K9, I know other residents that have dogs as regular pets here. Perhaps the prior policy changed but dogs are allowed at the Weatherby. If you move here, I believe youll be happy and very comfortable with your choice.",
        "ownerResponse": null
      },
      {
        "author": "K King",
        "rating": 1.0,
        "review": "Liars and cheats. Beautiful apartments, but quality of build is questionable at best. Look beneath the surface and shoddy construction run by shady people is what you get. Moved into a brand new unit and the list of damaged and broken items was extensive on our move in inspection was extensive. Several repairs needed. New appliances failing, cabinet doors falling apart. Smoke alarms frequently going off due to changes in water pressure that have shut down elevators for days. The heat went out at the coldest point of winter and no one responded for days. But most importantly- get everything in writing from these backhanded swindlers. The leasing agents are all sale, no integrity. They'll tell you month to month is okay and then force you to extend for a year or move out. No compromising. No reasonable extension with higher rent. They will admit they agreed to terms they're now not abiding by. Also good luck to all our dog owning neighbors, they're now banning dogs.",
        "ownerResponse": null
      },
      {
        "author": "Scott Welch",
        "rating": 5.0,
        "review": "Exxel Pacific doing a great job building.",
        "ownerResponse": null
      },
      {
        "author": "Joshua Jones",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "William Roberts",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 3.33,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the positive spectrum of experiences at Weatherby Apartments, residents report a level of comfort and satisfaction with their living space. For instance, one user review highlights a positive change in the resident-staff relationship post-move-in, with the staff being responsive to maintenance requests and taking proactive steps such as installing safety features in the unit. Additionally, users appreciate the quality of the appliances provided, and the quiet atmosphere, which is conducive to a peaceful living experience.</p><p>The review goes further to commend the community aspects, mentioning pleasant interactions with neighbors and a secure, clean environment. Notably, the property seems to have reversed its policy on pets, where service animals and pets are now welcomed—an update that pet-owning residents can certainly appreciate. These experiences together paint a picture of a responsive and evolving community at Weatherby Apartments.</p></section><section><h2>Great</h2><p>On the exceptional side, user reviews boast about the construction quality of the apartments. One review, in particular, gives high praise to the construction team, implying that the work done by builders such as Exxel Pacific has resulted in impressive and well-crafted living spaces, which contributes greatly to the initial appeal of the residence. The apartments are not only seen as beautiful but are also equipped with amenities that stand out to prospective and current tenants alike.</p><p>The user review applauds the little details that make a significant difference in everyday life, such as the surprisingly quiet dishwasher and the appreciation for proactive and considerate gestures by the maintenance staff. These points suggest that when Weatherby Apartments excels, it does so in a way that greatly enhances the residential experience, leading to high satisfaction among certain tenants.</p></section><section><h2>Bad</h2><p>However, not all resident experiences reflect the property's potential. A range of user reviews reveals dissatisfaction with the quality of build, with one review citing numerous broken and damaged items upon move-in. Additionally, residents have faced significant inconveniences such as faulty appliances, issues with smoke alarms, and maintenance delays, especially during critical times like winter when heating is essential for comfort and safety.</p><p>These issues indicate a gap between resident expectations based on the apartment's presentation and the reality of living there. The apparent inconsistencies in unit quality and the reliability of features, like functioning smoke alarms or heating systems, have undeniably colored the experience of some residents, leading to frustration and discomfort.</p></section><section><h2>Ugly</h2><p>The darkest clouds over Weatherby Apartments come from the reported dealings with the property management that suggest a lack of transparency and integrity. User reviews label some interactions with leasing staff as deceitful, accusing them of reneging on agreed terms and forcing residents into difficult situations such as having to agree to a year-long extension or vacate the premises. Compounding these issues is the absence of management's public response to these critical reviews, which could otherwise point to a willingness to resolve such conflicts openly.</p><p>Furthermore, the drastic policy change disallowing dogs—despite earlier indications to the contrary—can be seen not just as a decision that affects daily life but one that also erodes trust between residents and management. These severe accusations of dishonesty and poor communication practices contribute to a deeply negative outlook for those who have unfortunately encountered such issues at Weatherby Apartments.</p></section>"
  },
  "timestamp": "September 7 2024"
}