{
  "name": "Weatherby Apartments",
  "slug": "weatherby-apartments",
  "company_type": "Property",
  "address": "2314 Weatherby Way, Bellingham, WA 98226",
  "review_count": 9,
  "average_rating": 2.0,
  "reviews": {
    "google_reviews": [
      {
        "author": "Phoenician Beaux champ",
        "rating": 1,
        "review": "Great resident appreciation story. The community room isnt reservable (allegedly) though there is a sign up sheet to put down a request to use the room. After signing up for August 17th, 2024 a lovely notice appeared on the community room door that the room has been reserved for a special event. Kim is wonderful at not returning emails regarding why me and another residents request to use the room was scratched off the list. Must be someone important because the secured entry doorsunlocked and wide open for this special event but not for a birthday party last week when I requested the same thing. Do yourself a favor, ask a resident here what they think of management and resident appreciation. It could partially explain the mass exodus from this place every year. My lease can not expire fast enough.",
        "owner_response": null
      },
      {
        "author": "M Jaiya",
        "rating": 1,
        "review": "Congratulations, my first negative review goes to the thieves operating WestView Realty.\n\nThey should be in JAIL, not business.\n\nBe prepared to be lied to your face, hidden fees the day you move in, traps to steal your hard earned money and neglect like you've never experienced so they can gain from it.\n\nThe experience I had with this leasing agency was an absolute nightmare. From the very start, they were masters of deception, leading you with false promises, hidden fees popping up on moving day, and manipulative traps designed to snatch your hard-earned money away. The team's lack of professionalism and transparency was glaring, leaving you feeling swindled the moment you handed over your deposit. If you have any concerns, be prepared to be ignored over and over again. Expect to pay way more than the advertised price and kiss your deposit goodbye.\n\nThey operated like thieves, sucking the life out of every penny you have. This whole ordeal felt like a robbery, and dealing with them was akin to being drained of every drop of trust and satisfaction.\n\nIn my opinion, this agency stands as a testament to the worst in the industry, making it an experience I wouldn't wish upon my worst enemy.\n\nYou've been warned. Run as soon as you read this, PLEASE!",
        "owner_response": null
      },
      {
        "author": "Glenn F",
        "rating": 1,
        "review": "Update 07-03-24\nAll good things end I suppose. Kim Seitz kicked everybody out of the garage so they could clean it. Fine of course but told the handicapped residents they had to park in a gravel lot thats on an incline and cant park on the private road in front of the building! No handicap access to the building. So the 90 y/o with heart failuregood luck! Kim didnt care and simply said if they didnt drive they wouldnt need to worry about it. Real compassion from Kim to a resident that pays a lot of money for rent. Dont rent here! Kim is an awful person and treats residents like shes doing them a favor by leasing to them. If you're handicappedkeep looking! No handicap access to the building. The doors are large and heavy, so have fun trying to get a wheelchair or walker through one of them. The apartment is nice but Kim is the worst manager Ive ever dealt with.\n\nMy mother and I rented a 2 bedroom 2 bathroom unit a couple of months ago. The initial relationship with the leasing staff was rocky, but I feel has improved since weve moved in. The unit is as advertised, and the appliances are very nice. The dishwasher is so quiet! We rarely hear our neighbors and our fellow residents are nice. The leasing office have been very responsive to the few2 maintenance requests since we moved in. The maintenance team have been professional and prepared to complete work in an efficient manner. My mother was so pleased that Kim and the maintenance team had installed a safety bar in her bathroom before we moved in. The hallways and trash areas are kept clean, the garage doors actually work to keep your car safe and the garage is well lit. What we would have liked to see when we moved in; how to operate the BBQ grill (the power source is not anywhere youd expect and not labeled at the time), a map that indicates where the mail room is for large packages (didnt know there was one, but there is), where the trash area is and what the process is to use the club room (still a little confused about that one). Im sure that Covid precautions had a lot to do with how tours were/were not done and move-in tours done. Anyway, for us it is a nice complex thats close to everything we need to keep our life moving. The relationship with the leasing staff is much better and I dont worry about anything anymorewe actually plan on signing another lease. I do want to mention that though I have a Service K9, I know other residents that have dogs as regular pets here. Perhaps the prior policy changed but dogs are allowed at the Weatherby. If you move here, I believe youll be happy and very comfortable with your choice.",
        "owner_response": null
      },
      {
        "author": "Mike Jack",
        "rating": 1,
        "review": "Do yourself a favor and steer clear of Westview Realty unless you enjoy headaches and disappointment.\n\nFirst off, getting a response from these folks is like trying to summon a ghost. I had to send carrier pigeons to get any info on the leasing process. They're on some other level of unresponsiveness.\n\nAnd don't even get me started on the paperwork. It's like they handed me a puzzle instead of a lease agreement. I asked for clarification, and it was like talking to a brick wall. Good luck understanding anything without a cryptographer on speed dial.\n\nOnce I finally signed my soul away, I walked into a property that looked like it hadn't seen a vacuum or a paintbrush since the '90s. They must have missed the memo about basic cleanliness and maintenance. Dog urine on the floor of the elevator and trash on the entry floor.\n\nOh, and the maintenance requests? I might as well have sent a message in a bottle. I had a leaking sink that turned into a mini swimming pool before they bothered to send someone over. Apparently, they're on island time when it comes to fixing things.\n\nYou can tell these baboons are savages, by the look of their eyes you can tell they are money hungry and given the other reviews I've read I sense that I will be charged thousands for petty stuff. Save yourself the trouble. There are plenty of other leasing agencies that actually give a damn about their tenants. This one's a dumpster fire you don't want to get close to. NO TENANT APPRECIATION! ",
        "owner_response": null
      },
      {
        "author": "K King",
        "rating": 1,
        "review": "Liars and cheats. Beautiful apartments, but quality of build is questionable at best. Look beneath the surface and shoddy construction run by shady people is what you get. Moved into a brand new unit and the list of damaged and broken items was extensive on our move in inspection was extensive. Several repairs needed. New appliances failing, cabinet doors falling apart. Smoke alarms frequently going off due to changes in water pressure that have shut down elevators for days. The heat went out at the coldest point of winter and no one responded for days. But most importantly- get everything in writing from these backhanded swindlers. The leasing agents are all sale, no integrity. They'll tell you month to month is okay and then force you to extend for a year or move out. No compromising. No reasonable extension with higher rent. They will admit they agreed to terms they're now not abiding by. Also good luck to all our dog owning neighbors, they're now banning dogs.",
        "owner_response": null
      },
      {
        "author": "Scott Welch",
        "rating": 5,
        "review": "Exxel Pacific doing a great job building.",
        "owner_response": null
      },
      {
        "author": "Mundeep Jaiya",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Joshua Jones",
        "rating": 2,
        "review": "",
        "owner_response": null
      },
      {
        "author": "William Roberts",
        "rating": 5,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 6,
  "adjusted_average_rating": 1.67,
  "distribution": {
    "1": 6,
    "2": 1,
    "3": 0,
    "4": 0,
    "5": 2
  },
  "summary": {
    "created_timestamp": 1739205661,
    "text": "<section id=\"good\"><h2>Good</h2><p>Despite the overwhelming negative sentiment in most user reviews, there are a few positive aspects of Weatherby Apartments mentioned by their tenants. Specifically, the quality of the building construction has been praised by users, with one stating that the builders did a commendable job. Additionally, tenants have appreciated the quietness and cleanliness of the complex, especially in terms of soundproofing between units and maintenance of common areas like the hallways and trash locations. It appears that the overall layout and setup of the apartments are considered convenient by some, making life generally easier for residents.</p><p>Another bright spot highlighted in user reviews is the maintenance staff's responsiveness. Although there were negative experiences related to maintenance, there are instances where the maintenance team acted professionally and efficiently. For example, safety bars were installed promptly before one tenant moved in, reflecting a proactive approach by the team in some cases. The maintenance of a clean and well-lit garage was also mentioned as a positive attribute, helping tenants feel secure.</p></section><section id=\"great\"><h2>Great</h2><p>In stark contrast to the generally negative feedback, there are a couple of standout positive reviews that paint a different picture for Weatherby Apartments. One enthusiastic review highlighted an excellent experience with the building construction, noting that it was carried out by a reputable company and expressing satisfaction with the overall quality and design of the units. This sentiment indicates that for some, the physical spaces themselves meet high standards and contribute positively to their living experience.</p><p>While rare, these positive entries suggest that certain aspects of the Weatherby Apartments could provide a great living experience for those who prioritize solid construction and living in a property that aesthetically meets expectations. Residents who had positive interactions typically acknowledged specific features that appealed to them, like the sophisticated building layout and the peaceful environment facilitated by competent soundproofing. While these reviews are few, they provide a glimpse of potential satisfaction for future residents.</p></section><section id=\"bad\"><h2>Bad</h2><p>The negative reviews for Weatherby Apartments frequently touch on poor communication from management. Residents have expressed frustration with the lack of responsiveness to emails and requests for assistance, particularly related to making reservations within the community. One user described a situation where a reservation was made for the community room, only for it to be unceremoniously scratched off for a supposed special event, illustrating the inconsistency and lack of transparency in the property management team's operations. This lack of communication has often left residents feeling undervalued and ignored.</p><p>Additionally, maintenance concerns are a significant issue, with multiple reviews expressing dissatisfaction over delayed responses to requests. Tenants remarked on experiencing substantial issues, such as heating failures during the winter, with delayed resolutions that exacerbated the discomfort. Users consistently reported that essential repairs and maintenance services were treated as low priority, leaving residents to endure sometimes hazardous living conditions for extended periods. Such neglect suggests a pervasive issue with prioritizing tenant satisfaction and property upkeep.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Some of the most alarming feedback about Weatherby Apartments comes from experiences with their handling of lease agreements and fees. Several user reviews have described the leasing process as deceptive, with initial promises not being honored and hidden fees emerging at inopportune times. One tenant recounted being forced into a year-long lease after being told they could rent month-to-month, with no compromise or negotiation options. These sharp business practices have left many feeling swindled and trapped.</p><p>Beyond financial concerns, the disregard for handicapped accessibility and overall tenant well-being has sparked outrage among residents. Disturbing examples include forcing handicapped residents to park on gravely inclines without alternative access, and dismissive attitudes when confronted about these issues. One tenant shared how a lack of proper accessibility for wheelchair users made day-to-day living unnecessarily challenging, highlighting an indifference to the varying needs of residents. This neglect exposes a deeper issue within the management's capacity to compassionately and competently serve their tenant community.</p></section>"
  }
}