{
  "name": "Weatherby Apartments",
  "slug": "weatherby-apartments",
  "company_type": "property",
  "address": "2314 Weatherby Way, Bellingham, WA 98226",
  "review_count": 5,
  "average_rating": 3.4,
  "reviews": {
    "google_reviews": [
      {
        "author": "Glenn F",
        "rating": 4.0,
        "review": "My mother and I rented a 2 bedroom 2 bathroom unit a couple of months ago. The initial relationship with the leasing staff was rocky, but I feel has improved since weve moved in. The unit is as advertised, and the appliances are very nice. The dishwasher is so quiet! We rarely hear our neighbors and our fellow residents are nice. The leasing office have been very responsive to the few2 maintenance requests since we moved in. The maintenance team have been professional and prepared to complete work in an efficient manner. My mother was so pleased that Kim and the maintenance team had installed a safety bar in her bathroom before we moved in. The hallways and trash areas are kept clean, the garage doors actually work to keep your car safe and the garage is well lit. What we would have liked to see when we moved in; how to operate the BBQ grill (the power source is not anywhere youd expect and not labeled at the time), a map that indicates where the mail room is for large packages (didnt know there was one, but there is), where the trash area is and what the process is to use the club room (still a little confused about that one). Im sure that Covid precautions had a lot to do with how tours were/were not done and move-in tours done. Anyway, for us it is a nice complex thats close to everything we need to keep our life moving. The relationship with the leasing staff is much better and I dont worry about anything anymorewe actually plan on signing another lease. I do want to mention that though I have a Service K9, I know other residents that have dogs as regular pets here. Perhaps the prior policy changed but dogs are allowed at the Weatherby. If you move here, I believe youll be happy and very comfortable with your choice.",
        "ownerResponse": null
      },
      {
        "author": "K King",
        "rating": 1.0,
        "review": "Liars and cheats. Beautiful apartments, but quality of build is questionable at best. Look beneath the surface and shoddy construction run by shady people is what you get. Moved into a brand new unit and the list of damaged and broken items was extensive on our move in inspection was extensive. Several repairs needed. New appliances failing, cabinet doors falling apart. Smoke alarms frequently going off due to changes in water pressure that have shut down elevators for days. The heat went out at the coldest point of winter and no one responded for days. But most importantly- get everything in writing from these backhanded swindlers. The leasing agents are all sale, no integrity. They'll tell you month to month is okay and then force you to extend for a year or move out. No compromising. No reasonable extension with higher rent. They will admit they agreed to terms they're now not abiding by. Also good luck to all our dog owning neighbors, they're now banning dogs.",
        "ownerResponse": null
      },
      {
        "author": "Scott Welch",
        "rating": 5.0,
        "review": "Exxel Pacific doing a great job building.",
        "ownerResponse": null
      },
      {
        "author": "Joshua Jones",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "William Roberts",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 3.33,
  "summary": "<article class='review-summary'>  <section>          <h2>Disclaimer</h2>        <p>      This article has been generated by ChatGPT and is intended to be a tool to assist in finding property management companies or rental properties. It summarizes user reviews from Weatherby Apartments to provide a well-balanced perspective on the company's performance. The content may reflect a combination of positive and negative experiences, and is only a synthesis of user reviews without any personal identifiers.    </p>    <p>      By presenting common themes and specific examples cited by users, this article's intent is to deliver a concise overview of Weatherby Apartments' service quality. However, it is always encouraged to consult multiple sources and make a personal judgment before making any decisions based on this article.    </p>  </section>  <section>          <h2>Good</h2>        <p>      Weatherby Apartments have been commended for their clean properties and responsive maintenance teams. Some residents appreciate the professional conduct of the maintenance staff, stating that they are prepared and efficient in handling requests. A particular mention was made about the proactiveness of the team installing a safety bar in a resident's bathroom even before moving in, indicating attention to detail and caring customer service.    </p>    <p>      The complex itself has received praise for its amenities and the quietness it provides to its residents. The appliances are described as very nice, with a specifically highlighted dishwasher that operates quietly. The leasing staff seems to have developed a better relationship with the tenants over time, leading to an overall improved living experience and an intention among some residents to renew their leases.    </p>  </section>  <section>          <h2>Great</h2>        <p>      Among the positive attributes, Weatherby Apartments boasts agreements from residents about having well-lit and secure garage spaces, complimenting their efforts to ensure residents' safety and security. Neighbors are described as nice, which may contribute to a friendly community atmosphere. The location is touted as being conducive to a convenient lifestyle, being close to necessary services and amenities.    </p>    <p>      Additionally, there's an acknowledgment of a pleasant living experience particularly noted by a resident who plans on extending their stay due to their satisfaction with the apartment. This sentiment points towards a strong alignment to customer needs and a living environment that meets and perhaps exceeds some resident expectations.    </a>  </section>  <section>          <h2>Bad</h2>        <p>      Despite the favorable aspects, there have been reports of subpar construction quality. Some reviewers have noted issues with new appliances failing and structural components like cabinet doors falling into disrepair soon after moving in. Problems such as these indicate possible oversight in the building's quality assurance measures, leading to resident dissatisfaction.    </p>    <p>      In terms of responsiveness, there have been troubling accounts of the property management's lack of urgency when dealing with critical situations like a heat outage during winter. Delays in resolving such pressing issues question the reliability and efficiency of the administrative processes in place at Weatherby Apartments.    </p>  </section>  <section>          <h2>Ugly</h2>        <p>      Trust appears to be a significant issue with the leasing agents at Weatherby Apartments as per some user reviews, describing them as \"all sale, no integrity.\" Complaints of broken promises and abrupt policy changes concerning lease terms have tarnished the company's reputation. A grave note of caution is advised over verbal agreements that may not be honored, with one reviewer labeling the company as \"liars and cheats.\"    </p>    <p>      A particularly contentious point is the change in pet policy, reportedly banning dogs despite previous allowances. This sudden alteration in policy without clear communication or flexibility has led to much frustration among pet-owning tenants, demonstrating a disconnect between tenant expectations and management policies.    </p>  </section></article>"
}