{
  "name": "Westview Real Estate",
  "slug": "westview-real-estate",
  "company_type": "company",
  "address": "112 E Maple St STE 101, Bellingham, WA 98225",
  "review_count": 66,
  "average_rating": 2.86,
  "reviews": {
    "google_reviews": [
      {
        "author": "Make the World a Better Place",
        "rating": 3.0,
        "review": "Been here two years. First year rent went up around 100$ in 2023. Second year has just been told will be up again around 100$ in 2024. Over 1300$ studio without a room. Ocean view is nice and so is the newer building but it's just for high middle class if your a single individual. Nobody cares about single middle class people though, right? This country is not what it was promised to be. Quite unfortunate as a proud first generation American speaking. Still proud and no shade. All the best to westview going forward as I consider my options .",
        "ownerResponse": null
      },
      {
        "author": "Jessie Polin",
        "rating": 1.0,
        "review": "Avoid at all costs if possible. The people working in the office are mean, condescending, and unhelpful. They will keep at least half of your deposit for absolutely no good reason, no matter how well you clean. They break tenant protections regularly. Absolutely terrible experience. Don't do it.",
        "ownerResponse": null
      },
      {
        "author": "Jason Simon",
        "rating": 5.0,
        "review": "Lived in the Condor for 6 years, phenomenal experience. Very quick email responses for any questions/concerns, on top of any parking gate issues, garbage code updates, etc. Very professional office and staff, couldn't ask for more. 10/10.",
        "ownerResponse": null
      },
      {
        "author": "Megan Kelley",
        "rating": 1.0,
        "review": "Does not care about the security of the premises. Half of my premium gas was siphoned from my car in their gated parking lot. They did nothing.",
        "ownerResponse": null
      },
      {
        "author": "Olivia A",
        "rating": 5.0,
        "review": "I rented an apartment with Westview for two year, and it has been a great experience. They have been professional, organized, and quick to respond. I went through the process of a lease takeover, and they were very helpful and courteous through the whole process. I would rent through Westview again in a heartbeat.",
        "ownerResponse": null
      },
      {
        "author": "Phoenician Beaux champ",
        "rating": 1.0,
        "review": "Westview is a real estate company that also does property management. Meaning, there is a process they explain to lease and a criteria you must meetthey arent messing around so read it carefully. Another example; most apartment communities dont charge their residents $50/hr labor plus parts for maintenance that they determine is not normal wear and teardamage I understand, a clogged/leaky toilet I do not. The security deposit is equal to a months rent. The leasing staff in particular Kira Boardman should be locked away from future tenants. She doesnt communicate well, rude and unprofessional. For example; my handicapped wife sent her questions regarding accommodations for the shower, Kira didnt return phone calls/emails, claimed she didnt receive them or turfed the call to a colleague that didnt know what my wife was asking about. On the two occasions that we actually spoke with Kira, her tone of voice was demeaning and subordinate. She made comments like, we dont normally even discuss safety bars until a candidate is approved., or if youre not happy with our service, youre welcome to walk across the street, though we own that as well. When we signed our leasewith a colleague of Kiras, we didnt receive a welcome letter, a happy to have you with us or any hint that we were welcome at The Weatherby. People behave the way the do for many reasons. We were looking for a very specific apartment in a specific type of area. The Weatherby fit our needs well. So we rented for those reasonsunderstanding that we arent necessarily welcome by the leasing staff. If you choose this community, make sure that read the documents as though it were a mortgage and youre renting it with your eyes wide open. Hopefully others will have a better experience. Best of luck!",
        "ownerResponse": null
      },
      {
        "author": "misty garcia",
        "rating": 1.0,
        "review": "A sprinkler bursted at an apartment complex (broadway apartments) the customer service has been terrible. The way that the workers talk to people about situations and their frustrations is so wrong, if you work in customer service act like it. For example a very important email about everything that happens was supposed to get sent but that didnt happen so the next day we called and a woman answered and just said oh I forgot to send it. Mind you she was so rude and dismissive about everything. Saying  its not any new information you dont already know. Completely unprofessional. Expecting everybody to move right now like we have places to go automatically. It's a whole apartment complex don't expect everybody to have a place to go this could be their only option so why don't you guys try to be more sensitive about that. With that being said y'all need to get your words straight, saying we can get our rent and deposits back if we move, like you have to give us that anyways because we have to leave with causes that was not created by us. I get that you need to fix this problem but its not like it's not livable. People need time to figure stuff out. Think about the families. Or people that live paycheck to paycheck you think they can just move without their deposit back and getting rent back because you usually needs first months rent right? Sucks for people that don't have the money. Where they gonna go? The street? Right, you can't help us find housing. Oh don't get me started in maintenance. Still waiting for the second shower rod to get fixed and moved in august and now it's January. Had to fight to even get the blinds fixed in the front window of the apartment where everyone can just look in. Listen do not ever go with Westview. 10/10 do not recommend.",
        "ownerResponse": null
      },
      {
        "author": "Erin Lee",
        "rating": 5.0,
        "review": "I have lived in Bellingham for a while now and have rented from several different property management companies; Westview has easily been the best experience I have had so far! They were prompt when it came to helping us move in and have been great at communicating when maintenance will occur (little thins like window washing, etc.). They maintain their buildings and seem to have a kind and helpful team. I definitely recommend renting from them. Thank you, Westview!",
        "ownerResponse": null
      },
      {
        "author": "T Mac",
        "rating": 5.0,
        "review": "I lived in an apartment at Cornerstone Lane for several years and always found Westview to be super helpful whenever I had a question or needed maintenance done on a unit. Kim and Kira were always super friendly, and they went the extra mile when I had a request. Out of the three different places I have rented from, these apartments were the best.",
        "ownerResponse": null
      },
      {
        "author": "K",
        "rating": 1.0,
        "review": "I would leave no stars if I could, because working with the Westview Real Estate team has been nothing but frustrating for the duration of the time that I lived here.\n\nThe girls working in the office are unresponsive and unwilling to assist in any questions or needs the tenants at this unit may have. Any time I go in I feel like I'm wasting my time because I get zero help and leave their office/phone calls/emails feeling like I would get more advice talking to a balloon. You can tell that none of the office workers have worked with tenants before, and I understand that they may not actually care if someone approaches them with a concern but a huge part of customer service is at least PRETENDING to care.\n\nWestview has a tendency of not taking care of problems when they're brought up. Upon move in I was supposed to receive 2 keys to the unit, one for my spouse and I but it turns out they lent one to a painter, or the previous tenant had it, or something (they were unsure) so they told me to simply \"make another key\". Very comforting knowing that someone out there had a key to my unit for over a year that I lived there, but hey it wasn't 'their problem' so they did nothing about it. They could have at least changed my locks.\n\nThat wasn't even the worst part about my experience moving in. The worst part was being told via email 2 HOURS before my official move in date that they were going to have to push my move in date back over a week because my unit was deemed 'uninhabitable'. So I was stuck sitting outside of my unit with 2 trucks full of household items with no where to go, and did they offer to put us up in a hotel or anything? No. Westview simply said \"talk to your renters insurance and they'll pay for that\". After speaking to my renters insurance they said that that should have 100% been Westview's responsibility since they broke our contract but they didn't care. So my spouse and I couch surfed for another week while leaving all of our belongings in an open vehicle parked for a week. Thanks Westview!\n\nWhen I moved in there was still litter on my windowsills, holes that had not been cleaned up, mold in the dishwasher, and more. However, if you want someone form Westview to actually come and help fix anything they charge a minimum of $50 just for coming out. So yes, that means they charge $50 for replacing a lightbulb. I found this out the hard way. I lived in a unit with 20ft ceilings and would stack a ton of stuff up high so I could climb to reach high bulbs and spots; however they still managed to charge for the replacements of lightbulbs that were 'burnt out' upon my move out...which amounted to about $70 in total. When, I had replaced ALL of the bulbs 8 days prior to move out. There's many other things like this I could go on about but I'll leave it at that.\n\nFor at least 4 months when I lived at one of their units the garage doors were busted so that anyone could wander in and approach the cars of the tenants; I had stuff stolen from my parking space, found shattered glass, litter, etc and Westview wouldn't do the slightest thing about it.\n\nAlso, the girls in the office tend to simply lock their doors without warning or a sign during their normal business hours on rent due days, be gone during the weekend, and then try to charge a late fee when you couldn't get your check dropped off. (May I add they charge about $50+ to pay online with a card). This was pre COVID by the way, so it was very frustrating. If you're not going to be in the office during regular business hours, at least leave a sign on the door. Send an email, anything; so that when your tenants are trying to pay their rent on time they actually can.\n\nThere's a lot of other things I could mention here but hopefully you sense the theme. I had a very unprofessional and negative experience working with Westview despite how expensive it is to live here. If they could put some of the money that I'm paying them to actually make sure our services are operating (such as the garage doors) instead of pampering their office hamster that would be great.",
        "ownerResponse": null
      },
      {
        "author": "Ashley Kersey",
        "rating": 5.0,
        "review": "We've leased through Westview for two years now and plan to renew for a third. Overall, we've been very happy with their management services. They've answered our maintenance requests quickly and professionally; otherwise, they've been friendly and unobtrusive. Yes, they request renewal commitments early in the year as mentioned below, but this is standard practice in the area (although inconvenient) and other management firms also do this.\n\nThe rents are at a premium as their properties are virtually brand new and located in desirable areas. You get what you pay for. Bellingham rents are steep, but for us, Westview's great properties and staff continue to justify the price.",
        "ownerResponse": null
      },
      {
        "author": "Dan Carnevale",
        "rating": 2.0,
        "review": "They will take at least 70% of your deposit, no matter how clean your apartment is, so you may as well do a bad job. They also \"made a mistake\" and kept even more of my deposit than they were supposed to. Even after correcting this mistake, they still insisted it took 7 hours to clean an apartment I spent 12 hours cleaning and charged me hundreds of dollars of cleaning fee. Be VERY careful with your deposit.",
        "ownerResponse": null
      },
      {
        "author": "Braun Consulting Group, Inc",
        "rating": 5.0,
        "review": "As a business needing an apartment for an unknown period we were fortunate to have Westview become our landlord.  Form the beginning until early termination of the lease they worked with us to make the experience as good as we ever expected.  We recommend Westview to any business needing employee or temporary housing in Bellingham.",
        "ownerResponse": null
      },
      {
        "author": "Emma Smith",
        "rating": 1.0,
        "review": "I would give zero stars if I could. The owner of this management group is the most heartless business owner ever.  Bellingham is such a kind, beautiful, and diverse area, and the owner has no interest but her own.  They don't even tell potential tenants to remove their shoes before entering a showing of someone's apartment.  Seriously, very awesome studios, and new, but over-paying and dealing with management ruins it all.\n\nEven when there was a shooting in the building,  management had the resolution of sending all delivered packages to their main office where we can pick it up during their business hours....what sort of solution is this for their tenants??  And of course they said they would not be liable for any missing packages with that idea.  Even when I forgot to give back the parking pass, they told me to put it in  the mail and it wouldn't be a problem.   When I got my deposit money back, they still charged me for it.  I called and they said they didn't receive it.  They are truly cruel to tenants.  If you live here, don't complain, because they won't let you rent with them every again-even if you pay rent on time and leave the place better than you got it.\n\nSuch a shame that these people delegate over innocent bellingham residents, they make Bham look so bad.  They have no sympathy, morals, or respect for anything.  The office crew thinks they have the most important  job and love telling tenants they are screwed...sorry...not sorry...bye...\n\nLong story short, anyone that writes a good review was either by one of the staff members or just paid to write google reviews.  Shows how shady they are.  It's not hard to be nice-especially to tenants that pay $1,000 a month for a studio, in bellingham...\n\nThe only  people that enjoy living here are irrational narks, and imagine having neighbors like that, with the management like West Views.  My neighbor went out on the street and protested against gays every single day.  This caused honking and riots outside of our entrance door.  I guess westview shares the same disgusting views as the people haters of the world.",
        "ownerResponse": null
      },
      {
        "author": "Anonymous",
        "rating": 1.0,
        "review": "The worst property management company I have ever dealt with.  Watch out for hidden fees.  The elevator in Marketplace constantly breaks, leaving you to walk in the stairwell that leads to the ally way.  The stairwell clearly does not get cleaned (neither does the rest of the building)... it smells like pee and has for the last year.  Literally, do not live here.  The rent is obnoxious and hidden with fees!!!!!  Also, had a huge ant problem during my lease.  Disgusting.  When I moved in, I was so excited.  I met my neighbor, who ended up moving out early, and she felt bad for me that I had decided to live there.  I now understand where she was coming from.\n\n--A very angry, struggling college student",
        "ownerResponse": null
      },
      {
        "author": "M Ryan",
        "rating": 5.0,
        "review": "I have lived in the Morse Landing Apt. complex for almost six years now.  Westview took over the management of the building a few years ago from another compnay who was less that mediocre.  I am impressed with the quick and prompt attention the Westview Staff and my regular point of contact Kara have provided whenever anything has come up.  With the exception of a few irresponsible and immature tenants not heeding the posted hours of use for the rooftop deck, I like living here.  Westview has done all it can to prevent the abuse of the above and continues to do so.  I continue to renew my lease as a result of liking the building and the good people that run it, and will probably continue to stay until I buy a place.  I'd recommend this property management company highly, as they are nice, professional, and are legitimately concerned with the proper running of our building. Thanks!",
        "ownerResponse": null
      },
      {
        "author": "Amber Armstrong",
        "rating": 1.0,
        "review": "Terrible experience. Front desk people nothing but rude and always were super condescending towards me and friends I had in the complex. I found a homeless man in the stairwell and they did not help and I had to deal with the police when I had work and events going on. Also took more than half of my deposit. I will never recommend them.",
        "ownerResponse": null
      },
      {
        "author": "Luke Dubois",
        "rating": 1.0,
        "review": "Westview took over our apartment complex from Apex part way through the lease. They have been unprofessional and will sneak fees in wherever they can. Their tenant portal didnt show the balance to pay until its already past-due and then tried to force us to pay as a lump sum. And theres a $2 fee every time you pay rent online.\n\nDefinitely try your best to rent elsewhere. We got stuck with them. Definitely wouldnt have signed.",
        "ownerResponse": null
      },
      {
        "author": "Marcus Wiebe",
        "rating": 1.0,
        "review": "Absolute worst customer service. Was constantly lied to throughout my application process and got jipped out of 3 apartments. They never once cared that my wife and I are moving across country and NEED a place to live. All they care about is money. Its unfortunate that the nicest apartments in Bellingham are managed by such a bad company. I recommend whoever owns the apartment complex's to hire another management company that actually cares about people.",
        "ownerResponse": null
      },
      {
        "author": "Devyn Doctor",
        "rating": 1.0,
        "review": "I would not recommend using this company as your property manager. They hired construction workers to repair a parking lot that was in seemingly perfect shape. The workers yell across the lot starting at 7am and have no respect for the surrounding tenants. The management company does not care enough to help fix the problem they have created from lack of initial planning. Not a well-run company.",
        "ownerResponse": null
      },
      {
        "author": "Gavin Green",
        "rating": 5.0,
        "review": "Westview Property Management is a great property management company. Anytime I interact with them they are not only professional but also down right friendly. The thing that sets them apart from the other property management companies is how pro-active they are. Instead of waiting for problems to arise, or waiting to see if you are moving or not, and responding to it, westview goes out of their way to address potential problems before they become serious issues, and finds out your moving plans well in advance.",
        "ownerResponse": null
      },
      {
        "author": "Delia Wichrowski",
        "rating": 1.0,
        "review": "We went in to look at an apartment and started filling out applications on the spot. The leasing agent told us another girl was coming in with an application and we should fill them out quickly if we were serious. We had our cosigner form already faxed in and we were filling out the last of our application when the leasing agent came in saying she was taking the other application first. Are you kidding me? We were IN THE OFFICE FILLING IT OUT. Absolutely ridiculous. The girl was rude and was less than apologetic. With the way that we were treated we wouldn't want to live there anyways. Dodged a bullet.",
        "ownerResponse": null
      },
      {
        "author": "DeadEye428",
        "rating": 1.0,
        "review": "The year I lived downtown was certainly interesting.  My first week here I saw two hit-and-runs and the death of a homeless man. Later, two dozen homeless people making a large camp at the depot market that was up from mid December to January; a dozen arguments between gay and trans people echoing from the bar a block away; a meth-head taking a coffee bath and screaming every 30 seconds for about 16 hours straight (8pm to noon the next day) that the cops saw, then left alone; the mentally challenged kid waving an \"obsidian spear\" as he called it (a knife) at cops until he was beanbagged, literally outside the door of the Shearwater; and a few dozen breakups, fistfights, arguments and vagrants that made me not want to go outside.\n\nAs for the owners, It was a mistake renting from these people.\n\nOnce you're in you're stuck. They gave us a posting  for us to decide if we were moving out or staying and we had to answer by March 31st....  My lease ended in October and they were already trying to get me to commit to another year, 7 months in advance.",
        "ownerResponse": null
      },
      {
        "author": "Brendan Spah",
        "rating": 5.0,
        "review": "I was looking for an apartment downtown, but my first choice was not available at the time I applied. Alicia let me know immediately, and helped me look for other units that fit my needs. While I ended up choosing a different apartment outside of this property management company, I really appreciate all she did.",
        "ownerResponse": null
      },
      {
        "author": "James Dubelko",
        "rating": 5.0,
        "review": "Great service! When my wife and I had to move before our condominium lease was up, they stepped up and quickly found someone to move into the unit, savings us a lot of worry and money.  I highly recommend the company.",
        "ownerResponse": null
      },
      {
        "author": "Mike Anderson",
        "rating": 5.0,
        "review": "For about a decade this team took perfect care of our condothere wasn't a single day that a tenant wasn't renting, they were budget conscious on maintenance, and the price was very reasonable. I have nothing but great things to say about this team.",
        "ownerResponse": null
      },
      {
        "author": "Kayza Robertson",
        "rating": 5.0,
        "review": "The best and most helpful property management I can say. Gets problems fixed quickly and great customer service. I love my apartment and the team that works here! You cant go wrong choosing WestView. Thanks for all youve done!",
        "ownerResponse": null
      },
      {
        "author": "Megan Johnson",
        "rating": 1.0,
        "review": "Wow, we are in the process of moving out. Thus far, they have improperly entered our apartment (a strange man appeared in my roommate's bedroom while she was sleeping). They closed doors to litter boxes, left the door unlocked. Refuse reasonable requests to reschedule showing. Completely unprofessional and as to the entry illegal.",
        "ownerResponse": null
      },
      {
        "author": "katie Thiele",
        "rating": 5.0,
        "review": "Ive lived in Bellingham all of my life and have rented through a lot of different places and these guys are definitely the best choice. Awesome customer service. Very proactive about maintenance which was super refreshing after having bad landlord experiences in the past.",
        "ownerResponse": null
      },
      {
        "author": "Taylor D",
        "rating": 5.0,
        "review": "Great.  Friendly staff and ownership who genuinely care about tenents.  I had a major concern regarding issues with something regarding repaving the parking lot and received a call from the owner the same day explaining what they had done to solve the issue and thanking me for bringing it to their attention.  Best property management company by a long shot that maintains nice units",
        "ownerResponse": null
      },
      {
        "author": "Katie Micheletti",
        "rating": 1.0,
        "review": "They took over our building halfway through our lease with Apex and have been disorganized and unprofessional throughout the transition. We are constantly charged with random fees that the company cant even explain to us when we call to ask about. Terrible rent payment system. Dont waste your money, go somewhere else",
        "ownerResponse": null
      },
      {
        "author": "Amber Hanstead",
        "rating": 5.0,
        "review": "Wonderful property management! I've rented twice from Westview and never had an issue. Friendly and caring staff - great communication and attentive to any requests or questions.",
        "ownerResponse": null
      },
      {
        "author": "Amy Taylor",
        "rating": 1.0,
        "review": "We are currently residing in Los Angeles and have lived in Bellingham for years prior to moving down here. We are in the process of moving back and have been searching for housing in the area. We decided to place an application with their new property, The Weatherby.\n\nOur correspondences were with an agent named, Kim Seitz. Her lack of follow through and poor customer service during the process resulted in our decision to withdraw our application.\n\nWe had placed and application on their site this past weekend. We followed up with a call and spoke directly to Kim on Monday. We had requested availability of a 1 or 2 bedroom and she stated she would send us pictures through e-mail of a few units that were available later in the afternoon. She did not follow through, so we called again on Tuesday and left a message requesting to see pictures/floorpans of any available 1/2 bedrooms. Again, there was no follow through. We called on Wednesday, Kim answered and we asked her about the status of our application and if she could send us pics/floorplans of the 1/2 bedrooms as she shared she would earlier in the week.\n\nShe responded with a flat: \"I cannot move the process forward until the roommate places an application\". (We had no problem doing so as we both have rented and know this is standard procedure as far as being approved, but many places actually will send a notice or the agent will contact the primary applicant and tell them how to proceed for the \"roommate\". We were waiting to hear from the agent to know how to move forward as the primary was going to be fully rent responsible & able to afford place on his own while the roommate is on disability. We were unsure how to \"link\" the applications in the system.)\n\nThere was an awkward silence and I shared we could certainly fill out the application, but are you now saying that we can't see pictures of the 1/2 bedrooms that you stated earlier that you would send? She then shared she had been too busy and that she was there alone, etc. Keep in mind we had already placed $100 application fee. We could see on Craigslist that they only had 1  1 bedroom left, etc. and were growing concerned about availability.\n\nAt this point, we hung up quickly as we did not appreciate the lack of follow through, excuses, and frankly, the \"attitude\" displayed when we had waited patiently for pictures that she said she would send 2 days earlier. This apartment would have been $20,000-26,000 for a year lease that we were willing to commit to had we signed with them.\n\nWe wrote later stating that we were canceling the application. She continued to send a message about the 1 bedroom the following morning. We were potentially going to reconsider and \"just let things drop\" and we asked how much it would be as she did not include pricing for the unit. She then responded with the message below which showed quite a bit of immaturity, bringing up the conflict that was actually brought about by her lack of follow through initially and also not following up to explain how to link applications, etc. Most places we've rented the primary fills out the application first and then the roomate. Etc.\n\nAnd so, based on the lack of follow through, incompetence, immaturity, and unprofessionalism we decided to look elsewhere. I sincerely hope the property management company provides better training as moving is already extremely stressful and we didn't want the added stress of signing a lease with an agent who we didn't feel we could rely on to get back to us. And, one who made us feel uncomfortable in the process.\n\nWhy bother with a place that shows you UP FRONT that your business does not matter to them???  Thanks, but, UM, NO THANKS.",
        "ownerResponse": null
      },
      {
        "author": "Diva Menke-Thielman",
        "rating": 5.0,
        "review": "Westview is great. I've rented from them for 2 years and have come to really appreciate their staff. They take care of any issues right away with competence and respect. I highly recommend them.",
        "ownerResponse": null
      },
      {
        "author": "Ali Fares-Boulos",
        "rating": 5.0,
        "review": "Great place to rent through. Management was super helpful with finding me a spot. If you email them, theyll send you units that havent been posted. Theyve fixed all repairs quickly and effectively. Love the place they found me!",
        "ownerResponse": null
      },
      {
        "author": "Jake Johnson",
        "rating": 5.0,
        "review": "Fastest maintenance I've ever had!! Arrived within 5 minites of calling! And fixed everything super quick as well",
        "ownerResponse": null
      },
      {
        "author": "Hannah",
        "rating": 5.0,
        "review": "Their apartments are always well maintained, and the ladies in the office are awesome.",
        "ownerResponse": null
      },
      {
        "author": "Forrest Willoughby",
        "rating": 5.0,
        "review": "Haven't had any issues with them as a renter. Professional and friendly.",
        "ownerResponse": null
      },
      {
        "author": "Chris Wells",
        "rating": 1.0,
        "review": "Had no listing for the property on the web listed in Fairhaven.",
        "ownerResponse": null
      },
      {
        "author": "Baronesse Bham",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Joseph Taylor",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Emmett Whitehall",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Gavin Cook",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Chena Fisher",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Alina Holmes",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kaveh Ahmadi",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Kate Thiele",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "quinn lathe",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Samantha Mantey",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Donnie Ketchens",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jim Woloszyn",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Samia Quidwai",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Andrew Haggen",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Alex R",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Jamie Aten",
        "rating": 2.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Daniel Cantu",
        "rating": 1.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Z D",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      }
    ],
    "yelp_reviews": [
      {
        "author": "Amy T.",
        "rating": 1,
        "review": "We are currently residing in Los Angeles and have lived in Bellingham for years prior to moving down here. We are in the process of moving back and have been searching for housing in the area. We decided to place an application with their new property, The Weatherby.\n\nOur correspondences were with an agent named, Kim Seitz. Her lack of follow through and poor customer service during the process resulted in our decision to withdraw our application.\n\nWe had placed and application on their site this past weekend. We followed up with a call and spoke directly to Kim on Monday. We had requested availability of a 1 or 2 bedroom and she stated she would send us pictures through e-mail of a few units that were available later in the afternoon. She did not follow through, so we called again on Tuesday and left a message requesting to see pictures/floorpans of any available 1/2 bedrooms. Again, there was no follow through. We called on Wednesday, Kim answered and we asked her about the status of our application and if she could send us pics/floorplans of the 1/2 bedrooms as she shared she would earlier in the week. \n\nShe responded with a flat: \"I cannot move the process forward until the roommate places an application\". (We had no problem doing so as we both have rented and know this is standard procedure as far as being approved, but many places actually will send a notice or the agent will contact the primary applicant and tell them how to proceed for the \"roommate\". We were waiting to hear from the agent to know how to move forward as the primary was going to be fully rent responsible & able to afford place on his own while the roommate is on disability. We were unsure how to \"link\" the applications in the system.)\n\nThere was an awkward silence and I shared we could certainly fill out the application, but are you now saying that we can't see pictures of the 1/2 bedrooms that you stated earlier that you would send? She then shared she had been too busy and that she was there alone, etc. Keep in mind we had already placed $100 application fee. We could see on Craigslist that they only had 1  1 bedroom left, etc. and were growing concerned about availability. \n\nAt this point, we hung up quickly as we did not appreciate the lack of follow through, excuses, and frankly, the \"attitude\" displayed when we had waited patiently for pictures that she said she would send 2 days earlier. This apartment would have been $20,000-26,000 for a year lease that we were willing to commit to had we signed with them.  \n\nWe wrote later stating that we were canceling the application. She continued to send a message about the 1 bedroom the following morning. We were potentially going to reconsider and \"just let things drop\" and we asked how much it would be as she did not include pricing for the unit. She then responded with the message below which showed quite a bit of immaturity, bringing up the conflict that was actually brought about by her lack of follow through initially and also not following up to explain how to link applications, etc. Most places we've rented the primary fills out the application first and then the roomate. Etc.\n\nAnd so, based on the lack of follow through, incompetence, immaturity, and unprofessionalism we decided to look elsewhere. I sincerely hope the property management company provides better training as moving is already extremely stressful and we didn't want the added stress of signing a lease with an agent who we didn't feel we could rely on to get back to us. And, one who made us feel uncomfortable in the process.  \n\nWhy bother with a place that shows you UP FRONT that your business does not matter to them???  Thanks, but, UM, NO THANKS.",
        "ownerResponse": null
      },
      {
        "author": "Lance H.",
        "rating": 1,
        "review": "It was a rough year living in this apartment complex, and the turmoil did not end when we moved out. Some of our concerns are outside of the direct control of the management company, but most are not.\n\nFirst, it is a loud place to live. We started on one side of the complex, and could rarely get a good night's sleep with the noise from both inside and outside the complex. We then moved to the other side, and the train on that side was very loud and disruptive. But neither of these things were in the control of the management company.\n\nWhat was under their control was their customer service. Rarely did we feel attended to. Requests for repairs were sometimes met, but we were just as likely told that a repair (a leak, a clogged toilet, etc.) was our responsibility and they would try to charge us for it. To be clear, they DID charge us for it and only after a good deal of complaint, did they remove the charges. As a renter, I believe it is the owner/landlord's responsibility to make repairs on the property. \n\nWhen we moved out, we were the final tenants in a six-year run of that particular unit. The carpets had never been replaced in that time. Before moving out, I consulted with Alyssa, the property manager. She told me that the life of the carpet was five years and so they would be replacing it. Normally, carpet cleaning is billed to the tenant, but not replacement, she told me. When we left, we cleaned the place fairly thoroughly and took pictures.\n\nIn the end, they decided to clean the carpet and charge us for it, which is gross, frankly. I feel bad for the next tenants. On top of that they charged us hundreds of dollars in labor for things like putting in new light bulbs and replacing the burner pans on the stoves. The job could not take more than a few minutes. Hundreds of dollars! \n\nI know the real estate market in Bellingham is tight, but if you can find another place, I would advise you do. You will lose most of your deposit, and a lot of sleep if you have to live there. \n\nWe are currently in dispute over our deposit. If they make good, I will change my review here to note that.",
        "ownerResponse": null
      },
      {
        "author": "ian t.",
        "rating": 1,
        "review": "I lived at the Shearwater for 4 years.  The apartment is a great place to live, very convenient location, with parking lot and in-unit laundry, which are both rare in a downtown facility.\nHowever, the management staff were problematic.  The building common spaces were dirty most of the time, the parking lot was never cleared of snow, the security gates often didn't close fully.  \nThe staff consisted of a claque of rude young individuals who seemed more interested in their social lives other than customer service.  Using Covid as an excuse, they kept their business doors locked and maintained short hours well after restrictions were listed.  If one had a regular job and needed some help after 4:30 in the afternoon, well too bad! I returned from a 3 week trip to find that my building key didn't work, they had changed the locks.  Luckily, I got into town early   that day so could get into their office door (not the office, just a crack in the door) and was given the new key. When asked what I would have done if I had gotten there half hour later, the reply was, \"We emailed you that you needed a new key\"  That did not answer my question, and when I searched all my email, plus spam, there was no email\nDuring the rent control, they insisted that they would demand their proposed back rent to be paid as soon as the rent control was lifted, so I should pay their rate even if I wasn't legally required.\nThe rules regarding the lease were rigid.  One had to notify them over 3 months in advance if you were going to renew, which was difficult in my work situation.  If you didn't tell them by that date, they threatened to rent the apartment out from under you.  When I finally retired and moved, the process of finding someone to take over my lease was bureaucratic, cumbersome, and inflexible, with tons of paperwork, and difficult for both myself and the individual taking over my lease. Plus they wanted me to sign documents which would imply I was still responsible for the next year's lease renewal, or so it sounded from what they were seemingly saying. This was at a time when there was a huge demand for rentals downtown, and they even refused to list my unit on their website as being available for rent.  \nIn summary, great apartment, lousy service",
        "ownerResponse": null
      },
      {
        "author": "S S.",
        "rating": 1,
        "review": "I used to really enjoy living in a Westview-managed apartment, but I have been thoroughly disappointed lately, feeling as though management has perhaps switched hands, because service has gone completely downhill. \n\nThey seem keen on utilizing classic sleazy landlord techniques like cheap, band-aid fixes, and while they are quick to respond, is it really fixed if it's just going to break again in a month? It didn't help that my completely justified frustration with said 'quick fix' was met with a lot of unwarranted attitude and back-talk by one of the employees in the office. \n\nWhat was once a beautiful apartment complex, seemingly aimed at young professionals, has since become a dumping ground for rowdy college students, the hallways now trashed from spills of fluorescent yellow paint and what looks like vomit. The parking lot is littered with cigarette butts and trash, and so many poorly parked vehicles, overlapping your space and making it nearly impossible to get out. The traffic from the surrounding businesses regularly blocks parking access altogether. \n\nIt's really a shame; what would have been a 5 star review a few years ago is now barely deserving of 1.",
        "ownerResponse": null
      },
      {
        "author": "Misty G.",
        "rating": 1,
        "review": "A sprinkler bursted at an apartment complex (broadway apartments) the customer service has been terrible. The way that the workers talk to people about situations and their frustrations is so wrong, if you work in customer service act like it. For example a very important email about everything that happens was supposed to get sent but that didn't happen so the next day we called and a woman answered and just said \"oh I forgot to send it.\" Mind you she was so rude and dismissive about everything. Saying \" it's not any new information you don't already know.\" Completely unprofessional. Expecting everybody to move right now like we have places to go automatically. It's a whole apartment complex don't expect everybody to have a place to go this could be their only option so why don't you guys try to be more sensitive about that. With that being said y'all need to get your words straight, saying we can get our rent and deposits back if we move, like you have to give us that anyways because we have to leave with causes that was not created by us. I get that you need to fix this problem but its not like it's not livable. People need time to figure stuff out. Think about the families. Or people that live paycheck to paycheck you think they can just move without their deposit back and getting rent back because you usually needs first months rent right? Sucks for people that don't have the money. Where they gonna go? The street? Right, you can't help us find housing. Oh don't get me started in maintenance. Still waiting for the second shower rod to get fixed and moved in august and now it's January. Had to fight to even get the blinds fixed in the front window of the apartment where everyone can just look in. Listen do not ever go with Westview. 10/10 do not recommend!",
        "ownerResponse": null
      },
      {
        "author": "L T.",
        "rating": 1,
        "review": "I lived in an apartment at a Westview Property downtown Bellingham for a month before moving out due to the level of noise in and surrounding the building, and had $750 deducted from my deposit despite ZERO damage or wear to the apartment (and having it professionally cleaned before leaving), and continuing to pay rent for the duration of my lease.\n\nThe first most important issue is the unbearable noise levels both inside and outside the building; I had a water-facing apartment, which initially seemed great, but ended up being so nerve-wracking because of constant noise I had to move out. \nThe noise ranges from blaring, extended horn blasts from trains passing by no less than 5 times a night at all hours of the night, constant construction noise (including incessant beep-beep-beeps from trucks backing up) from 7am-7pm 6 days a week from the waterfront development (which will be ongoing through 2019), amplified music from bands playing across the street at the Market every Saturday throughout the summer, loud DJ music from private parties at the Depot until as late as 2am, and drunk students yelling and carousing at an outdoor bar directly downstairs from the building from 6pm-11:30pm. \nInside the building, tenants blast music on a high-bass surround-sound stereo systems, and neither the walls, flooring or windows muffle sound. I could hear conversations my neighbors were having, along with other unmentionable things they were doing, every night.\n\nThe second big issue is the lease; it is wildly complicated and a lesson in why you should have an attorney review all contracts before signing - there are tons of hidden fees and unreasonable costs buried in the text of the multi-page agreement - and you will get money deducted from your lease no matter how untouched you leave your rental. I was in my apartment a total of 4 weeks and left the place immaculate, and was still charged a cleaning fee, plus fees for things like 1 roll of toilet paper I had left as a courtesy in the bathroom.\nThe management is staffed by people who don't seem to want to take the time to explain any of their policies; when I asked to have a move-out inspection done by my parents, who were co-signers on the lease, they made an appointment, then, told my elderly parents that they \"forgot\" the appointment when they showed up, and that they were not allowed keys or able to enter the apartment anyway even though they co-signed the lease. This was not mentioned at any point, or when I set up the walk through appointment. The staff also became terse, difficult and argumentative when my parents tried to ask them questions, so they ended up leaving feeling defeated and like they were treated poorly. \n\nThe apartment also had a bad, onion-y odor, my previously clear skin broke out shortly after moving in, and cleared up soon after I moved out.\n\nAll in all, after 25 years of renting apartments in cities large and small, this was one of the worst living experiences I've ever had, and despite appearances, the way this company treats people and gets their money - taking advantage of a high-cost rental market - is shameful. I would not recommend these apartments to anyone looking for a reasonably comfortable and quiet place to live.",
        "ownerResponse": null
      },
      {
        "author": "Megan J.",
        "rating": 1,
        "review": "Such a shameful company. They have treated us terribly during our move out. Improperly (and illegally) entering our apartment for a showing, thereby terrifying my roommate by having a strange man enter her bedroom while she was sleeping. They further locked doors to litter boxes repeatedly, and didn't lock the front door on another occasion. \n\nThey had the nerve to complain about the disarray the house was in, which was purely due to the typical chaos of taking everything out to get into boxes.\n\nLease here at your own risk!",
        "ownerResponse": null
      },
      {
        "author": "Daniel D.",
        "rating": 1,
        "review": "DO NOT LIVE HERE!\n\nWhen I moved in, the carpet was not cleaned properly so I wrote on my intake form that it was okay and that there were spots on the carpet. \n\nI just received my security deposit back and they charged me $105 for regular cleaning and $120 for deep cleaning! The carpet was not deep cleaned when I moved in why should it be now. \n\nThey also deducted ONE HUNDRED DOLLARS for changing of lightbulbs (THAT ALL WORKED WHEN I LEFT) and drip pans! Who charges for drip pans? That is supposed to be managements cost not the renters responsibility.\n\nI was accused of leaving items behind and plastic removal from garbage disposal yet it worked when I was there and I never would put plastic in the garbage disposal like an idiot. Also I cleared the apartment out when I left which makes no sense at all why they would charge for leaving items behind. \n\nAlso the maintenance team stole my power drill from my apartment. UNPROFESSIONAL! \n\nDO NOT LIVE HERE!",
        "ownerResponse": null
      },
      {
        "author": "Debbie B.",
        "rating": 1,
        "review": "I lived in the Cornerstone Apartments for 5 years and on more than one ocassion I was subject to the penny gouging they routinely employ. Despite leaving a clean apartment I was charged for 4 hours of cleaning. i was also charged to clean nonexistent carpeting. They charge carpet cleaning by the sq ft and charge by the size of the apartment not the amount of carpet  Beware and demand your refund if you have moved from that complex. They also charged $100 to open my door after hours at 6 pm one night even though someone walked down the hallway and it took less than 2 minutes. Beware of west facing apartments , especially on the top floor. Temperatures hit over 90 degrees even with fans going and blinds drawn. Look elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 48,
  "adjusted_average_rating": 2.73,
  "summary": {
    "text": "<section><h2>Good</h2><p>In the good corner, some user reviews reflect on Westview Real Estate's strengths. There are mentions of the property management company's prompt response to maintenance requests and effective communication. A resident who faced a parking gate issue highlighted that Westview was quick to resolve the problem, ensuring the premises remained secure. Moreover, the friendly and unobtrusive nature of the staff has earned the company praise from several tenants who appreciate the attentiveness and professionalism provided throughout their tenancy.</p><p>Another former resident recounts their satisfactory experience with Westview, noting the staff's proactive approach in keeping the property well-maintained and the community welcoming. In particular, the process of moving in is described as smooth, and the team's willingness to communicate about upcoming maintenance is appreciated, creating a sense of transparency and trust between the renters and the company.</p></section><section><h2>Great</h2><p>Highlighted as great by user reviews are instances where the Westview Real Estate team exceeded tenants' expectations. For several years, a long-term tenant experienced phenomenal service, praising the staff for their swift email responses and for always being on top of any building-related updates. Another positive note includes tenants who received professional help during the lease takeover process, which was handled courteously and efficiently, making them willing to rent through Westview again.</p><p>Moreover, a user review from a business that required a housing arrangement for its employees points out that Westview was accommodating and worked with the company effectively, providing an experience that went above and beyond. Such accounts back the belief that Westview is capable of delivering great management services that make tenants feel valued and taken care of.</p></section><section><h2>Bad</h2><p>However, not all users have had pleasant dealings with Westview Real Estate. Some reviews recount experiences that highlight negligence in their duties as a property management firm. Complaints about lack of action regarding safety concerns, such as a vehicle's gas being siphoned off in a supposedly secure parking lot, paint Westview in a bad light. Additionally, there are tenants who claim that maintenance issues, like shower rods and blinds, were either inadequately addressed or ignored altogether, leading to frustration and a sense of being overlooked.</p><p>Communication is also an area where Westview allegedly falls short. A user review tells a story where crucial emails about significant changes were not sent out, leading to confusion and stress. Tenants feel that they are not being heard, and this lack of two-way communication denotes poor customer service. These bad experiences tarnish the otherwise capable property management image of Westview Real Estate, indicating inconsistencies in their service delivery.</p></section><section><h2>Ugly</h2><p>The ugly aspect of Westview Real Estate's operations is revealed through reviews that discuss profound grievances with the company. There are reports of highly unprofessional encounters, such as rude and condescending office staff, overly aggressive deposit deductions, and a disregard for tenant protections. The amount of detail in such assertions suggests significant levels of discontent and mistrust among certain tenants, which reflects poorly on Westview's commitment to a positive tenant relationship.</p><p>Moving on, tenants recount that maintenance was chargeable at excessive rates, even for routine wear and tear, causing additional financial strain. User reviews paint a picture of indifference on the company's part regarding the seriousness of the issues tenants faced, from intruders in secure areas to essential appliances left unrepaired. These disturbing examples underscore the need for the property management to critically assess and improve their customer service and tenant interaction protocols.</p></section>"
  }
}