{
  "name": "Windermere Property Management / North Sound",
  "slug": "windermere-property-management-north-sound",
  "company_type": "company",
  "address": "3018 Commercial Ave, Anacortes, WA 98221",
  "review_count": 21,
  "avg_rating": 4.4,
  "reviews": {
    "google_reviews": [
      {
        "author": "Ron Rolston",
        "rating": 5.0,
        "review": "Dreabon and her team has managed our investment property for several years now and we could not be more pleased with the property management services provided. We have used property management companies for many years now in several cities. We know that the caliber of companies can vary greatly. The  proactive and professional service provided by this team far exceeds any of our previous experiences. Would recommend them highly.",
        "ownerResponse": null
      },
      {
        "author": "P A",
        "rating": 5.0,
        "review": "Dreabon Robillard and her staff have managed our rentals for over a decade. Their communication is excellent, they are friendly and respectful to work with, and they perform regular inspections and handle maintenance needs as we have instructed. We work as a team and we really appreciate that.",
        "ownerResponse": {
          "text": "Thank you for entrusting us with your properties. We enjoy working with you. Hearing about your positive experience brings us great joy, thank you for taking the time to share. "
        }
      },
      {
        "author": "Blake Seese",
        "rating": 5.0,
        "review": "Windermere Property Management  has been fantastic to work with. Always professional and impressively quick responses.  I highly recommend their services!",
        "ownerResponse": null
      },
      {
        "author": "Christopher Panek",
        "rating": 5.0,
        "review": "Windermere Property Management has been keeping an eye on our rental. The entire process from first contact to receiving our monthly statement/payment has been professional, very easy, and without worry. Two thumbs up.",
        "ownerResponse": null
      },
      {
        "author": "Crista Engom",
        "rating": 5.0,
        "review": "Easy to work with. The property is kept in excellent condition. We love our home.",
        "ownerResponse": null
      },
      {
        "author": "Terri Garrett",
        "rating": 1.0,
        "review": "We used Windemere as our property management for three years. They were difficult to get ahold of and used different 'associate' managers, so there was very little consistency. That would have earned them a three star rating. But when we returned to our property, we were very disappointed with the condition of our home. Even more shocking was that they were willing to return the entire damage deposit to the renter despite obvious damage to our home (holes in drywall, smashed remote, etc). It became an exhausting process of emails back and forth. My 'favorite' part was having to digging through year of receipts to prove to 'my' property manager that I wan't lying when I said I'd purchased new stove knobs for the renter. I enthusiastically do not recommend.",
        "ownerResponse": {
          "text": "I was able to pull up the account and see it was eight years ago. I did address this with you at the time and unfortunately we had to 'agree to disagree'. I still stand by the deposit refund that was issued but understand you still feel the tenant was not charged enough. I am sincerely sorry, but I am governed by Washington State Landlord Tenant Laws and I charged for all items legally allowed (items that were above normal wear and tear). I do wish you didn't have a negative opinion of Windermere Property Management but it is your right to harbor your feelings. This is simply a situation I am not able to rectify."
        }
      },
      {
        "author": "Elisha Volanos",
        "rating": 2.0,
        "review": "Rented an apartment from them for a year and decided to move into a house after my lease was up. Never in my life have I ever had a rental company keep all of my deposit. Long story short, they fired the manager, ignored my calls and 4 months down the road I talked to a construction crew member that repaired an area with water damage, in the apartment I had rented , keep in mind that I complained 6 months after moving in that I could hear dripping Every time the apartment above me ran their dishwasher. I've asked around and come to find out: not many renters like them or have received a deposit back --minus of course the usual charges for move out cleaning--. I truly hope the new staff has fixed this issue.",
        "ownerResponse": {
          "text": "Elisha, are you sure youve left a review on the correct Windermere office? Our records do not show you as a tenant in 2018 and our staff consists of only 2 people; both of us with the company multiple years. I take client satisfaction very seriously and am always here to discuss any concerns but again I do find you in our system. What town is the rental in?"
        }
      },
      {
        "author": "Bev Martin",
        "rating": 5.0,
        "review": "I sold my house June 2015 using Windermere Anacortes service's. Colleen Craig was my Realtor. I received amazing service from my Realtor and her associates in the office. I appreciated the excellent marketing of my home and the great follow through to closing. Colleen was exceptional at keeping me informed on the market and her marketing plan. I would highly recommend Colleen Craig and the Anacortes Windermere staff.",
        "ownerResponse": null
      },
      {
        "author": "Mohammed Shorab",
        "rating": 5.0,
        "review": "They do an excellent job.",
        "ownerResponse": {
          "text": "Thank you Mohammed. \n"
        }
      },
      {
        "author": "David",
        "rating": 5.0,
        "review": "Paul Weisz is a great broker that knows what he's doing and is a very responsible person to work with!",
        "ownerResponse": null
      },
      {
        "author": "Joe Huston",
        "rating": 5.0,
        "review": "Highly recommend.",
        "ownerResponse": null
      },
      {
        "author": "alaina m. schafer",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Brianna Tracy",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Sina Bahmani",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "shelby langston",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ren Tarvin",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Mike Linebrink",
        "rating": 4.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ashley Eileen (Sigrit)",
        "rating": 3.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Ryan Reichlin (Red)",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      },
      {
        "author": "Danny Lewis",
        "rating": 5.0,
        "review": "",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 11,
  "adjusted_average_rating": 4.36,
  "average_rating": 4.43,
  "summary": "<article class='review-summary'>  <section>    <h2>Disclaimer</h2>    <p>This article is generated by ChatGPT and is intended to provide a helpful summary of user reviews for Windermere Property Management / North Sound. The content within should serve as a tool for individuals seeking insights into the company's performance in property management based on previous experiences shared by clients. The article's intent is to offer a concise, balanced reflection of the company's services, without identifying specific reviewers, and should be used for informational purposes only.</p>  </section>  <section>    <h2>Good</h2>    <p>Windermere Property Management / North Sound has garnered praise for its professional and proactive service. Several users have noted the exemplary management of their investment properties, indicating a level of service that far surpasses their experiences with other companies. Highlighted are the team's abilities to effortlessly handle the entire process from initial contact to the remission of monthly statements and payments, creating an experience described as professional, easy, and worry-free.</p>    <p>In particular, the management by Dreabon and her staff has been commended for excellent communication, being friendly and respectful, and conducting regular inspections. This effective collaboration has resulted in long-term satisfaction, where the company is credited with maintaining properties in excellent condition over extended periods, often exceeding a decade. Such practices have earned the company high recommendations from their customers.</p>  </section>  <section>    <h2>Great</h2>    <p>Users have been vocal about Windermere's quick response times and high level of professionalism. The positive feedback continues with responses to maintenance needs being handled expeditiously and in accordance with owners' instructions. The use of comprehensive and efficient methodologies is evident in how they manage rental properties, ensuring tenants are content and the properties are well-kept.</p>    <p>Clients have appreciated the hassle-free experience, enjoying homes kept in excellent shape and a general sentiment that Windermere makes the arduous tasks associated with property management seem easy. Their ability to deliver on services promised is also evident in the great joy and appreciation expressed in the owner's responses to positive user reviews, highlighting their commitment to client satisfaction.</p>  </section>  <section>    <h2>Bad</h2>    <p>However, not all experiences with Windermere Property Management / North Sound have been positive. Some users have conveyed dissatisfaction with the company's consistency and communication practices. Cases were cited where difficulty in contacting the company has been encountered, compounded by the presence of various associate managers, which led to inconsistencies in the management service. Moreover, clients have found themselves engaged in tiresome email correspondences which can detract from the overall ease and professionalism that property management companies strive to provide.</p>    <p>Another noteworthy concern revolves around the company's handling of security deposit refunds. Certain users have reported substantial delays in communication and undesirable outcomes, such as not receiving a fair portion of their deposits back despite claims of documented property damage. These experiences have led to a declining trust in the company's operations for some of their renters and property owners.</p>  </section>  <section>    <h2>Ugly</h2>    <p>The ugliest incidents reported in user reviews pertain to disagreements over property damage assessments and deposit refunds. In one instance, a property owner was distressed by Windermere's decision to refund a tenant's full deposit despite claimed damage to the property. This led to exhaustive communications where the property owner felt the need to prove purchases and question the judgment of the company regarding tenant charges, underlining a serious breach in trust between client and management.</p>    <p>Additionally, there are allegations of systemic issues with maintenance concerns being inadequately addressed, as a user cited ongoing water damage that was apparently neglected over an extended period. Issues of this severity not only impact the tenant's immediate living conditions but also have lasting implications on the property's condition and value. Such episodes are obviously damaging to the company's reputation and raise valid concerns over their overall diligence and accountability in property management.</p>  </section></article>"
}