{
  "name": "Windermere Real Estate - Whatcom, Inc.",
  "slug": "windermere-real-estate-whatcom-inc",
  "company_type": "Company",
  "address": "515 W Bakerview Rd, Bellingham, WA 98226",
  "review_count": 29,
  "average_rating": 2.76,
  "reviews": {
    "google_reviews": [
      {
        "author": "Tiffany Birrell",
        "rating": 3,
        "review": "Good company to work with, but need to work on their technology, I had to sign my lease in person and could not wire my deposit - had to bring it in person. It was a 6 hour drive round trip for me. They also didn't notified me that was the process until day before.",
        "owner_response": null
      },
      {
        "author": "Jazmin Snyder",
        "rating": 1,
        "review": "Both Windermere realtors involved in the purchase of my home lied to me, which has caused me to pay over $40k over the span of 4 years when I was told it wouldnt be my problem.\nThis office rarely answers calls, or calls back after weeks of voicemails.",
        "owner_response": null
      },
      {
        "author": "Marie Murdock",
        "rating": 1,
        "review": "Everkept Construction - uses her as there listing agent\nI spoke to Lynzi Cowden the listing agent and was asking questions about what options I could get that were not an extra fee, like color choices and cabinets etc. I also let her know I did not like the white cabinets they typically put in there homes and wanted to see if the builder would let me buy my own cabinets and have someone put them in and I understood they would not warrantee them. I had noticed that some of there floor plans had the entry way closet, pantry and linen closet but not all the plans had them all in one floor plan, that I had seen yet in the previouse mls listings. I was asking if they had a floor plan with all these things and her response was . ( These are spec homes. YOU GET WHAT YOU PAY FOR) was her exact words. She acted like my questions were an annoyance to her and that I was asking redicluose questions. She said that these spec houses don't come with those things , that's why we're selling them for such a low cost . Even though some of the so called spec houses did have these things. She said that would be a custom home which was confusing because they have plans that have these things in them already. She was texting with me part of the time and spoke to me once on the phone . I felt like she was downplaying the homes and felt that she was very immature and unprofessional. She was not catering to the client at all. I also asked when the lots that have a green belt behind them would be available and she replyed (whenever there ready, after we sell the others ). She wasnt concerned about helping me get what i wanted. I would have been a client and bought a home with cash no financing , but she ruined it for me . The house experience is supposed to be a fun one , picking colors , lot to build on etc., but not if I have to deal with someone who has a bad attitude and is downplaying the homes. I feel the builder should know and others to beware",
        "owner_response": null
      },
      {
        "author": "Samantha Arias-Romero",
        "rating": 5,
        "review": "My husband and I recently started the rental process with Windermere. As we all do, I came to check their Google reviews and I was terrified. There is so many negative comments and one stars all over the place. (Not just Windermere but most management companies) The housing market in Bellingham keeps getting hard month after month it seems like.\n\nAnyway my husband and I have had a pleasant time from the moment we called to check the availability to the moment we were approved. They were very professional and very helpful with the millions of questions I had. I believe there turn around time was fast, applied Friday was approved Wednesday. Turn around was just a few business days,\n\nSo far I am happy with the interactions I have had with this management company. If you are a perspective renter don't rely on the reviews on here. This is my review for the application process and how I was treated.\n\nThank you Windermere, keep up the good work.",
        "owner_response": {
          "text": "Samantha,\n\nWhat a nice review! We wish we could take credit for it, but I believe your comment is intended for our next door neighbor, Windermere Property Management. You can review them at:\n\nhttps://search.google.com/local/writereview?placeid=ChIJJ6FtelujhVQRztZM6Zx5snY\n\nWe hope you are still enjoying your rental!\n\nWindermere Real Estate\nResidential and Commercial Sales"
        }
      },
      {
        "author": "David Mcinnis",
        "rating": 1,
        "review": "Apartment was not cleaned when we moved in. Parking lot concrete is completely destroyed looks like a war zone. The ceo makes 110 million a year. Another example of why this country is going downhill",
        "owner_response": null
      },
      {
        "author": "davis kenny",
        "rating": 1,
        "review": "Just another example of why Bellingham sucks and unaffordable to live in. Giant multimillion dollar companies buy out all the apartments and raise rent whenever they want. Apartments aren't cleaned or maintained. I hate Bellingham and this is exactly why. Rich elite own everything",
        "owner_response": null
      },
      {
        "author": "N/A N/A",
        "rating": 1,
        "review": "Next to impossible to get a hold of, and extremely unhelpful if you manage to reach them. Usually they fob you off to the Sedro Wooley office who apologize about not being able to help. If you have any kind of maintenance issue the response is 'we don't know' and thats that. What do they actually manage, if they don't know?",
        "owner_response": null
      },
      {
        "author": "Keegan Shannon",
        "rating": 1,
        "review": "Overcharging on move out costs, well over 1100 bucks post move out. Repairs aside due to obvious wear and tear, yet 21 gallons of paint for example, indicates that that the whole home required repainting, which one would assume the worst.\n\nAfter reviewing the move out paperwork and following the list as needed to ensure a fair and equal transition out of the home, the charges overall are clear indications of mishandling of labor and costs.\nIf anyone gets stuck having to rent through windemere, i would suggest having alot more money at move out, because in my opinion, this company has a good control over public opinion and clearly have a strong base to charge whatever price they feel like.\n\nI wouldnt reccomend this company, unless you are ok with paying more than you have.",
        "owner_response": null
      },
      {
        "author": "Valarie Matinjussi",
        "rating": 1,
        "review": "Windermere protects Jason Loeb, an unethical broker who misleads the public by subcontracting with PM Construction and building substandard homes.  Windermere and Mr Loeb do not uphold signed contracts.   We have water intrusion and penetration around windows and decking with undisclosed code violations and numerous construction defects on our newly built home.  Jason Loeb refused to correct these defects that expert inspections and reports have total up to $70,000 for repairs.  Windermere attorney requested a budget estimate and list of construction defects that were submitted without a response.  Windermere prefers litigation over upholding a signed document.",
        "owner_response": null
      },
      {
        "author": "Kyle McSomething",
        "rating": 5,
        "review": "I've never had any issues so far, very professional unlike other agencies in Bellingham (you know the one i mean). they even held my apartment while I was getting my documents together. Thanks guys!",
        "owner_response": null
      },
      {
        "author": "Gursewak Singh",
        "rating": 5,
        "review": "Sukhvir Khaira is a best realtor, very  professional at Windermere. She is very responsive and guided us through a smooth buying process. We highly recommend her to everyone. Thank you for your help.",
        "owner_response": null
      },
      {
        "author": "Jeremiah Pace",
        "rating": 1,
        "review": "They constantly lied to me and said they sent me things papers that needed to be completed when they didn't. They treated me like I'm dumb and then tried to blame their intern. Thank you windemere for wasting my time and money.",
        "owner_response": {
          "text": "Jeremiah,\n\nWe are so sorry to hear about this mix-up with the paperwork! Can you contact us to let us know which agent you were working with on your home sale/purchase?\n\nLooking forward to hearing from you,\n\nWindermere Real Estate\nResidential and Commercial Sales"
        }
      },
      {
        "author": "Signs Plus Install",
        "rating": 1,
        "review": "They like to double charge for things and the property manager is always away from their desk, always.",
        "owner_response": null
      },
      {
        "author": "Julie Andree",
        "rating": 5,
        "review": "Just got do e moving in. It is so amazing and beautiful home.",
        "owner_response": null
      },
      {
        "author": "AL Romero",
        "rating": 1,
        "review": "Place is horrible, they totally tried screwing us over. We had to get a lawyer involved!",
        "owner_response": null
      },
      {
        "author": "Jeffrey Goins",
        "rating": 1,
        "review": "Not a respectable company or real estate business. Lack of professionalism.",
        "owner_response": {
          "text": "Jeffrey,\n\nWe apologize for your unsatisfactory experience. Please give us a call at 360-734-7500, and we would like to discuss this with you. Thank you!\n\nAll the best,\nCiarra\nWindermere Real Estate\nResidential and Commercial Sales"
        }
      },
      {
        "author": "tim zara",
        "rating": 1,
        "review": "unprofessional , bad real estate agent unethical broker",
        "owner_response": {
          "text": "Tim,\n\nWe apologize for your negative experience with one of our brokers. We do not see you listed in our files, so if you would like, please give us a call at 360-734-7500, as we would like to discuss this situation with you.  Thank you!\n\nAll the best,\nCiarra\nWindermere Real Estate\nResidential and Commercial Sales"
        }
      },
      {
        "author": "Lyle Sorenson",
        "rating": 5,
        "review": "Best Real Estate in Bellingham #CallLyle",
        "owner_response": null
      },
      {
        "author": "Kathryn Lockerbie",
        "rating": 5,
        "review": "Our long time agent works here.",
        "owner_response": null
      },
      {
        "author": "Jake Werrion",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "A",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Corey Ellis",
        "rating": 3,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Abraham A.",
        "rating": 1,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Stephanie Joy",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Luke Kaemingk",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Megan A Barnes",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Chad Johnson",
        "rating": 5,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Cheryl Andal",
        "rating": 4,
        "review": "",
        "owner_response": null
      },
      {
        "author": "Hugh Newmark",
        "rating": 1,
        "review": "",
        "owner_response": null
      }
    ]
  },
  "adjusted_review_count": 19,
  "adjusted_average_rating": 2.37,
  "distribution": {
    "1": 15,
    "2": 0,
    "3": 2,
    "4": 1,
    "5": 11
  },
  "summary": {
    "created_timestamp": 1739095199,
    "text": "<section id=\"good\"><h2>Good</h2><p>Windermere Real Estate - Whatcom, Inc. has received some positive feedback from users who appreciated their services during the rental process. One user mentioned a particularly smooth experience from the moment they inquired about availability to their approval as tenants, highlighting professional and helpful interactions throughout. This user emphasized the quick turnaround in application processing, which took just a few business days, suggesting that their customer service met expectations during this critical time in a challenging housing market.</p><p>Another user also expressed satisfaction with the professionalism of their representative, noting that they were held patiently until all documents were ready. This feedback provides reassuring insight for potential clients, suggesting that while the company may have its issues, there are also instances where the services meet or exceed the basic expectations, making the experience worthwhile for some clients.</p></section><section id=\"great\"><h2>Great</h2><p>While overwhelmingly negative reviews dominate Windermere's feedback, a few users have had notably positive experiences, particularly with specific agents. Praise for individual realtors who demonstrated exceptional professionalism and responsiveness can be found, which indicates that some employees are effectively fulfilling their roles. Users described their agents as helpful guides through potentially challenging processes, reinforcing that there are capable individuals within the organization committed to client satisfaction.</p><p>The strong commendations for certain staff members suggest an inconsistency in the overall service quality but stand as a beacon for those who might be lucky enough to work with one of the more attentive agents. This illustrates that, while the company itself has received substantial criticism, the personal touch and effort of individual employees can lead to a greatly improved experience.</p></section><section id=\"bad\"><h2>Bad</h2><p>The negative experiences shared by users often highlight challenges related to communication and the handling of properties. A significant issue raised involves the difficulty in reaching representatives, with multiple users noting that calls frequently go unanswered, leading to frustration over unreturned voicemails. This lack of responsiveness can exacerbate maintenance concerns, leaving tenants feeling neglected when they are unable to receive timely assistance.</p><p>Additionally, users have reported issues regarding cleanliness and the state of properties upon move-in. One user described their apartment as unclean upon arrival, reflecting poorly on the company's maintenance and turnover processes. Such experiences highlight a more systemic problem with property management that could detract potential clients who prioritize both communication and well-maintained living conditions.</p></section><section id=\"ugly\"><h2>Ugly</h2><p>Several reviews paint a dire picture of Windermere Real Estate - Whatcom, Inc., especially concerning ethics and professionalism. Users allege serious grievances regarding overcharges and misleading communication, particularly at move-out, where one tenant reported excessive charges for what they deemed normal wear and tear. This raised questions about the transparency of the company in their billing practices and the potential for clients to feel taken advantage of financially.</p><p>Moreover, unprofessional behavior exhibited by employees is frequently mentioned, with one reviewer recalling an encounter with a realtor who belittled their questions and concerns, making them feel unsupported. Such accounts foster an image of a company that not only struggles with operational issues but appears to lack a foundational commitment to ethical and respectful client interactions, ultimately tarnishing its reputation within the community.</p></section>"
  }
}