{
  "name": "Elite Association Management",
  "slug": "elite-association-management",
  "company_type": "company",
  "address": "1313 E Maple St Ste 209 Bellingham, WA 98225",
  "review_count": 3,
  "average_rating": 1.0,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "John B.",
        "rating": 1,
        "review": "Unprofessional and incredibly slow. You can expect up to a week to get a response and if you call their emergency number you will get taken to a full voicemail inbox.\n\nThey will purposely ignore your urgent mail and delay. Their employees are snarky, rude and WILL use slurs. \n\nI for one, would rather have my nails pulled out than interact with this company in any capacity ever again.",
        "ownerResponse": null
      },
      {
        "author": "Diana J.",
        "rating": 1,
        "review": "Run!   Terrible business ethics and unprofessional.  Our HOA is seriously considering taking Elite to small claims court. They paid themselves for services at the beginning of the last two contract months and did not perform the work.   Did not like the newly elected board members and refused to work with them.   Not much positive to say.  We will be writing to the Better Business Bureau so that other HOAs do have to go down the road we did.",
        "ownerResponse": null
      },
      {
        "author": "Tom A.",
        "rating": 1,
        "review": "This is the worst HOA management service company I have ever had to deal with. Judith Hamner is one of the most unprofessional personalities I have yet to come across. She doesn't respond to any calls, requests, emails or messages unless it's convenient for her. She accomplishes absolutely nothing and doesn't work well with homeowners nothing about the matter you bring to her attention gets done. She has a horrible attitude and not only can you hear it in her somewhat rude inadequate tone, but you can also feel her lack of respect and concern through the way she carries herself. I would never recommend this \"community association specialist\" company to anyone. Judith Hamner is a horrible management administrator and a waste of time, money and effort. . \"If you're in a self-managed association looking to relieve board members from endless administrative duties, if your association needs a change in management, if you're planning a new community development -- you can expect the very best service from us.\" This quote and expectation taken directly from their website is false, inaccurate and should be heeded as services they DO NOT provide. Let me save you time and a headache and suggest you look elsewhere.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 3,
  "adjusted_average_rating": 1.0
}