{
  "name": "Navigate Community Management",
  "slug": "navigate-community-management",
  "company_type": "company",
  "address": "16300 Mill Creek Blvd Ste 201-202 Mill Creek, WA 98012",
  "review_count": 40,
  "average_rating": 3.77,
  "reviews": {
    "yelp_reviews": [
      {
        "author": "Derek S.",
        "rating": 5,
        "review": "Charmaine Lambinicio was really helpful in getting my account set up for multiple properties at the same community.",
        "ownerResponse": null
      },
      {
        "author": "Crystal F.",
        "rating": 5,
        "review": "Anytime I have had a concern, Christine Besas, Navigate Community Management rep is so quick to take action to mitigate the issue or find a solution to the problem. \n\nFor example, I had sent a message about horseback riders leaving their horse's manure on our roads and sidewalks and within three hours she had the landscapers clean it all up,\n\nFeeling grateful for her care and responsiveness!",
        "ownerResponse": null
      },
      {
        "author": "Doug R.",
        "rating": 4,
        "review": "Carmela was very helpful in sorting out some payment issues we had, after mistakenly making a double payment.",
        "ownerResponse": null
      },
      {
        "author": "Bryson G.",
        "rating": 1,
        "review": "Navigate has been the absolute worst company to deal with. Much like the other reviews, this company is fast to promise amazing things and extremely disappointing when actually trying to get things done. Their communication is extremely bad and slow to get back to you, and when they do it's pretty much worthless. \n\nThey will NOT try to help but they will do anything to get out of doing actual work. They are an absolute waste to time and money and I pray you take your business elsewhere. Like the other gentleman who posted he wished he could give 0 stars, I too would give 0 stars if possible.",
        "ownerResponse": null
      },
      {
        "author": "Laura C.",
        "rating": 1,
        "review": "Absolutely FLEECE owners on condo transfer fees.  SHAME ON YOU!\n\n$700 + just to sell my condo because you need to charge fee after fee after fee to fleece the people in your \"community\".\nYou just took over for a different management company that charged 1/3 the price for this.",
        "ownerResponse": null
      },
      {
        "author": "Scott D.",
        "rating": 4,
        "review": "I just had a very kind and knowledgeable person, Christine , help me through understanding some things about payments. she's the greatest.    Scott",
        "ownerResponse": null
      },
      {
        "author": "Kathleen B.",
        "rating": 5,
        "review": "This is a great management team.  Everyone is professional and very helpful taking the time to make sure all concerns and questions are resolved.  MJ (Mary Joy) was especially helpful with talking me through the process of sending our condo newsletter to them via pdf using a website to help streamline the procedure.  I have nothing but good things to say about all of my interactions with the staff at this company!",
        "ownerResponse": null
      },
      {
        "author": "Peter C.",
        "rating": 5,
        "review": "Recently, I was stressed because changed to a new management company, but thanks to the kind and prompt handling of Navigate management (Robie), I am very grateful for the clear handling. \nI would like to thank you (Robie) for purifying my heart with such kind laughter.\nThanks Robie.",
        "ownerResponse": null
      },
      {
        "author": "Mike O.",
        "rating": 1,
        "review": "Navigate has got to be the absolute WORST property management company on the face of the earth!!!! \n\nFirst off, they aren't even located in Mill Creek as their Yelp page Indicates. They're in Bellingham!!! As a result, they have NEVER attended a single one of our HIA meetings!!!\n\nThey don't seem to understand HOA law at all!!! There is almost ALWAYS a delay in receiving any sort of response or action from them!!! \n\nRUN don't walk, but RUN QUICKLY away from Navigate or you'll truly be sorry!!!",
        "ownerResponse": null
      },
      {
        "author": "Karen D.",
        "rating": 1,
        "review": "This business has terrible business practices. They have terrible communication and are completely useless, I could've paid a 10 year old to do the work they do. They are incompetent along with using systems that are old and inefficient. I have so much more to add but to be honest I'm so done putting energy into doing the work for them. Please steer clear of this management company as they will take money from your account and take 20 years to give it back! DONT DO BUSINESS WITH THESE PEOPLE!!!",
        "ownerResponse": null
      },
      {
        "author": "Avijit G.",
        "rating": 5,
        "review": "Appreciate all the help Navigate community management gave us for getting home improvements approved with the hoa. Special thanks to Ric and Ezekiel for responsive and timely follow ups.",
        "ownerResponse": null
      },
      {
        "author": "Vishal S.",
        "rating": 5,
        "review": "Been couple of months with Navigate for our community. I can see things have changed for better with the change. Navigate's online portal makes everything about HOA centralized. No tracking emails for communications. And, Navigate has been quick to respond to any queries. This is a pleasant surprise compared to previous community managements. Now it falls of Navigate to keep up the good work",
        "ownerResponse": null
      },
      {
        "author": "Jie Y.",
        "rating": 5,
        "review": "My approval request to HOA was reviewed promptly, Raycor has been assisting with clear instructions and communicate information timely to me before the work is started. I really recommend Raycor and fast responding and friendly in customer support.",
        "ownerResponse": null
      },
      {
        "author": "Catherine B.",
        "rating": 1,
        "review": "Very poor and expensive services with lack of detail mindedness such as mailing out the wrong date for our annual homeowners meeting. I have been extremely disappointed with the inability of the staff to provide details concerning a drastic negative change in the homeowner's financial balance. I would recommend not using this business.",
        "ownerResponse": null
      },
      {
        "author": "Jesus S.",
        "rating": 5,
        "review": "I really recommend Mary, it fast on responding and friendly, great on customer service",
        "ownerResponse": null
      },
      {
        "author": "Creanga C.",
        "rating": 5,
        "review": "Had a request for an architectural request. \nEzekiel was helpful and quick in communication.\nThank you.",
        "ownerResponse": null
      },
      {
        "author": "v h.",
        "rating": 5,
        "review": "Raycor Besas of navigate community management (charleson place) did a professional job in assisting me to submit my architectural review application to the board for review & approval.  He was very patient and helpful as well as extremely customer oriented!  Thanks so much for your help, Raycor!\nV Ho",
        "ownerResponse": null
      },
      {
        "author": "Tyler S.",
        "rating": 5,
        "review": "This company manages my HOA, which is responsible for the exterior and roofs of our townhouses.  My roof leaked, and I contacted Navigate Community Management.  Their representative Mary Joy helped me every step of the way, and made sure the HOA took care of the cost to fix the roof.  Everything was quick and transparent.  I am very happy with their service and responsiveness.",
        "ownerResponse": null
      },
      {
        "author": "Jill W.",
        "rating": 5,
        "review": "I am about to move into a new neighborhood and had a items I needed approval for from the board.\nRic/Ezekiel were so helpful and made it very easy for me.  It was a great experience!",
        "ownerResponse": null
      },
      {
        "author": "M K.",
        "rating": 5,
        "review": "I have been pretty impressed with Navigate Community. Management. My interactions have been with Christine Besas. She is always there to assist us when we had any questions. She is knowledgeable, prompt, always available and more importantly handles in professional manner. Big shout out to her. Thank you Christine for what you do.",
        "ownerResponse": null
      },
      {
        "author": "Gee G.",
        "rating": 1,
        "review": "You're not getting a hold of anyone they rarely call you back they love to text you on parking fees that are so confusing and no one can say they handle the appropriate action I've been transferred to somebody that handles violations but not somebody that handles the parking now what the heck is it buildings have not been on for the last 2 months I've made numerous requests and nothing's changed so at night time we have no lighting whatsoever on the property except for the head of the HOAs carport",
        "ownerResponse": null
      },
      {
        "author": "Palak A.",
        "rating": 5,
        "review": "Charmaine was exceptional in communicating and helping us out during our countertop installation. she was prompt in responding and addressing it as well. we have never before received so much support from HOA. We had a situation with our neighbors that was very well handled and managed. so grateful to have this support.",
        "ownerResponse": null
      },
      {
        "author": "Nicki A.",
        "rating": 5,
        "review": "I would like to thank Ezekiel for responding so quickly to my request for getting a tree taken down in my yard, he has also been a huge help with my noisy neighbors, he deserves a raise for being efficient and doing his job well, hard to come by that lately.",
        "ownerResponse": null
      },
      {
        "author": "Levi C.",
        "rating": 5,
        "review": "We are going to paint our house and when we Sent the approval request in, we had an answer in 1 day.  No delay is great!",
        "ownerResponse": null
      },
      {
        "author": "Nancy H.",
        "rating": 5,
        "review": "Had an assessment  error on my account, (paid a full not partial payment that wasn't  correctly recorded) and MJ contacted  the appropriate  people, and the issue was solved while I waited- a 4 minute fix! Thank you, great job!",
        "ownerResponse": null
      },
      {
        "author": "Abhishek C.",
        "rating": 5,
        "review": "I recently worked with MJ for multiple questions and MJ was great in answering all the questions. I look forward to working with her in the future.",
        "ownerResponse": null
      },
      {
        "author": "Gotham C.",
        "rating": 5,
        "review": "I have had a few interactions with Navigate and in all of them found their customer service to be very good. A recent interaction was with a customer support person there named Ric - who was very quick and efficient in helping me with my requests.",
        "ownerResponse": null
      },
      {
        "author": "Ben G.",
        "rating": 1,
        "review": "Worst company management company. I used the saved bank account information and they systems didn't take my payment and got $35 charge dir NSF and I retired again with same saved account information and worked. I called them they and they said they will check this and call me back, I never got call back. After calling again they said nothing they can do and I have to pay that extra $35 charge. I wish I could use different company but sadly my HOA is with them. I will talk about this on on board meeting to see if can switch the company.",
        "ownerResponse": {
          "text": "Dear Ben G,\n\nWe apologize for any inconvenience caused due to the NSF charge on your account. We have investigated the matter and can confirm that the NSF charge was valid as the payment processor could not locate the account, this usually means that the account information was entered incorrectly. The payment process is entirely under the control of the homeowner and we cannot modify, edit or see the bank account information of homeowners for your protection.\n\nWe understand that this situation was frustrating for you, and we apologize for any miscommunication from our end regarding the follow-up call. We assure you that our team is committed to providing prompt and efficient customer service, and we regret any lapses in this instance.\n\nWe want to reassure you that we are always willing to work with our customers to find a satisfactory resolution.\n\nWe appreciate your feedback.\n\nSincerely,\n\nNicolas Marin, Navigate"
        }
      },
      {
        "author": "Kimberley C.",
        "rating": 5,
        "review": "I needed documents and Victoria was on it! Waiting seconds, literally, they were in my inbox! Now, that's what I call good customer service.  No excuses! Also, Mr. Obed helped me after hours.  He could have told me to go fly a kite, but he didn't.  He gave me instructions as to what I needed to do and where to go to get the information I needed.  These two people went out of their way to ensure I got the quality service that I needed.  They put their patrons first snd foremost.  Not a lot of talking.  They are all about getting the job done!! Thank you Victoria and Mr. Obed!!!\n\nKimberly Coleman",
        "ownerResponse": null
      },
      {
        "author": "Richard L.",
        "rating": 1,
        "review": "IGNORE THE SINGLE STAR ABOVE, YOU CAN'T LEAVE A ZERO STAR RATING.\n\nZero stars for service but five stars for crapping all over an HOA Board Member having to submit multiple technical service requests due to them sending \"Links\" that either result in a blank screen or request that you change your password by clicking a link. You guessed it, that link doesn't work either. \nWhen I complained about the lack of timely response, the owner sent me a condescending email stating that in fact, they had not only responded within the promised time but any confusion was due to my not answering a call from them and he listed the day and time of that call.  It was from an unknown nuymber. Who answers their phone when \"Scam Likely\" is displayed on the phone? \n\nI checked my phone log and yes there was a call, BUT NO VOICEMAIL WAS LEFT. I don't know if this clown did or didn't know that his employee declined to leave a voicemail, and I guess it doesn't matter to him.  If that voicemail had been left, this current situation (the friggin links still don't work) could have been avoided. No admission of any lack of service by the owner though. \n\nWe have been with Navigate for less than three weeks and it appears that the uncomplimentary reviews left by others are indeed accurate. \n\nI have chosen to resign from the Board as these bozo's seem only to excel at selling while not committing adequate resources/training to provide the promised level of service.  I thought we hired this management company to assist HOA Board members and homeowners. Guess we will have to live with this unless the Board contacts legal representation to see if we can cancel the contract.\n\nOne thing you can count on with Navigate is that you will have to prove them wrong multiple times before they respond and then you are not even remotely assured that the situation will be resolved. \n\nWhen contacting Navigate, you will not speak with someone, you will be given the option of leaving a voicemail. Then, when they \"think\" they have addressed your concern, you will just get another text or email that, in my experience, will result in the same or very similar result-Not able to sign in. Again, when you try to follow up with them, you will not speak with anyone and be forced to email again to let them know that they have not resolved the issue. \n\nI wish I could blow off troublesome customers as Navigate does, but I don't think my owner would like that.\n\nHaving read the response below, here are my thought on my experience with the company. The owner is not proactive but reactive. He is very good at gaslighting. Here are the facts relevant to the client:\n\nBe proactive. A text prior to or a voicemail at the end of the first call would have resolved this issue and you would not be reading any of this.\nOwner didn't text prior to calling, resulting in the same missed connection. His voicemail was more gaslighting, just like his email. \n\nThe effort to rebut my review has consumed more time and resources than just doing what works the first time and keep at it. \n\nI guess if you gave a scrabble game worth of letters after your name, it's safe to assume people will pay a premium for bovine excrement.",
        "ownerResponse": {
          "text": "Hello Richard, \n\nThank you for your feedback and comment. \n\nI am happy to post here the same information that I responded to you by email. \n\nIn regards to the timeline of communication, our goal is to respond within 1 business day to voicemails and emails. Our office is open Monday through Friday. \n\nYou emailed our office over the weekend that you couldn't register to the homeowner portal. You called Monday afternoon toward the end of the day (3:51 pm) and your first call Tuesday morning was at 8:45 am before our opening time of 9am.  \n\nFrom your voicemail Monday afternoon to my return call Tuesday afternoon, it has been less than 24h. I personally left you a voicemail indicating that I had resend the registration information by both email and text message. Your email was  also responded to in 1 business day as our staff responded on Tuesday morning. \n\nI don't see how we failed to answer your call in a timely manner. I returned your call in less than 24h. \n\nWhen calling our office, you have the option to press 0 to get to support, our support team is available to answer these type of questions/issues.\n\nYour previous management company provided just 30 days' notice and we were given less than 10 days to do a transition (which would normally require 45 days) to avoid any gap of management for your Association. Our staff transition a majority of the preliminary information for your community in less than 2 weeks.\n\nRegards, \n\nNIcolas Marin, Owner."
        }
      },
      {
        "author": "Sam S.",
        "rating": 1,
        "review": "I live in Highland Vistas Community ( a Beautiful Townhome Community in the Snoqualmie area ) and our  HOA is currently managed by Navigate.  I really wish we were under a better HOA company\n1. These guys have no accountability whatsoever and never bring any value to the table and their only interest seems to be in misleading the board in not doing anything that way their workload is significantly less\n2. Any homeowner request that was submitted (Even after several follow-ups) takes several months/if not years to get an update or answer (forget about resolving it  ).  \n3. Another big negative is these guys have no network of contractors, landscaping companies, or any other company that HOA needs.  I always find better companies/contractors and cheaper prices as an individual vs when working with this HOA Company.",
        "ownerResponse": null
      },
      {
        "author": "Meri M.",
        "rating": 1,
        "review": "WARNING TO ALL BOARD MEMBERS CONSIDERING NAVIGATE! Navigate Community Management is a corporate operation that makes money with every service they provide. While excessive charging, nothing is more violating than the fees they charge for a homeowner to sell their own. In a homeowner association a Resale Certificate and Demand Certificate is needed by WA law to complete a real estate sale transaction. Not only does owner Nicolas Marin, charge the law required $275 for the Resale Certificate, he adds extra fees amounting to $360. Then Marin charges an extra $320 for the Resale Demand Certificate necessary for escrow to close. The escrow company told me Navigate holds up many home closings by demanding this extra money for the Demand Certificate. For comparison, Windermere charges zero for the Demand Certificate. Since a seller needs to close by the contract date, you end up paying for the Demand Certificate including Rush fees of $140. In total to close escrow on our home, we had to pay $918.85 to Navigate Community Management and we are not alone. This company holds sellers hostage to these extra fees. BEWARE! This will happen to you as a seller under Navigate Community Management! They are capitalism at its worst. Do not use this Management Company. Your costs as an association will skyrocket and your homeowners will be burdened with these unnecessary real estate sale charges.",
        "ownerResponse": null
      },
      {
        "author": "Irene S.",
        "rating": 5,
        "review": "Have dealt with a number of HOA Management companies in the past.  They far outshine everyone else in terms of customer service.  The Owner Portal makes it easy to communicate maintenance requests.  Mary Jo, kept us up to date by email as to the status from initiation, in process and completion.",
        "ownerResponse": null
      },
      {
        "author": "Alex Z.",
        "rating": 2,
        "review": "The truth is that they start strong, with a lot of promises, but the disappointment comes later. No follow up on issues, managers that leave the company and nobody tells you until weeks later, issues pending that pile up on their plate, and on top of the above, they hate when you want the control of your HOA back. They are not collaborative with the HOA board, but more an obstacle to get things done on time. They should work more with the HOA board members instead of keeping full control of everything, maybe afraid of losing business opportunities.\nWe have changed recently of management and were with them now, but after a year were considering to switch again to another vendor.",
        "ownerResponse": null
      },
      {
        "author": "Indranee S.",
        "rating": 5,
        "review": "Good customer service by Mary Joy. Put in a request in the online portal for a service request which was promptly scheduled. This is my second time raising an issue which was handled smoothly. Happy with the service",
        "ownerResponse": null
      },
      {
        "author": "Roni M.",
        "rating": 5,
        "review": "MJ provided was very helpful in going over account balance questions.",
        "ownerResponse": null
      },
      {
        "author": "Keven B.",
        "rating": 1,
        "review": "Navigate is a new management company for the residents at Highland Vista Townhomes in Snoqualmie. We have been through several companies and residents were excited to have a management company that really cared about us. Unfortunately this has not been the case. First of all they have gone through 3 different managers over the last 4 months. They do not keep us updated and we have to find out on our own that there is a new person working for the company. We had a meeting with Nicholas and his manager and was promised they would look into all the requests that had been neglected  by the first company along with Pulte. Unfortunately again, nothing that we talked about has been addressed. We have asked to have a follow up meeting regarding our requests, but nothing has been offered. They sent out some rule and regulations for the homeowners, but they aren't backing them up especially in regards to short  term leasing and Airbnb's.\nThey seem to be onlinterested in the bottom line, and taking our money, and not fixing the requests that we have asked them to do. \nIf you can use another home owner company. do so. This one doesn't seem to care about its residents. \n\n\nWe have emailed all 3 board members, but have not received follow up on when issues will be responded to or when our next meeting will occur. \nStill with Airbnb's which says no short term leasing. \nStill without a meeting date. \nTemporary sprinklers remain even after Pulte gave money to have them removed.\nNot keeping residents updated on personnel changes\nNot fixing walk area backing up to green area.\nNot looking into our boundaries in same area and who is responsible for what\nNot looking into wild life fence backing up to green area.",
        "ownerResponse": {
          "text": "Keven, \n\nWhile we always welcome constructive criticism so we can continually improve our services, the information you are sharing in your review is incorrect. I have personally responded to several of your emails over the past few months and my response will remain the same. \n\n1) Rules and regulations: the rules and regulations were drafted by the previous management company (Palette Property Management) for the developer and not by us. The rules were drafted in 2016 when the Association was being built by the developer. \n\n2) Airbnb: As mentioned to you by email several time, there is a hierarchy of documents within an Association. Rules and Regulations are at the bottom of the hierarchy of documents and cannot be more restrictive than the CC&Rs of your Association. The CC&Rs of your Association do not prohibit leasing and do not prohibit vacation rentals/short term lease. I have provided you the section of the CC&Rs and provided you with the following article (https://wscai.org/getting-away-in-an-hoa-what-can-associations-do-about-vacation-rentals/= to provide you with more information about the issue of vacation rentals in HOAs & Condos. In order to restrict the rental of units, the Board would have to hire an attorney, draft an amendment to the CC&Rs and get a super-majority approval from the homeowners to approve the change. \n\n3) 'They don't keep us updated'. Our company reports on issues to the Board of Directors. The Board is the elected party who receives the manager report, guidance and information. You are free to attend the open board meeting, and two have already been held (one in July, one in September). \n\n4) 'Not fixing the requests that we have asked them to do': Again we take our directions from the Board of Directors. The Board of Directors is the party making the decisions for your community and we implement them based on the specific directions given by the Board. We have already addressed several outstanding items, including replacing the landscaping company. \n\n5) 'Taking our money'. The Assessments of your Association are collected in a specific account held by the Association in the name of the Association. The board receives a full financial report monthly, including bank statements. \n\n6) 'We have gone through 3 different managers over the last 4 months': that is incorrect as well. I personally came to the meeting in July after the start of our management and was attended by another manager as well. We have a collaborative approach and work as a team. I am personally involved in many aspects of all communities.\n\n7) 'We have been through several companies': Palette Property Management was the only management company. They were hired by Pulte and we acquired Palette over the summer.\n\nYour additional comment/review proves that you dont understand how an Association works even though I have provided information to you.\n\n1) Board meeting: meetings are set and called by the board. Our office has no authority on scheduling meetings. The board met already 3 times this year and the average board meets quarterly.\n\n2) Personnel changes: we work as a team. The homeowners can report issues for the common areas in various ways through our portal, email and phone. The board was made aware of the most recent change.\n\n3) Other landscaping issues: these are being discussed by the board and worked on. The board chose a new landscaping company after we provided multiple bids as directed by the board.\n\n4) In regards to Airbnb, you clearly still have not read the CC&Rs of the Association. There is no restriction in CC&Rs about Airbnb rentals and the rule drafted by the previous management company is not enforceable. \n\n\nRegards, \n\nNicolas Marin, Owner & President"
        }
      },
      {
        "author": "Stephen L.",
        "rating": 5,
        "review": "Navigate took over the management of the condominium complex last year from our previous management company. The owner, Nicolas was hands-on, was able to take on all of the workload. That included understanding the variety of on-going and upcoming projects, the rental situation and the many other aspects of managing a community with 120+ units. Navigate also modernized the way our meetings were run by moving much of the detail we looked at online, including moving our membership to an online payment that included sharing important documents with the membership. Overall, I'm very pleased with they way Navigate has transitioned management, the improvements they've brought both to our board meetings and the everyday running of the complex.\nWith a community as large as ours there are always a small percentage of units that require greater attention for a variety of reasons. This particularly, has been an area of improvement from my perspective. Nicolas and his team are able to engage with the issue/owners and get to a timely resolution that leaves the membership in a better place. I highly recommend Navigate community management if you're looking for great management services.",
        "ownerResponse": null
      },
      {
        "author": "Patrick A.",
        "rating": 5,
        "review": "Having had a poor relationship with a previous management company, and hearing stories of how difficult it was to work with other management companies, we found Navigate to be a refreshing change.  The team is responsive, and show care to our residence.  They have been very professional when issues arose.  Nicolas Marin has been helpful to keep us up to date and in compliance with the latest state regulations.  I can recommend them.",
        "ownerResponse": null
      },
      {
        "author": "Celeste M.",
        "rating": 5,
        "review": "Our condominium association has recently contracted the service of Navigate Community Management.  I have been with my condominium association for 30 years so I have seen several management companies come and go.  Since I had never heard of Navigate I had concerns of our transition but was also hopeful since our current management company seemed to have checked out long before we decided to make this change.  \n\nI feel we have made a very positive move to call Navigate Community Management our management company.  Nicolas and his staff have been very professional while displaying expertise in the management of our association.  I recently received a packet for our upcoming Annual Meeting and Budget Ratification.  It has been a very long time since I have seen such a comprehensive informative packet.  It was easy to follow and understand.\n\nWe also have a great Homeowners Portal that is easy to navigate.  The portal provides lots of document information on our association.  I can easily see and schedule payments or schedule a maintenance request.  We had a homeowner portal previously with our other management company but it did not have the details we currently receive nor was it updated with our monthly documents as Navigate Community has done\n\nWe are off to a great start!",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 40,
  "adjusted_average_rating": 3.77
}