{
  "name": "Park Place Apartments",
  "slug": "park-place-apartments",
  "company_type": "property",
  "address": "3928 Northwest Ave, Bellingham, WA 98226",
  "review_count": 9,
  "average_rating": 2.56,
  "reviews": {
    "google_reviews": [
      {
        "author": "Heidi Beierle",
        "rating": 2.0,
        "review": "These apartments are clean and spacious, and the whole complex is tidy with nice amenities, like secure mail room, treats in the reception area, game room, community room, and gym. Theres a play area out back and a mini basketball court. I found the staff friendly. I appreciated that we could do a short-term rental.\nAs a bicycle commuter and rider, I did not find the bike parking in the garage secure and staff recommended I keep my bike(s) in the apartment (confirming that it wasnt secure).\n\nThere are a LOT of rules.\nOnly cats are allowed, but dogs live in the complex. If you want to live here with your dog, make sure its an emotional support animal. Thats how you do it. They wont offer that.\nBecause recycling can be untidy and to avoid the property being fined on account of tenants, the only recycling is cardboard. Trash must be double bagged and tied closed. Twice the plastic in the landfill will keep the trash chute neat and tidy.\nDo not even think of air drying your clothes on a rack on the balcony. Its unsightly and therefore forbidden.\nBeginning in mid-December, there are more rules. No plants on the balcony and no hanging baskets. Any balcony furniture must be pre-approved by management and conform to their aesthetic preferences or you cannot have it. If you put a bicycle on the balcony, they can come and take it without notice. No flags or other hanging items on the balcony, no smoking grills. Obviously, no junk. (If you didnt know it, your personal preferences for how to live are junk.) Its all about their aesthetic for the place and doesnt seem to matter that the tenants are renting the balconies.\n\nThere isnt a rule about bike parking nor are there any public racks, but you will still get a nastygram for temporarily locking your bike outdoors somewhere out of view, out of the way, out of the landscaping and not on anyones balcony. No one will kindly get in touch with you because its clear your lifestyle does not conform and is not welcome.\n\nDuring move out, its on you, the tenant, to pay $5 to change the door lock. Even though the rental agreement says you will not be charged for normal wear and tear, you can expect to be charged at least $50 for painting to address normal wear and tear, $90 to sanitize a spotless apartment, and $85 for them to professionally clean the carpets.\nIn keeping with the friendly relationship they have established with you, you will receive a certified letter with the departure accounting. The sentence with the payment due date will conclude with to avoid legal action and the next sentence will threaten to send you to the collection agency.\n\nOffensive business model. We had planned to stay longer but took our business elsewhere.",
        "ownerResponse": null
      },
      {
        "author": "barney barnhart",
        "rating": 2.0,
        "review": "So, it was interesting that this place was mostly empty. It is clean and neat, almost sterile. Not cheap, but the talking points indicate that it is \"luxury living\".\nNo dogs, no dogs anywhere including in vehicles on this property. Although I dd notice a fair number of what appeared to be dogs and was reminded, somewhat dismissively, that they were support animals.\nWe rented a unit that faced the courtyard. What we did not know is that the lights, alot of lights, like a prison yard were lit at night. When I asked, it was explained to me, that those were on a timer. Appeared to me to be a variable switch.\nThe entire complex is quiet enough. We did not appreciate how being next to I5, and the complex being on top of the brow of the hill would funnel that noise. The frequent and intermittent music to discourage transients blaring from the car dealership was something that was a matter of self-discovery.\nEveryone adjusts, eventually.\nWalking score, very low. Biking score, you literally take your life in your hands.\nIf you have a vehicle and are totally vehicle-dependent, you too can pour into the traffic circles in the morning and back out in the evening.\nI feel badly for the staff. It seems they are forced into a role of being camera watching, hall monitor rules minders.\nThe lease is an absurd 40 pages. I have purchased homes with less paper (and yes, they print you copies to take along). I wondered out loud to peers and friends if some of it is even legal.\nThe only way you can hope to see your deposit back involves two methods, one stay at least 6 months, and two, do not live in your place while renting. With our work schedules, we were there 5 out of the 8 weeks of our lease. Our final bill was nearly half of the initial $600 deposit, which was forfeited.\nTwo older adults cannot cause less of a stir.\nOverall, we were the lucky ones. We were remodeling, we needed a short-term cheaper-per-day-rental and we were able to move out. We did pass the credit and criminal checks, we did pass the 2.5 times income to rent ratio.\nWould I recommend this property or this management group? No. No equivocation, no conditions to my answer.\nNo.",
        "ownerResponse": null
      },
      {
        "author": "Megan Ostrom",
        "rating": 5.0,
        "review": "Park Place Apartments has been a WONDERFUL place to call home over the last 6 months. The amenities offered (the beautiful lounge, friendly management, a coffee bar in the lobby, a fitness center, covered parking, a small basketball court, a game room, electric vehicle charging, a playground for the kiddos, a large area for secure bicycle storage, and much more) are unbeatable. The location of this building is spectacular, as it is very close to essential businesses such as grocery stores, restaurants, a gas station, Bellingham International Airport, and even an urgent medical care office across the street.\n\nThe people who run the office are incredibly kind and understanding, and things run very smoothly here, thanks to them. The other tenants are super respectful of quiet hours, and the property is always kept clean.\n\nOverall, Park Place is a great place to live, and if you are looking for a place to live in Bellingham, I highly recommend taking a tour to check it out!",
        "ownerResponse": null
      },
      {
        "author": "Raghvendra Singh",
        "rating": 1.0,
        "review": "It's never the amenities but the management/the people running this place.\nThe quality of management is more important than the amenities offered by a place. During our tour of this property, my wife and I encountered a rude property manager who spoke to me in a dismissive manner when I called to inquire about becoming a tenant. Despite being initially interested in renting a 1-bedroom apartment here, I ultimately decided to take my business elsewhere.\n\nPros:\n\n- The building is new and has only 15-20 tenants.\n- Good amenities, including new appliances and decently sized 1-bedroom units (682 sq ft).\n- The Yoga and game room are nice.\n\nCons:\n\n- Cumbersome application process unless paying in cash at the leasing office; no website available for application.\n- No online rent payment option; rent must be paid by cheque dropped off at the office.\n- Extremely rude property manager.\n- Packages left out in the open with no visible cameras, putting them at risk of theft.",
        "ownerResponse": null
      },
      {
        "author": "Cam Bridgerson",
        "rating": 5.0,
        "review": "Awesome property and very helpful staff! I noticed in someone else's review on here that a few things are not true.\n\n-Applications can be submitted online or through the mail. I moved here from another town and wasn't available to submit paperwork in person due to the distance.\n-The entire package area & mail room are on camera, so I'm unsure how the person touring the property (that doesn't even appear to live here) missed that?\n-The few employees that I've met at the building have all been nice and always easy to work with.\n\nOverall, I'm more than happy to live here and call this place my home.",
        "ownerResponse": null
      },
      {
        "author": "Cinnamon & Travis Hoekema",
        "rating": 5.0,
        "review": "Highly recommend this complex. Communication was prompt, paperwork was clear,  staff is friendly and helpful.  The grounds are clean and tidy. Complex is quiet and respectful. Pricing is comparable to all apartments these days.",
        "ownerResponse": null
      },
      {
        "author": "D k",
        "rating": 1.0,
        "review": "Douche people wanting way too much money for something that is a basic necessity",
        "ownerResponse": null
      },
      {
        "author": "Jennifer Muller",
        "rating": 1.0,
        "review": "0 stars for not allowing dogs",
        "ownerResponse": null
      },
      {
        "author": "Kaydn Custer",
        "rating": 1.0,
        "review": "Insane prices.",
        "ownerResponse": null
      }
    ]
  },
  "adjusted_review_count": 9,
  "adjusted_average_rating": 2.56
}